Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: ta

source: The Bed Mesh module may be used to compensate for bed surface irregularities to achieve a better first layer across the entire bed. It should be noted that software based correction will not achieve perfect results, it can only approximate the shape of the bed. Bed Mesh also cannot compensate for mechanical and electrical issues. If an axis is skewed or a probe is not accurate then the bed_mesh module will not receive accurate results from the probing process.
ta: படுக்கை கண்ணி தொகுதி முழு படுக்கையிலும் ஒரு சிறந்த முதல் அடுக்கை அடைய படுக்கை மேற்பரப்பு முறைகேடுகளுக்கு ஈடுசெய்ய பயன்படுத்தப்படலாம். மென்பொருள் அடிப்படையிலான திருத்தம் சரியான முடிவுகளை அடையாது என்பதை கவனத்தில் கொள்ள வேண்டும், இது படுக்கையின் வடிவத்தை மட்டுமே தோராயமாக மதிப்பிட முடியும். படுக்கை கண்ணி இயந்திர மற்றும் மின் பிரச்சினைகளுக்கு ஈடுசெய்ய முடியாது. ஒரு அச்சு வளைந்திருக்கும் அல்லது ஒரு ஆய்வு துல்லியமாக இல்லாவிட்டால், படுக்கை_மேச் தொகுதி ஆய்வு செயல்முறையிலிருந்து துல்லியமான முடிவுகளைப் பெறாது.

source: The illustration below shows how the probed points are generated. As you can see, setting the `mesh_origin` to (-10, 0) allows us to specify a larger mesh radius of 85.
ta: ஆய்வு புள்ளிகள் எவ்வாறு உருவாக்கப்படுகின்றன என்பதை கீழே உள்ள விளக்கம் காட்டுகிறது. நீங்கள் பார்க்க முடியும் என, `Mesh_origin` ஐ (-10, 0) என அமைப்பது 85 என்ற பெரிய கண்ணி ஆரம் குறிப்பிட அனுமதிக்கிறது.

source: While its possible to sample the probed matrix directly using simple bi-linear interpolation to determine the Z-Values between probed points, it is often useful to interpolate extra points using more advanced interpolation algorithms to increase mesh density. These algorithms add curvature to the mesh, attempting to simulate the material properties of the bed. Bed Mesh offers lagrange and bicubic interpolation to accomplish this.
ta: ஆய்வு செய்யப்பட்ட புள்ளிகளுக்கு இடையிலான இசட்-மதிப்புகளைத் தீர்மானிக்க எளிய இரு-நேரியல் இடைக்கணிப்பைப் பயன்படுத்தி நேரடியாக ஆய்வு செய்யப்பட்ட மேட்ரிக்சை மாதிரி செய்ய முடியும் என்றாலும், கண்ணி அடர்த்தியை அதிகரிக்க மிகவும் மேம்பட்ட இடைக்கணிப்பு வழிமுறைகளைப் பயன்படுத்தி கூடுதல் புள்ளிகளை ஒன்றிணைப்பது பெரும்பாலும் பயனுள்ளதாக இருக்கும். இந்த வழிமுறைகள் கண்ணி மீது வளைவைச் சேர்க்கின்றன, படுக்கையின் பொருள் பண்புகளை உருவகப்படுத்த முயற்சிக்கின்றன. இதை நிறைவேற்ற படுக்கை கண்ணி லாக்ரேஞ்ச் மற்றும் பிக்யூபிக் இடைக்கணிப்பை வழங்குகிறது.

source: Generally the default values for these options are sufficient, in fact the default value of 5mm for the `move_check_distance` may be overkill. However an advanced user may wish to experiment with these options in an effort to squeeze out the optimal first layer.
ta: பொதுவாக இந்த விருப்பங்களுக்கான இயல்புநிலை மதிப்புகள் போதுமானவை, உண்மையில் `move_check_distance` க்கான 5 மிமீ இயல்புநிலை மதிப்பு ஓவர்கில் இருக்கலாம். இருப்பினும் ஒரு மேம்பட்ட பயனர் உகந்த முதல் அடுக்கை கசக்கும் முயற்சியில் இந்த விருப்பங்களை பரிசோதிக்க விரும்பலாம்.

source: `fade_target: 0` *Default Value: The average Z value of the mesh* The `fade_target` can be thought of as an additional Z offset applied to the entire bed after fade completes. Generally speaking we would like this value to be 0, however there are circumstances where it should not be. For example, lets assume your homing position on the bed is an outlier, its .2 mm lower than the average probed height of the bed. If the `fade_target` is 0, fade will shrink the print by an average of .2 mm across the bed. By setting the `fade_target` to .2, the homed area will expand by .2 mm, however, the rest of the bed will be accurately sized. Generally its a good idea to leave `fade_target` out of the configuration so the average height of the mesh is used, however it may be desirable to manually adjust the fade target if one wants to print on a specific portion of the bed.
ta: `fade_target: 0` * இயல்புநிலை மதிப்பு: கண்ணி சராசரி சட் மதிப்பு *` fade_target` ஐ மங்கலான முடிந்ததும் முழு படுக்கைக்கும் பயன்படுத்தப்படும் கூடுதல் சட் ஆஃப்செட் என்று கருதலாம். பொதுவாக இந்த மதிப்பு 0 ஆக இருக்க விரும்புகிறோம், இருப்பினும் அது இருக்கக்கூடாது என்று சூழ்நிலைகள் உள்ளன. எடுத்துக்காட்டாக, படுக்கையில் உங்கள் ஓமிங் நிலை ஒரு வெளிநாட்டவர், படுக்கையின் சராசரி ஆய்வு உயரத்தை விட அதன் .2 மிமீ குறைவாக இருக்கும் என்று வைத்துக் கொள்வோம். `Fade_target` 0 ஆக இருந்தால், மங்கலான அச்சை படுக்கையின் குறுக்கே சராசரியாக .2 மி.மீ. `Fade_target` ஐ .2 ஆக அமைப்பதன் மூலம், வீட்டுக்கு வந்த பகுதி .2 மிமீ விரிவாக்கப்படும், இருப்பினும், படுக்கையின் மற்ற பகுதிகள் துல்லியமாக அளவிடப்படும். பொதுவாக `ஃபேட்_டார்கெட்` உள்ளமைவிலிருந்து வெளியேறுவது நல்லது, எனவே கண்ணி சராசரி உயரம் பயன்படுத்தப்படுகிறது, இருப்பினும் படுக்கையின் ஒரு குறிப்பிட்ட பகுதியில் அச்சிட விரும்பினால் மங்கலான இலக்கை கைமுறையாக சரிசெய்ய விரும்பத்தக்கதாக இருக்கலாம்.

source: It should be noted that each time a BED_MESH_CALIBRATE occurs, the current state is automatically saved to the *default* profile. The *default* profile can be removed as follows:
ta: ஒவ்வொரு முறையும் ஒரு படுக்கை_மெச்_கலிப்ரேட் நிகழும்போது, தற்போதைய நிலை தானாக * இயல்புநிலை * சுயவிவரத்தில் சேமிக்கப்படும் என்பதை கவனத்தில் கொள்ள வேண்டும். * இயல்புநிலை * சுயவிவரத்தை பின்வருமாறு அகற்றலாம்:

source: Configuring the zero reference position
ta: சுழிய குறிப்பு நிலையை கட்டமைத்தல்

source: `zero_reference_position: ` *Default Value: None (disabled)* The `zero_reference_position` expects an (X, Y) coordinate matching that of the `reference position` described above. If the coordinate lies within the mesh then the mesh will be offset so the reference position applies zero adjustment. If the coordinate lies outside of the mesh then the coordinate will be probed after calibration, with the resulting z-value used as the z-offset. Note that this coordinate must NOT be in a location specified as a `faulty_region` if a probe is necessary.
ta: `ZERO_REFERENCE_POSITION:` * இயல்புநிலை மதிப்பு: எதுவுமில்லை (முடக்கப்பட்டுள்ளது) * `ZERO_REFERENCE_POSITION` மேலே விவரிக்கப்பட்ட` குறிப்பு நிலை` உடன் பொருந்தக்கூடிய ஒரு (x, y) ஒருங்கிணைப்பை எதிர்பார்க்கிறது. ஒருங்கிணைப்பு கண்ணிக்குள் இருந்தால், கண்ணி ஈடுசெய்யப்படும், எனவே குறிப்பு நிலை சுழிய சரிசெய்தலைப் பயன்படுத்துகிறது. ஒருங்கிணைப்பு கண்ணிக்கு வெளியே உள்ளது என்றால், ஒருங்கிணைப்பு அளவுத்திருத்தத்திற்குப் பிறகு ஆராயப்படும், இதன் விளைவாக இசட்-மதிப்பு இசட்-ஆஃப்செட்டாக பயன்படுத்தப்படுகிறது. ஒரு ஆய்வு தேவைப்பட்டால் இந்த ஒருங்கிணைப்பு `தவறான_பய்ப்பு` என குறிப்பிடப்பட்ட இடத்தில் இருக்கக்கூடாது என்பதை நினைவில் கொள்க.

source: The deprecated relative_reference_index
ta: நீக்கப்பட்ட உறவினர்_ரொஃபென்ச்_இண்டெக்ச்

source: Existing configurations using the `relative_reference_index` option must be updated to use the `zero_reference_position`. The response to the [BED_MESH_OUTPUT PGP=1](#output) gcode command will include the (X, Y) coordinate associated with the index; this position may be used as the value for the `zero_reference_position`. The output will look similar to the following:
ta: `Zero_reference_position` ஐப் பயன்படுத்த` reptive_reference_index` விருப்பத்தைப் பயன்படுத்தி இருக்கும் உள்ளமைவுகள் புதுப்பிக்கப்பட வேண்டும். . இந்த நிலை `ZERO_REFERENCE_POSITION` க்கான மதிப்பாக பயன்படுத்தப்படலாம். வெளியீடு பின்வருவனவற்றைப் போலவே இருக்கும்:

source: *Note: The above output is also printed in `klippy.log` during initialization.*
ta: *குறிப்பு: மேலே உள்ள வெளியீடு துவக்கத்தின் போது `klippy.log` இல் அச்சிடப்பட்டுள்ளது.*

source: Using the example above we see that the `relative_reference_index` is printed along with its coordinate. Thus the `zero_reference_position` is `131.5, 108`.
ta: மேலே உள்ள எடுத்துக்காட்டைப் பயன்படுத்தி `உறவினர்_ரொஃபென்ச்_இண்டெக்ச்` அதன் ஒருங்கிணைப்புடன் அச்சிடப்படுவதைக் காண்கிறோம். இவ்வாறு `ZERO_REFERENCE_POSITION` என்பது` 131.5, 108` ஆகும்.

source: Adaptive Meshes
ta: தகவமைப்பு மெச்கள்

source: Adaptive bed meshing is a way to speed up the bed mesh generation by only probing the area of the bed used by the objects being printed. When used, the method will automatically adjust the mesh parameters based on the area occupied by the defined print objects.
ta: அடாப்டிவ் பெட் மெசிங் என்பது படுக்கை கண்ணி உற்பத்தியை விரைவுபடுத்துவதற்கான ஒரு வழியாகும், இது அச்சிடப்படும் பொருள்களால் பயன்படுத்தப்படும் படுக்கையின் பகுதியை மட்டுமே ஆராய்வதன் மூலம். பயன்படுத்தும்போது, வரையறுக்கப்பட்ட அச்சு பொருள்களால் ஆக்கிரமிக்கப்பட்ட பகுதியின் அடிப்படையில் மெச் அளவுருக்களை முறை தானாகவே சரிசெய்யும்.

source: The adapted mesh area will be computed from the area defined by the boundaries of all the defined print objects so it covers every object, including any margins defined in the configuration. After the area is computed, the number of probe points will be scaled down based on the ratio of the default mesh area and the adapted mesh area. To illustrate this consider the following example:
ta: தழுவிய கண்ணி பகுதி அனைத்து வரையறுக்கப்பட்ட அச்சுப் பொருட்களின் எல்லைகளால் வரையறுக்கப்பட்ட பகுதியிலிருந்து கணக்கிடப்படும், எனவே இது உள்ளமைவில் வரையறுக்கப்பட்ட எந்த விளிம்புகளும் உட்பட ஒவ்வொரு பொருளையும் உள்ளடக்கியது. பரப்பளவு கணக்கிடப்பட்ட பிறகு, இயல்புநிலை கண்ணி பகுதி மற்றும் தழுவிய கண்ணி பகுதியின் விகிதத்தின் அடிப்படையில் ஆய்வு புள்ளிகளின் எண்ணிக்கை அளவிடப்படும். இதை விளக்குவதற்கு பின்வரும் உதாரணத்தைக் கவனியுங்கள்:

source: For a 150mmx150mm bed with `mesh_min` set to `25,25` and `mesh_max` set to `125,125`, the default mesh area is a 100mmx100mm square. An adapted mesh area of `50,50` means a ratio of `0.5x0.5` between the adapted area and default mesh area.
ta: `மெச்_மின்` கொண்ட 150mmx150 மிமீ படுக்கைக்கு` 25,25` மற்றும் `மெச்_மாக்ச்` அமைக்கப்பட்டுள்ளது` 125,125` என அமைக்கப்பட்டுள்ளது, இயல்புநிலை மெச் பகுதி 100mmx100 மிமீ நாற்கை. `50,50` இன் தழுவிய கண்ணி பகுதி என்பது தழுவிய பகுதி மற்றும் இயல்புநிலை கண்ணி பகுதிக்கு இடையில்` 0.5x0.5` என்ற விகிதமாகும்.

source: If the `bed_mesh` configuration specified `probe_count` as `7x7`, the adapted bed mesh will use 4x4 probe points (7 * 0.5 rounded up).
ta: `பெட்_மேச்` உள்ளமைவு` ஆய்வு_கவுண்ட்` `7x7` என குறிப்பிடப்பட்டால், தழுவிய படுக்கை கண்ணி 4x4 ஆய்வு புள்ளிகளைப் பயன்படுத்தும் (7 * 0.5 வட்டமானது).

source: `adaptive_margin` *Default Value: 0* Margin (in mm) to add around the area of the bed used by the defined objects. The diagram below shows the adapted bed mesh area with an `adaptive_margin` of 5mm. The adapted mesh area (area in green) is computed as the used bed area (area in blue) plus the defined margin.
ta: `அடாப்டிவ்_மார்சின்` * இயல்புநிலை மதிப்பு: 0 * விளிம்பு (மிமீ) வரையறுக்கப்பட்ட பொருள்களால் பயன்படுத்தப்படும் படுக்கையின் பகுதியைச் சேர்க்க. கீழேயுள்ள வரைபடம் 5 மிமீ `அடாப்டிவ்_மார்சின்` உடன் தழுவிய படுக்கை கண்ணி பகுதியைக் காட்டுகிறது. தழுவிய கண்ணி பகுதி (பச்சை நிறத்தில் பகுதி) பயன்படுத்தப்பட்ட படுக்கை பகுதி (நீல நிறத்தில் பகுதி) மற்றும் வரையறுக்கப்பட்ட விளிம்பு என கணக்கிடப்படுகிறது.

source: By nature, adaptive bed meshes use the objects defined by the Gcode file being printed. Therefore, it is expected that each Gcode file will generate a mesh that probes a different area of the print bed. Therefore, adapted bed meshes should not be re-used. The expectation is that a new mesh will be generated for each print if adaptive meshing is used.
ta: இயற்கையால், தகவமைப்பு படுக்கை மெச்கள் அச்சிடப்பட்ட GCODE கோப்பால் வரையறுக்கப்பட்ட பொருள்களைப் பயன்படுத்துகின்றன. எனவே, ஒவ்வொரு GCODE கோப்பும் அச்சு படுக்கையின் வேறுபட்ட பகுதியை ஆய்வு செய்யும் ஒரு கண்ணி உருவாக்கும் என்று எதிர்பார்க்கப்படுகிறது. எனவே, தழுவிய படுக்கை மெச்களை மீண்டும் பயன்படுத்தக்கூடாது. தகவமைப்பு மெசிங் பயன்படுத்தப்பட்டால் ஒவ்வொரு அச்சுக்கும் ஒரு புதிய கண்ணி உருவாக்கப்படும் என்பது எதிர்பார்ப்பு.

source: It is also important to consider that adaptive bed meshing is best used on machines that can normally probe the entire bed and achieve a maximum variance less than or equal to 1 layer height. Machines with mechanical issues that a full bed mesh normally compensates for may have undesirable results when attempting print moves **outside** of the probed area. If a full bed mesh has a variance greater than 1 layer height, caution must be taken when using adaptive bed meshes and attempting print moves outside of the meshed area.
ta: தகவமைப்பு படுக்கை மெசிங் இயந்திரங்களில் சிறந்த முறையில் பயன்படுத்தப்படுகிறது என்பதையும் கருத்தில் கொள்வது முதன்மை, அவை பொதுவாக முழு படுக்கையையும் ஆராய்ந்து 1 அடுக்கு உயரத்தை விட குறைவாகவோ அல்லது சமமாகவோ அதிகபட்ச மாறுபாட்டை அடையலாம். ஒரு முழு படுக்கை கண்ணி பொதுவாக ஈடுசெய்யும் இயந்திர சிக்கல்களைக் கொண்ட இயந்திரங்கள், ஆய்வு செய்யப்பட்ட பகுதியின் அச்சு நகர்வுகளை ** வெளியே ** முயற்சிக்கும்போது விரும்பத்தகாத முடிவுகளைக் கொண்டிருக்கலாம். ஒரு முழு படுக்கை கண்ணி 1 அடுக்கு உயரத்தை விட அதிகமான மாறுபாட்டைக் கொண்டிருந்தால், தகவமைப்பு படுக்கை மெச்களைப் பயன்படுத்தும் போது மற்றும் மெச் செய்யப்பட்ட பகுதிக்கு வெளியே அச்சு நகர்வுகளை முயற்சிக்கும்போது எச்சரிக்கையாக இருக்க வேண்டும்.

source: `ADAPTIVE`
ta: `தகவமைப்பு`

source: `ADAPTIVE_MARGIN`
ta: `அடாப்டிவ்_மார்சின்`

source: `BED_MESH_OFFSET [X=<value>] [Y=<value>] [ZFADE=<value>]`
ta: `Bed_mesh_offset [x = <மதிப்பு>] [y = <மதிப்பு>] [zfade = <value>]`

source: This is useful for printers with multiple independent extruders, as an offset is necessary to produce correct Z adjustment after a tool change. Offsets should be specified relative to the primary extruder. That is, a positive X offset should be specified if the secondary extruder is mounted to the right of the primary extruder, a positive Y offset should be specified if the secondary extruder is mounted "behind" the primary extruder, and a positive ZFADE offset should be specified if the secondary extruder's nozzle is above the primary extruder's.
ta: பல சுயாதீன எக்ச்ட்ரூடர்களைக் கொண்ட அச்சுப்பொறிகளுக்கு இது பயனுள்ளதாக இருக்கும், ஏனெனில் ஒரு கருவி மாற்றத்திற்குப் பிறகு சரியான சட் சரிசெய்தலை உருவாக்க ஆஃப்செட் தேவை. முதன்மை எக்ச்ட்ரூடருடன் ஒப்பிடும்போது ஆஃப்செட்டுகள் குறிப்பிடப்பட வேண்டும். அதாவது, முதன்மை எக்ச்ட்ரூடரின் வலதுபுறத்தில் இரண்டாம் நிலை எக்ச்ட்ரூடர் ஏற்றப்பட்டால், ஒரு நேர்மறையான ஃச் ஆஃப்செட் குறிப்பிடப்பட வேண்டும், இரண்டாம் நிலை எக்ச்ட்ரூடர் முதன்மை எக்ச்ட்ரூடருக்கு பின்னால் "ஏற்றப்பட்டால், நேர்மறையான ஒய் ஆஃப்செட் குறிப்பிடப்பட வேண்டும், மேலும் நேர்மறையான ZFADE ஆஃப்செட் வேண்டும் இரண்டாம் நிலை எக்ச்ட்ரூடரின் முனை முதன்மை எக்ச்ட்ரூடருக்கு மேலே இருந்தால் குறிப்பிடவும்.

source: Note that a ZFADE offset does *NOT* directly apply additional adjustment. It is intended to compensate for a `gcode offset` when [mesh fade](#mesh-fade) is enabled. For example, if a secondary extruder is higher than the primary and needs a negative gcode offset, ie: `SET_GCODE_OFFSET Z=-.2`, it can be accounted for in `bed_mesh` with `BED_MESH_OFFSET ZFADE=.2`.
ta: ஒரு Zfade ஆஃப்செட் * கூடுதல் சரிசெய்தலை நேரடியாகப் பயன்படுத்துவதில்லை என்பதை நினைவில் கொள்க. [மெச் ஃபேட்] (#மெச்-ஃபேட்) இயக்கப்பட்டிருக்கும் போது `GCode ஆஃப்செட்` ஐ ஈடுசெய்யும் நோக்கம் கொண்டது. எடுத்துக்காட்டாக, இரண்டாம் நிலை எக்ச்ட்ரூடர் முதன்மையை விட உயர்ந்தது மற்றும் எதிர்மறை GCode ஆஃப்செட் தேவைப்பட்டால், அதாவது: `set_gcode_offset சட் =-.

source: `mesh_max: 240, 198` *Required* The probed coordinate farthest from the origin. This is not necessarily the last point probed, as the probing process occurs in a zig-zag fashion. As with `mesh_min`, this coordinate is relative to the probe's location.
ta: `Mesh_max: 240, 198` * தேவை * ஆய்வு ஒருங்கிணைப்பு தோற்றத்திலிருந்து வெகு தொலைவில் உள்ளது. இது ஒரு சிக்-சாக் பாணியில் நிகழ்த்தியிருப்பதால், இது கடைசி புள்ளி அல்ல. `Mesh_min` ஐப் போலவே, இந்த ஒருங்கிணைப்பும் ஆய்வின் இருப்பிடத்துடன் தொடர்புடையது.

source: Surface Scans
ta: மேற்பரப்பு ச்கேன்

source: Some probes, such as the [Eddy Current Probe](./Eddy_Probe.md), are capable of "scanning" the surface of the bed. That is, these probes can sample a mesh without lifting the tool between samples. To activate scanning mode, the `METHOD=scan` or `METHOD=rapid_scan` probe parameter should be passed in the `BED_MESH_CALIBRATE` gcode command.
ta: [எடி நடப்பு ஆய்வு] (./ eddy_probe.md) போன்ற சில ஆய்வுகள் படுக்கையின் மேற்பரப்பை "ச்கேன் செய்யும்" திறன் கொண்டவை. அதாவது, இந்த ஆய்வுகள் மாதிரிகளுக்கு இடையில் கருவியைத் தூக்காமல் ஒரு கண்ணி மாதிரியாக இருக்கும். ச்கேனிங் பயன்முறையை செயல்படுத்த, `முறை = ச்கேன்` அல்லது` முறை = ரேபிட்_ச்கான்` ஆய்வு அளவுருவை `BED_MESH_CALIBRATE` GCODE கட்டளையில் அனுப்ப வேண்டும்.

source: Scan Height
ta: உயரம் ச்கேன்

source: The scan height is set by the `horizontal_move_z` option in `[bed_mesh]`. In addition it can be supplied with the `BED_MESH_CALIBRATE` gcode command via the `HORIZONTAL_MOVE_Z` parameter.
ta: ச்கேன் உயரம் `[bed_mesh]` இல் `கிடைமட்ட_மோவ்_செச்` விருப்பத்தால் அமைக்கப்பட்டுள்ளது. கூடுதலாக, `bed_mesh_calibrate` gcode கட்டளை` கிடைமட்ட_மோவ்_இச்` அளவுரு வழியாக வழங்கப்படலாம்.

source: The scan height must be sufficiently low to avoid scanning errors. Typically a height of 2mm (ie: `HORIZONTAL_MOVE_Z=2`) should work well, presuming that the probe is mounted correctly.
ta: ச்கேன் உயரம் ச்கேன் செய்வதைத் தவிர்க்க போதுமானதாக இருக்க வேண்டும். பொதுவாக 2 மிமீ உயரம் (அதாவது: `கிடைமட்ட_மோவ்_செவ் = 2`) நன்றாக வேலை செய்ய வேண்டும், ஆய்வு சரியாக ஏற்றப்பட்டதாக கருதுகிறது.

source: It should be noted that if the probe is more than 4mm above the surface then the results will be invalid. Thus, scanning is not possible on beds with severe surface deviation or beds with extreme tilt that hasn't been corrected.
ta: ஆய்வு மேற்பரப்பில் இருந்து 4 மி.மீ.க்கு மேல் இருந்தால், முடிவுகள் செல்லாது என்பதை கவனத்தில் கொள்ள வேண்டும். எனவே, கடுமையான மேற்பரப்பு விலகல் அல்லது படுக்கைகள் கொண்ட படுக்கைகளில் ச்கேனிங் சாத்தியமில்லை.

source: Rapid (Continuous) Scanning
ta: விரைவான (தொடர்ச்சியான) ச்கேனிங்

source: When performing a `rapid_scan` one should keep in mind that the results will have some amount of error. This error should be low enough to be useful on large print areas with reasonably thick layer heights. Some probes may be more prone to error than others.
ta: `ரேபிட்_ச்கான்` செய்யும்போது, முடிவுகளுக்கு ஓரளவு பிழைகள் இருக்கும் என்பதை ஒருவர் நினைவில் கொள்ள வேண்டும். நியாயமான தடிமனான அடுக்கு உயரங்களைக் கொண்ட பெரிய அச்சு பகுதிகளில் பயனுள்ளதாக இருக்கும் அளவுக்கு இந்த பிழை குறைவாக இருக்க வேண்டும். சில ஆய்வுகள் மற்றவர்களை விட பிழைக்கு ஆளாகக்கூடும்.

source: It is not recommended that rapid mode be used to scan a "dense" mesh. Some of the error introduced during a rapid scan may be gaussian noise from the sensor, and a dense mesh will reflect this noise (ie: there will be peaks and valleys).
ta: "அடர்த்தியான" கண்ணி ச்கேன் செய்ய விரைவான பயன்முறையைப் பயன்படுத்த பரிந்துரைக்கப்படவில்லை. விரைவான ச்கேன் போது அறிமுகப்படுத்தப்பட்ட சில பிழைகள் சென்சாரிலிருந்து காசியன் சத்தமாக இருக்கலாம், மேலும் அடர்த்தியான கண்ணி இந்த சத்தத்தை பிரதிபலிக்கும் (அதாவது: சிகரங்களும் பள்ளத்தாக்குகளும் இருக்கும்).

source: Bed Mesh will attempt to optimize the travel path to provide the best possible result based on the configuration. This includes avoiding faulty regions when collecting samples and "overshooting" the mesh when changing direction. This overshoot improves sampling at the edges of a mesh, however it requires that the mesh be configured in a way that allows the tool to travel outside of the mesh.
ta: கட்டமைப்பின் அடிப்படையில் சிறந்த முடிவை வழங்குவதற்காக பயண பாதையை மேம்படுத்த படுக்கை கண்ணி முயற்சிக்கும். மாதிரிகள் சேகரிக்கும் போது தவறான பகுதிகளைத் தவிர்ப்பது மற்றும் திசையை மாற்றும்போது கண்ணி "ஓவர்சூட்டிங்" ஆகியவை இதில் அடங்கும். இந்த ஓவர்சூட் ஒரு கண்ணி விளிம்புகளில் மாதிரியை மேம்படுத்துகிறது, இருப்பினும் அந்தக் கண்ணி கண்ணி வெளியே பயணிக்க அனுமதிக்கும் வகையில் கண்ணி கட்டமைக்கப்பட வேண்டும்.

source: `scan_overshoot` *Default Value: 0 (disabled)* The maximum amount of travel (in mm) available outside of the mesh. For rectangular beds this applies to travel on the X axis, and for round beds it applies to the entire radius. The tool must be able to travel the amount specified outside of the mesh. This value is used to optimize the travel path when performing a "rapid scan". The minimum value that may be specified is 1. The default is no overshoot.
ta: `Scan_overshoot` * இயல்புநிலை மதிப்பு: 0 (முடக்கப்பட்டது) * கண்ணி வெளியே கிடைக்கும் அதிகபட்ச பயணத்தின் (மிமீ). செவ்வக படுக்கைகளுக்கு இது ஃச் அச்சில் பயணிக்க பொருந்தும், மேலும் வட்ட படுக்கைகளுக்கு இது முழு ஆரம் பொருந்தும். கருவி கண்ணிக்கு வெளியே குறிப்பிடப்பட்ட தொகையை பயணிக்க முடியும். "விரைவான ச்கேன்" செய்யும்போது பயண பாதையை மேம்படுத்த இந்த மதிப்பு பயன்படுத்தப்படுகிறது. குறிப்பிடப்படக்கூடிய குறைந்தபட்ச மதிப்பு 1. இயல்புநிலை ஓவர்சூட் இல்லை.

source: If no scan overshoot is configured then travel path optimization will not be applied to changes in direction.
ta: ச்கேன் ஓவர்சூட் எதுவும் கட்டமைக்கப்படாவிட்டால், திசையில் ஏற்படும் மாற்றங்களுக்கு பயண பாதை தேர்வுமுறை பயன்படுத்தப்படாது.

source: `BED_MESH_CALIBRATE PROFILE=<name> METHOD=[manual | automatic | scan | rapid_scan] \ [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=[0|1] \ [ADAPTIVE_MARGIN=<value>]` *Default Profile: default* *Default Method: automatic if a probe is detected, otherwise manual* *Default Adaptive: 0* *Default Adaptive Margin: 0*
ta: `Bed_mesh_calibrate சுயவிவரம் = <amane> முறை = [கையேடு | தானியங்கி | ச்கேன் | rapid_scan] \ [<probe_parameter> = <மதிப்பு>] [<mesh_parameter> = <மதிப்பு>] [தகவமைப்பு = [0 | 1] \ [தகவமைப்பு_மார்சின் = <மதிப்பு>] ` *இயல்புநிலை சுயவிவரம்: இயல்புநிலை * *இயல்புநிலை முறை: தானியங்கி என்றால் ஒரு ஆய்வு கண்டறியப்பட்டது, இல்லையெனில் கையேடு** இயல்புநிலை தகவமைப்பு: 0** இயல்புநிலை தகவமைப்பு விளிம்பு: 0*

source: The mesh will be saved into a profile specified by the `PROFILE` parameter, or `default` if unspecified. The `METHOD` parameter takes one of the following values:
ta: குறிப்பிடப்படாவிட்டால் `சுயவிவரம்` அளவுருவால் குறிப்பிடப்பட்ட சுயவிவரத்தில் கண்ணி சேமிக்கப்படும். `முறை` அளவுரு பின்வரும் மதிப்புகளில் ஒன்றை எடுக்கும்:

source: `METHOD=manual`: enables manual probing using the nozzle and the paper test
ta: `முறை = கையேடு`: முனை மற்றும் காகித சோதனையைப் பயன்படுத்தி கையேடு ஆய்வை இயக்குகிறது

source: `METHOD=automatic`: Automatic (standard) probing. This is the default.
ta: `முறை = தானியங்கி`: தானியங்கி (தரநிலை) ஆய்வு. இது இயல்புநிலை.

source: `METHOD=scan`: Enables surface scanning. The tool will pause over each position to collect a sample.
ta: `முறை = ச்கேன்`: மேற்பரப்பு ச்கேனிங்கை செயல்படுத்துகிறது. ஒரு மாதிரியை சேகரிக்க ஒவ்வொரு நிலைக்கும் கருவி இடைநிறுத்தப்படும்.

source: `METHOD=rapid_scan`: Enables continuous surface scanning.
ta: `முறை = ரேபிட்_ச்கான்`: தொடர்ச்சியான மேற்பரப்பு ச்கேனிங்கை செயல்படுத்துகிறது.

source: XY positions are automatically adjusted to include the X and/or Y offsets when a probing method other than `manual` is selected.
ta: `கையேடு` தவிர வேறு ஆய்வு முறை தேர்ந்தெடுக்கப்படும்போது ஃச் மற்றும்/அல்லது ஒய் ஆஃப்செட்களைச் சேர்க்க XY நிலைகள் தானாகவே சரிசெய்யப்படுகின்றன.

source: Bed Mesh Webhooks APIs
ta: பெட் மெச் வெப்ஊக்ச் ஏபிஐக்கள்

source: Dumping mesh data
ta: கண்ணி தரவைக் கொட்டுதல்

source: `{"id": 123, "method": "bed_mesh/dump_mesh"}`
ta: `{" ஐடி ": 123," முறை ":" bed_mesh/dump_mesh "}`

source: Visualization and analysis
ta: காட்சிப்படுத்தல் மற்றும் பகுப்பாய்வு

source: Most users will likely find that the visualizers included with applications such as Mainsail, Fluidd, and Octoprint are sufficient for basic analysis. However, Klipper's `scripts` folder contains the `graph_mesh.py` script that may be used to perform additional visualizations and more detailed analysis, particularly useful for debugging hardware or the results produced by `bed_mesh`:
ta: மெயின்செயில், ஃப்ளூயிட் டி மற்றும் ஆக்டோபிரிண்ட் போன்ற பயன்பாடுகளுடன் சேர்க்கப்பட்ட காட்சிப்படுத்திகள் அடிப்படை பகுப்பாய்விற்கு போதுமானவை என்பதை பெரும்பாலான பயனர்கள் காணலாம். இருப்பினும், கிளிப்பரின் `ச்கிரிப்ட்கள்` கோப்புறையில்` வரைபடம்_மெச்.பி` ச்கிரிப்ட் உள்ளது, இது கூடுதல் காட்சிப்படுத்தல் மற்றும் விரிவான பகுப்பாய்வைச் செய்ய பயன்படுத்தப்படலாம், குறிப்பாக பிழைத்திருத்த வன்பொருள் அல்லது `படுக்கை_மெச்` தயாரித்த முடிவுகளுக்கு பயனுள்ளதாக இருக்கும்:

source: Pre-requisites
ta: முன்நிபந்தனைகள்
