Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: ta

source: Like most graphing tools provided by Klipper, `graph_mesh.py` requires the `matplotlib` and `numpy` python dependencies. In addition, connecting to Klipper via Moonraker's websocket requires the `websockets` python dependency. While all visualizations can be output to an `svg` file, most of the visualizations offered by `graph_mesh.py` are better viewed in live preview mode on a desktop class PC. For example, the 3D visualizations may be rotated and zoomed in preview mode, and the path visualizations can optionally be animated in preview mode.
ta: கிளிப்பர் வழங்கிய பெரும்பாலான வரைபடக் கருவிகளைப் போலவே, `Math_mesh.py` க்கு` Matplotlib` மற்றும் `Numpy` பைதான் சார்புகள் தேவை. கூடுதலாக, மூன்ரேக்கரின் வெப்சாக்கெட் வழியாக கிளிப்பருடன் இணைக்க `வெப்சாக்கெட்டுகள்` பைதான் சார்பு தேவைப்படுகிறது. அனைத்து காட்சிப்படுத்தல்களும் ஒரு `எச்.வி.சி` கோப்புக்கு வெளியீடாக இருக்க முடியும் என்றாலும்,` வரைபடம்_மெச்.பி` வழங்கும் பெரும்பாலான காட்சிப்படுத்தல்கள் டெச்க்டாப் வகுப்பு கணினியில் நேரடி முன்னோட்ட பயன்முறையில் சிறப்பாகக் காணப்படுகின்றன. எடுத்துக்காட்டாக, 3D காட்சிப்படுத்தல் முன்னோட்ட பயன்முறையில் சுழற்றப்பட்டு பெரிதாக்கப்படலாம், மேலும் பாதை காட்சிப்படுத்தல் விருப்பமாக முன்னோட்ட பயன்முறையில் அனிமேசன் செய்யப்படலாம்.

source: Plotting Mesh data
ta: மெச் தரவு சூழ்ச்சி

source: The `graph_mesh.py` tool can plot several types of visualizations. Available types can be shown by running `graph_mesh.py list`:
ta: `Maprage_mesh.py` கருவி பல வகையான காட்சிப்படுத்தல்களைத் திட்டமிடலாம். `Maprag_mesh.py பட்டியல்` ஐ இயக்குவதன் மூலம் கிடைக்கக்கூடிய வகைகளைக் காட்டலாம்:

source: Several options are available when plotting visualizations:
ta: காட்சிப்படுத்தல்களைத் திட்டமிடும்போது பல விருப்பங்கள் கிடைக்கின்றன:

source: Below is a description of each argument:
ta: ஒவ்வொரு வாதத்தின் விளக்கம் கீழே:

source: `plot type`: A required positional argument designating the type of visualization to generate. Must be one of the types output by the `graph_mesh.py list` command.
ta: `சதி வகை`: உருவாக்கும் காட்சிப்படுத்தல் வகையை நியமிக்கும் தேவையான நிலை உரையாடல். `Maprage_mesh.py பட்டியல்` கட்டளை மூலம் வகை வெளியீட்டில் ஒன்றாக இருக்க வேண்டும்.

source: `input`: A required positional argument containing a path or url to the input source. This must be one of the following:
ta: `உள்ளீடு`: உள்ளீட்டு மூலத்திற்கு ஒரு பாதை அல்லது முகவரி ஐக் கொண்ட தேவையான நிலை உரையாடல். இது பின்வருவனவற்றில் ஒன்றாக இருக்க வேண்டும்:

source: A path to Klipper's Unix Domain Socket
ta: கிளிப்பரின் யுனிக்ச் டொமைன் சாக்கெட்டுக்கு ஒரு பாதை

source: A url to an instance of Moonraker
ta: மூன்ரேக்கரின் ஒரு நிகழ்வுக்கு ஒரு முகவரி

source: A path to a json file produced by `graph_mesh.py dump <input>`
ta: `Maprage_mesh.py டம்ப் <input>` ஆல் தயாரிக்கப்பட்ட சாதொபொகு கோப்பிற்கான பாதை பாதை

source: `-a`: Optional animation for the `path` and `rapid` visualization types. Animations only apply to a live preview.
ta: `-a`:` பாதை` மற்றும் `விரைவான` காட்சிப்படுத்தல் வகைகளுக்கான விருப்ப அனிமேசன். அனிமேசன்கள் ஒரு நேரடி மாதிரிக்காட்சிக்கு மட்டுமே பொருந்தும்.

source: `-s`: Optionally scales a plot using the `axis_minimum` and `axis_maximum` values reported by Klipper's `toolhead` object when the dump file was generated.
ta: `-s`: டம்ப் கோப்பு உருவாக்கப்பட்டபோது கிளிப்பரின்` கருவிக்காஎட்` பொருளால் அறிவிக்கப்பட்ட `அச்சு_மினிமம்` மற்றும்` அச்சு_மாக்சிமம்` மதிப்புகளைப் பயன்படுத்தி ஒரு சதித்திட்டத்தை விருப்பமாக அளவிடுகிறது.

source: `-p`: A profile name that may be specified when generating the `probedz` 3D mesh visualization. When generating an `overlay` or `delta` visualization this argument must be provided.
ta: `-p`:` புரோபெட்ச்` 3 டி மெச் காட்சிப்படுத்தலை உருவாக்கும் போது குறிப்பிடக்கூடிய சுயவிவரப் பெயர். `மேலடுக்கு` அல்லது` டெல்டா` காட்சிப்படுத்தலை உருவாக்கும் போது இந்த உரையாடல் வழங்கப்பட வேண்டும்.

source: `-o`: An optional file path indicating that the script should save the visualization to this location rather than run in preview mode. Images are saved in `svg` format.
ta: `-o`: முன்னோட்ட பயன்முறையில் இயங்குவதை விட ச்கிரிப்ட் காட்சிப்படுத்தலை இந்த இருப்பிடத்திற்கு சேமிக்க வேண்டும் என்பதைக் குறிக்கும் விருப்பமான கோப்பு பாதை. படங்கள் `எச்.வி.சி` வடிவத்தில் சேமிக்கப்படுகின்றன.

source: For example, to plot an animated rapid path, connecting via Klipper's unix socket:
ta: எடுத்துக்காட்டாக, அனிமேசன் செய்யப்பட்ட விரைவான பாதையைத் திட்டமிட, கிளிப்பரின் யூனிக்ச் சாக்கெட் வழியாக இணைக்கப்படுகிறது:

source: Or to plot a 3d visualization of the mesh, connecting via Moonraker:
ta: அல்லது மூன்ராகேக்கர் வழியாக இணைக்கும் கண்ணி ஒரு 3D காட்சிப்படுத்தல்:

source: Bed Mesh Analysis
ta: படுக்கை கண்ணி பகுப்பாய்வு

source: The `graph_mesh.py` tool may also be used to perform an analysis on the data provided by the [bed_mesh/dump_mesh](#dumping-mesh-data) API:
ta: [BED_MESH/DUMB_MESH] (#டம்பிங்-மெச்-டேட்டா) பநிஇ ஆல் வழங்கப்பட்ட தரவுகளில் ஒரு பகுப்பாய்வைச் செய்ய `Mapric_mesh.py` கருவி பயன்படுத்தப்படலாம்:

source: As with the `plot` command, the `<input>` must be a path to Klipper's unix socket, a URL to an instance of Moonraker, or a path to a json file generated by the dump command.
ta: `சதி` கட்டளையைப் போலவே,` <input> `கிளிப்பரின் யூனிக்ச் சாக்கெட், மூன்ரேக்கரின் ஒரு நிகழ்வுக்கு ஒரு முகவரி அல்லது டம்ப் கட்டளையால் உருவாக்கப்பட்ட சாதொபொகு கோப்பிற்கான பாதை இருக்க வேண்டும்.

source: To begin, the analysis will perform various checks on the points and probe paths generated by `bed_mesh` at the time of the dump. This includes the following:
ta: தொடங்குவதற்கு, பகுப்பாய்வு டம்பின் நேரத்தில் `பெட்_மேச்` உருவாக்கிய புள்ளிகள் மற்றும் ஆய்வு பாதைகளில் பல்வேறு காசோலைகளைச் செய்யும். இதில் பின்வருவன அடங்கும்:

source: The number of probe points generated, without any additions
ta: எந்த சேர்த்தலும் இல்லாமல், உருவாக்கப்பட்ட ஆய்வு புள்ளிகளின் எண்ணிக்கை

source: The number of probe points generated including any points generated as the result faulty regions and/or a configured zero reference position.
ta: இதன் விளைவாக தவறான பகுதிகள் மற்றும்/அல்லது கட்டமைக்கப்பட்ட சுழிய குறிப்பு நிலை என உருவாக்கப்பட்ட எந்த புள்ளிகளும் உட்பட உருவாக்கப்படும் ஆய்வு புள்ளிகளின் எண்ணிக்கை.

source: The number of probe points generated when performing a rapid scan.
ta: விரைவான ச்கேன் செய்யும்போது உருவாக்கப்படும் ஆய்வு புள்ளிகளின் எண்ணிக்கை.

source: The total number of moves generated for a rapid scan.
ta: விரைவான ச்கேன் செய்யப்படும் மொத்த நகர்வுகளின் எண்ணிக்கை.

source: A validation that the probe points generated for a rapid scan are identical to the probe points generated for a standard probing procedure.
ta: விரைவான ச்கேனுக்காக உருவாக்கப்பட்ட ஆய்வு புள்ளிகள் ஒரு நிலையான ஆய்வு நடைமுறைக்கு உருவாக்கப்பட்ட ஆய்வு புள்ளிகளுக்கு ஒத்ததாகும்.

source: A "backtracking" check for both the standard probe path and a rapid scan path. Backtracking can be defined as moving to the same position more than once during the probing procedure. Backtracking should never occur during a standard probe. Faulty regions *can* result in backtracking during a rapid scan in an attempt to avoid entering a faulty region when approaching or leaving a probe location, however should never occur otherwise.
ta: நிலையான ஆய்வு பாதை மற்றும் விரைவான ச்கேன் பாதை இரண்டையும் ஒரு "பின்னடைவு" சரிபார்க்கவும். ஆய்வு நடைமுறையின் போது ஒரு முறைக்கு மேல் அதே நிலைக்கு நகர்வதை பின்னடைவு வரையறுக்கலாம். ஒரு நிலையான ஆய்வின் போது பின்வாங்குவது ஒருபோதும் ஏற்படக்கூடாது. தவறான பகுதிகள் * விரைவான ச்கேன் போது பின்வாங்குவதற்கு வழிவகுக்கும், இது ஒரு ஆய்வு இடத்தை நெருங்கும் போது அல்லது வெளியேறும்போது தவறான பகுதிக்குள் நுழைவதைத் தவிர்ப்பதற்கான முயற்சியில், இருப்பினும் ஒருபோதும் ஏற்படக்கூடாது.

source: Next each probed mesh present in the dump will by analyzed, beginning with the mesh loaded at the time of the dump (if present) and followed by any saved profiles. The following data is extracted:
ta: அடுத்து டம்பில் இருக்கும் ஒவ்வொரு ஆய்வு கண்ணி பகுப்பாய்வு செய்யப்படுவதன் மூலம், டம்பின் நேரத்தில் ஏற்றப்பட்ட கண்ணி தொடங்கி (இருந்தால்) மற்றும் சேமிக்கப்பட்ட சுயவிவரங்கள் தொடர்ந்து இருக்கும். பின்வரும் தரவு பிரித்தெடுக்கப்படுகிறது:

source: Mesh shape (Min X,Y, Max X,Y Probe Count)
ta: கண்ணி வடிவம் (மின் ஃச், ஒய், அதிகபட்சம் ஃச், ஒய் ஆய்வு எண்ணிக்கை)

source: Mesh Z range, (Minimum Z, Maximum Z)
ta: மெச் சட் ரேஞ்ச், (குறைந்தபட்ச சட், அதிகபட்ச இசட்)

source: Mean Z value in the mesh
ta: கண்ணி சராசரி சட் மதிப்பு

source: Standard Deviation of the Z values in the Mesh
ta: கண்ணி மதிப்புகளின் நிலையான விலகல்

source: In addition to the above, a delta analysis is performed between meshes with the same shape, reporting the following:
ta: மேற்கூறியவற்றைத் தவிர, ஒரே வடிவத்துடன் மெச்களுக்கு இடையே ஒரு டெல்டா பகுப்பாய்வு செய்யப்படுகிறது, பின்வருவனவற்றைப் புகாரளிக்கிறது:

source: The range of the delta between to meshes (Minimum and Maximum)
ta: டெல்டாவின் வரம்பு முதல் மெச்கள் (குறைந்தபட்சம் மற்றும் அதிகபட்சம்)

source: The mean delta
ta: சராசரி டெல்டா

source: Standard Deviation of the delta
ta: டெல்டாவின் நிலையான விலகல்

source: The absolute maximum difference
ta: முழுமையான அதிகபட்ச வேறுபாடு

source: The absolute mean
ta: முழுமையான சராசரி

source: Save mesh data to a file
ta: மெச் தரவை ஒரு கோப்பில் சேமிக்கவும்

source: The `dump` command may be used to save the response to a file which can be shared for analysis when troubleshooting:
ta: சரிசெய்தல் போது பகுப்பாய்விற்காக பகிரக்கூடிய ஒரு கோப்பிற்கான பதிலைச் சேமிக்க `டம்ப்` கட்டளை பயன்படுத்தப்படலாம்:

source: The `<input>` should be a path to Klipper's unix socket or a URL to an instance of Moonraker. The `-o` option may be used to specify the path to the output file. If omitted, the file will be saved in the working directory, with a file name in the following format:
ta: `<input>` கிளிப்பரின் யூனிக்ச் சாக்கெட்டுக்கு ஒரு பாதையாக இருக்க வேண்டும் அல்லது மூன்ரேக்கரின் ஒரு நிகழ்வுக்கு முகவரி ஆக இருக்க வேண்டும். வெளியீட்டு கோப்பிற்கான பாதையை குறிப்பிட `-o` விருப்பம் பயன்படுத்தப்படலாம். தவிர்க்கப்பட்டால், கோப்பு வேலை கோப்பகத்தில் சேமிக்கப்படும், பின்வரும் வடிவத்தில் கோப்பு பெயருடன்:

source: `klipper-bedmesh-{year}{month}{day}{hour}{minute}{second}.json`
ta: `klipper-bedmesh- {{{year} {month} {day} {hour} {minute} .json`
