Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: ta

source: Basic Configuration
ta: அடிப்படை உள்ளமைவு

source: Rectangular Beds
ta: செவ்வக படுக்கைகள்

source: This example assumes a printer with a 250 mm x 220 mm rectangular bed and a probe with an x-offset of 24 mm and y-offset of 5 mm.
ta: இந்த எடுத்துக்காட்டு 250 மிமீ ஃச் 220 மிமீ செவ்வக படுக்கை மற்றும் 24 மிமீ எக்ச்-ஆஃப்செட் மற்றும் 5 மிமீ ஒய்-ஆஃப்செட் கொண்ட ஒரு அச்சுப்பொறியை கருதுகிறது.

source: `speed: 120` *Default Value: 50* The speed in which the tool moves between points.
ta: `வேகம்: 120` * இயல்புநிலை மதிப்பு: 50 * கருவி புள்ளிகளுக்கு இடையில் நகரும் விரைவு.

source: `horizontal_move_z: 5` *Default Value: 5* The Z coordinate the probe rises to prior to traveling between points.
ta: `கிடைமட்ட_மோவ்_செச்: 5` * இயல்புநிலை மதிப்பு: 5 * சட் ஒருங்கிணைப்பு ஆய்வு புள்ளிகளுக்கு இடையில் பயணம் செய்வதற்கு முன் உயர்கிறது.

source: The illustration below demonstrates how the `mesh_min`, `mesh_max`, and `probe_count` options are used to generate probe points. The arrows indicate the direction of the probing procedure, beginning at `mesh_min`. For reference, when the probe is at `mesh_min` the nozzle will be at (11, 1), and when the probe is at `mesh_max`, the nozzle will be at (206, 193).
ta: ஆய்வு புள்ளிகளை உருவாக்க `mesh_min`,` Mesh_max` மற்றும் `probe_count` விருப்பங்கள் எவ்வாறு பயன்படுத்தப்படுகின்றன என்பதை கீழே உள்ள விளக்கம் நிரூபிக்கிறது. அம்புகள் `mesh_min` இல் தொடங்கி ஆய்வு நடைமுறையின் திசையைக் குறிக்கின்றன. குறிப்புக்கு, ஆய்வு `mesh_min` இல் இருக்கும்போது முனை (11, 1) இருக்கும், மற்றும் ஆய்வு` Mesh_max` இல் இருக்கும்போது, முனை (206, 193) இருக்கும்.

source: Round beds
ta: வட்ட படுக்கைகள்

source: This example assumes a printer equipped with a round bed radius of 100mm. We will use the same probe offsets as the rectangular example, 24 mm on X and 5 mm on Y.
ta: இந்த எடுத்துக்காட்டு 100 மிமீ வட்ட படுக்கை ஆரம் கொண்ட அச்சுப்பொறியாக கருதுகிறது. செவ்வக எடுத்துக்காட்டு, ஃச் இல் 24 மிமீ மற்றும் ஒய் மீது 5 மிமீ போன்ற அதே ஆய்வு ஆஃப்செட்களைப் பயன்படுத்துவோம்.

source: `mesh_radius: 75` *Required* The radius of the probed mesh in mm, relative to the `mesh_origin`. Note that the probe's offsets limit the size of the mesh radius. In this example, a radius larger than 76 would move the tool beyond the range of the printer.
ta: `Mesh_radius: 75` * தேவை *` Mesh_origin` உடன் தொடர்புடைய MM இல் ஆய்வு செய்யப்பட்ட கண்ணி ஆரம். ஆய்வின் ஆஃப்செட்டுகள் கண்ணி ஆரம் அளவைக் கட்டுப்படுத்துகின்றன என்பதை நினைவில் கொள்க. இந்த எடுத்துக்காட்டில், 76 ஐ விட பெரிய ஆரம் கருவியை அச்சுப்பொறியின் வரம்பிற்கு அப்பால் நகர்த்தும்.

source: `round_probe_count: 5` *Default Value: 5* This is an integer value that defines the maximum number of probed points along the X and Y axes. By "maximum", we mean the number of points probed along the mesh origin. This value must be an odd number, as it is required that the center of the mesh is probed.
ta: `round_probe_count: 5` * இயல்புநிலை மதிப்பு: 5 * இது ஃச் மற்றும் ஒய் அச்சுகளுடன் அதிகபட்ச ஆய்வு புள்ளிகளின் எண்ணிக்கையை வரையறுக்கும் ஒரு முழு எண் மதிப்பு. "அதிகபட்சம்" என்பதன் மூலம், கண்ணி தோற்றத்துடன் ஆய்வு செய்யப்பட்ட புள்ளிகளின் எண்ணிக்கை என்று பொருள். இந்த மதிப்பு ஒற்றைப்படை எண்ணாக இருக்க வேண்டும், ஏனெனில் கண்ணி நடுவண் ஆய்வு செய்யப்பட வேண்டும்.

source: Advanced Configuration
ta: மேம்பட்ட உள்ளமைவு

source: Below the more advanced configuration options are explained in detail. Each example will build upon the basic rectangular bed configuration shown above. Each of the advanced options apply to round beds in the same manner.
ta: மேலும் மேம்பட்ட உள்ளமைவு விருப்பங்கள் கீழே விரிவாக விளக்கப்பட்டுள்ளன. ஒவ்வொரு எடுத்துக்காட்டு மேலே காட்டப்பட்டுள்ள அடிப்படை செவ்வக படுக்கை உள்ளமைவை உருவாக்கும். மேம்பட்ட விருப்பங்கள் ஒவ்வொன்றும் வட்ட படுக்கைகளுக்கு ஒரே மாதிரியாக பொருந்தும்.

source: Mesh Interpolation
ta: கண்ணி இடைக்கணிப்பு

source: `algorithm: lagrange` *Default Value: lagrange* The algorithm used to interpolate the mesh. May be `lagrange` or `bicubic`. Lagrange interpolation is capped at 6 probed points as oscillation tends to occur with a larger number of samples. Bicubic interpolation requires a minimum of 4 probed points along each axis, if less than 4 points are specified then lagrange sampling is forced. If `mesh_pps` is set to 0 then this value is ignored as no mesh interpolation is done.
ta: `அல்காரிதம்: லாக்ரேஞ்ச்` * இயல்புநிலை மதிப்பு: லாக்ரேஞ்ச் * மெச் இடைக்கணிக்க பயன்படுத்தப்படும் வழிமுறை. `லாக்ரேஞ்ச்` அல்லது` பிக்யூபிக்` ஆக இருக்கலாம். அதிக எண்ணிக்கையிலான மாதிரிகளுடன் ஊசலாட்டம் ஏற்படுவதால் லாக்ரேஞ்ச் இடைக்கணிப்பு 6 ஆய்வு புள்ளிகளில் மூடப்பட்டுள்ளது. BICUBIC இடைக்கணிப்புக்கு ஒவ்வொரு அச்சிலும் குறைந்தபட்சம் 4 ஆய்வு புள்ளிகள் தேவைப்படுகின்றன, 4 புள்ளிகளுக்கும் குறைவாக குறிப்பிடப்பட்டால், லாக்ரேஞ்ச் மாதிரி கட்டாயப்படுத்தப்படுகிறது. `Mesh_pps` 0 ஆக அமைக்கப்பட்டால், இந்த மதிப்பு புறக்கணிக்கப்படுகிறது, ஏனெனில் கண்ணி இடைக்கணிப்பு எதுவும் செய்யப்படவில்லை.

source: `bicubic_tension: 0.2` *Default Value: 0.2* If the `algorithm` option is set to bicubic it is possible to specify the tension value. The higher the tension the more slope is interpolated. Be careful when adjusting this, as higher values also create more overshoot, which will result in interpolated values higher or lower than your probed points.
ta: `BICUBIC_TENSION: 0.2` * இயல்புநிலை மதிப்பு: 0.2 *` அல்காரிதம்` விருப்பம் BICUBIC க்கு அமைக்கப்பட்டால், பதற்றம் மதிப்பைக் குறிப்பிட முடியும். அதிக பதற்றம் அதிக சாய்வு இடைக்கணிக்கப்படுகிறது. இதை சரிசெய்யும்போது கவனமாக இருங்கள், ஏனெனில் அதிக மதிப்புகள் அதிக ஓவர்சூட்டை உருவாக்குகின்றன, இதன் விளைவாக இடைக்கணிப்பு மதிப்புகள் உங்கள் ஆய்வு புள்ளிகளை விட அதிகமாகவோ அல்லது குறைவாகவோ இருக்கும்.

source: The illustration below shows how the options above are used to generate an interpolated mesh.
ta: இடைக்கணிப்பு கண்ணி உருவாக்க மேலே உள்ள விருப்பங்கள் எவ்வாறு பயன்படுத்தப்படுகின்றன என்பதை கீழே உள்ள விளக்கம் காட்டுகிறது.

source: Move Splitting
ta: பிளவுகளை நகர்த்தவும்

source: `move_check_distance: 5` *Default Value: 5* The minimum distance to check for the desired change in Z before performing a split. In this example, a move longer than 5mm will be traversed by the algorithm. Each 5mm a mesh Z lookup will occur, comparing it with the Z value of the previous move. If the delta meets the threshold set by `split_delta_z`, the move will be split and traversal will continue. This process repeats until the end of the move is reached, where a final adjustment will be applied. Moves shorter than the `move_check_distance` have the correct Z adjustment applied directly to the move without traversal or splitting.
ta: `MOVE_CHECK_DISTANCE: 5` * இயல்புநிலை மதிப்பு: 5 * ஒரு பிளவு செய்வதற்கு முன் சட் இல் விரும்பிய மாற்றத்தை சரிபார்க்க குறைந்தபட்ச தூரம். இந்த எடுத்துக்காட்டில், 5 மிமீவை விட நீண்ட நகர்வு வழிமுறையால் பயணிக்கும். ஒவ்வொரு 5 மிமீ ஒரு மெச் சட் தேடல் நிகழும், இது முந்தைய நகர்வின் சட் மதிப்புடன் ஒப்பிடுகிறது. `Split_delta_z` ஆல் நிர்ணயிக்கப்பட்ட வாசலை டெல்டா சந்தித்தால், இந்த நடவடிக்கை பிரிக்கப்படும் மற்றும் பயணத் தொடுதல் தொடரும். நகர்வின் இறுதி வரை இந்த செயல்முறை மீண்டும் நிகழ்கிறது, அங்கு இறுதி சரிசெய்தல் பயன்படுத்தப்படும். `Move_check_distance` ஐ விடக் குறைவான நகரும், சரியான சட் சரிசெய்தல் பயணத்திற்கு நேரடியாக பயணத்திற்கு அல்லது பிளவு இல்லாமல் பயன்படுத்தப்படுகிறது.

source: `split_delta_z: .025` *Default Value: .025* As mentioned above, this is the minimum deviation required to trigger a move split. In this example, any Z value with a deviation +/- .025mm will trigger a split.
ta: `split_delta_z: .025` * இயல்புநிலை மதிப்பு: .025 * மேலே குறிப்பிட்டுள்ளபடி, இது ஒரு நகர்வு பிளவு தூண்டுவதற்கு தேவையான குறைந்தபட்ச விலகல். இந்த எடுத்துக்காட்டில், விலகல் +/- .025 மிமீ கொண்ட எந்த சட் மதிப்பும் ஒரு பிளவைத் தூண்டும்.

source: Mesh Fade
ta: கண்ணி மங்கலானது

source: When "fade" is enabled Z adjustment is phased out over a distance defined by the configuration. This is accomplished by applying small adjustments to the layer height, either increasing or decreasing depending on the shape of the bed. When fade has completed, Z adjustment is no longer applied, allowing the top of the print to be flat rather than mirror the shape of the bed. Fade also may have some undesirable traits, if you fade too quickly it can result in visible artifacts on the print. Also, if your bed is significantly warped, fade can shrink or stretch the Z height of the print. As such, fade is disabled by default.
ta: "ஃபேட்" இயக்கப்பட்டால், உள்ளமைவால் வரையறுக்கப்பட்ட தூரத்திற்கு மேல் சட் சரிசெய்தல் படிப்படியாக வெளியேற்றப்படுகிறது. படுக்கையின் வடிவத்தைப் பொறுத்து அதிகரிக்கும் அல்லது குறைகிறது, அடுக்கு உயரத்திற்கு சிறிய மாற்றங்களைப் பயன்படுத்துவதன் மூலம் இது நிறைவேற்றப்படுகிறது. ஃபேட் முடிந்ததும், சட் சரிசெய்தல் இனி பயன்படுத்தப்படாது, படுக்கையின் வடிவத்தை பிரதிபலிப்பதை விட அச்சின் மேற்பகுதி தட்டையாக இருக்க அனுமதிக்கிறது. மங்கலும் சில விரும்பத்தகாத பண்புகளைக் கொண்டிருக்கலாம், நீங்கள் மிக விரைவாக மங்கினால் அது அச்சில் புலப்படும் கலைப்பொருட்களை ஏற்படுத்தும். மேலும், உங்கள் படுக்கை கணிசமாக திசைதிருப்பப்பட்டால், மங்கலாக சுருங்கலாம் அல்லது அச்சின் சட் உயரத்தை நீட்டலாம். எனவே, இயல்புநிலையாக ஃபேட் முடக்கப்பட்டுள்ளது.

source: `fade_start: 1` *Default Value: 1* The Z height in which to start phasing out adjustment. It is a good idea to get a few layers down before starting the fade process.
ta: `fade_start: 1` * இயல்புநிலை மதிப்பு: 1 * சரிசெய்தலை வெளியேற்றத் தொடங்க சட் உயரம். மங்கலான செயல்முறையைத் தொடங்குவதற்கு முன் சில அடுக்குகளை கீழே பெறுவது நல்லது.

source: `fade_end: 10` *Default Value: 0* The Z height in which fade should complete. If this value is lower than `fade_start` then fade is disabled. This value may be adjusted depending on how warped the print surface is. A significantly warped surface should fade out over a longer distance. A near flat surface may be able to reduce this value to phase out more quickly. 10mm is a sane value to begin with if using the default value of 1 for `fade_start`.
ta: `fade_end: 10` * இயல்புநிலை மதிப்பு: 0 * மங்கலான சட் உயரம் முடிக்க வேண்டும். இந்த மதிப்பு `Fade_start` ஐ விட குறைவாக இருந்தால், மங்கலாக முடக்கப்பட்டுள்ளது. அச்சு மேற்பரப்பு எவ்வளவு திசைதிருப்பப்பட்டது என்பதைப் பொறுத்து இந்த மதிப்பு சரிசெய்யப்படலாம். கணிசமாக திசைதிருப்பப்பட்ட மேற்பரப்பு நீண்ட தூரத்தில் மங்க வேண்டும். அருகிலுள்ள தட்டையான மேற்பரப்பு இந்த மதிப்பை விரைவாகக் குறைக்க முடியும். 10 மிமீ என்பது `ஃபேட்_ச்டார்ட்` க்கு 1 இன் இயல்புநிலை மதிப்பைப் பயன்படுத்தினால் தொடங்குவதற்கு ஒரு விவேகமான மதிப்பு.

source: Faulty Regions
ta: தவறான பகுதிகள்

source: It is possible for some areas of a bed to report inaccurate results when probing due to a "fault" at specific locations. The best example of this are beds with series of integrated magnets used to retain removable steel sheets. The magnetic field at and around these magnets may cause an inductive probe to trigger at a distance higher or lower than it would otherwise, resulting in a mesh that does not accurately represent the surface at these locations. **Note: This should not be confused with probe location bias, which produces inaccurate results across the entire bed.**
ta: ஒரு படுக்கையின் சில பகுதிகள் குறிப்பிட்ட இடங்களில் "தவறு" காரணமாக ஆராயும்போது தவறான முடிவுகளைப் புகாரளிக்க முடியும். நீக்கக்கூடிய எஃகு தாள்களைத் தக்கவைக்கப் பயன்படுத்தப்படும் ஒருங்கிணைந்த காந்தங்களின் தொடர்ச்சியான படுக்கைகள் இதற்கு சிறந்த எடுத்துக்காட்டு. இந்த காந்தங்களில் உள்ள மற்றும் அதைச் சுற்றியுள்ள காந்தப்புலம் ஒரு தூண்டல் ஆய்வு இல்லையெனில் அதை விட அதிகமாகவோ அல்லது குறைவாகவோ தூண்டுவதற்கு காரணமாக இருக்கலாம், இதன் விளைவாக இந்த இடங்களில் மேற்பரப்பை துல்லியமாக பிரதிநிதித்துவப்படுத்தாத ஒரு கண்ணி உருவாகிறது. ** குறிப்பு: இது முழு படுக்கையிலும் தவறான முடிவுகளை உருவாக்கும் ஆய்வு இருப்பிட சார்புடன் குழப்பமடையக்கூடாது. **

source: The `faulty_region` options may be configured to compensate for this affect. If a generated point lies within a faulty region bed mesh will attempt to probe up to 4 points at the boundaries of this region. These probed values will be averaged and inserted in the mesh as the Z value at the generated (X, Y) coordinate.
ta: இந்த பாதிப்பை ஈடுசெய்ய `flicty_region` விருப்பங்கள் கட்டமைக்கப்படலாம். ஒரு உருவாக்கப்பட்ட புள்ளி ஒரு தவறான பிராந்திய படுக்கை கண்ணி இருந்தால் இந்த பிராந்தியத்தின் எல்லைகளில் 4 புள்ளிகள் வரை ஆய்வு செய்ய முயற்சிக்கும். உருவாக்கப்பட்ட (x, y) ஒருங்கிணைப்பில் சட் மதிப்பாக இந்த ஆய்வு மதிப்புகள் சராசரியாக மற்றும் கண்ணி இல் செருகப்படும்.

source: `faulty_region_{1...99}_min` `faulty_region_{1..99}_max` *Default Value: None (disabled)* Faulty Regions are defined in a way similar to that of mesh itself, where minimum and maximum (X, Y) coordinates must be specified for each region. A faulty region may extend outside of a mesh, however the alternate points generated will always be within the mesh boundary. No two regions may overlap.
ta: `flacty_region_ {1...99} _min`` flagy_region_ {1..99} _max` * இயல்புநிலை மதிப்பு: எதுவுமில்லை (முடக்கப்பட்டவை) * தவறான பகுதிகள் கண்ணி போன்ற வகையில் வரையறுக்கப்படுகின்றன, அங்கு குறைந்தபட்ச மற்றும் அதிகபட்சம் (x , Y) ஒவ்வொரு பிராந்தியத்திற்கும் ஒருங்கிணைப்புகள் குறிப்பிடப்பட வேண்டும். ஒரு தவறான பகுதி ஒரு கண்ணிக்கு வெளியே நீட்டிக்கப்படலாம், இருப்பினும் உருவாக்கப்படும் மாற்று புள்ளிகள் எப்போதும் கண்ணி எல்லைக்குள் இருக்கும். இரண்டு பிராந்தியங்களும் ஒன்றுடன் ஒன்று இருக்கக்கூடாது.

source: The image below illustrates how replacement points are generated when a generated point lies within a faulty region. The regions shown match those in the sample config above. The replacement points and their coordinates are identified in green.
ta: ஒரு உருவாக்கப்பட்ட புள்ளி தவறான பகுதிக்குள் இருக்கும்போது மாற்று புள்ளிகள் எவ்வாறு உருவாக்கப்படுகின்றன என்பதை கீழே உள்ள படம் விளக்குகிறது. காட்டப்பட்ட பகுதிகள் மேலே உள்ள மாதிரி உள்ளமைவில் உள்ளவற்றுடன் பொருந்துகின்றன. மாற்று புள்ளிகள் மற்றும் அவற்றின் ஒருங்கிணைப்புகள் பச்சை நிறத்தில் அடையாளம் காணப்படுகின்றன.

source: Bed Mesh Gcodes
ta: படுக்கை கண்ணி gcodes

source: Calibration
ta: அளவுத்திருத்தம்

source: It is possible to specify mesh parameters to modify the probed area. The following parameters are available:
ta: ஆய்வு செய்யப்பட்ட பகுதியை மாற்ற மெச் அளவுருக்களைக் குறிப்பிட முடியும். பின்வரும் அளவுருக்கள் கிடைக்கின்றன:

source: Rectangular beds (cartesian):
ta: செவ்வக படுக்கைகள் (கார்ட்டீசியன்):

source: Round beds (delta):
ta: வட்ட படுக்கைகள் (டெல்டா):

source: All beds:
ta: அனைத்து படுக்கைகளும்:

source: Profiles
ta: சுயவிவரங்கள்

source: `BED_MESH_PROFILE REMOVE=default`
ta: `BED_MESH_PROFILE REIGHT = இயல்புநிலை`

source: Any other saved profile can be removed in the same fashion, replacing *default* with the named profile you wish to remove.
ta: சேமித்த வேறு எந்த சுயவிவரத்தையும் அதே பாணியில் அகற்றலாம், நீங்கள் அகற்ற விரும்பும் பெயரிடப்பட்ட சுயவிவரத்துடன் * இயல்புநிலை * ஐ மாற்றலாம்.

source: Output
ta: வெளியீடு

source: Outputs the current mesh state to the terminal. Note that the mesh itself is output
ta: தற்போதைய கண்ணி நிலையை முனையத்திற்கு வெளியிடுகிறது. கண்ணி தானே வெளியீடு என்பதை நினைவில் கொள்க

source: The PGP parameter is shorthand for "Print Generated Points". If `PGP=1` is set, the generated probed points will be output to the terminal:
ta: பிசிபி அளவுரு "அச்சு உருவாக்கப்பட்ட புள்ளிகள்" க்கான சுருக்கெழுத்து ஆகும். `Pgp = 1` அமைக்கப்பட்டால், உருவாக்கப்பட்ட ஆய்வு புள்ளிகள் முனையத்திற்கு வெளியீடாக இருக்கும்:

source: The "Tool Adjusted" points refer to the nozzle location for each point, and the "Probe" points refer to the probe location. Note that when manually probing the "Probe" points will refer to both the tool and nozzle locations.
ta: "கருவி சரிசெய்யப்பட்ட" புள்ளிகள் ஒவ்வொரு புள்ளிக்கும் முனை இருப்பிடத்தைக் குறிக்கின்றன, மேலும் "ஆய்வு" புள்ளிகள் ஆய்வு இருப்பிடத்தைக் குறிக்கின்றன. "ஆய்வு" புள்ளிகளை கைமுறையாக ஆராயும்போது கருவி மற்றும் முனை இடங்கள் இரண்டையும் குறிக்கும் என்பதை நினைவில் கொள்க.

source: Clear Mesh State
ta: தெளிவான கண்ணி நிலை

source: This gcode may be used to clear the internal mesh state.
ta: உள் கண்ணி நிலையை அழிக்க இந்த GCODE பயன்படுத்தப்படலாம்.

source: Apply X/Y offsets
ta: X/y ஆஃப்செட்டுகளைப் பயன்படுத்துங்கள்

source: Bed Mesh
ta: படுக்கை மெச்

source: Initiates the probing procedure for Bed Mesh Calibration.
ta: படுக்கை கண்ணி அளவுத்திருத்தத்திற்கான ஆய்வு நடைமுறையைத் தொடங்குகிறது.

source: Bed Mesh works by intercepting gcode move commands and applying a transform to their Z coordinate. Long moves must be split into smaller moves to correctly follow the shape of the bed. The options below control the splitting behavior.
ta: Gcode நகரும் கட்டளைகளைத் தடுத்து, அவற்றின் சட் ஒருங்கிணைப்புக்கு ஒரு மாற்றத்தைப் பயன்படுத்துவதன் மூலம் படுக்கை கண்ணி செயல்படுகிறது. படுக்கையின் வடிவத்தை சரியாகப் பின்பற்ற நீண்ட நகர்வுகள் சிறிய நகர்வுகளாக பிரிக்கப்பட வேண்டும். கீழே உள்ள விருப்பங்கள் பிளவுபடுத்தும் நடத்தையை கட்டுப்படுத்துகின்றன.

source: Prior to Mesh Calibration you will need to be sure that your Probe's Z-Offset is calibrated. If using an endstop for Z homing it will need to be calibrated as well. See [Probe Calibrate](Probe_Calibrate.md) and Z_ENDSTOP_CALIBRATE in [Manual Level](Manual_Level.md) for more information.
ta: மெச் அளவுத்திருத்தத்திற்கு முன், உங்கள் ஆய்வின் இசட்-ஆஃப்செட் அளவீடு செய்யப்படுகிறது என்பதை நீங்கள் உறுதிப்படுத்த வேண்டும். சட் ஓமிங்கிற்கு ஒரு எண்ட்ச்டாப்பைப் பயன்படுத்தினால், அதை அளவீடு செய்ய வேண்டும். மேலும் தகவலுக்கு [கையேடு நிலை] (Manual_level.md) இல் [probe_calibrate.md) மற்றும் z_endstop_calibrate ஐப் பார்க்கவும்.

source: `ALGORITHM`
ta: `அல்காரிதம்`

source: See the configuration documentation above for details on how each parameter applies to the mesh.
ta: ஒவ்வொரு அளவுருவும் கண்ணிக்கு எவ்வாறு பொருந்தும் என்பது குறித்த விவரங்களுக்கு மேலே உள்ள உள்ளமைவு ஆவணங்களைப் பார்க்கவும்.

source: `BED_MESH_PROFILE SAVE=<name> LOAD=<name> REMOVE=<name>`
ta: `Bed_mesh_profile சேமி = <name> load = <amen> reyed = <amen>`

source: After a BED_MESH_CALIBRATE has been performed, it is possible to save the current mesh state into a named profile. This makes it possible to load a mesh without re-probing the bed. After a profile has been saved using `BED_MESH_PROFILE SAVE=<name>` the `SAVE_CONFIG` gcode may be executed to write the profile to printer.cfg.
ta: ஒரு படுக்கை_மேச்_கலிபிரேட் செய்யப்பட்ட பிறகு, தற்போதைய கண்ணி நிலையை பெயரிடப்பட்ட சுயவிவரத்தில் சேமிக்க முடியும். இது படுக்கையை மீண்டும் நிகழ்த்தாமல் ஒரு கண்ணி ஏற்றுவதை சாத்தியமாக்குகிறது. `Bed_mesh_profile சேமி = <aname>` `save_config` gcode ஐப் பயன்படுத்தி ஒரு சுயவிவரம் சேமிக்கப்பட்ட பிறகு, சுயவிவரத்தை printurs.cfg க்கு எழுத செயல்படுத்தப்படலாம்.

source: Profiles can be loaded by executing `BED_MESH_PROFILE LOAD=<name>`.
ta: `BED_MESH_PROFILE LOAD = <amen>` ஐ இயக்குவதன் மூலம் சுயவிவரங்களை ஏற்ற முடியும்.

source: `mesh_min: 35, 6` *Required* The first probed coordinate, nearest to the origin. This coordinate is relative to the probe's location.
ta: `மெச்_மின்: 35, 6` * தேவை * முதல் ஆய்வு ஒருங்கிணைப்பு, தோற்றத்திற்கு மிக அருகில். இந்த ஒருங்கிணைப்பு ஆய்வின் இருப்பிடத்துடன் தொடர்புடையது.

source: `probe_count: 5, 3` *Default Value: 3, 3* The number of points to probe on each axis, specified as X, Y integer values. In this example 5 points will be probed along the X axis, with 3 points along the Y axis, for a total of 15 probed points. Note that if you wanted a square grid, for example 3x3, this could be specified as a single integer value that is used for both axes, ie `probe_count: 3`. Note that a mesh requires a minimum probe_count of 3 along each axis.
ta: `probe_count: 5, 3` * இயல்புநிலை மதிப்பு: 3, 3 * ஒவ்வொரு அச்சிலும் ஆராய வேண்டிய புள்ளிகளின் எண்ணிக்கை, ஃச், ஒய் முழு எண் மதிப்புகள் என குறிப்பிடப்படுகிறது. இந்த எடுத்துக்காட்டில் 5 புள்ளிகள் ஃச் அச்சில், ஒய் அச்சுடன் 3 புள்ளிகளுடன், மொத்தம் 15 ஆய்வு புள்ளிகளுக்கு ஆய்வு செய்யப்படும். நீங்கள் ஒரு சதுர கட்டத்தை விரும்பினால், எடுத்துக்காட்டாக 3x3, இது இரு அச்சுகளுக்கும் பயன்படுத்தப்படும் ஒற்றை முழு மதிப்பாக குறிப்பிடப்படலாம், அதாவது `PROBE_COUNT: 3`. ஒரு கண்ணி ஒவ்வொரு அச்சிலும் 3 இன் குறைந்தபட்ச ஆய்வு_சவுண்ட் தேவைப்படுகிறது என்பதை நினைவில் கொள்க.

source: `mesh_origin: 0, 0` *Default Value: 0, 0* The center point of the mesh. This coordinate is relative to the probe's location. While the default is 0, 0, it may be useful to adjust the origin in an effort to probe a larger portion of the bed. See the illustration below.
ta: `mesh_origin: 0, 0` * இயல்புநிலை மதிப்பு: 0, 0 * கண்ணி மைய புள்ளி. இந்த ஒருங்கிணைப்பு ஆய்வின் இருப்பிடத்துடன் தொடர்புடையது. இயல்புநிலை 0, 0 ஆக இருக்கும்போது, படுக்கையின் பெரிய பகுதியை ஆய்வு செய்யும் முயற்சியில் தோற்றத்தை சரிசெய்வது பயனுள்ளதாக இருக்கும். கீழே உள்ள விளக்கத்தைக் காண்க.

source: `mesh_pps: 2, 3` *Default Value: 2, 2* The `mesh_pps` option is shorthand for Mesh Points Per Segment. This option specifies how many points to interpolate for each segment along the X and Y axes. Consider a 'segment' to be the space between each probed point. Like `probe_count`, `mesh_pps` is specified as an X, Y integer pair, and also may be specified a single integer that is applied to both axes. In this example there are 4 segments along the X axis and 2 segments along the Y axis. This evaluates to 8 interpolated points along X, 6 interpolated points along Y, which results in a 13x8 mesh. Note that if mesh_pps is set to 0 then mesh interpolation is disabled and the probed matrix will be sampled directly.
ta: `mesh_pps: 2, 3` * இயல்புநிலை மதிப்பு: 2, 2 *` mesh_pps` விருப்பம் ஒரு பிரிவுக்கு கண்ணி புள்ளிகளுக்கு சுருக்கெழுத்து ஆகும். இந்த விருப்பம் ஃச் மற்றும் ஒய் அச்சுகளுடன் ஒவ்வொரு பிரிவிற்கும் எத்தனை புள்ளிகள் இடைக்கணிக்க வேண்டும் என்பதைக் குறிப்பிடுகிறது. ஒவ்வொரு ஆய்வு புள்ளிக்கும் இடையிலான இடமாக ஒரு 'பிரிவு' என்று கருதுங்கள். `Probe_count` ஐப் போலவே,` mesh_pps` ஒரு ஃச், ஒய் முழு எண் சோடியாக குறிப்பிடப்படுகிறது, மேலும் இரண்டு அச்சுகளுக்கும் பயன்படுத்தப்படும் ஒற்றை முழு எண் குறிப்பிடப்படலாம். இந்த எடுத்துக்காட்டில் ஃச் அச்சில் 4 பிரிவுகளும், ஒய் அச்சுடன் 2 பிரிவுகளும் உள்ளன. இது ஃச் உடன் 8 இடைக்கணிப்பு புள்ளிகளை மதிப்பிடுகிறது, ஒய் உடன் 6 இடைக்கணிப்பு புள்ளிகள், இதன் விளைவாக 13x8 கண்ணி ஏற்படுகிறது. Mesh_pps 0 ஆக அமைக்கப்பட்டால், கண்ணி இடைக்கணிப்பு முடக்கப்பட்டு, ஆய்வு செய்யப்பட்ட மேட்ரிக்ச் நேரடியாக மாதிரி எடுக்கப்படும் என்பதை நினைவில் கொள்க.

source: Loading the default profile
ta: இயல்புநிலை சுயவிவரத்தை ஏற்றுகிறது

source: Previous versions of `bed_mesh` always loaded the profile named *default* on startup if it was present. This behavior has been removed in favor of allowing the user to determine when a profile is loaded. If a user wishes to load the `default` profile it is recommended to add `BED_MESH_PROFILE LOAD=default` to either their `START_PRINT` macro or their slicer's "Start G-Code" configuration, whichever is applicable.
ta: `BED_MESH` இன் முந்தைய பதிப்புகள் தொடக்கத்தில் * இயல்புநிலை * என்ற சுயவிவரத்தை எப்போதும் ஏற்றின. ஒரு சுயவிவரம் ஏற்றப்படும் போது பயனரை தீர்மானிக்க அனுமதிப்பதற்கு ஆதரவாக இந்த நடத்தை அகற்றப்பட்டுள்ளது. ஒரு பயனர் `இயல்புநிலை` சுயவிவரத்தை ஏற்ற விரும்பினால்,` bed_mesh_profile load = இயல்புநிலை` அவற்றின் `start_print` மேக்ரோ அல்லது அவற்றின் ச்லைசரின்" தொடக்க சி-குறியீடு "உள்ளமைவுக்கு சேர்க்க பரிந்துரைக்கப்படுகிறது, எது பொருந்தினாலும்.

source: Alternatively the old behavior of loading a profile at startup can be restored with a `[delayed_gcode]`:
ta: மாற்றாக, தொடக்கத்தில் ஒரு சுயவிவரத்தை ஏற்றுவதற்கான பழைய நடத்தை `[தாமதமான_சி கோட்]`:
