Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bootloader_Entry.po
Languages: ta

source: Bootloader Entry
ta: துவக்க ஏற்றி நுழைவு

source: Klipper can be instructed to reboot into a [Bootloader](Bootloaders.md) in one of the following ways:
ta: பின்வரும் வழிகளில் ஒன்றில் [துவக்க ஏற்றி] (துவக்க ஏற்றிகள்] (துவக்க ஏற்றிகள்.

source: Requesting the bootloader
ta: துவக்க ஏற்றி கோருகிறது

source: Virtual Serial
ta: மெய்நிகர் தொடர்

source: If a virtual (USB-ACM) serial port is in use, pulsing DTR while at 1200 baud will request the bootloader.
ta: ஒரு மெய்நிகர் (யூ.எச்.பி-ஏ.சி.எம்) சீரியல் துறைமுகம் பயன்பாட்டில் இருந்தால், டி.டி.ஆரை துடிக்கும் போது 1200 பாட் துவக்க ஏற்றி கோரும்.

source: Python (with `flash_usb`)
ta: பைதான் (`ஃப்ளாச்_ச்பி` உடன்)

source: To enter the bootloader using python (using `flash_usb`):
ta: பைத்தானைப் பயன்படுத்தி துவக்க ஏற்றியை உள்ளிட (`Flash_usb` ஐப் பயன்படுத்தி):

source: Where `<DEVICE>` is your serial device, such as `/dev/serial.by-id/usb-Klipper[...]` or `/dev/ttyACM0`
ta: `<sevider>` என்பது உங்கள் தொடர் சாதனம், அதாவது `/dev/serial.by-id/usb-klipper [...]` அல்லது `/dev/ttyacm0`

source: Note that if this fails, no output will be printed, success is indicated by printing `Entering bootloader on <DEVICE>`.
ta: இது தோல்வியுற்றால், எந்த வெளியீடும் அச்சிடப்படாது என்பதை நினைவில் கொள்க, <சாதனத்தில் துவக்க ஏற்றியை உள்ளிடுவதன் மூலம் செய் குறிக்கப்படுகிறது.

source: Picocom
ta: பைக்கோகாம்

source: `<Ctrl-A><Ctrl-P>` means holding `Ctrl`, pressing and releasing `a`, pressing and releasing `p`, then releasing `Ctrl`
ta: `<ctrl-a> <ctrl-p>` என்றால் `ctrl` ஐ வைத்திருப்பது,` A` ஐ அழுத்தி விடுவித்தல், `p` ஐ அழுத்தி வெளியிடுவது, பின்னர்` ctrl` ஐ வெளியிடுகிறது

source: Physical serial
ta: இயற்பியல் தொடர்

source: If a physical serial port is being used on the MCU (even if a USB serial adapter is being used to connect to it), sending the string `<SPACE><FS><SPACE>Request Serial Bootloader!!<SPACE>~`.
ta: MCU இல் ஒரு இயற்பியல் சீரியல் துறைமுகம் பயன்படுத்தப்பட்டால் (ஒரு யூ.எச்.பி சீரியல் அடாப்டர் அதனுடன் இணைக்கப் பயன்படுத்தப்பட்டாலும் கூட), `<space> <fs> <space> என்ற சரத்தை அனுப்புகிறது தொடர் துவக்க ஏற்றி !! .

source: `<SPACE>` is an ASCII literal space, 0x20.
ta: `<space>` என்பது ஒரு ASCII நேரடி இடம், 0x20.

source: `<FS>` is the ASCII File Separator, 0x1c.
ta: `<fs>` என்பது ASCII கோப்பு பிரிப்பான், 0x1c.

source: Note that this is not a valid message as per the [MCU Protocol](Protocol.md#micro-controller-interface), but sync characters(`~`) are still respected.
ta: [MCU நெறிமுறை] (புரோட்டோகால்.

source: Because this message must be the only thing in the "block" it is received in, prefixing an extra sync character can increase reliability if other tools were previously accessing the serial port.
ta: இந்த செய்தி மட்டுமே பெறப்பட்ட "தடுப்பில்" ஒரே விசயமாக இருக்க வேண்டும் என்பதால், கூடுதல் ஒத்திசைவு எழுத்தை முன்னொட்டு மற்ற கருவிகள் முன்பு சீரியல் போர்ட்டை அணுகினால் நம்பகத்தன்மையை அதிகரிக்கும்.

source: Shell
ta: ஓடு

source: Where `<DEVICE>` is your serial port, such as `/dev/ttyS0`, or `/dev/serial/by-id/gpio-serial2`, and
ta: `<சாதனம்>` என்பது உங்கள் தொடர் துறைமுகம், அதாவது `/dev/ttys0`, அல்லது`/dev/serial/by-id/gpio-serial2`, மற்றும்

source: `<BAUD>` is the baud rate of the serial port, such as `115200`.
ta: `<baud>` என்பது `115200` போன்ற தொடர் துறைமுகத்தின் பாட் வீதமாகும்.

source: CANBUS
ta: கான்பச்

source: If CANBUS is in use, a special [admin message](CANBUS_protocol.md#admin-messages) will request the bootloader. This message will be respected even if the device already has a nodeid, and will also be processed if the mcu is shutdown.
ta: கான்பச் பயன்பாட்டில் இருந்தால், ஒரு சிறப்பு [நிர்வாக செய்தி] (canbus_protocol.md#நிர்வாக-மெசேச்கள்) துவக்க ஏற்றி கோரும். சாதனம் ஏற்கனவே ஒரு நோடிட் வைத்திருந்தாலும் இந்த செய்தி மதிக்கப்படும், மேலும் MCU பணிநிறுத்தம் செய்யப்பட்டால் செயலாக்கப்படும்.

source: This method also applies to devices operating in [CANBridge](CANBUS.md#usb-to-can-bus-bridge-mode) mode.
ta: [CANBRIDGE] (Canbus.MD#USB-TO-CAN-BUS-BRIDGE-MODE) பயன்முறையில் செயல்படும் சாதனங்களுக்கும் இந்த முறை பொருந்தும்.

source: Katapult's flashtool.py
ta: கட்டபுல்ட்டின் ஃப்ளாச் டூல்.பை

source: Where `<CAN_IFACE>` is the can interface to use. If using `can0`, both the `-i` and `<CAN_IFACE>` may be omitted.
ta: `<can_iface>` என்பது பயன்படுத்தக்கூடிய இடைமுகம். `Can0` ஐப் பயன்படுத்தினால்,` -i` மற்றும் `<can_iface> இரண்டுமே தவிர்க்கப்படலாம்.

source: `<UUID>` is the UUID of your CAN device.
ta: `<uuid>` என்பது உங்கள் CAN சாதனத்தின் UUID ஆகும்.

source: See the [CANBUS Documentation](CANBUS.md#finding-the-canbus_uuid-for-new-micro-controllers) for information on finding the CAN UUID of your devices.
ta: உங்கள் சாதனங்களின் UUID ஐக் கண்டுபிடிப்பது குறித்த தகவலுக்கு [Canbus Documentation] (canbus.md#கண்டுபிடிப்பு-தி-கன்பச்_யூயிட்-புதிய-மைக்ரோ-கன்ட்ரோலர்கள்) ஐப் பார்க்கவும்.

source: Entering the bootloader
ta: துவக்க ஏற்றி நுழைகிறது

source: When klipper receives one of the above bootloader requests:
ta: மேலே உள்ள துவக்க ஏற்றி கோரிக்கைகளில் ஒன்றை கிளிப்பர் பெறும்போது:

source: If Katapult (formerly known as CANBoot) is available, klipper will request that Katapult stay active on the next boot, then reset the MCU (therefore entering Katapult).
ta: கட்டபுல்ட் (முன்னர் கான்பூட் என்று அழைக்கப்பட்டார்) கிடைத்தால், அடுத்த துவக்கத்தில் கட்டபல்ட் செயலில் இருக்க வேண்டும் என்று கிளிப்பர் கோருவார், பின்னர் MCU ஐ மீட்டமைக்கவும் (எனவே கட்டபால்ட்டுக்குள் நுழைகிறது).

source: If Katapult is not available, klipper will then try to enter a platform-specific bootloader, such as STM32's DFU mode([see note](#stm32-dfu-warning)).
ta: கட்டபுல்ட் கிடைக்கவில்லை என்றால், கிளிப்பர் STM32 இன் DFU பயன்முறையைப் போன்ற ஒரு இயங்குதள-குறிப்பிட்ட துவக்க ஏற்றியை உள்ளிட முயற்சிப்பார் ([குறிப்பைக் காண்க] (#STM32-DFU-WARNING)).

source: In short, Klipper will reboot to Katapult if installed, then a hardware specific bootloader if available.
ta: சுருக்கமாக, நிறுவப்பட்டால் கிளிப்பர் கட்டபுல்ட்டுக்கு மறுதொடக்கம் செய்யும், பின்னர் ஒரு வன்பொருள் குறிப்பிட்ட துவக்க ஏற்றி கிடைத்தால்.

source: For details about the specific bootloaders on various platforms see [Bootloaders](Bootloaders.md)
ta: பல்வேறு தளங்களில் குறிப்பிட்ட துவக்க ஏற்றிகள் பற்றிய விவரங்களுக்கு [துவக்க ஏற்றிகள்] (துவக்க ஏற்றிகள்.

source: Notes
ta: குறிப்புகள்

source: STM32 DFU Warning
ta: STM32 DFU எச்சரிக்கை

source: Note that on some boards, like the Octopus Pro v1, entering DFU mode can cause undesired actions (such as powering the heater while in DFU mode). It is recommended to disconnect heaters, and otherwise prevent undesired operations when using DFU mode. Consult the documentation for your board for more details.
ta: ஆக்டோபச் புரோ வி 1 போன்ற சில பலகைகளில், டி.எஃப்.யூ பயன்முறையில் நுழைவது விரும்பத்தகாத செயல்களை ஏற்படுத்தும் என்பதை நினைவில் கொள்க (டி.எஃப்.யூ பயன்முறையில் இருக்கும்போது ஈட்டரை இயக்குவது போன்றவை). ஈட்டர்களைத் துண்டிக்க பரிந்துரைக்கப்படுகிறது, இல்லையெனில் DFU பயன்முறையைப் பயன்படுத்தும் போது விரும்பத்தகாத செயல்பாடுகளைத் தடுக்கவும். மேலும் விவரங்களுக்கு உங்கள் வாரியத்திற்கான ஆவணங்களை அணுகவும்.
