Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/CANBUS_Troubleshooting.po
Languages: ta, zh_hans

source: CANBUS Troubleshooting
ta: கான்பச் சரிசெய்தல்
zh_hans: CanBus故障排除

source: This document provides information on troubleshooting communication issues when using [Klipper with CAN bus](CANBUS.md).
ta: இந்த ஆவணம் [கேன் பச்) (CANBUS.MD) ஐப் பயன்படுத்தும் போது தகவல்தொடர்பு சிக்கல்களை சரிசெய்தல் பற்றிய தகவல்களை வழங்குகிறது.
zh_hans: 本文档提供了使用[Klipper with CAN Bus](CANBUS.md)时通信问题的故障排除信息。

source: Verify CAN bus wiring
ta: பச் வயரிங் செய்யலாம்
zh_hans: 验证CAN总线布线

source: The first step in troubleshooting communication issues is to verify the CAN bus wiring.
ta: தகவல்தொடர்பு சிக்கல்களை சரிசெய்வதற்கான முதல் படி கேன் பச் வயரிங் சரிபார்க்க வேண்டும்.
zh_hans: 排除通信故障的第一步是验证CAN总线布线。

source: Be sure there are exactly two 120 Ohm [terminating resistors](CANBUS.md#terminating-resistors) on the CAN bus. If the resistors are not properly installed then messages may not be able to be sent at all or the connection may have sporadic instability.
ta: கேன் பச்சில் சரியாக இரண்டு 120 ஓம் [நிறுத்துதல் மின்தடையங்கள்] (canbus.md#நிறுத்துதல்-ரெசிச்டர்கள்) உள்ளன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். மின்தடையங்கள் சரியாக நிறுவப்படாவிட்டால், செய்திகளை அனுப்ப முடியாது அல்லது இணைப்புக்கு அவ்வப்போது உறுதியற்ற தன்மை இருக்கலாம்.
zh_hans: 确保CAN总线上恰好有两个120欧姆[终端电阻](CANBUS.md#终端电阻)。如果没有正确安装电阻器，则可能根本无法发送消息，或者连接可能有零星的不稳定。

source: The CANH and CANL bus wiring should be twisted around each other. At a minimum, the wiring should have a twist every few centimeters. Avoid twisting the CANH and CANL wiring around power wires and ensure that power wires that travel parallel to the CANH and CANL wires do not have the same amount of twists.
ta: CAN மற்றும் CANL BUS வயரிங் ஒருவருக்கொருவர் முறுக்க வேண்டும். குறைந்தபட்சம், வயரிங் ஒவ்வொரு சில சென்டிமீட்டருக்கும் ஒரு திருப்பத்தைக் கொண்டிருக்க வேண்டும். பவர் கம்பிகளைச் சுற்றி கேன் மற்றும் கேன்ல் வயரிங் முறுக்குவதைத் தவிர்த்து, கேன் மற்றும் கேன்ல் கம்பிகளுக்கு இணையாக பயணிக்கும் பவர் கம்பிகள் அதே அளவு திருப்பங்களைக் கொண்டிருக்கவில்லை என்பதை உறுதிப்படுத்தவும்.
zh_hans: CANH和CANL母线应相互缠绕。至少，电线每隔几厘米就应该有一次绞合。避免将CANH和CALL电线缠绕在电源线周围，并确保平行于CANH和CALL电线的电源线没有相同的扭转量。

source: Verify that all plugs and wire crimps on the CAN bus wiring are fully secured. Movement of the printer toolhead may jostle the CAN bus wiring causing a bad wire crimp or unsecured plug to result in intermittent communication errors.
ta: கேன் பச் வயரிங் இல் உள்ள அனைத்து செருகிகளும் கம்பி கிரிம்ப்களும் முழுமையாகப் பாதுகாக்கப்பட்டுள்ளனவா என்பதை சரிபார்க்கவும். அச்சுப்பொறி கருவியின் இயக்கம் பச் வயரிங் ஒரு மோசமான கம்பி கிரிம்ப் அல்லது பாதுகாப்பற்ற பிளக் இடைப்பட்ட தகவல்தொடர்பு பிழைகள் ஏற்படக்கூடும்.
zh_hans: 确认CAN总线接线上的所有插头和线夹都已完全固定。打印机刀头的移动可能会挤压CAN总线布线，导致不良的线缆卷曲或未固定的插头，从而导致间歇性通信错误。

source: Check for incrementing bytes_invalid counter
ta: BYTES_INVALID கவுண்டரை அதிகரிக்க சரிபார்க்கவும்
zh_hans: 检查递增BYTES_INVALID计数器

source: The Klipper log file will report a `Stats` line once a second when the printer is active. These "Stats" lines will have a `bytes_invalid` counter for each micro-controller. This counter should not increment during normal printer operation (it is normal for the counter to be non-zero after a RESTART and it is not a concern if the counter increments once a month or so). If this counter increments on a CAN bus micro-controller during normal printing (it increments every few hours or more frequently) then it is an indication of a severe problem.
ta: அச்சுப்பொறி செயலில் இருக்கும்போது ஒரு நொடிக்கு ஒரு முறை `புள்ளிவிவரங்கள்` வரியை கிளிப்பர் பதிவு கோப்பு புகாரளிக்கும். இந்த "புள்ளிவிவரங்கள்" வரிகள் ஒவ்வொரு மைக்ரோ-கன்ட்ரோலருக்கும் `பைட்டுகள்_இன் வாலிட்` கவுண்டரைக் கொண்டிருக்கும். சாதாரண அச்சுப்பொறி செயல்பாட்டின் போது இந்த கவுண்டர் அதிகரிக்கக்கூடாது (மறுதொடக்கத்திற்குப் பிறகு கவுண்டர் பூச்சியமற்றவராக இருப்பது இயல்பானது, மேலும் கவுண்டர் ஒரு மாதத்திற்கு ஒரு முறை அல்லது அதற்கு மேல் அதிகரித்தால் அது கவலைக்குரியது அல்ல). சாதாரண அச்சிடலின் போது இந்த கவுண்டர் கேன் பச் மைக்ரோ-கன்ட்ரோலரில் அதிகரித்தால் (இது ஒவ்வொரு சில மணிநேரங்களுக்கும் அல்லது அடிக்கடி அதிகரிக்கிறது), இது கடுமையான பிரச்சினையின் அறிகுறியாகும்.
zh_hans: 当打印机处于活动状态时，Klipper日志文件将每秒报告一次`Stats‘行。对于每个微控制器，这些“Stat”行都将有一个`bytes_valid`计数器。在正常的打印机操作期间，此计数器不应递增(重新启动后计数器为非零值是正常的，如果计数器每月递增一次也无关紧要)。如果在正常打印过程中，CAN Bus微控制器上的此计数器增加(每隔几个小时或更频繁地增加一次)，则表示存在严重问题。

source: Incrementing `bytes_invalid` on a CAN bus connection is a symptom of reordered messages on the CAN bus. There are two known causes of reordered messages:
ta: கேன் பச் இணைப்பில் `bytes_invalid` ஐ அதிகரிப்பது கேன் பச்சில் மறுவரிசைப்படுத்தப்பட்ட செய்திகளின் அறிகுறியாகும். மறுவரிசைப்படுத்தப்பட்ட செய்திகளுக்கு இரண்டு அறியப்பட்ட காரணங்கள் உள்ளன:
zh_hans: 在CAN总线连接上递增`BYTES_INVALID`是CAN总线上消息重新排序的症状。消息重新排序有两个已知原因：

source: Old versions of the popular candlight_firmware for USB CAN adapters had a bug that could cause reordered messages. If using a USB CAN adapter running this firmware then make sure to update to the latest firmware if incrementing `bytes_invalid` is observed.
ta: யூ.எச்.பி க்கான பிரபலமான மெழுகுவர்த்தி_பார்ம்வேரின் பழைய பதிப்புகள் அடாப்டர்களில் மறுவரிசைப்படுத்தப்பட்ட செய்திகளை ஏற்படுத்தக்கூடிய ஒரு பிழை இருந்தது. ஒரு யூ.எச்.பி பயன்படுத்தினால் இந்த ஃபார்ம்வேரை இயக்கும் அடாப்டர் முடியும் என்றால், `bytes_invalid` ஐ அதிகரிப்பதாக இருந்தால் அண்மைக் கால ஃபார்ம்வேரைப் புதுப்பிக்க உறுதிசெய்க.
zh_hans: 用于USB CAN适配器的常用烛光固件的旧版本有一个错误，可能会导致消息重新排序。如果使用运行此固件的USB CAN适配器，则在观察到递增的`Bytes_Invalid`时，请确保更新到最新固件。

source: Some Linux kernel builds for embedded devices have been known to reorder CAN bus messages. It may be necessary to use an alternative Linux kernel or to use alternative hardware that supports mainstream Linux kernels that do not exhibit this problem.
ta: உட்பொதிக்கப்பட்ட சாதனங்களுக்கான சில லினக்ச் கர்னல் கட்டமைப்புகள் பச் செய்திகளை மறுவரிசைப்படுத்துகின்றன. மாற்று லினக்ச் கர்னலைப் பயன்படுத்துவது அல்லது இந்த சிக்கலை வெளிப்படுத்தாத முதன்மையான லினக்ச் கர்னல்களை ஆதரிக்கும் மாற்று வன்பொருளைப் பயன்படுத்துவது அவசியமாக இருக்கலாம்.
zh_hans: 已知一些用于嵌入式设备的Linux内核版本会对CAN总线消息进行重新排序。可能需要使用替代的Linux内核，或者使用支持不存在此问题的主流Linux内核的替代硬件。

source: Reordered messages is a severe problem that must be fixed. It will result in unstable behavior and can lead to confusing errors at any part of a print.
ta: மறுவரிசைப்படுத்தப்பட்ட செய்திகள் ஒரு கடுமையான சிக்கல், அது சரி செய்யப்பட வேண்டும். இது நிலையற்ற நடத்தைக்கு வழிவகுக்கும் மற்றும் அச்சின் எந்தப் பகுதியிலும் குழப்பமான பிழைகள் வழிவகுக்கும்.
zh_hans: 重新排序的消息是一个必须解决的严重问题。这将导致行为不稳定，并可能导致打印的任何部分出现令人困惑的错误。

source: Obtaining candump logs
ta: கேண்டம்ப் பதிவுகளைப் பெறுதல்
zh_hans: 获取candump日志

source: The CAN bus messages sent to and from the micro-controller are handled by the Linux kernel. It is possible to capture these messages from the kernel for debugging purposes. A log of these messages may be of use in diagnostics.
ta: மைக்ரோ-கன்ட்ரோலருக்கு அனுப்பப்பட்ட மற்றும் அனுப்பப்பட்ட பச் செய்திகள் லினக்ச் கர்னால் கையாளப்படுகின்றன. பிழைத்திருத்த நோக்கங்களுக்காக இந்த செய்திகளை கர்னலில் இருந்து கைப்பற்ற முடியும். இந்த செய்திகளின் பதிவு நோயறிதலில் பயன்படலாம்.
zh_hans: 向微控制器发送和从微控制器发送的CAN总线消息由Linux内核处理。出于调试目的，可以从内核捕获这些消息。这些消息的日志可能在诊断中有用。

source: The Linux [can-utils](https://github.com/linux-can/can-utils) tool provides the capture software. It is typically installed on a machine by running:
ta: லினக்ச் [CAN-UTILS] (https://github.com/linux-can/can-utils) கருவி பிடிப்பு மென்பொருளை வழங்குகிறது. இது பொதுவாக இயங்குவதன் மூலம் ஒரு கணினியில் நிறுவப்படுகிறது:
zh_hans: Linux[can-utils](https://github.com/linux-can/can-utils)工具提供了捕获软件。通常通过运行以下命令将其安装在计算机上：

source: Once installed, one may obtain a capture of all CAN bus messages on an interface with the following command:
ta: நிறுவப்பட்டதும், பின்வரும் கட்டளையுடன் ஒரு இடைமுகத்தில் அனைத்து பச் செய்திகளையும் கைப்பற்றலாம்:
zh_hans: 安装后，可使用以下命令捕获接口上的所有CAN总线消息：

source: One can view the resulting log file (`mycanlog` in the example above) to see each raw CAN bus message that was sent and received by Klipper. Understanding the content of these messages will likely require low-level knowledge of Klipper's [CANBUS protocol](CANBUS_protocol.md) and Klipper's [MCU commands](MCU_Commands.md).
ta: கிளிப்பரால் அனுப்பப்பட்ட மற்றும் பெறப்பட்ட ஒவ்வொரு மூல கேன் பச் செய்தியையும் காண, இதன் விளைவாக வரும் பதிவு கோப்பை (`மைன்லாக்` மேலே உள்ள எடுத்துக்காட்டில்) காணலாம். இந்த செய்திகளின் உள்ளடக்கத்தைப் புரிந்துகொள்வதற்கு கிளிப்பரின் [கான்பச் நெறிமுறை] (Canbus_protocol.md) மற்றும் கிளிப்பரின் [MCU கட்டளைகள்] (MCU_COMMANDS.MD) பற்றிய குறைந்த அளவிலான அறிவு தேவைப்படும்.
zh_hans: 用户可以查看生成的日志文件(上例中的`mycanlog`)，以查看Klipper发送和接收的每个原始CAN总线消息。要理解这些消息的内容，可能需要对Klipper的[CanBus协议](CanBus_Protocol.md)和Klipper的[MCU命令](mcu_Commands.md)有较低层次的了解。

source: Parsing Klipper messages in a candump log
ta: கேண்டம்ப் பதிவில் கிளிப்பர் செய்திகளை பாகுபடுத்துதல்
zh_hans: 分析candump日志中的Klipper消息

source: One may use the `parsecandump.py` tool to parse the low-level Klipper micro-controller messages contained in a candump log. Using this tool is an advanced topic that requires knowledge of Klipper [MCU commands](MCU_Commands.md). For example:
ta: கேண்டம்ப் பதிவில் உள்ள குறைந்த அளவிலான கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் செய்திகளை அலசுவதற்கு ஒருவர் `parsecandump.py` கருவியைப் பயன்படுத்தலாம். இந்த கருவியைப் பயன்படுத்துவது ஒரு மேம்பட்ட தலைப்பு, இது கிளிப்பர் [MCU கட்டளைகள்] (MCU_COMMANDS.MD) பற்றிய அறிவு தேவைப்படுகிறது. உதாரணமாக:
zh_hans: 用户可以使用`parsecandump.py`工具来解析烛光日志中包含的低级Klipper微控制器消息。使用此工具是一个高级主题，需要具备Klipper[MCU命令](MCU_Commands.md)的知识。例如：

source: This tool produces output similar to the [parsedump tool](Debugging.md#translating-gcode-files-to-micro-controller-commands). See the documentation for that tool for information on generating the Klipper micro-controller data dictionary.
ta: இந்த கருவி [பார்செடம்ப் கருவி] (பிழைத்திருத்தம். கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் தரவு அகராதியை உருவாக்குவது குறித்த தகவலுக்கு அந்த கருவிக்கான ஆவணங்களைப் பார்க்கவும்.
zh_hans: 此工具生成的输出类似于[ParseDump tool](Debugging.md#translating-gcode-files-to-micro-controller-commands).。有关生成Klipper微控制器数据字典的信息，请参阅该工具的文档。

source: In the above example, `108` is the [CAN bus id](CANBUS_protocol.md#micro-controller-id-assignment). It is a hexadecimal number. The id `108` is assigned by Klipper to the first micro-controller. If the CAN bus has multiple micro-controllers on it, then the second micro-controller would be `10a`, the third would be `10c`, and so on.
ta: மேலே உள்ள எடுத்துக்காட்டில், `108` என்பது [கேன் பச் ஐடி] (canbus_protocol.md#மைக்ரோ-கன்ட்ரோலர்-ஐடி-ஒதுக்கீடு). இது ஒரு எக்சாடெசிமல் எண். ஐடி `108` முதல் மைக்ரோ-கன்ட்ரோலருக்கு கிளிப்பரால் ஒதுக்கப்படுகிறது. CAN பச் பல மைக்ரோ-கண்ட்ரோலர்களைக் கொண்டிருந்தால், இரண்டாவது மைக்ரோ-கண்ட்ரோலர் `10a` ஆக இருக்கும், மூன்றாவது` 10c`, மற்றும் பல.
zh_hans: 在上面的例子中，`108‘是[CAN Bus id](CANBUS_protocol.md#micro-controller-id-assignment).。它是一个十六进制数。ID‘108’由Klipper分配给第一个微控制器。如果CAN总线上有多个微控制器，则第二个微控制器将是 `10a`，第三个微控制器将是 `10c`，依此类推。

source: The candump log must be produced using the `-tz -Ddex` command-line arguments (for example: `candump -tz -Ddex can0,#FFFFFFFF`) in order to use the `parsecandump.py` tool.
ta: `Parsecandump.py` கருவியைப் பயன்படுத்துவதற்காக` -tz -ddex` கட்டளை -வரி வாதங்களைப் பயன்படுத்தி (எடுத்துக்காட்டாக: `candump -tz -ddex can0,#ffffffff`) பயன்படுத்தி கேண்டம்ப் பதிவு தயாரிக்கப்பட வேண்டும்.
zh_hans: 要使用`parsecandump.py`工具，必须使用`-tz-Ddex`命令行参数(例如：`andump-tz-DDEX can0，#FFFFFFF`)生成坎通普日志。

source: Using a logic analyzer on the canbus wiring
ta: கான்பச் வயரிங் மீது ஒரு வழக்கு பகுப்பாய்வியைப் பயன்படுத்துதல்
zh_hans: 在CanBus接线上使用逻辑分析仪

source: The [Sigrok Pulseview](https://sigrok.org/wiki/PulseView) software along with a low-cost [logic analyzer](https://en.wikipedia.org/wiki/Logic_analyzer) can be useful for diagnosing CAN bus signaling. This is an advanced topic likely only of interest to experts.
ta: [சிக்ரோக் புல்வெவியூ] (https://sigrok.org/wiki/pulsyview) மென்பொருள் குறைந்த வழக்கு [லாசிக் அனலைசர்] (https://en.wikipedia.org/wiki/logic_analyzer) பச் சிக்னலிங். இது நிபுணர்களுக்கு ஆர்வமாக மட்டுமே இருக்கும் ஒரு மேம்பட்ட தலைப்பு.
zh_hans: [Sigrok Pulseview](https://sigrok.org/wiki/PulseView)软件和低成本的[逻辑分析](https://en.wikipedia.org/wiki/Logic_analyzer)]可用于诊断CAN总线信号。这是一个可能只有专家才感兴趣的高级话题。

source: One can often find "USB logic analyzers" for under $15 (US pricing as of 2023). These devices are often listed as "Saleae logic clones" or as "24MHz 8 channel USB logic analyzers".
ta: ஒருவர் பெரும்பாலும் "யூ.எச்.பி லாசிக் அனலிசர்களை" $ 15 க்கு கீழ் காணலாம் (2023 வரை அமெரிக்க விலை நிர்ணயம்). இந்த சாதனங்கள் பெரும்பாலும் "சாலே லாசிக் குளோன்கள்" அல்லது "24 மெகா எர்ட்ச் 8 சேனல் யூ.எச்.பி லாசிக் அனலைசர்கள்" என பட்டியலிடப்பட்டுள்ளன.
zh_hans: 人们经常可以找到价格低于15美元的“USB逻辑分析仪”(截至2023年美国定价)。这些设备通常被列为“Saleae逻辑克隆”或“24 MHz 8通道USB逻辑分析仪”。

source: The above picture was taken while using Pulseview with a "Saleae clone" logic analyzer. The Sigrok and Pulseview software was installed on a desktop machine (also install the "fx2lafw" firmware if that is packaged separately). The CH0 pin on the logic analyzer was routed to the CAN Rx line, the CH1 pin was wired to the CAN Tx pin, and GND was wired to GND. Pulseview was configured to only display the D0 and D1 lines (red "probe" icon center top toolbar). The number of samples was set to 5 million (top toolbar) and the sample rate was set to 24Mhz (top toolbar). The CAN decoder was added (yellow and green "bubble icon" right top toolbar). The D0 channel was labeled as RX and set to trigger on a falling edge (click on black D0 label at left). The D1 channel was labeled as TX (click on brown D1 label at left). The CAN decoder was configured for 1Mbit rate (click on green CAN label at left). The CAN decoder was moved to the top of the display (click and drag green CAN label). Finally, the capture was started (click "Run" at top left) and a packet was transmitted on the CAN bus (`cansend can0 123#121212121212`).
ta: "சாலே நகலி" லாசிக் பகுப்பாய்வியுடன் பல்ச்வியூவைப் பயன்படுத்தும் போது மேலே உள்ள படம் எடுக்கப்பட்டது. சிக்ரோக் மற்றும் புல்வெவியூ மென்பொருள் ஒரு டெச்க்டாப் கணினியில் நிறுவப்பட்டது (அது தனித்தனியாக தொகுக்கப்பட்டால் "FX2LAFW" ஃபார்ம்வேரையும் நிறுவவும்). லாசிக் அனலைசரில் உள்ள CH0 முள் CAN RX வரிக்கு அனுப்பப்பட்டது, CH1 முள் CAN TX முள் க்கு கம்பி செய்யப்பட்டது, மற்றும் GND GND க்கு கம்பி செய்யப்பட்டது. D0 மற்றும் D1 வரிகளை (சிவப்பு "ஆய்வு" படவுரு சென்டர் டாப் கருவிப்பட்டி) மட்டுமே காண்பிக்க பல்சேவியூ கட்டமைக்கப்பட்டது. மாதிரிகளின் எண்ணிக்கை 5 மில்லியனாக (சிறந்த கருவிப்பட்டி) அமைக்கப்பட்டது மற்றும் மாதிரி வீதம் 24 மெகா எர்ட்ச் (சிறந்த கருவிப்பட்டி) என அமைக்கப்பட்டது. கேன் டிகோடர் சேர்க்கப்பட்டது (மஞ்சள் மற்றும் பச்சை "குமிழி படவுரு" வலது மேல் கருவிப்பட்டி). டி 0 சேனல் ஆர்எக்ச் என பெயரிடப்பட்டு வீழ்ச்சி விளிம்பில் தூண்டுவதற்கு அமைக்கப்பட்டது (இடதுபுறத்தில் கருப்பு டி 0 லேபிளைக் சொடுக்கு செய்க). டி 1 சேனல் டிஎக்ச் என பெயரிடப்பட்டது (இடதுபுறத்தில் பிரவுன் டி 1 லேபிளைக் சொடுக்கு செய்க). CAN டிகோடர் 1MBIT வீதத்திற்கு கட்டமைக்கப்பட்டது (இடதுபுறத்தில் பச்சை கேன் லேபிளைக் சொடுக்கு செய்க). கேன் டிகோடர் காட்சியின் மேற்பகுதிக்கு நகர்த்தப்பட்டது (கிளிக் செய்து இழுக்க பச்சை கேன் லேபிள்). இறுதியாக, பிடிப்பு தொடங்கப்பட்டது (மேல் இடதுபுறத்தில் "ரன்" என்பதைக் சொடுக்கு செய்க) மற்றும் கேன் பச்சில் ஒரு பாக்கெட் அனுப்பப்பட்டது (`கேன்சென்ட் CAN0 123#1212121212`).
zh_hans: 上图是在使用Pulseview和“Saleae Clone”逻辑分析仪时拍摄的。Sigrok和Pulseview软件安装在台式计算机上(如果单独打包，还应安装“fx2lafw”固件)。逻辑分析仪上的CH0引脚被布线到CAN Rx线路，CH1引脚被布线到CAN Tx引脚，GND被布线到GND。Pulseview配置为仅显示D0和D1线(红色“探头”图标中央顶部工具栏)。采样数设置为500万(顶部工具栏)，采样率设置为24 Mhz(顶部工具栏)。添加了CAN解码器(右上工具栏黄绿相间的“气泡图标”)。D0通道被标记为RX并设置为在下降沿触发(点击左侧的黑色D0标签)。将d1通道标记为Tx(点击左侧棕色的d1标签)。CAN解码器配置为1Mbit速率(点击左侧绿色的CAN标签)。CAN解码器被移到显示屏顶部(单击并拖动绿色的CAN标签)。最后，开始捕获(点击左上角的“Run”(运行))，并在CAN总线上传输一个包(`cansend can0 123#121212121212`)。

source: The logic analyzer provides an independent tool for capturing packets and verifying bit timing.
ta: லாசிக் அனலைசர் பாக்கெட்டுகளைக் கைப்பற்றுவதற்கும் பிட் நேரத்தை சரிபார்க்கவும் ஒரு சுயாதீன கருவியை வழங்குகிறது.
zh_hans: 逻辑分析器提供了用于捕获数据包和验证位时序的独立工具。

source: Use an appropriate txqueuelen setting
ta: பொருத்தமான txquealen அமைப்பைப் பயன்படுத்தவும்
zh_hans: 使用适当的 txqueuelen 设置

source: The Klipper code uses the Linux kernel to manage CAN bus traffic. By default, the kernel will only queue 10 CAN transmit packets. It is recommended to [configure the can0 device](CANBUS.md#host-hardware) with a `txqueuelen 128` to increase that size.
ta: பச் போக்குவரத்தை நிர்வகிக்க கிளிப்பர் குறியீடு லினக்ச் கர்னலைப் பயன்படுத்துகிறது. இயல்பாக, கர்னல் வரிசையில் 10 மட்டுமே பாக்கெட்டுகளை அனுப்ப முடியும். அந்த அளவை அதிகரிக்க [CAN0 சாதனத்தை] (CANBUS.MD#ஓச்ட்-ஆர்ட்வேர்) `TxQuealen 128` உடன் கட்டமைக்க பரிந்துரைக்கப்படுகிறது.
zh_hans: Klipper 代码使用 Linux 内核来管理 CAN 总线流量。默认情况下，内核只会排队 10 个 CAN 传输数据包。建议使用 `txqueuelen 128` [配置 can0 设备](CANBUS.md#host-hardware) 来增加该大小。

source: If Klipper transmits a packet and Linux has filled all of its transmit queue space then Linux will drop that packet and messages like the following will appear in the Klipper log:
ta: கிளிப்பர் ஒரு பாக்கெட்டை அனுப்பி, லினக்ச் அதன் டிரான்ச்மிட் வரிசை இடத்தை நிரப்பியிருந்தால், லினக்ச் அந்த பாக்கெட்டை கைவிடுகிறது, மேலும் பின்வருவனவற்றைப் போன்ற செய்திகள் கிளிப்பர் பதிவில் தோன்றும்:
zh_hans: 如果 Klipper 传输了一个数据包，而 Linux 已经填满了其所有的传输队列空间，那么 Linux 将丢弃该数据包，并且 Klipper 日志中将出现如下消息：

source: Klipper will automatically retransmit the lost messages as part of its normal application level message retransmit system. Thus, this log message is a warning and it does not indicate an unrecoverable error.
ta: கிளிப்பர் அதன் சாதாரண பயன்பாட்டு நிலை செய்தி ரெட்ரான்ச்மிட் அமைப்பின் ஒரு பகுதியாக இழந்த செய்திகளை தானாகவே மீண்டும் அனுப்பும். எனவே, இந்த பதிவு செய்தி ஒரு எச்சரிக்கையாகும், மேலும் இது மீட்டெடுக்க முடியாத பிழையைக் குறிக்கவில்லை.
zh_hans: 作为其正常应用程序级消息重传系统的一部分，Klipper 将自动重传丢失的消息。因此，此日志消息是警告，并不表示不可恢复的错误。

source: If a complete CAN bus failure occurs (such as a CAN wire break) then Linux will not be able to transmit any messages on the CAN bus and it is common to find the above message in the Klipper log. In this case, the log message is a symptom of a larger problem (the inability to transmit any messages) and is not directly related to Linux `txqueuelen`.
ta: ஒரு முழுமையான கேன் பச் தோல்வி ஏற்பட்டால் (கேன் கம்பி பிரேக் போன்றவை) பின்னர் லினக்ச் கேன் பச்சில் எந்த செய்திகளையும் அனுப்ப முடியாது, மேலும் மேலே உள்ள செய்தியை கிளிப்பர் பதிவில் கண்டுபிடிப்பது பொதுவானது. இந்த வழக்கில், பதிவு செய்தி ஒரு பெரிய பிரச்சினையின் அறிகுறியாகும் (எந்த செய்திகளையும் கடத்த இயலாமை) மற்றும் இது லினக்ச் `TxQuealen` உடன் நேரடியாக தொடர்புடையது அல்ல.
zh_hans: 如果发生 CAN 总线完全故障（例如 CAN 线路断线），则 Linux 将无法在 CAN 总线上传输任何消息，并且通常会在 Klipper 日志中找到上述消息。在这种情况下，日志消息是更大问题的征兆（无法传输任何消息），与 Linux `txqueuelen` 没有直接关系。

source: One may check the current queue size by running the Linux command `ip link show can0`. It should report a bunch of text including the snippet `qlen 128`. If one sees something like `qlen 10` then it indicates the CAN device has not been properly configured.
ta: லினக்ச் கட்டளை `ஐபி இணைப்பு காட்சி CAN0` ஐ இயக்குவதன் மூலம் தற்போதைய வரிசை அளவை ஒருவர் சரிபார்க்கலாம். இது `QLEN 128` துணுக்கை உட்பட ஒரு சில உரையைப் புகாரளிக்க வேண்டும். `QLEN 10` போன்ற ஒன்றை ஒருவர் பார்த்தால், CAN சாதனம் சரியாக கட்டமைக்கப்படவில்லை என்பதைக் குறிக்கிறது.
zh_hans: 可以通过运行 Linux 命令“ip link show can0”来检查当前队列大小。它应该会报告一堆文本，包括代码片段“qlen 128”。如果看到类似“qlen 10”的内容，则表明 CAN 设备尚未正确配置。

source: It is not recommended to use a `txqueuelen` significantly larger than 128. A CAN bus running at a frequency of 1000000 will typically take around 120us to transmit a CAN packet. Thus a queue of 128 packets is likely to take around 15-20ms to drain. A substantially larger queue could cause excessive spikes in message round-trip-time which could lead to unrecoverable errors. Said another way, Klipper's application retransmit system is more robust if it does not have to wait for Linux to drain an excessively large queue of possibly stale data. This is analogous to the problem of [bufferbloat](https://en.wikipedia.org/wiki/Bufferbloat) on internet routers.
ta: 128 ஐ விட கணிசமாக பெரிய `txquealen` ஐப் பயன்படுத்த பரிந்துரைக்கப்படவில்லை. 1000000 அதிர்வெண்ணில் இயங்கும் ஒரு பச் பொதுவாக ஒரு கேன் பாக்கெட்டை அனுப்ப 120US ஐ எடுக்கும். இதனால் 128 பாக்கெட்டுகளின் வரிசை வடிகட்ட 15-20 மீட்டர் ஆகும். கணிசமாக பெரிய வரிசை செய்தி சுற்று-பயண நேரத்தில் அதிகப்படியான கூர்முனைகளை ஏற்படுத்தக்கூடும், இது மீட்டெடுக்க முடியாத பிழைகளுக்கு வழிவகுக்கும். மற்றொரு வழி, கிளிப்பரின் பயன்பாட்டு ரெட்ரான்ச்மிட் அமைப்பு லினக்ச் அதிகப்படியான பெரிய வரிசையை வடிகட்ட காத்திருக்க வேண்டியதில்லை என்றால் மிகவும் வலுவானது. இது இணைய ரவுட்டர்களில் [பஃபர் பிளாட்] (https://en.wikipedia.org/wiki/bufferbloat) இன் சிக்கலுக்கு ஒப்பானது.
zh_hans: 不建议使用明显大于 128 的 `txqueuelen`。以 1000000 频率运行的 CAN 总线通常需要大约 120us 来传输 CAN 数据包。因此，128 个数据包的队列可能需要大约 15-20ms 才能耗尽。大得多的队列可能会导致消息往返时间出现过度峰值，从而导致无法恢复的错误。换句话说，如果 Klipper 的应用程序重传系统不必等待 Linux 耗尽可能过时的过大队列，它会更加强大。这类似于互联网路由器上的 [bufferbloat](https://en.wikipedia.org/wiki/Bufferbloat) 问题。

source: Under normal circumstances Klipper may utilize ~25 queue slots per MCU - typically only utilizing more slots during retransmits. (Specifically, the Klipper host may transmit up to 192 bytes to each Klipper MCU before receiving an acknowledgment from that MCU.) If a single CAN bus has 5 or more Klipper MCUs on it, then it might be necessary to increase the `txqueuelen` above the recommended value of 128. However, as above, care should be taken when selecting a new value to avoid excessive round-trip-time latency.
ta: சாதாரண சூழ்நிலைகளில் கிளிப்பர் MCU க்கு ~ 25 வரிசை இடங்களைப் பயன்படுத்தலாம் - பொதுவாக மறுபிரவேசங்களின் போது அதிக இடங்களைப் பயன்படுத்துகிறது. . 128 இன் பரிந்துரைக்கப்பட்ட மதிப்புக்கு மேலே. இருப்பினும், மேலே உள்ளபடி, அதிகப்படியான சுற்று-பயண நேர தாமதத்தைத் தவிர்க்க புதிய மதிப்பைத் தேர்ந்தெடுக்கும்போது கவனமாக இருக்க வேண்டும்.
zh_hans: 在正常情况下，Klipper 可能每个 MCU 使用约 25 个队列槽 - 通常仅在重传期间使用更多槽。（具体而言，Klipper 主机可能向每个 Klipper MCU 传输最多 192 个字节，然后才会收到该 MCU 的确认。）如果单个 CAN 总线上有 5 个或更多 Klipper MCU，则可能需要将`txqueuelen`增加到建议值 128 以上。但是，如上所述，选择新值时应小心谨慎，以避免过长的往返时间延迟。
