Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [bltouch] sensor_pin: # Pin connected to the BLTouch sensor pin. Most BLTouch devices # require a pullup on the sensor pin (prefix the pin name with "^"). # This parameter must be provided. control_pin: # Pin connected to the BLTouch control pin. This parameter must be # provided. #pin_move_time: 0.680 # The amount of time (in seconds) to wait for the BLTouch pin to # move up or down. The default is 0.680 seconds. #stow_on_each_sample: True # This determines if Klipper should command the pin to move up # between each probe attempt when performing a multiple probe # sequence. Read the directions in docs/BLTouch.md before setting # this to False. The default is True. #probe_with_touch_mode: False # If this is set to True then Klipper will probe with the device in # "touch_mode". The default is False (probing in "pin_down" mode). #pin_up_reports_not_triggered: True # Set if the BLTouch consistently reports the probe in a "not # triggered" state after a successful "pin_up" command. This should # be True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #pin_up_touch_mode_reports_triggered: True # Set if the BLTouch consistently reports a "triggered" state after # the commands "pin_up" followed by "touch_mode". This should be # True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #set_output_mode: # Request a specific sensor pin output mode on the BLTouch V3.0 (and # later). This setting should not be used on other types of probes. # Set to "5V" to request a sensor pin output of 5 Volts (only use if # the controller board needs 5V mode and is 5V tolerant on its input # signal line). Set to "OD" to request the sensor pin output use # open drain mode. The default is to not request an output mode. #x_offset: #y_offset: #z_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # See the "probe" section for information on these parameters.
uk: [bltouch] sensor_pin: Штифт, підключений до контакту датчика BLTouch. Більшість пристроїв BLTouch вимагають підтягування контакту датчика (префікс назви контакту "^"). Цей параметр необхідно вказати. control_pin: Штифт, підключений до контакту керування BLTouch. Цей параметр повинен бути надано. #pin_move_time: 0,680 Час (у секундах), який потрібно очікувати на пін BLTouch рух вгору або вниз. За замовчуванням 0,680 секунди. #stow_on_each_sample: Правда Це визначає, чи має Кліппер наказувати шпильці рухатися вгору між кожною спробою тестування під час виконання кількох тестів послідовність. Перед налаштуванням прочитайте вказівки в docs/BLTouch.md це на False. Типовим значенням є True. #probe_with_touch_mode: False Якщо для цього значення встановлено значення True, тоді Klipper виконуватиме зондування з пристроєм "сенсорний_режим". За замовчуванням значення False (зондування в режимі "pin_down"). #pin_up_reports_not_triggered: Правда Установіть, якщо BLTouch постійно повідомляє про зонд у "not triggered" стан після успішної команди "pin_up". Це повинно бути вірним для всіх справжніх пристроїв BLTouch. Прочитайте вказівки в docs/BLTouch.md, перш ніж встановити значення False. Типовим значенням є True. #pin_up_touch_mode_reports_triggered: Правда Установіть, якщо BLTouch постійно повідомляє про «запущений» стан після команди "pin_up", а потім "touch_mode". Це повинно бути Вірно для всіх справжніх пристроїв BLTouch. Прочитайте вказівки в docs/BLTouch.md, перш ніж встановити значення False. Типовим значенням є True. #set_output_mode: Запит на певний режим виведення контактів датчика на BLTouch V3.0 (і пізніше). Цей параметр не слід використовувати для інших типів датчиків. Встановіть значення "5V", щоб вимагати вихідну напругу датчика 5 В (використовуйте, лише якщо платі контролера потрібен режим 5 В і він толерантний до 5 В на вході сигнальна лінія). Встановіть значення "OD", щоб надіслати запит на використання вихідного контакту датчика відкритий режим зливу. За замовчуванням режим виведення не запитується. #x_offset: #y_offset: #z_offset: #швидкість: #ліфт_швидкість: #зразки: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: Перегляньте розділ "зонд", щоб отримати інформацію про ці параметри.

source: PCA9632 LED support. The PCA9632 is used on the FlashForge Dreamer.
uk: Підтримка світлодіодів PCA9632. PCA9632 використовується на FlashForge Dreamer.

source: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # See the "stepper" section for a description of the above # parameters. If none of the above parameters are specified then no # stepper will be associated with the nozzle hotend (though a # SYNC_EXTRUDER_MOTION command may associate one at run-time). nozzle_diameter: # Diameter of the nozzle orifice (in mm). This parameter must be # provided. filament_diameter: # The nominal diameter of the raw filament (in mm) as it enters the # extruder. This parameter must be provided. #max_extrude_cross_section: # Maximum area (in mm^2) of an extrusion cross section (eg, # extrusion width multiplied by layer height). This setting prevents # excessive amounts of extrusion during relatively small XY moves. # If a move requests an extrusion rate that would exceed this value # it will cause an error to be returned. The default is: 4.0 * # nozzle_diameter^2 #instantaneous_corner_velocity: 1.000 # The maximum instantaneous velocity change (in mm/s) of the # extruder during the junction of two moves. The default is 1mm/s. #max_extrude_only_distance: 50.0 # Maximum length (in mm of raw filament) that a retraction or # extrude-only move may have. If a retraction or extrude-only move # requests a distance greater than this value it will cause an error # to be returned. The default is 50mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Maximum velocity (in mm/s) and acceleration (in mm/s^2) of the # extruder motor for retractions and extrude-only moves. These # settings do not have any impact on normal printing moves. If not # specified then they are calculated to match the limit an XY # printing move with a cross section of 4.0*nozzle_diameter^2 would # have. #pressure_advance: 0.0 # The amount of raw filament to push into the extruder during # extruder acceleration. An equal amount of filament is retracted # during deceleration. It is measured in millimeters per # millimeter/second. The default is 0, which disables pressure # advance. #pressure_advance_smooth_time: 0.040 # A time range (in seconds) to use when calculating the average # extruder velocity for pressure advance. A larger value results in # smoother extruder movements. This parameter may not exceed 200ms. # This setting only applies if pressure_advance is non-zero. The # default is 0.040 (40 milliseconds). # # The remaining variables describe the extruder heater. heater_pin: # PWM output pin controlling the heater. This parameter must be # provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # heater_pin may be set to. The value 1.0 allows the pin to be set # fully enabled for extended periods, while a value of 0.5 would # allow the pin to be enabled for no more than half the time. This # setting may be used to limit the total power output (over extended # periods) to the heater. The default is 1.0. sensor_type: # Type of sensor - common thermistors are "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Generic # 3950","Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", and "TDK NTCG104LH104JT1". See the # "Temperature sensors" section for other sensors. This parameter # must be provided. sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # This parameter is only valid when the sensor is a thermistor. The # default is 4700 ohms. #smooth_time: 1.0 # A time value (in seconds) over which temperature measurements will # be smoothed to reduce the impact of measurement noise. The default # is 1 seconds. control: # Control algorithm (either pid or watermark). This parameter must # be provided. pid_Kp: pid_Ki: pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # heater_pwm = (Kp*error + Ki*integral(error) - Kd*derivative(error)) / 255 # Where "error" is "requested_temperature - measured_temperature" # and "heater_pwm" is the requested heating rate with 0.0 being full # off and 1.0 being full on. Consider using the PID_CALIBRATE # command to obtain these parameters. The pid_Kp, pid_Ki, and pid_Kd # parameters must be provided for PID heaters. #max_delta: 2.0 # On 'watermark' controlled heaters this is the number of degrees in # Celsius above the target temperature before disabling the heater # as well as the number of degrees below the target before # re-enabling the heater. The default is 2 degrees Celsius. #pwm_cycle_time: 0.100 # Time in seconds for each software PWM cycle of the heater. It is # not recommended to set this unless there is an electrical # requirement to switch the heater faster than 10 times a second. # The default is 0.100 seconds. #min_extrude_temp: 170 # The minimum temperature (in Celsius) at which extruder move # commands may be issued. The default is 170 Celsius. min_temp: max_temp: # The maximum range of valid temperatures (in Celsius) that the # heater must remain within. This controls a safety feature # implemented in the micro-controller code - should the measured # temperature ever fall outside this range then the micro-controller # will go into a shutdown state. This check can help detect some # heater and sensor hardware failures. Set this range just wide # enough so that reasonable temperatures do not result in an error. # These parameters must be provided.
uk: [extruder] Крок_pin: Дир_пін: Увімкнути: мікрокропи: catalog / saw / Ресурси #full_steps_per_rotation: #gear_ratio: Нема Див. розділ "Степпер" для опису вище # параметри. Якщо не вказано вищевказаних параметрів, то немає # степпер буде асоціюватися з насадкою гарячим (хоча б # SYNC_EXTRUDER_MOTION Команда може асоціювати один за замовчуванням. сопл_діаметр: Нема Діаметр насадки (в мм). Цей параметр повинен бути # надано. JavaScript licenses API Веб-сайт Нема Номінальний діаметр сировини (в мм) як він надходить # екструдер. Цей параметр необхідно надати. #max_extrude_cross_секція: # Максимальна площа (в мм^2) екструзійного перерізу (наприклад, # ширина екструзії множиться на висоту шару. Ця установка запобігає # надмірна кількість екструзії при порівняно малих переміщеннях XY. Нема Якщо перемістити запит на екструзійну швидкість, яка буде перевищити це значення Повернеться помилка. За замовчуванням: 4.0 * # сопл_діаметр^2 #instantaneous_corner_velocity: 1.000 Нема Максимальна миттєва зміна швидкості (в мм / с) # екструдера під час з'єднання двох рухів. За замовчуванням 1 мм/с. #max_extrude_only_distance: 50.0 # Максимальна довжина (в мм сирої нитки), що втракція або Чи може мати екструзії. Якщо відшкодування або зовнішнє переміщення # вимагає відстані більше, ніж це значення, це призведе до помилки # повернути. За замовчуванням 50мм. #max_extrude_only_velocity: #max_extrude_only_accel: # Максимальна швидкість (в мм / с) і прискорення (в мм / s^2) # екструдераторний двигун для ретракцій і екструзійних рухів. Про нас # налаштування не впливають на нормальні переходи друку. Якщо # вказаний, потім вони розраховуються, щоб відповідати ліміту XY # друк переміщення з перерізом 4.0*nozzle_diameter^2 б Немає. #pressure_advance: 0.0 Нема Сума сирої нитки для натискання на екструдер під час # прискорення екструдера. Рівномірна кількість ниток # при декларації. Вимірюється в міліметрах на # міліметр/секунд. За замовчуванням 0, який відключає тиск # заздалегідь. #pressure_advance_smooth_time: 0.040 # Діапазон часу (в секундах) для використання при розрахунку середня # Швидкість екструдера для тиску заздалегідь. Більші результати значення в # гладкі рухи екструдера. Цей параметр не може перевищувати 200 м. Нема Ця установка застосовується тільки при тиску_advance не-zero. Про нас # За замовчуванням 0.040 (40 мілісекунди). Нема Нема Решта змінних описують зовнішній нагрівач. Термопомпи: # PWM вихідний штифт, що контролює нагрівач. Цей параметр повинен бути # надано. #max_power: 1.0 Нема Максимальна потужність (визначена як значення від 0.0 до 1.0) # нагрівач_pin може бути встановлений. Значення 1.0 дозволяє встановлювати шпильку # повністю ввімкнено для розширених періодів, при цьому значення 0,5 буде # дозволяють ввімкнути шпильку не більше половини часу. Про нас # налаштування може бути використана для обмеження загальної потужності # періоди) нагрівач. За замовчуванням 1.0. Датчик_тип: Нема Тип датчика - загальні арматури "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Генерик" # 3950", "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", "TDK NTCG104LH104JT1". Дивитися # "Температурні датчики" для інших датчиків. Цей параметр Не обов'язково бути надані. Датчик_pin: Нема Аналоговий вхідний штифт підключений до датчика. Цей параметр повинен бути # надано. #pullup_resistor: 4700 Нема Стійкість (в омах) тяги прикріплюється до арматури. Нема Цей параметр діє лише тоді, коли датчик є аристором. Про нас # За замовчуванням 4700 Ом. #smooth_time: 1.0 # Значення часу (в секундах), над якими вимірюється температура Згладити вплив шуму вимірювання. За замовчуванням No 1 секунд. контроль: Нема Алгоритм управління (або під водою). Цей параметр повинен Немає наданих. pid_Kp: pid_Ki: pid_Kd: Нема Пропорційний (pid_Kp), інтегральний (pid_Ki), похідний Параметри керування зворотним зв'язком PID. Клиппер # оцінює параметри PID з наступним загальним формулою: # heater_pwm = (Kp*error + Ki*integral(error) - Kd *derivative(error)) / 255 Нема Де "error" "requested_ Infrastructure - вимірюється_температура" # і "heater_pwm" є запитаним коефіцієнтом опалення з 0,0 будучи повним #від і 1,0 повною мірою. Розглянемо використання PID_CALIBRATE # команди для отримання цих параметрів. pid_Kp, pid_Ki, pid_Kd # параметри повинні бути надані для нагрівачів PID. #max_delta: 2.6 км Нема На керованих обігрівачах «водамарка» це кількість ступенів Нема Цельсій над цільовою температурою перед відключенням нагрівача #, а також кількість градусів нижче цілі перед # перезнімання нагрівача. За замовчуванням 2 градусів Celsius. #pwm_cycle_time: 0.100 Нема Час за секундами для кожного програмного забезпечення PWM цикл обігрівача. Він Не рекомендується встановлювати це, якщо є електрика # Вимоги до перемикання обігрівача швидше 10 разів на секунду. Нема За замовчуванням 0.100 секунд. #min_extrude_temp: 170 Нема Мінімальна температура (в Цельсію) при якому пересуватися екструдер # команди можуть бути видані. За замовчуванням 170 Celsius. min_temp: максимум: Нема Максимальний діапазон допустимих температур (в Кельсі) # обігрівач повинен залишатися в межах. Це контролює функцію безпеки # реалізований в мікроконтролерному коді - слід вимірювати # температура коли-небудь падає за межі цього діапазону, то мікроконтролер # перейде в стан відключення. Ця перевірка може допомогти виявити деякі # Теплові та сенсорні апаратні збої. Встановити цей діапазон просто широкий Чи не вистачить розумних температур, що не призводить до помилки. Нема Ці параметри повинні бути надані. .

source: LEDs
uk: світлодіоди

source: [led]
uk: [під керівництвом]

source: Support for LEDs (and LED strips) controlled via micro-controller PWM pins (one may define any number of sections with an "led" prefix). See the [command reference](G-Codes.md#led) for more information.
uk: Підтримка світлодіодів (і світлодіодних стрічок), керованих через ШІМ-контакти мікроконтролера (можна визначити будь-яку кількість секцій з префіксом "led"). Додаткову інформацію див. у [довідковій частині команд](G-Codes.md#led).

source: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # The pin controlling the given LED color. At least one of the above # parameters must be provided. #cycle_time: 0.010 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Sets the initial LED color. Each value should be between 0.0 and # 1.0. The default for each color is 0.
uk: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: Штифт, що контролює даний світлодіодний колір. Принаймні один із перерахованих Необхідно вказати # параметр. #час_циклу: 0,010 Час (у секундах) на цикл ШІМ. Рекомендується це має бути 10 мілісекунд або більше, якщо використовується програмна ШІМ. За замовчуванням 0,010 секунди. #hardware_pwm: Помилка Увімкніть це, щоб використовувати апаратну ШІМ замість програмної ШІМ. Коли з використанням апаратної ШІМ фактичний час циклу обмежений реалізації та може значно відрізнятися від запитаний час_циклу. За замовчуванням значення False. #initial_RED: 0,0 #initial_GREEN: 0,0 #початковий_СИНІЙ: 0,0 #початковий_БІЛИЙ: 0,0 Встановлює початковий колір світлодіода. Кожне значення має бути від 0,0 до 1.0. За замовчуванням для кожного кольору дорівнює 0.

source: Neopixel (aka WS2812) LED support (one may define any number of sections with a "neopixel" prefix). See the [command reference](G-Codes.md#led) for more information.
uk: Підтримка світлодіодів Neopixel (він же WS2812) (можна визначити будь-яку кількість секцій з префіксом "neopixel"). Додаткову інформацію див. у довідці про команди.

source: Dotstar (aka APA102) LED support (one may define any number of sections with a "dotstar" prefix). See the [command reference](G-Codes.md#led) for more information.
uk: Підтримка світлодіодів Dotstar (aka APA102) (можна визначити будь-яку кількість секцій з префіксом "dotstar"). Додаткову інформацію див. у довідковій частині команд.

source: [dotstar my_dotstar] data_pin: # The pin connected to the data line of the dotstar. This parameter # must be provided. clock_pin: # The pin connected to the clock line of the dotstar. This parameter # must be provided. #chain_count: # See the "neopixel" section for information on this parameter. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 # See the "led" section for information on these parameters.
uk: [dotstar my_dotstar] data_pin: Штифт, підключений до лінії даних дотстар. Цей параметр Потрібно вказати #. clock_pin: Штифт, підключений до тактової лінії зірки. Цей параметр Потрібно вказати #. #chain_count: Перегляньте розділ "neopixel" для отримання інформації про цей параметр. #initial_RED: 0,0 #initial_GREEN: 0,0 #початковий_СИНІЙ: 0,0 Дивіться розділ "led", щоб отримати інформацію про ці параметри.

source: Additional servos, buttons, and other pins
uk: Додаткові сервоприводи, кнопки та інші шпильки

source: Display data text "macros" (one may define any number of sections with a display_template prefix). See the [command templates](Command_Templates.md) document for information on template evaluation.
uk: «Макроси» відображення тексту даних (можна визначити будь-яку кількість розділів за допомогою префікса display_template). Перегляньте документ шаблони команд, щоб отримати інформацію про оцінку шаблону.

source: This feature allows one to reduce repetitive definitions in display_data sections. One may use the builtin `render()` function in display_data sections to evaluate a template. For example, if one were to define `[display_template my_template]` then one could use `{ render('my_template') }` in a display_data section.
uk: Ця функція дозволяє зменшити кількість повторюваних визначень у розділах display_data. Щоб оцінити шаблон, можна використати вбудовану функцію `render()` у розділах display_data. Наприклад, якщо потрібно визначити `[display_template my_template]`, то можна використовувати `{ render('my_template') }` у розділі display_data.

source: This feature can also be used for continuous LED updates using the [SET_LED_TEMPLATE](G-Codes.md#set_led_template) command.
uk: Цю функцію також можна використовувати для постійного оновлення світлодіодів за допомогою команди [SET_LED_TEMPLATE](G-Codes.md#set_led_template).

source: [display_template my_template_name] #param_<name>: # One may specify any number of options with a "param_" prefix. The # given name will be assigned the given value (parsed as a Python # literal) and will be available during macro expansion. If the # parameter is passed in the call to render() then that value will # be used during macro expansion. For example, a config with # "param_speed = 75" might have a caller with # "render('my_template_name', param_speed=80)". Parameter names may # not use upper case characters. text: # The text to return when the this template is rendered. This field # is evaluated using command templates (see # docs/Command_Templates.md). This parameter must be provided.
uk: [display_template my_template_name] #param_ : Можна вказати будь-яку кількість параметрів з префіксом "param_". The заданому імені буде присвоєно вказане значення (розібране як Python літерал) і буде доступним під час розширення макросу. Якщо параметр передається під час виклику render(), тоді це значення буде використовувати під час розширення макросу. Наприклад, конфігурація з "param_speed = 75" може мати абонента з "render('my_template_name', param_speed=80)". Імена параметрів можуть не використовувати символи верхнього регістру. текст: Текст, який повертається під час відтворення цього шаблону. Це поле обчислюється за допомогою шаблонів команд (див docs/Command_Templates.md). Цей параметр необхідно вказати.

source: [angle]
uk: [кут]

source: Magnetic hall angle sensor support for reading stepper motor angle shaft measurements using a1333, as5047d, or tle5012b SPI chips. The measurements are available via the [API Server](API_Server.md) and [motion analysis tool](Debugging.md#motion-analysis-and-data-logging). See the [G-Code reference](G-Codes.md#angle) for available commands.
uk: Підтримка магнітного датчика кута Холла для зчитування вимірювань кута вала крокового двигуна за допомогою мікросхем SPI a1333, as5047d або tle5012b. Вимірювання доступні через API-сервер і інструмент аналізу руху. Доступні команди див. у довідці G-Code.
