Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver is active. # The default is 1.0 #idle_timeout: # The amount of time (in seconds) after a stepper driver or heater # was active and the fan should be kept running. The default # is 30 seconds. #idle_speed: # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver was active and # before the idle_timeout is reached. The default is fan_speed. #heater: #stepper: # Name of the config section defining the heater/stepper that this fan # is associated with. If a comma separated list of heater/stepper names # is provided here, then the fan will be enabled when any of the given # heaters/steppers are enabled. The default heater is "extruder", the # default stepper is all of them.
uk: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #час_циклу: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #тахометр_ppr: #tachometer_poll_interval: #enable_pin: Дивіться розділ "вентилятор" для опису наведених вище параметрів. #швидкість_вентилятора: 1.0 Швидкість вентилятора (виражена значенням від 0,0 до 1,0), яку вентилятор буде встановлено, коли нагрівач або кроковий драйвер активний. За замовчуванням 1.0 #idle_timeout: Час (у секундах) після крокового драйвера або нагрівача був активним, і вентилятор повинен працювати. За замовчуванням становить 30 секунд. #idle_speed: Швидкість вентилятора (виражена значенням від 0,0 до 1,0), яку вентилятор буде встановлено, коли нагрівач або кроковий драйвер був активним і до досягнення idle_timeout. Типовим значенням є fan_speed. #обігрівач: #степер: Назва розділу конфігурації, що визначає нагрівач/кроковий вентилятор пов'язано з. Якщо відокремлено комами, список назв нагрівачів/крокових елементів #, тоді вентилятор буде ввімкнено, коли будь-який із наведених Увімкнено # обігрівачів/кроків. Нагрівачем за замовчуванням є «екструдер». степпер за замовчуванням — це всі.

source: [temperature_fan my_temp_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #sensor_type: #sensor_pin: #control: #max_delta: #min_temp: #max_temp: # See the "extruder" section for a description of the above parameters. #pid_Kp: #pid_Ki: #pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # fan_pwm = max_power - (Kp*e + Ki*integral(e) - Kd*derivative(e)) / 255 # Where "e" is "target_temperature - measured_temperature" and # "fan_pwm" is the requested fan rate with 0.0 being full off and # 1.0 being full on. The pid_Kp, pid_Ki, and pid_Kd parameters must # be provided when the PID control algorithm is enabled. #pid_deriv_time: 2.0 # A time value (in seconds) over which temperature measurements will # be smoothed when using the PID control algorithm. This may reduce # the impact of measurement noise. The default is 2 seconds. #target_temp: 40.0 # A temperature (in Celsius) that will be the target temperature. # The default is 40 degrees. #max_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when the sensor temperature exceeds the set value. # The default is 1.0. #min_speed: 0.3 # The minimum fan speed (expressed as a value from 0.0 to 1.0) that # the fan will be set to for PID temperature fans. # The default is 0.3. #gcode_id: # If set, the temperature will be reported in M105 queries using the # given id. The default is to not report the temperature via M105.
uk: [temperature_fan my_temp_fan] #pin: #max_power: #shutdown_speed: #цикл_час: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #тахометр_ppr: #tachometer_poll_interval: #enable_pin: # Дивіться розділ "вентилятор" для опису наведених вище параметрів. #sensor_type: #sensor_pin: #КОНТРОЛЬ: #max_delta: #min_temp: #max_temp: # Перегляньте розділ «Екструдер» для опису наведених вище параметрів. #pid_Kp: #pid_Ki: #pid_Kd: # Пропорційна (pid_Kp), інтегральна (pid_Ki) і похідна # (pid_Kd) параметри для ПІД системи керування зворотним зв'язком. Кліппер # оцінює параметри PID за такою загальною формулою: # fan_pwm = max_power - (Kp*e + Ki*integral(e) - Kd*derivative(e)) / 255 # Де "e" означає "цільова_температура - виміряна_температура" і # "fan_pwm" - це запитана швидкість вентилятора, при цьому 0,0 повністю вимкнено і # 1.0 повний. Параметри pid_Kp, pid_Ki та pid_Kd повинні # надається, коли ввімкнено алгоритм ПІД-регулювання. #pid_deriv_time: 2.0 # Значення часу (у секундах), протягом якого відбуватимуться вимірювання температури # бути згладженими при використанні алгоритму ПІД-регулювання. Це може зменшити # вплив вимірювального шуму. За замовчуванням 2 секунди. #цільова_температура: 40,0 # Температура (у градусах Цельсія), яка буде цільовою температурою. # За замовчуванням 40 градусів. #max_speed: 1.0 # Швидкість вентилятора (виражена значенням від 0,0 до 1,0), яку вентилятор # буде встановлено, коли температура датчика перевищує встановлене значення. # За замовчуванням 1.0. #хв_швидкість: 0,3 # Мінімальна швидкість вентилятора (виражена значенням від 0,0 до 1,0), що # вентилятор буде налаштовано на вентилятори температури PID. # За замовчуванням 0,3. #gcode_id: # Якщо встановлено, температура повідомлятиметься в запитах M105 за допомогою # заданий ідентифікатор. За замовчуванням температура не повідомляється через M105.

source: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters.
uk: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #час_циклу: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #тахометр_ppr: #tachometer_poll_interval: #enable_pin: Дивіться розділ "вентилятор" для опису наведених вище параметрів.

source: Temperature-dependant toolhead Z position adjustment. Compensate for vertical toolhead movement caused by thermal expansion of the printer's frame in real-time using a temperature sensor (typically coupled to a vertical section of frame).
uk: Регулювання положення головки інструменту по Z залежно від температури. Компенсація вертикального руху головки інструменту, викликаного тепловим розширенням рами принтера, у режимі реального часу за допомогою датчика температури (зазвичай підключеного до вертикальної частини рами).

source: See also: [extended g-code commands](G-Codes.md#z_thermal_adjust).
uk: Дивіться також: [розширені команди g-коду](G-Codes.md#z_thermal_adjust).

source: [z_thermal_adjust] #temp_coeff: # The temperature coefficient of expansion, in mm/degC. For example, a # temp_coeff of 0.01 mm/degC will move the Z axis downwards by 0.01 mm for # every degree Celsius that the temperature sensor increases. Defaults to # 0.0 mm/degC, which applies no adjustment. #smooth_time: # Smoothing window applied to the temperature sensor, in seconds. Can reduce # motor noise from excessive small corrections in response to sensor noise. # The default is 2.0 seconds. #z_adjust_off_above: # Disables adjustments above this Z height [mm]. The last computed correction # will remain applied until the toolhead moves below the specified Z height # again. The default is 99999999.0 mm (always on). #max_z_adjustment: # Maximum absolute adjustment that can be applied to the Z axis [mm]. The # default is 99999999.0 mm (unlimited). #sensor_type: #sensor_pin: #min_temp: #max_temp: # Temperature sensor configuration. # See the "extruder" section for the definition of the above # parameters. #gcode_id: # See the "heater_generic" section for the definition of this # parameter.
uk: [z_thermal_adjust] #temp_coeff: # Температурний коефіцієнт розширення, мм/град. Наприклад, a # temp_coeff 0,01 мм/градус Цельсія перемістить вісь Z вниз на 0,01 мм для # кожен градус Цельсія, який датчик температури підвищує. За замовчуванням # 0,0 мм/градус C, що не застосовує коригування. #smooth_time: # Вікно згладжування, застосоване до датчика температури, за секунди. Може зменшити # шум двигуна від надмірно малих поправок у відповідь на шум датчика. # За замовчуванням 2,0 секунди. #z_adjust_off_above: # Вимикає налаштування вище цієї висоти Z [мм]. Остання обчислена корекція # залишатиметься застосованим, доки інструментальна головка не переміститься нижче вказаної висоти Z # знову. За замовчуванням 99999999,0 мм (завжди ввімкнено). #max_z_adjustment: # Максимальне абсолютне коригування, яке можна застосувати до осі Z [мм]. The # за замовчуванням 99999999,0 мм (необмежено). #sensor_type: #sensor_pin: #min_temp: #max_temp: # Конфігурація датчика температури. # Дивіться розділ «екструдер» для визначення наведеного вище # параметри. #gcode_id: # Перегляньте розділ "heater_generic" для визначення цього # параметр.

source: Support for MPU-9250, MPU-9255, MPU-6515, MPU-6050, and MPU-6500 accelerometers (one may define any number of sections with an "mpu9250" prefix).
uk: Підтримка акселерометрів MPU-9250, MPU-9255, MPU-6515, MPU-6050 і MPU-6500 (можна визначити будь-яку кількість секцій з префіксом «mpu9250»).

source: [printer] kinematics: deltesian max_z_velocity: # For deltesian printers, this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a deltesian printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. #min_angle: 5 # This represents the minimum angle (in degrees) relative to horizontal # that the deltesian arms are allowed to achieve. This parameter is # intended to restrict the arms from becoming completely horizontal, # which would risk accidental inversion of the XZ axis. The default is 5. #print_width: # The distance (in mm) of valid toolhead X coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. This setting usually # corresponds to bed width (in mm). #slow_ratio: 3 # The ratio used to limit velocity and acceleration on moves near the # extremes of the X axis. If vertical distance divided by horizontal # distance exceeds the value of slow_ratio, then velocity and # acceleration are limited to half their nominal values. If vertical # distance divided by horizontal distance exceeds twice the value of # the slow_ratio, then velocity and acceleration are limited to one # quarter of their nominal values. The default is 3. # The stepper_left section is used to describe the stepper controlling # the left tower. This section also controls the homing parameters # (homing_speed, homing_retract_dist) for all towers. [stepper_left] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstops are triggered. This # parameter must be provided for stepper_left; for stepper_right this # parameter defaults to the value specified for stepper_left. arm_length: # Length (in mm) of the diagonal rod that connects the tower carriage to # the print head. This parameter must be provided for stepper_left; for # stepper_right, this parameter defaults to the value specified for # stepper_left. arm_x_length: # Horizontal distance between the print head and the tower when the # printers is homed. This parameter must be provided for stepper_left; # for stepper_right, this parameter defaults to the value specified for # stepper_left. # The stepper_right section is used to describe the stepper controlling the # right tower. [stepper_right] # The stepper_y section is used to describe the stepper controlling # the Y axis in a deltesian robot. [stepper_y]
uk: [принтер] кінематика: дельтезиана max_z_velocity: # Для дельтезіанських принтерів це обмежує максимальну швидкість (у мм/с). # рухається з рухом осі z Цей параметр можна використовувати для зменшення # максимальна швидкість рухів вгору/вниз (для яких потрібна більша швидкість кроку # ніж інші рухи на дельтезіанському принтері). За умовчанням використовується # max_velocity для max_z_velocity. #max_z_accel: # Це встановлює максимальне прискорення (у мм/с^2) руху вздовж # вісь z. Це налаштування може бути корисним, якщо принтер може досягати більших значень # прискорення рухів XY, ніж рухів Z (наприклад, під час використання формувача введення). # За замовчуванням для max_z_accel використовується max_accel. #minimum_z_position: 0 # Мінімальне положення Z, яке користувач може наказати рухати головою # до. За замовчуванням 0. #min_angle: 5 # Це мінімальний кут (у градусах) відносно горизонталі # що дозволено досягати дельтезіанським рукавам. Цей параметр є # призначений для обмеження того, щоб руки стали повністю горизонтальними, # що може призвести до випадкової інверсії осі XZ. За замовчуванням 5. #print_width: # Відстань (у мм) дійсних координат головки X. Можна використовувати # це налаштування для налаштування діапазону перевірки рухів інструментальної головки. Якщо # тут вказано велике значення, тоді його можна вказати # головка інструменту в зіткнення з вежею. Цей параметр зазвичай # відповідає ширині ліжка (у мм). #slow_ratio: 3 # Коефіцієнт, який використовується для обмеження швидкості та прискорення під час рухів поблизу # крайні точки осі X. Якщо вертикальну відстань розділити на горизонтальну # відстань перевищує значення slow_ratio, потім швидкість і # прискорення обмежені половиною їх номінальних значень. Якщо вертикально # відстань, поділена на горизонтальну відстань, перевищує подвійне значення # відношення_повільного, тоді швидкість і прискорення обмежені одиницею # чверті їх номінальних значень. За замовчуванням 3. # Секція stepper_left використовується для опису керування кроком # ліва вежа. Цей розділ також керує параметрами наведення # (homing_speed, homing_retract_dist) для всіх веж. [stepper_left] position_endstop: # Відстань (у мм) між соплом і ліжком, коли сопло є # у центрі області побудови, і кінцеві упори спрацьовують. Це # параметр повинен бути наданий для stepper_left; для stepper_right це # параметр за умовчанням має значення, указане для stepper_left. arm_length: # Довжина (у мм) діагонального стрижня, який з’єднує каретку башти # друкуюча головка. Цей параметр необхідно надати для stepper_left; для # stepper_right, цей параметр за умовчанням має значення, указане для # крок_вліво. arm_x_length: # Горизонтальна відстань між друкуючою голівкою та вежею, коли # принтерів переведено на домашню сторінку. Цей параметр необхідно надати для stepper_left; # для stepper_right цей параметр за замовчуванням має значення, указане для # крок_вліво. # Розділ stepper_right використовується для опису степера, який контролює # права вежа. [stepper_right] # Розділ stepper_y використовується для опису керування кроком # вісь Y у дельтезіанному роботі. [stepper_y]

source: [screws_tilt_adjust] #screw1: # The (X, Y) coordinate of the first bed leveling screw. This is a # position to command the nozzle to so that the probe is directly # above the bed screw (or as close as possible while still being # above the bed). This is the base screw used in calculations. This # parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw2: #screw2_name: #... # Additional bed leveling screws. At least two screws must be # defined. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #screw_thread: CW-M3 # The type of screw used for bed leveling, M3, M4, or M5, and the # rotation direction of the knob that is used to level the bed. # Accepted values: CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # Default value is CW-M3 which most printers use. A clockwise # rotation of the knob decreases the gap between the nozzle and the # bed. Conversely, a counter-clockwise rotation increases the gap.
uk: [screws_tilt_adjust] #гвинт1: # Координата (X, Y) першого гвинта для вирівнювання ліжка. Це а # положення, щоб наказати насадці, щоб зонд знаходився прямо # над гвинтом ліжка (або якомога ближче, залишаючись # над ліжком). Це базовий гвинт, який використовується в розрахунках. Це # Потрібно вказати # параметр. #screw1_name: # Довільна назва для заданого гвинта. Ця назва відображається, коли # виконується допоміжний сценарій. За умовчанням використовується назва на основі # розташування гвинта XY. #гвинт2: #screw2_name: #... # Додаткові гвинти для вирівнювання ліжка. Повинно бути як мінімум два гвинти # визначено. #швидкість: 50 # Швидкість (у мм/с) незондувальних рухів під час калібрування. # За замовчуванням 50. #horizontal_move_z: 5 # Висота (у мм), на яку слід наказати рухатися голові # безпосередньо перед початком операції зондування. За замовчуванням 5. #гвинтова_різьба: CW-M3 # Тип гвинта, який використовується для вирівнювання ліжка, M3, M4 або M5, і # напрямок обертання ручки, яка використовується для вирівнювання ліжка. # Прийнятні значення: CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # Значення за замовчуванням CW-M3, яке використовують більшість принтерів. A за годинниковою стрілкою # обертання ручки зменшує зазор між соплом і # ліжко. І навпаки, обертання проти годинникової стрілки збільшує зазор.

source: [palette2] serial: # The serial port to connect to the Palette 2. #baud: 115200 # The baud rate to use. The default is 115200. #feedrate_splice: 0.8 # The feedrate to use when splicing, default is 0.8 #feedrate_normal: 1.0 # The feedrate to use after splicing, default is 1.0 #auto_load_speed: 2 # Extrude feedrate when autoloading, default is 2 (mm/s) #auto_cancel_variation: 0.1 # Auto cancel print when ping variation is above this threshold
uk: [палітра2] серійний: Послідовний порт для підключення до Palette 2. #бод: 115200 Швидкість передачі даних для використання. За замовчуванням 115200. #feedrate_splice: 0,8 Швидкість подачі, яка використовується під час зварювання, за замовчуванням становить 0,8 #feedrate_normal: 1,0 Швидкість подачі, яка використовується після зварювання, за замовчуванням 1,0 #швидкість_автозавантаження: 2 Швидкість подачі екструзії під час автозавантаження, за замовчуванням 2 (мм/с) #auto_cancel_variation: 0.1 Автоматичне скасування друку, коли зміна ping вище цього порогу

source: Note that Klipper's current micro-controller support for I2C is generally not tolerant to line noise. Unexpected errors on the I2C wires may result in Klipper raising a run-time error. Klipper's support for error recovery varies between each micro-controller type. It is generally recommended to only use I2C devices that are on the same printed circuit board as the micro-controller.
uk: Зауважте, що поточна підтримка мікроконтролерів Klipper для I2C, як правило, нетерпима до лінійного шуму. Неочікувані помилки в проводах I2C можуть призвести до того, що Klipper викличе помилку виконання. Підтримка Klipper для відновлення помилок залежить від кожного типу мікроконтролера. Зазвичай рекомендується використовувати лише пристрої I2C, які розташовані на одній друкованій платі з мікроконтролером.

source: Most Klipper micro-controller implementations only support an `i2c_speed` of 100000 (*standard mode*, 100kbit/s). The Klipper "Linux" micro-controller supports a 400000 speed (*fast mode*, 400kbit/s), but it must be [set in the operating system](RPi_microcontroller.md#optional-enabling-i2c) and the `i2c_speed` parameter is otherwise ignored. The Klipper "RP2040" micro-controller and ATmega AVR family support a rate of 400000 via the `i2c_speed` parameter. All other Klipper micro-controllers use a 100000 rate and ignore the `i2c_speed` parameter.
uk: Більшість реалізацій мікроконтролерів Klipper підтримують лише i2c_speed 100000 (стандартний режим, 100 кбіт/с). Мікроконтролер Klipper «Linux» підтримує швидкість 400 000 (швидкий режим, 400 Кбіт/с), але її потрібно [встановити в операційній системі] (RPi_microcontroller.md#optional-enabling-i2c) і i2c_speed інакше параметр ігнорується. Мікроконтролер Klipper "RP2040" і сімейство ATmega AVR підтримують швидкість 400 000 за допомогою параметра i2c_speed . Усі інші мікроконтролери Klipper використовують швидкість 100 000 і ігнорують параметр i2c_speed .

source: Support for LIS2DW accelerometers.
uk: Підтримка акселерометрів LIS2DW.

source: [lis2dw] cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: 5000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #axes_map: x, y, z # See the "adxl345" section for information on this parameter.
uk: [lis2dw] cs_pin: Штифт увімкнення SPI для датчика. Цей параметр необхідно вказати. #spi_speed: 5000000 Швидкість SPI (у Гц), яка використовується під час обміну даними з чіпом. За замовчуванням 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис параметр вище. #axes_map: x, y, z Перегляньте розділ "adxl345", щоб отримати інформацію про цей параметр.

source: [mpu9250 my_accelerometer] #i2c_address: # Default is 104 (0x68). If AD0 is high, it would be 0x69 instead. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: 400000 # See the "common I2C settings" section for a description of the # above parameters. The default "i2c_speed" is 400000. #axes_map: x, y, z # See the "adxl345" section for information on this parameter.
uk: [mpu9250 мій_акселерометр] #i2c_адреса: За замовчуванням 104 (0x68). Якщо AD0 високий, замість нього буде 0x69. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: 400000 Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис параметр вище. За замовчуванням "i2c_speed" становить 400000. #axes_map: x, y, z Перегляньте розділ "adxl345", щоб отримати інформацію про цей параметр.

source: A tool to compensate for inaccurate probe readings due to twist in X gantry. See the [Axis Twist Compensation Guide](Axis_Twist_Compensation.md) for more detailed information regarding symptoms, configuration and setup.
uk: Інструмент для компенсації неточних показань датчика через перекручування X-портального ланцюга. Перегляньте Посібник з компенсації скручування осі, щоб отримати докладнішу інформацію щодо симптомів, конфігурації та налаштування.
