Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [tmc2130 stepper_x] cs_pin: # The pin corresponding to the TMC2130 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This interpolation does # introduce a small systemic positional deviation - see # TMC_Drivers.md for details. The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.110 # The resistance (in ohms) of the motor sense resistor. The default # is 0.110 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #coolstep_threshold: # The velocity (in mm/s) to set the TMC driver internal "CoolStep" # threshold to. If set, the coolstep feature will be enabled when # the stepper motor velocity is near or above this value. Important # - if coolstep_threshold is set and "sensorless homing" is used, # then one must ensure that the homing speed is above the coolstep # threshold! The default is to not enable the coolstep feature. #high_velocity_threshold: # The velocity (in mm/s) to set the TMC driver internal "high # velocity" threshold (THIGH) to. This is typically used to disable # the "CoolStep" feature at high speeds. The default is to not set a # TMC "high velocity" threshold. #driver_MSLUT0: 2863314260 #driver_MSLUT1: 1251300522 #driver_MSLUT2: 608774441 #driver_MSLUT3: 269500962 #driver_MSLUT4: 4227858431 #driver_MSLUT5: 3048961917 #driver_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #driver_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 # These fields control the Microstep Table registers directly. The optimal # wave table is specific to each motor and might vary with current. An # optimal configuration will have minimal print artifacts caused by # non-linear stepper movement. The values specified above are the default # values used by the driver. The value must be specified as a decimal integer # (hex form is not supported). In order to compute the wave table fields, # see the tmc2130 "Calculation Sheet" from the Trinamic website. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 # Set the given register during the configuration of the TMC2130 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC2130 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc2130_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
uk: [tmc2130 stepper_x] cs_pin: # Пін, що відповідає лінії вибору мікросхеми TMC2130. Ця шпилька # буде встановлено на низький рівень на початку повідомлень SPI і підвищено на високий # після завершення повідомлення. Цей параметр необхідно вказати. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис # параметр вище. #chain_position: #chain_length: # Ці параметри налаштовують шлейфове з’єднання SPI. Два параметри # визначити позицію кроку в ланцюзі та загальну довжину ланцюга. # Позиція 1 відповідає степеру, який підключається до сигналу MOSI. # За замовчуванням ланцюжок SPI не використовується. #interpolate: Правда # Якщо істина, увімкнути покрокову інтерполяцію (драйвер буде внутрішньо # крок зі швидкістю 256 мікрокроків). Ця інтерполяція робить # ввести невелике системне позиційне відхилення - див # TMC_Drivers.md для деталей. Типовим значенням є True. run_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # під час руху степера. Цей параметр необхідно вказати. #hold_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # коли степпер не рухається. Налаштування hold_current не є # рекомендовано (подробиці див. на TMC_Drivers.md). За умовчанням встановлено значення # не зменшувати струм. #сенс_резистор: 0,110 # Опір (в Омах) резистора датчика двигуна. За замовчуванням # дорівнює 0,110 Ом. #stealthchop_threshold: 0 # Швидкість (у мм/с), на яку потрібно встановити порогове значення "stealthChop". Коли # set, режим "stealthChop" буде ввімкнено, якщо кроковий двигун # швидкість нижче цього значення. За замовчуванням 0, що вимикає # режим "stealthChop". #coolstep_threshold: # Швидкість (у мм/с) для встановлення внутрішнього "CoolStep" драйвера TMC # поріг до. Якщо встановлено, функція coolstep буде ввімкнена, коли # швидкість крокового двигуна близька до цього значення або перевищує його. важливо # - якщо встановлено coolstep_threshold і використовується "безсенсорне самонаведення", # тоді потрібно переконатися, що швидкість наведення вище кроку холоду #поріг! За замовчуванням функцію coolstep не ввімкнено. #high_velocity_threshold: # Швидкість (у мм/с) для встановлення високого рівня внутрішнього драйвера TMC # швидкість" порогове значення (СТЕГНО) до. Це зазвичай використовується для вимкнення # функція "CoolStep" на високих швидкостях. За замовчуванням не встановлено a # Поріг "високої швидкості" TMC. #драйвер_MSLUT0: 2863314260 #драйвер_MSLUT1: 1251300522 #драйвер_MSLUT2: 608774441 #драйвер_MSLUT3: 269500962 #драйвер_MSLUT4: 4227858431 #драйвер_MSLUT5: 3048961917 #драйвер_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #водій_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 # Ці поля безпосередньо керують регістрами таблиці Microstep. Оптимальний Таблиця хвиль # є специфічною для кожного двигуна та може змінюватись залежно від струму. Ан # оптимальна конфігурація матиме мінімальні артефакти друку, викликані # нелінійний кроковий рух. Зазначені вище значення є типовими # значення, які використовує драйвер. Значення має бути вказане як ціле десяткове число # (шістнадцяткова форма не підтримується). Щоб обчислити поля хвильової таблиці, # дивіться tmc2130 "Таблиця розрахунків" на веб-сайті Trinamic. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #водій_HEND: 7 #driver_HSTRT: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_PWM_AUTOSCALE: Правда #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 # Встановіть заданий регістр під час конфігурації TMC2130 # чіп. Це може бути використано для встановлення власних параметрів двигуна. The # значення за замовчуванням для кожного параметра вказано поруч із назвою параметра в # вище списку. #diag0_pin: #diag1_pin: # Вивід мікроконтролера, приєднаний до однієї з ліній DIAG # Чіп TMC2130. Потрібно вказати лише один діагностичний штифт. шпилька # є "активним низьким" і тому зазвичай має перед собою "^!". Налаштування # це створює віртуальний пін "tmc2130_stepper_x:virtual_endstop" # який можна використовувати як endstop_pin степера. Це дозволяє # "безсенсорне самонаведення". (Не забудьте також встановити driver_SGT на an # відповідне значення чутливості.) За умовчанням не ввімкнено # безсенсорне самонаведення.

source: [tmc2209 stepper_x] uart_pin: #tx_pin: #select_pins: #interpolate: True run_current: #hold_current: #sense_resistor: 0.110 #stealthchop_threshold: 0 # See the "tmc2208" section for the definition of these parameters. #coolstep_threshold: # The velocity (in mm/s) to set the TMC driver internal "CoolStep" # threshold to. If set, the coolstep feature will be enabled when # the stepper motor velocity is near or above this value. Important # - if coolstep_threshold is set and "sensorless homing" is used, # then one must ensure that the homing speed is above the coolstep # threshold! The default is to not enable the coolstep feature. #uart_address: # The address of the TMC2209 chip for UART messages (an integer # between 0 and 3). This is typically used when multiple TMC2209 # chips are connected to the same UART pin. The default is zero. #driver_MULTISTEP_FILT: True #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 # Set the given register during the configuration of the TMC2209 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag_pin: # The micro-controller pin attached to the DIAG line of the TMC2209 # chip. The pin is normally prefaced with "^" to enable a pullup. # Setting this creates a "tmc2209_stepper_x:virtual_endstop" virtual # pin which may be used as the stepper's endstop_pin. Doing this # enables "sensorless homing". (Be sure to also set driver_SGTHRS to # an appropriate sensitivity value.) The default is to not enable # sensorless homing.
uk: [tmc2209 stepper_x] uart_pin: #tx_pin: #select_pins: #interpolate: Правда run_current: #hold_current: #сенс_резистор: 0,110 #stealthchop_threshold: 0 # Перегляньте розділ "tmc2208" для визначення цих параметрів. #coolstep_threshold: # Швидкість (у мм/с) для встановлення внутрішнього "CoolStep" драйвера TMC # поріг до. Якщо встановлено, функція coolstep буде ввімкнена, коли # швидкість крокового двигуна близька до цього значення або перевищує його. важливо # - якщо встановлено coolstep_threshold і використовується "безсенсорне самонаведення", # тоді потрібно переконатися, що швидкість наведення вище кроку холоду #поріг! За замовчуванням функцію coolstep не ввімкнено. #uart_address: # Адреса мікросхеми TMC2209 для повідомлень UART (ціле число # між 0 і 3). Це зазвичай використовується, коли кілька TMC2209 # мікросхеми підключено до одного контакту UART. За умовчанням дорівнює нулю. #driver_MULTISTEP_FILT: Правда #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #драйвер_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: Правда #driver_PWM_AUTOSCALE: Правда #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 # Встановіть заданий регістр під час налаштування TMC2209 # чіп. Це може бути використано для встановлення власних параметрів двигуна. The # значення за замовчуванням для кожного параметра вказано поруч із назвою параметра в # вище списку. #diag_pin: # Вивід мікроконтролера, підключений до лінії DIAG TMC2209 # чіп. Перед штифтом зазвичай стоїть «^», щоб увімкнути підтягування. # Це налаштування створює віртуальний "tmc2209_stepper_x:virtual_endstop" # штифт, який можна використовувати як endstop_pin степера. Роблячи це # вмикає "безсенсорне самонаведення". (Обов’язково також установіть для driver_SGTHRS значення # відповідне значення чутливості.) За умовчанням не ввімкнено # безсенсорне самонаведення.

source: [tmc2240 stepper_x] cs_pin: # The pin corresponding to the TMC2240 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #uart_pin: # The pin connected to the TMC2240 DIAG1/SW line. If this parameter # is provided UART communication is used rather then SPI. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #rref: 12000 # The resistance (in ohms) of the resistor between IREF and GND. The # default is 12000. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #coolstep_threshold: # The velocity (in mm/s) to set the TMC driver internal "CoolStep" # threshold to. If set, the coolstep feature will be enabled when # the stepper motor velocity is near or above this value. Important # - if coolstep_threshold is set and "sensorless homing" is used, # then one must ensure that the homing speed is above the coolstep # threshold! The default is to not enable the coolstep feature. #high_velocity_threshold: # The velocity (in mm/s) to set the TMC driver internal "high # velocity" threshold (THIGH) to. This is typically used to disable # the "CoolStep" feature at high speeds. The default is to not set a # TMC "high velocity" threshold. #driver_MSLUT0: 2863314260 #driver_MSLUT1: 1251300522 #driver_MSLUT2: 608774441 #driver_MSLUT3: 269500962 #driver_MSLUT4: 4227858431 #driver_MSLUT5: 3048961917 #driver_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #driver_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 #driver_OFFSET_SIN90: 0 # These fields control the Microstep Table registers directly. The optimal # wave table is specific to each motor and might vary with current. An # optimal configuration will have minimal print artifacts caused by # non-linear stepper movement. The values specified above are the default # values used by the driver. The value must be specified as a decimal integer # (hex form is not supported). In order to compute the wave table fields, # see the tmc2130 "Calculation Sheet" from the Trinamic website. # Additionally, this driver also has the OFFSET_SIN90 field which can be used # to tune a motor with unbalanced coils. See the `Sine Wave Lookup Table` # section in the datasheet for information about this field and how to tune # it. #driver_MULTISTEP_FILT: True #driver_IHOLDDELAY: 6 #driver_IRUNDELAY: 4 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 29 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 #driver_SG4_ANGLE_OFFSET: 1 # Set the given register during the configuration of the TMC2240 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC2240 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc2240_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
uk: [tmc2240 stepper_x] cs_pin: # Пін, що відповідає лінії вибору мікросхеми TMC2240. Ця шпилька # буде встановлено на низький рівень на початку повідомлень SPI і підвищено на високий # після завершення повідомлення. Цей параметр необхідно вказати. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис # параметр вище. #uart_pin: # Штифт, підключений до лінії TMC2240 DIAG1/SW. Якщо цей параметр # за умови, що зв'язок UART використовується замість SPI. #chain_position: #chain_length: # Ці параметри налаштовують шлейфове з’єднання SPI. Два параметри # визначити позицію кроку в ланцюзі та загальну довжину ланцюга. # Позиція 1 відповідає степеру, який підключається до сигналу MOSI. # За замовчуванням ланцюжок SPI не використовується. #interpolate: Правда # Якщо істина, увімкнути крокову інтерполяцію (драйвер буде внутрішньо # крок зі швидкістю 256 мікрокроків). Типовим значенням є True. run_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # під час руху степера. ей параметр необхідно вказати. #hold_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # коли степпер не рухається. Налаштування hold_current не є # рекомендовано (подробиці див. на TMC_Drivers.md). Типовим значенням є # не зменшувати струм. #rref: 12000 # Опір (в Омах) резистора між IREF і GND. The # за замовчуванням 12000. #stealthchop_threshold: 0 # Швидкість (у мм/с), на яку потрібно встановити порогове значення "stealthChop". Коли # set, режим "stealthChop" буде ввімкнено, якщо кроковий двигун # швидкість нижче цього значення. За замовчуванням 0, що вимикає # режим "stealthChop". #coolstep_threshold: # Швидкість (у мм/с) для встановлення внутрішнього "CoolStep" драйвера TMC # поріг до. Якщо встановлено, функція coolstep буде ввімкнена, коли # швидкість крокового двигуна близька до цього значення або перевищує його. важливо # - якщо встановлено coolstep_threshold і використовується "безсенсорне самонаведення", # тоді потрібно переконатися, що швидкість наведення вище кроку холоду #поріг! За замовчуванням функцію coolstep не ввімкнено. #high_velocity_threshold: # Швидкість (у мм/с) для встановлення високого рівня внутрішнього драйвера TMC # швидкість" порогове значення (СТЕГНО) до. Це зазвичай використовується для вимкнення # функція "CoolStep" на високих швидкостях. За замовчуванням не встановлено a # Поріг "високої швидкості" TMC. #драйвер_MSLUT0: 2863314260 #драйвер_MSLUT1: 1251300522 #драйвер_MSLUT2: 608774441 #драйвер_MSLUT3: 269500962 #драйвер_MSLUT4: 4227858431 #драйвер_MSLUT5: 3048961917 #драйвер_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #водій_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 #driver_OFFSET_SIN90: 0 # Ці поля безпосередньо керують регістрами таблиці Microstep. Оптимальний Таблиця хвиль # є специфічною для кожного двигуна та може змінюватись залежно від струму. Ан # оптимальна конфігурація матиме мінімальні артефакти друку, викликані # нелінійний кроковий рух. Зазначені вище значення є типовими # значення, які використовує драйвер. Значення має бути вказане як ціле десяткове число # (шістнадцяткова форма не підтримується). Щоб обчислити поля хвильової таблиці, # дивіться tmc2130 "Таблиця розрахунків" на веб-сайті Trinamic. # Крім того, цей драйвер також має поле OFFSET_SIN90, яке можна використовувати # для налаштування двигуна з незбалансованими котушками. Перегляньте `Таблицю пошуку синусоїди` # розділ у таблиці даних для інформації про це поле та способи налаштування # це. #driver_MULTISTEP_FILT: Правда #driver_IHOLDDELAY: 6 #driver_IRUNDELAY: 4 #driver_TPOWERDOWN: 10 #драйвер_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #драйвер_FD3: 0 #драйвер_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: Правда #driver_PWM_AUTOGRAD: Правда #driver_PWM_FREQ: 0 #водій_ВІЛЬНИЙ КОЛЕШ: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 29 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 #driver_SG4_ANGLE_OFFSET: 1 # Встановіть заданий регістр під час конфігурації TMC2240 # чіп. Це може бути використано для встановлення власних параметрів двигуна. The # значення за замовчуванням для кожного параметра вказано поруч із назвою параметра в # вище списку. #diag0_pin: #diag1_pin: # Вивід мікроконтролера, приєднаний до однієї з ліній DIAG # Чіп TMC2240. Потрібно вказати лише один діагностичний штифт. шпилька # є "активним низьким" і тому зазвичай має перед собою "^!". Налаштування # це створює віртуальний пін "tmc2240_stepper_x:virtual_endstop" # який можна використовувати як endstop_pin степера. Це дозволяє # "безсенсорне самонаведення". (Не забудьте також встановити driver_SGT на an # відповідне значення чутливості.) За умовчанням не ввімкнено # безсенсорне самонаведення.
