Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: # The "replicape" config section adds "replicape:stepper_x_enable" # virtual stepper enable pins (for steppers X, Y, Z, E, and H) and # "replicape:power_x" PWM output pins (for hotbed, e, h, fan0, fan1, # fan2, and fan3) that may then be used elsewhere in the config file. [replicape] revision: # The replicape hardware revision. Currently only revision "B3" is # supported. This parameter must be provided. #enable_pin: !gpio0_20 # The replicape global enable pin. The default is !gpio0_20 (aka # P9_41). host_mcu: # The name of the mcu config section that communicates with the # Klipper "linux process" mcu instance. This parameter must be # provided. #standstill_power_down: False # This parameter controls the CFG6_ENN line on all stepper # motors. True sets the enable lines to "open". The default is # False. #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # This parameter controls the CFG1 and CFG2 pins of the given # stepper motor driver. Available options are: disable, 1, 2, # spread2, 4, 16, spread4, spread16, stealth4, and stealth16. The # default is disable. #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # The configured maximum current (in Amps) of the stepper motor # driver. This parameter must be provided if the stepper is not in a # disable mode. #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # This parameter controls the CFG0 pin of the stepper motor driver # (True sets CFG0 high, False sets it low). The default is False. #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # This parameter controls the CFG4 pin of the stepper motor driver # (True sets CFG4 high, False sets it low). The default is False. #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # This parameter controls the CFG5 pin of the stepper motor driver # (True sets CFG5 high, False sets it low). The default is True.
uk: # Розділ конфігурації "replicape" додає "replicape:stepper_x_enable" # шпильки для активації віртуального степера (для степерів X, Y, Z, E та H) і # "replicape:power_x" Вихідні контакти ШІМ (для hotbed, e, h, fan0, fan1, # fan2 і fan3), які потім можна використовувати в іншому місці конфігураційного файлу. [репліка] версія: # Версія апаратного забезпечення копії. На даний момент є лише версія "B3". # підтримується. Цей параметр необхідно вказати. #enable_pin: !gpio0_20 # Глобальний пін активації репліки. Типовим є !gpio0_20 (він же # P9_41). host_mcu: # Назва розділу конфігурації mcu, який взаємодіє з # Екземпляр mcu "процес linux" Klipper. Цей параметр повинен бути # надано. #standstill_power_down: Неправда # Цей параметр керує лінією CFG6_ENN на всіх степерах # мотори. True встановлює для активних ліній значення "відкриті". За замовчуванням # Неправда. #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # Цей параметр керує виводами CFG1 і CFG2 заданого # драйвер крокового двигуна. Доступні варіанти: вимкнути, 1, 2, # spread2, 4, 16, spread4, spread16, stealth4 і stealth16. The # за умовчанням вимкнено. #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # Сконфігурований максимальний струм (в амперах) крокового двигуна # водій. Цей параметр необхідно вказати, якщо степпер знаходиться не в a # режим вимкнення. #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # Цей параметр керує контактом CFG0 драйвера крокового двигуна # (True встановлює CFG0 на високий рівень, False встановлює його на низький). За замовчуванням значення False. #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # Цей параметр керує контактом CFG4 драйвера крокового двигуна # (True встановлює CFG4 на високий рівень, False встановлює його на низький). За замовчуванням значення False. #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # Цей параметр керує контактом CFG5 драйвера крокового двигуна # (True встановлює CFG5 на високий рівень, False встановлює його на низький). Типовим значенням є True.

source: See the [bed mesh guide](Bed_Mesh.md) and [command reference](G-Codes.md#bed_mesh) for additional information.
uk: Додаткову інформацію див. у [посібнику з сітки для ліжок](Bed_Mesh.md) і [довідці про команди](G-Codes.md#bed_mesh).

source: See the [command reference](G-Codes.md#bed_tilt) for additional information.
uk: Додаткову інформацію див. у [довідці про команди](G-Codes.md#bed_tilt).

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws) and [command reference](G-Codes.md#bed_screws) for additional information.
uk: Додаткову інформацію див. у [посібнику з вирівнювання](Manual_Level.md#adjusting-bed-leveling-screws) і [довідці про команди](G-Codes.md#bed_screws).

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) and [command reference](G-Codes.md#screws_tilt_adjust) for additional information.
uk: Щоб отримати додаткову інформацію, перегляньте [посібник з вирівнювання](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) і [довідку про команди](G-Codes.md#screws_tilt_adjust).

source: Multiple Z stepper tilt adjustment. This feature enables independent adjustment of multiple z steppers (see the "stepper_z1" section) to adjust for tilt. If this section is present then a Z_TILT_ADJUST extended [G-Code command](G-Codes.md#z_tilt) becomes available.
uk: Багаторазове регулювання нахилу степпера Z. Ця функція дозволяє незалежно регулювати кілька z-степперів (див. розділ «stepper_z1») для налаштування нахилу. Якщо цей розділ присутній, стає доступною розширена [команда G-Code] (G-Codes.md#z_tilt) Z_TILT_ADJUST.

source: Printer Skew Correction. It is possible to use software to correct printer skew across 3 planes, xy, xz, yz. This is done by printing a calibration model along a plane and measuring three lengths. Due to the nature of skew correction these lengths are set via gcode. See [Skew Correction](Skew_Correction.md) and [Command Reference](G-Codes.md#skew_correction) for details.
uk: Корекція перекосу принтера. Можна використовувати програмне забезпечення для виправлення перекосу принтера в 3 площинах, xy, xz, yz. Це робиться шляхом друку калібрувальної моделі вздовж площини та вимірювання трьох довжин. Через характер корекції перекосу ці довжини встановлюються за допомогою gcode. Докладніше див. у [Корекція перекосів](Skew_Correction.md) і [Довідка про команди](G-Codes.md#skew_correction).

source: See the [endstop phases guide](Endstop_Phase.md) and [command reference](G-Codes.md#endstop_phase) for additional information.
uk: Щоб отримати додаткову інформацію, перегляньте [посібник із фаз кінцевої зупинки](Endstop_Phase.md) і [довідку про команди](G-Codes.md#endstop_phase).

source: Execute a gcode on a set delay. See the [command template guide](Command_Templates.md#delayed-gcodes) and [command reference](G-Codes.md#delayed_gcode) for more information.
uk: Виконати gcode із встановленою затримкою. Для отримання додаткової інформації перегляньте посібник із шаблонів команд і довідку про команди.

source: Support saving variables to disk so that they are retained across restarts. See [command templates](Command_Templates.md#save-variables-to-disk) and [G-Code reference](G-Codes.md#save_variables) for further information.
uk: Підтримка збереження змінних на диск, щоб вони зберігалися під час перезапусків. Щоб отримати додаткову інформацію, перегляньте [шаблони команд](Command_Templates.md#save-variables-to-disk) і [довідник G-Code](G-Codes.md#save_variables).

source: See the [command reference](G-Codes.md#sdcard_loop) for supported commands. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin compatible M808 G-Code macro.
uk: Перегляньте [довідку про команди](G-Codes.md#sdcard_loop), щоб дізнатися про підтримувані команди. Перегляньте файл [sample-macros.cfg](../config/sample-macros.cfg) для макросу M808 G-Code, сумісного з Marlin.

source: Support manually moving stepper motors for diagnostic purposes. Note, using this feature may place the printer in an invalid state - see the [command reference](G-Codes.md#force_move) for important details.
uk: Підтримка рухомих крокових двигунів вручну для діагностичних цілей. Зауважте, що використання цієї функції може призвести до недійсного стану принтера - див. [довідку про команди](G-Codes.md#force_move), щоб отримати важливі відомості.

source: Pause/Resume functionality with support of position capture and restore. See the [command reference](G-Codes.md#pause_resume) for more information.
uk: Функція паузи/відновлення з підтримкою захоплення та відновлення позиції. Додаткову інформацію див. у довідковій частині команд.

source: Firmware filament retraction. This enables G10 (retract) and G11 (unretract) GCODE commands issued by many slicers. The parameters below provide startup defaults, although the values can be adjusted via the SET_RETRACTION [command](G-Codes.md#firmware_retraction)), allowing per-filament settings and runtime tuning.
uk: Втягування нитки прошивки. Це вмикає команди G10 (відкликати) і G11 (скасувати) GCODE, які видають багато зрізів. Наведені нижче параметри надають параметри запуску за замовчуванням, хоча значення можна налаштувати за допомогою [команди] SET_RETRACTION (G-Codes.md#firmware_retraction)), що дозволяє налаштовувати параметри для кожної нитки та час виконання.

source: Enable the "M118" and "RESPOND" extended [commands](G-Codes.md#respond).
uk: Увімкніть розширені [команди] «M118» і «RESPOND» (G-Codes.md#respond).

source: Enables [resonance compensation](Resonance_Compensation.md). Also see the [command reference](G-Codes.md#input_shaper).
uk: Вмикає компенсацію резонансу. Також перегляньте довідку про команди.

source: Support for ADXL345 accelerometers. This support allows one to query accelerometer measurements from the sensor. This enables an ACCELEROMETER_MEASURE command (see [G-Codes](G-Codes.md#adxl345) for more information). The default chip name is "default", but one may specify an explicit name (eg, [adxl345 my_chip_name]).
uk: Підтримка акселерометрів ADXL345. Ця підтримка дозволяє запитувати вимірювання акселерометра від датчика. Це вмикає команду ACCELEROMETER_MEASURE (додаткову інформацію див. у [G-коди](G-Codes.md#adxl345). Назва мікросхеми за замовчуванням — «default», але можна вказати явну назву (наприклад, [adxl345 my_chip_name]).

source: Support for resonance testing and automatic input shaper calibration. In order to use most of the functionality of this module, additional software dependencies must be installed; refer to [Measuring Resonances](Measuring_Resonances.md) and the [command reference](G-Codes.md#resonance_tester) for more information. See the [Max smoothing](Measuring_Resonances.md#max-smoothing) section of the measuring resonances guide for more information on `max_smoothing` parameter and its use.
uk: Підтримка резонансного тестування та автоматичного калібрування формувача вхідного сигналу. Щоб використовувати більшу частину функціональних можливостей цього модуля, необхідно встановити додаткові програмні залежності; для отримання додаткової інформації зверніться до [Вимірювання резонансів](Measuring_Resonances.md) і [довідки щодо команд](G-Codes.md#resonance_tester). Перегляньте розділ [Максимальне згладжування](Measuring_Resonances.md#max-smoothing) посібника з вимірювання резонансів, щоб отримати додаткові відомості про параметр `max_smoothing` та його використання.

source: [extruder1] #step_pin: #dir_pin: #... # See the "extruder" section for available stepper and heater # parameters. #shared_heater: # This option is deprecated and should no longer be specified.
uk: [екструдер1] #step_pin: #dir_pin: #... Дивіться розділ «Екструдер», щоб дізнатися про доступні кроковий механізм і нагрівач параметри. #спільний_обігрівач: Цей параметр застарів і його більше не слід вказувати.

source: See the [command reference](G-Codes.md#extruder) for more information.
uk: Додаткову інформацію див. у [довідці щодо команд](G-Codes.md#extruder).

source: Manual steppers (one may define any number of sections with a "manual_stepper" prefix). These are steppers that are controlled by the MANUAL_STEPPER g-code command. For example: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". See [G-Codes](G-Codes.md#manual_stepper) file for a description of the MANUAL_STEPPER command. The steppers are not connected to the normal printer kinematics.
uk: Ручні степпери (можна визначити будь-яку кількість секцій з префіксом "ручний_степер"). Це степери, які керуються командою g-коду MANUAL_STEPPER. Наприклад: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". Опис команди MANUAL_STEPPER див. у файлі G-Codes. Степери не пов’язані зі звичайною кінематикою принтера.

source: Generic heaters (one may define any number of sections with a "heater_generic" prefix). These heaters behave similarly to standard heaters (extruders, heated beds). Use the SET_HEATER_TEMPERATURE command (see [G-Codes](G-Codes.md#heaters) for details) to set the target temperature.
uk: Загальні нагрівачі (можна визначити будь-яку кількість розділів з префіксом "heater_generic"). Ці нагрівачі поводяться подібно до стандартних нагрівачів (екструдерів, ліжок з підігрівом). Використовуйте команду SET_HEATER_TEMPERATURE (додаткову інформацію див. у G-Codes), щоб установити цільову температуру.

source: LM75/LM75A two wire (I2C) connected temperature sensors. These sensors have a range of -55~125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers.
uk: LM75/LM75A двопровідні (I2C) датчики температури. Ці датчики мають діапазон -55~125 C, тому їх можна використовувати, наприклад, для моніторингу температури в камері. Вони також можуть функціонувати як прості контролери вентилятора/нагрівача.

source: See the [command reference](G-Codes.md#temperature_fan) for additional information.
uk: Додаткову інформацію див. у [довідці щодо команд](G-Codes.md#temperature_fan).

source: Manually controlled fan (one may define any number of sections with a "fan_generic" prefix). The speed of a manually controlled fan is set with the SET_FAN_SPEED [gcode command](G-Codes.md#fan_generic).
uk: Вентилятор з ручним управлінням (можна визначити будь-яку кількість секцій з префіксом "fan_generic"). Швидкість вентилятора з ручним керуванням встановлюється за допомогою SET_FAN_SPEED команда gcode.

source: Servos (one may define any number of sections with a "servo" prefix). The servos may be controlled using the SET_SERVO [g-code command](G-Codes.md#servo). For example: SET_SERVO SERVO=my_servo ANGLE=180
uk: Сервоприводи (можна визначити будь-яку кількість секцій з префіксом «сервоприводи»). Сервоприводами можна керувати за допомогою SET_SERVO [команда g-code](G-Codes.md#servo). Наприклад: SET_SERVO SERVO=my_servo ANGLE=180

source: Run-time configurable output pins (one may define any number of sections with an "output_pin" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1" type extended [g-code commands](G-Codes.md#output_pin).
uk: Вихідні контакти, що настроюються під час виконання (можна визначити будь-яку кількість секцій із префіксом "output_pin"). Налаштовані тут контакти буде встановлено як вихідні контакти, і їх можна буде змінити під час виконання за допомогою розширеного типу "SET_PIN PIN=my_pin VALUE=.1" [команди g-коду](G-Codes.md#output_pin).

source: Configuration of Trinamic stepper motor drivers in UART/SPI mode. Additional information is in the [TMC Drivers guide](TMC_Drivers.md) and in the [command reference](G-Codes.md#tmcxxxx).
uk: Конфігурація драйверів крокових двигунів Trinamic у режимі UART/SPI. Додаткову інформацію можна знайти в посібнику з драйверів TMC і в довідці щодо команд.

source: See the [command reference](G-Codes.md#filament_switch_sensor) for more information.
uk: Додаткову інформацію див. у [довідці щодо команд](G-Codes.md#filament_switch_sensor).

source: The extruder section is used to describe the heater parameters for the nozzle hotend along with the stepper controlling the extruder. See the [command reference](G-Codes.md#extruder) for additional information. See the [pressure advance guide](Pressure_Advance.md) for information on tuning pressure advance.
uk: Описи в цьому документі відформатовано таким чином, що їх можна вирізати та вставити у файл конфігурації принтера. Перегляньте [інсталяції документа](Installation.md) для отримання інформації щодо налаштування Klipper та вибору початкового конфігураційного файлу.

source: [extruder_stepper my_extra_stepper] extruder: # The extruder this stepper is synchronized to. If this is set to an # empty string then the stepper will not be synchronized to an # extruder. This parameter must be provided. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for the definition of the above # parameters.
uk: [extruder_stepper my_extra_stepper] екструдер: Екструдер, з яким синхронізовано цей степер. Якщо для цього встановлено значення an пустий рядок, тоді степпер не буде синхронізовано з an екструдер. Цей параметр необхідно вказати. #step_pin: #dir_pin: #enable_pin: #мікрокроки: #rotation_distance: Перегляньте розділ «степпер» для визначення наведеного вище параметри.

source: [printer] kinematics: polar max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_bed section is used to describe the stepper controlling # the bed. [stepper_bed] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the bed has an 80 toothed pulley driven # by a stepper with a 16 toothed pulley then one would specify a # gear ratio of "80:16". This parameter must be provided. # The stepper_arm section is used to describe the stepper controlling # the carriage on the arm. [stepper_arm] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
uk: [принтер] кінематика: полярна max_z_velocity: # Це встановлює максимальну швидкість (у мм/с) руху вздовж z # вісь. Цей параметр можна використовувати для обмеження максимальної швидкості # кроковий двигун z. За умовчанням використовується max_velocity для # max_z_velocity. max_z_accel: # Це встановлює максимальне прискорення (у мм/с^2) руху вздовж # вісь z. Він обмежує прискорення крокового двигуна z. The # за замовчуванням для max_z_accel використовується max_accel. # Розділ stepper_bed використовується для опису управління кроком # ліжко. [stepper_bed] передаточне число: # Необхідно вказати gear_ratio, а rotation_distance — не можна # вказано. Наприклад, якщо ліжко має 80-зубчастий шків # кроковим кроком із 16-зубчастим шківом, тоді можна вказати a # передавальне число «80:16». Цей параметр необхідно вказати. # Секція stepper_arm використовується для опису керування кроком # коляска на кронштейні. [stepper_arm] # Секція stepper_z використовується для опису керування кроком # вісь Z. [stepper_z]
