Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [probe] pin: # Probe detection pin. If the pin is on a different microcontroller # than the Z steppers then it enables "multi-mcu homing". This # parameter must be provided. #deactivate_on_each_sample: True # This determines if Klipper should execute deactivation gcode # between each probe attempt when performing a multiple probe # sequence. The default is True. #x_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # x-axis. The default is 0. #y_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # y-axis. The default is 0. z_offset: # The distance (in mm) between the bed and the nozzle when the probe # triggers. This parameter must be provided. #speed: 5.0 # Speed (in mm/s) of the Z axis when probing. The default is 5mm/s. #samples: 1 # The number of times to probe each point. The probed z-values will # be averaged. The default is to probe 1 time. #sample_retract_dist: 2.0 # The distance (in mm) to lift the toolhead between each sample (if # sampling more than once). The default is 2mm. #lift_speed: # Speed (in mm/s) of the Z axis when lifting the probe between # samples. The default is to use the same value as the 'speed' # parameter. #samples_result: average # The calculation method when sampling more than once - either # "median" or "average". The default is average. #samples_tolerance: 0.100 # The maximum Z distance (in mm) that a sample may differ from other # samples. If this tolerance is exceeded then either an error is # reported or the attempt is restarted (see # samples_tolerance_retries). The default is 0.100mm. #samples_tolerance_retries: 0 # The number of times to retry if a sample is found that exceeds # samples_tolerance. On a retry, all current samples are discarded # and the probe attempt is restarted. If a valid set of samples are # not obtained in the given number of retries then an error is # reported. The default is zero which causes an error to be reported # on the first sample that exceeds samples_tolerance. #activate_gcode: # A list of G-Code commands to execute prior to each probe attempt. # See docs/Command_Templates.md for G-Code format. This may be # useful if the probe needs to be activated in some way. Do not # issue any commands here that move the toolhead (eg, G1). The # default is to not run any special G-Code commands on activation. #deactivate_gcode: # A list of G-Code commands to execute after each probe attempt # completes. See docs/Command_Templates.md for G-Code format. Do not # issue any commands here that move the toolhead. The default is to # not run any special G-Code commands on deactivation.
uk: [зонд] прикріпити: # Штифт виявлення зонда. Якщо штифт знаходиться на іншому мікроконтролері # ніж Z-степери, то він дає змогу "наведення з кількома мікроконтроллерами". Це Потрібно вказати # параметр. #deactivate_on_each_sample: Правда # Це визначає, чи має Klipper виконувати gcode дезактивації # між кожною спробою тестування під час виконання кількох тестів # послідовність. Типовим значенням є True. #x_offset: 0,0 # Відстань (у мм) між зондом і соплом уздовж # вісь х. За замовчуванням 0. #y_offset: 0,0 # Відстань (у мм) між зондом і соплом уздовж # вісь y. За замовчуванням 0. z_offset: # Відстань (у мм) між ложем і соплом, коли зонд # тригери. Цей параметр необхідно вказати. #швидкість: 5.0 # Швидкість (у мм/с) осі Z під час вимірювання. За замовчуванням 5 мм/с. #зразки: 1 # Кількість разів для зондування кожної точки. Досліджувані z-значення будуть # бути усередненим. За замовчуванням досліджується 1 раз. #sample_retract_dist: 2.0 # Відстань (у мм), щоб підняти інструментальну головку між кожним зразком (якщо # вибірка більше одного разу). За замовчуванням 2 мм. #ліфт_швидкість: # Швидкість (у мм/с) осі Z під час підняття зонда між # зразків. За умовчанням використовується те саме значення, що й «швидкість». # параметр. #samples_result: середній # Метод розрахунку при вибірці більше одного разу - будь-який # "медіана" або "середнє". За умовчанням встановлено середнє значення. #samples_tolerance: 0,100 # Максимальна відстань Z (у мм), якою зразок може відрізнятися від інших # зразків. Якщо цей допуск перевищено, то є помилка # повідомлено або спробу розпочато повторно (див # samples_tolerance_retries). За замовчуванням 0,100 мм. #samples_tolerance_retries: 0 # Кількість повторів, якщо знайдено зразок, що перевищує # зразки_допуску. Під час повторної спроби всі поточні зразки скидаються # і спроба зонду розпочнеться повторно. Якщо дійсний набір зразків є # не отримано за задану кількість повторів, тоді виникає помилка # повідомлено. За умовчанням дорівнює нулю, що спричиняє повідомлення про помилку # на першому зразку, який перевищує samples_tolerance. #activate_gcode: # Список команд G-коду для виконання перед кожною спробою зондування. # Перегляньте docs/Command_Templates.md для формату G-коду. Це може бути # корисно, якщо зонд потрібно якимось чином активувати. не треба # видати тут будь-які команди, які переміщують інструментальну головку (наприклад, G1). The # За замовчуванням під час активації не запускаються спеціальні команди G-коду. #deactivate_gcode: # Список команд G-Code для виконання після кожної спроби зонду # виконано. Перегляньте docs/Command_Templates.md для формату G-коду. не треба # видайте тут будь-які команди, які переміщують інструментальну головку. Типовим значенням є # не запускати жодних спеціальних команд G-Code після деактивації.

source: [display] lcd_type: # The type of LCD chip in use. This may be "hd44780", "hd44780_spi", # "st7920", "emulated_st7920", "uc1701", "ssd1306", or "sh1106". # See the display sections below for information on each type and # additional parameters they provide. This parameter must be # provided. #display_group: # The name of the display_data group to show on the display. This # controls the content of the screen (see the "display_data" section # for more information). The default is _default_20x4 for hd44780 # displays and _default_16x4 for other displays. #menu_timeout: # Timeout for menu. Being inactive this amount of seconds will # trigger menu exit or return to root menu when having autorun # enabled. The default is 0 seconds (disabled) #menu_root: # Name of the main menu section to show when clicking the encoder # on the home screen. The defaults is __main, and this shows the # the default menus as defined in klippy/extras/display/menu.cfg #menu_reverse_navigation: # When enabled it will reverse up and down directions for list # navigation. The default is False. This parameter is optional. #encoder_pins: # The pins connected to encoder. 2 pins must be provided when using # encoder. This parameter must be provided when using menu. #encoder_steps_per_detent: # How many steps the encoder emits per detent ("click"). If the # encoder takes two detents to move between entries or moves two # entries from one detent, try changing this. Allowed values are 2 # (half-stepping) or 4 (full-stepping). The default is 4. #click_pin: # The pin connected to 'enter' button or encoder 'click'. This # parameter must be provided when using menu. The presence of an # 'analog_range_click_pin' config parameter turns this parameter # from digital to analog. #back_pin: # The pin connected to 'back' button. This parameter is optional, # menu can be used without it. The presence of an # 'analog_range_back_pin' config parameter turns this parameter from # digital to analog. #up_pin: # The pin connected to 'up' button. This parameter must be provided # when using menu without encoder. The presence of an # 'analog_range_up_pin' config parameter turns this parameter from # digital to analog. #down_pin: # The pin connected to 'down' button. This parameter must be # provided when using menu without encoder. The presence of an # 'analog_range_down_pin' config parameter turns this parameter from # digital to analog. #kill_pin: # The pin connected to 'kill' button. This button will call # emergency stop. The presence of an 'analog_range_kill_pin' config # parameter turns this parameter from digital to analog. #analog_pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the analog # button. The default is 4700 ohms. #analog_range_click_pin: # The resistance range for a 'enter' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_back_pin: # The resistance range for a 'back' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_up_pin: # The resistance range for a 'up' button. Range minimum and maximum # comma-separated values must be provided when using analog button. #analog_range_down_pin: # The resistance range for a 'down' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_kill_pin: # The resistance range for a 'kill' button. Range minimum and # maximum comma-separated values must be provided when using analog # button.
uk: [дисплей] lcd_type: Тип РК-чіпа, що використовується. Це може бути "hd44780", "hd44780_spi", "st7920", "emulated_st7920", "uc1701", "ssd1306" або "sh1106". Перегляньте розділи дисплея нижче для отримання інформації про кожен тип і додаткові параметри, які вони надають. Цей параметр повинен бути надано. #display_group: Назва групи display_data для відображення на дисплеї. Це контролює вміст екрана (див. розділ «display_data». для отримання додаткової інформації). Типовим є _default_20x4 для hd44780 дисплеїв і _default_16x4 для інших дисплеїв. #menu_timeout: Час очікування для меню. Будучи неактивним протягом такої кількості секунд тригер вихід із меню або повернення до кореневого меню під час автозапуску увімкнено. За замовчуванням 0 секунд (вимкнено) #menu_root: Назва розділу головного меню, який буде показано під час натискання кодера на головному екрані. За замовчуванням __main, і це показує типові меню, як визначено у klippy/extras/display/menu.cfg #menu_reverse_navigation: Якщо ввімкнути, він змінює напрямки вгору та вниз для списку навігація. За замовчуванням значення False. Цей параметр необов'язковий. #encoder_pins: Виводи, підключені до кодера. При використанні необхідно передбачити 2 шпильки кодувальник. Цей параметр необхідно вказати під час використання меню. #encoder_steps_per_detent: Скільки кроків кодер видає на фіксацію ("клацання"). Якщо кодер використовує два фіксатори для переходу між записами або переміщує два записів з одного блокування, спробуйте змінити це. Дозволені значення 2 (напівкроковий) або 4 (повний крок). За замовчуванням 4. #click_pin: Штифт, підключений до кнопки «введення» або «клацання» кодера. Це Під час використання меню необхідно вказати # параметр. Наявність ан Параметр конфігурації 'analog_range_click_pin' повертає цей параметр від цифрового до аналогового. #back_pin: Штифт, підключений до кнопки "назад". Цей параметр необов'язковий, меню можна використовувати без нього. Наявність ан Параметр конфігурації 'analog_range_back_pin' повертає цей параметр з цифро-аналоговий. #up_pin: Штифт, підключений до кнопки «вгору». Цей параметр необхідно вказати при використанні меню без кодера. Наявність ан Параметр конфігурації 'analog_range_up_pin' повертає цей параметр з цифро-аналоговий. #down_pin: Штифт, підключений до кнопки «вниз». Цей параметр повинен бути надається при використанні меню без кодера. Наявність ан Параметр конфігурації 'analog_range_down_pin' повертає цей параметр з цифро-аналоговий. #kill_pin: Штифт, пов’язаний з кнопкою «kill». Ця кнопка викличе аварійна зупинка. Наявність конфігурації 'analog_range_kill_pin' Параметр # перетворює цей параметр із цифрового на аналоговий. #analog_pullup_resistor: 4700 Опір (в Омах) підтягування, підключеного до аналога кнопка. За замовчуванням 4700 Ом. #analog_range_click_pin: Діапазон опору для кнопки «введення». Діапазон мінімальний і Максимальна кількість значень, розділених комами, має бути надано під час використання аналогового кнопка. #analog_range_back_pin: Діапазон опору для кнопки «Назад». Діапазон мінімальний і Максимальна кількість значень, розділених комами, має бути надано під час використання аналогового кнопка. #analog_range_up_pin: Діапазон опору для кнопки «вгору». Мінімальний і максимальний діапазон Під час використання аналогової кнопки необхідно вказати # значення, розділені комами. #analog_range_down_pin: Діапазон опору для кнопки «вниз». Діапазон мінімальний і Максимальна кількість значень, розділених комами, має бути надано під час використання аналогового кнопка. #analog_range_kill_pin: Діапазон опору для кнопки «вбити». Діапазон мінімальний і Максимальна кількість значень, розділених комами, має бути надано під час використання аналогового кнопка.

source: sensor_type: # One of "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", or "TDK NTCG104LH104JT1" sensor_pin: # Analog input pin connected to the thermistor. This parameter must # be provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # The default is 4700 ohms. #inline_resistor: 0 # The resistance (in ohms) of an extra (not heat varying) resistor # that is placed inline with the thermistor. It is rare to set this. # The default is 0 ohms.
uk: тип_датчика: # Один із "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450" або "TDK NTCG104LH104JT1" sensor_pin: # Аналоговий вхід, підключений до термістора. Цей параметр повинен # бути надано. #pullup_resistor: 4700 # Опір (в Омах) підтягування, підключеного до термістора. # За замовчуванням 4700 Ом. #inline_resistor: 0 # Опір (в Омах) додаткового (не змінного нагріву) резистора # який розміщено в одній лінії з термістором. Таке встановлюється рідко. # За замовчуванням 0 Ом.

source: Hall filament width sensor (see [Hall Filament Width Sensor](Hall_Filament_Width_Sensor.md)).
uk: Датчик ширини нитки Холла (див. Датчик ширини нитки Холла).

source: Replicape support - see the [beaglebone guide](Beaglebone.md) and the [generic-replicape.cfg](../config/generic-replicape.cfg) file for an example.
uk: Підтримка реплікатів – дивіться [посібник з beaglebone](Beaglebone.md) і файл [generic-replicape.cfg](../config/generic-replicape.cfg) для прикладу.

source: [stepper_x] step_pin: # Step GPIO pin (triggered high). This parameter must be provided. dir_pin: # Direction GPIO pin (high indicates positive direction). This # parameter must be provided. enable_pin: # Enable pin (default is enable high; use ! to indicate enable # low). If this parameter is not provided then the stepper motor # driver must always be enabled. rotation_distance: # Distance (in mm) that the axis travels with one full rotation of # the stepper motor (or final gear if gear_ratio is specified). # This parameter must be provided. microsteps: # The number of microsteps the stepper motor driver uses. This # parameter must be provided. #full_steps_per_rotation: 200 # The number of full steps for one rotation of the stepper motor. # Set this to 200 for a 1.8 degree stepper motor or set to 400 for a # 0.9 degree motor. The default is 200. #gear_ratio: # The gear ratio if the stepper motor is connected to the axis via a # gearbox. For example, one may specify "5:1" if a 5 to 1 gearbox is # in use. If the axis has multiple gearboxes one may specify a comma # separated list of gear ratios (for example, "57:11, 2:1"). If a # gear_ratio is specified then rotation_distance specifies the # distance the axis travels for one full rotation of the final gear. # The default is to not use a gear ratio. #step_pulse_duration: # The minimum time between the step pulse signal edge and the # following "unstep" signal edge. This is also used to set the # minimum time between a step pulse and a direction change signal. # The default is 0.000000100 (100ns) for TMC steppers that are # configured in UART or SPI mode, and the default is 0.000002 (which # is 2us) for all other steppers. endstop_pin: # Endstop switch detection pin. If this endstop pin is on a # different mcu than the stepper motor then it enables "multi-mcu # homing". This parameter must be provided for the X, Y, and Z # steppers on cartesian style printers. #position_min: 0 # Minimum valid distance (in mm) the user may command the stepper to # move to. The default is 0mm. position_endstop: # Location of the endstop (in mm). This parameter must be provided # for the X, Y, and Z steppers on cartesian style printers. position_max: # Maximum valid distance (in mm) the user may command the stepper to # move to. This parameter must be provided for the X, Y, and Z # steppers on cartesian style printers. #homing_speed: 5.0 # Maximum velocity (in mm/s) of the stepper when homing. The default # is 5mm/s. #homing_retract_dist: 5.0 # Distance to backoff (in mm) before homing a second time during # homing. Set this to zero to disable the second home. The default # is 5mm. #homing_retract_speed: # Speed to use on the retract move after homing in case this should # be different from the homing speed, which is the default for this # parameter #second_homing_speed: # Velocity (in mm/s) of the stepper when performing the second home. # The default is homing_speed/2. #homing_positive_dir: # If true, homing will cause the stepper to move in a positive # direction (away from zero); if false, home towards zero. It is # better to use the default than to specify this parameter. The # default is true if position_endstop is near position_max and false # if near position_min.
uk: [stepper_x] step_pin: # Крок GPIO контакт (спрацьовує високий рівень). Цей параметр необхідно вказати. dir_pin: # Напрямок контакту GPIO (високий вказує на позитивний напрямок). Це Потрібно вказати # параметр. enable_pin: # Увімкнути PIN-код (за замовчуванням включений високий; використовуйте !, щоб вказати ввімкнення). # низький). Якщо цей параметр не передбачено, то кроковий двигун # драйвер має бути завжди ввімкнено. відстань_обертання: # Відстань (у мм), яку проходить вісь за один повний оберт # кроковий двигун (або кінцева передача, якщо вказано gear_ratio). # Цей параметр необхідно вказати. мікрокроки: # Кількість мікрокроків, які використовує драйвер крокового двигуна. Це Потрібно вказати # параметр. #full_steps_per_rotation: 200 # Кількість повних кроків за один оберт крокового двигуна. # Встановіть значення 200 для крокового двигуна 1,8 градуса або встановіть значення 400 для a # Мотор 0,9 градусів. За замовчуванням 200. #gear_ratio: # Передавальне число, якщо кроковий двигун підключено до осі через a # коробка передач. Наприклад, можна вказати «5:1», якщо коробка передач 5 до 1 # у використанні. Якщо вісь має кілька коробок передач, можна вказати кому # відокремлений список передавальних чисел (наприклад, «57:11, 2:1»). Якщо a # gear_ratio вказано, тоді rotation_distance визначає # відстань, яку проходить вісь за один повний оберт кінцевої шестерні. # За замовчуванням передавальне число не використовується. #step_pulse_duration: # Мінімальний час між фронтом сигналу крокового імпульсу та # наступний фронт сигналу "unstep". Це також використовується для встановлення # мінімальний час між кроковим імпульсом і сигналом зміни напрямку. # Значення за замовчуванням становить 0,000000100 (100 нс) для степерів TMC, які # налаштовано в режимі UART або SPI, а за замовчуванням 0,000002 (що # дорівнює 2 нас) для всіх інших степерів. endstop_pin: # Штифт виявлення кінцевого перемикача. Якщо цей кінцевий штифт знаходиться на a # відрізняється від крокового двигуна mcu, тоді він увімкне "multi-mcu # homing". Цей параметр необхідно надати для X, Y і Z # степери на принтерах декартового типу. #position_min: 0 # Мінімальна допустима відстань (у мм), яку користувач може вказати степеру # перейти до. За замовчуванням 0 мм. position_endstop: # Розташування кінцевого упору (у мм). Цей параметр необхідно вказати # для кроків X, Y та Z на принтерах декартового типу. position_max: # Максимальна дійсна відстань (у мм), яку користувач може вказати степеру # перейти до. Цей параметр необхідно надати для X, Y і Z # степери на принтерах декартового типу. #homing_speed: 5,0 # Максимальна швидкість (у мм/с) крокового кроку при наведенні. За замовчуванням # становить 5 мм/с. #homing_retract_dist: 5.0 # Відстань до відступу (у мм) перед повторним поверненням до початку # самонаведення. Встановіть це значення на нуль, щоб вимкнути другий будинок. За замовчуванням # становить 5 мм. #homing_retract_speed: # Швидкість для використання під час руху втягування після наведення у разі потреби # відрізнятися від швидкості наведення, яка є типовою для цього # параметр #second_homing_speed: # Швидкість (у мм/с) кроку при виконанні другого дому. # Типовим є homing_speed/2. #homing_positive_dir: # Якщо істина, наведення призведе до позитивного руху крокового кроку # напрямок (від нуля); якщо false, додому до нуля. Це так # краще використовувати значення за замовчуванням, ніж вказувати цей параметр. The # за замовчуванням значення true, якщо position_endstop близько до position_max і false # якщо поблизу position_min.
