Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [tmc5160 stepper_x] cs_pin: # The pin corresponding to the TMC5160 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.075 # The resistance (in ohms) of the motor sense resistor. The default # is 0.075 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #coolstep_threshold: # The velocity (in mm/s) to set the TMC driver internal "CoolStep" # threshold to. If set, the coolstep feature will be enabled when # the stepper motor velocity is near or above this value. Important # - if coolstep_threshold is set and "sensorless homing" is used, # then one must ensure that the homing speed is above the coolstep # threshold! The default is to not enable the coolstep feature. #high_velocity_threshold: # The velocity (in mm/s) to set the TMC driver internal "high # velocity" threshold (THIGH) to. This is typically used to disable # the "CoolStep" feature at high speeds. The default is to not set a # TMC "high velocity" threshold. #driver_MSLUT0: 2863314260 #driver_MSLUT1: 1251300522 #driver_MSLUT2: 608774441 #driver_MSLUT3: 269500962 #driver_MSLUT4: 4227858431 #driver_MSLUT5: 3048961917 #driver_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #driver_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 # These fields control the Microstep Table registers directly. The optimal # wave table is specific to each motor and might vary with current. An # optimal configuration will have minimal print artifacts caused by # non-linear stepper movement. The values specified above are the default # values used by the driver. The value must be specified as a decimal integer # (hex form is not supported). In order to compute the wave table fields, # see the tmc2130 "Calculation Sheet" from the Trinamic website. #driver_MULTISTEP_FILT: True #driver_IHOLDDELAY: 6 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 30 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 #driver_DRVSTRENGTH: 0 #driver_BBMCLKS: 4 #driver_BBMTIME: 0 #driver_FILT_ISENSE: 0 # Set the given register during the configuration of the TMC5160 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC5160 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc5160_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
uk: [tmc5160 stepper_x] cs_pin: # Пін, що відповідає лінії вибору мікросхеми TMC5160. Ця шпилька # буде встановлено на низький рівень на початку повідомлень SPI і підвищено на високий # після завершення повідомлення. Цей параметр необхідно вказати. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис # параметр вище. #chain_position: #chain_length: # Ці параметри налаштовують шлейфове з’єднання SPI. Два параметри # визначити позицію кроку в ланцюзі та загальну довжину ланцюга. # Позиція 1 відповідає степеру, який підключається до сигналу MOSI. # За замовчуванням ланцюжок SPI не використовується. #interpolate: Правда # Якщо істина, увімкнути покрокову інтерполяцію (драйвер буде внутрішньо # крок зі швидкістю 256 мікрокроків). Типовим значенням є True. run_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # під час руху степера. Цей параметр необхідно вказати. #hold_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # коли степпер не рухається. Налаштування hold_current не є # рекомендовано (подробиці див. на TMC_Drivers.md). За умовчанням встановлено значення # не зменшувати струм. #сенс_резистор: 0,075 # Опір (в Омах) резистора датчика двигуна. За замовчуванням # дорівнює 0,075 Ом. #stealthchop_threshold: 0 # Швидкість (у мм/с), на яку потрібно встановити порогове значення "stealthChop". Коли # set, режим "stealthChop" буде ввімкнено, якщо кроковий двигун # швидкість нижче цього значення. За замовчуванням 0, що вимикає # режим "stealthChop". #coolstep_threshold: # Швидкість (у мм/с) для встановлення внутрішнього "CoolStep" драйвера TMC # поріг до. Якщо встановлено, функція coolstep буде ввімкнена, коли # швидкість крокового двигуна близька до цього значення або перевищує його. важливо # - якщо встановлено coolstep_threshold і використовується "безсенсорне самонаведення", # тоді потрібно переконатися, що швидкість наведення вище кроку холоду #поріг! За замовчуванням функцію coolstep не ввімкнено. #high_velocity_threshold: # Швидкість (у мм/с) для встановлення високого рівня внутрішнього драйвера TMC # швидкість" порогове значення (СТЕГНО) до. Це зазвичай використовується для вимкнення # функція "CoolStep" на високих швидкостях. За замовчуванням не встановлено a # Поріг "високої швидкості" TMC. #драйвер_MSLUT0: 2863314260 #драйвер_MSLUT1: 1251300522 #драйвер_MSLUT2: 608774441 #драйвер_MSLUT3: 269500962 #драйвер_MSLUT4: 4227858431 #драйвер_MSLUT5: 3048961917 #драйвер_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #водій_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 # Ці поля безпосередньо керують регістрами таблиці Microstep. Оптимальний Таблиця хвиль # є специфічною для кожного двигуна та може змінюватись залежно від струму. Ан # оптимальна конфігурація матиме мінімальні артефакти друку, викликані # нелінійний кроковий рух. Зазначені вище значення є типовими # значення, які використовує драйвер. Значення має бути вказане як ціле десяткове число # (шістнадцяткова форма не підтримується). Щоб обчислити поля хвильової таблиці, # дивіться tmc2130 "Таблиця розрахунків" на веб-сайті Trinamic. #driver_MULTISTEP_FILT: Правда #driver_IHOLDDELAY: 6 #driver_TPOWERDOWN: 10 #драйвер_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #драйвер_FD3: 0 #драйвер_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: Правда #driver_PWM_AUTOGRAD: Правда #driver_PWM_FREQ: 0 #водій_ВІЛЬНИЙ КОЛЕШ: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 30 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 #driver_DRVSTRENGTH: 0 #driver_BBMCLKS: 4 #driver_BBMTIME: 0 #driver_FILT_ISENSE: 0 # Встановіть заданий регістр під час налаштування TMC5160 # чіп. Це може бути використано для встановлення власних параметрів двигуна. The # значення за замовчуванням для кожного параметра вказано поруч із назвою параметра в # вище списку. #diag0_pin: #diag1_pin: # Вивід мікроконтролера, приєднаний до однієї з ліній DIAG # Чіп TMC5160. Потрібно вказати лише один діагностичний штифт. шпилька # є "активним низьким" і тому зазвичай має перед собою "^!". Налаштування # це створює віртуальний пін "tmc5160_stepper_x:virtual_endstop" # який можна використовувати як endstop_pin степера. Це дозволяє # "безсенсорне самонаведення". (Не забудьте також встановити driver_SGT на an # відповідне значення чутливості.) За умовчанням не ввімкнено # безсенсорне самонаведення.

source: Load Cells
uk: Датчики навантаження

source: Load Cell. Uses an ADC sensor attached to a load cell to create a digital scale.
uk: Датчик навантаження. Використовує датчик АЦП, прикріплений до тензодатчика, для створення цифрових ваг.

source: [load_cell] sensor_type: # This must be one of the supported sensor types, see below.
uk: [load_cell] тип_датчика: Це має бути один із підтримуваних типів датчиків, див. нижче.

source: This is a 24 bit low sample rate chip using "bit-bang" communications. It is suitable for filament scales.
uk: Це 24-бітний чіп із низькою частотою дискретизації, який використовує зв’язок «bit-bang». Підходить для нитяних лусочок.

source: [load_cell] sensor_type: hx711 sclk_pin: # The pin connected to the HX711 clock line. This parameter must be provided. dout_pin: # The pin connected to the HX711 data output line. This parameter must be # provided. #gain: A-128 # Valid values for gain are: A-128, A-64, B-32. The default is A-128. # 'A' denotes the input channel and the number denotes the gain. Only the 3 # listed combinations are supported by the chip. Note that changing the gain # setting also selects the channel being read. #sample_rate: 80 # Valid values for sample_rate are 80 or 10. The default value is 80. # This must match the wiring of the chip. The sample rate cannot be changed # in software.
uk: [load_cell] тип_датчика: hx711 sclk_pin: Штифт, підключений до тактової лінії HX711. Цей параметр необхідно вказати. dout_pin: Штифт, підключений до лінії виведення даних HX711. Цей параметр повинен бути надано. #посилення: A-128 Дійсні значення посилення: A-128, A-64, B-32. Типовим є A-128. 'A' позначає вхідний канал, а цифра позначає посилення. Тільки 3 перераховані комбінації підтримуються чіпом. Зверніть увагу, що зміна посилення Параметр # також вибирає канал, який читається. #sample_rate: 80 Дійсні значення для sample_rate — 80 або 10. Значення за замовчуванням — 80. Це має відповідати розводці чіпа. Частоту дискретизації не можна змінити в програмному забезпеченні.

source: This is the 4x higher sample rate version of the HX711, suitable for probing.
uk: Це версія HX711 з 4-кратною вищою частотою дискретизації, придатна для зондування.

source: [load_cell] sensor_type: hx717 sclk_pin: # The pin connected to the HX717 clock line. This parameter must be provided. dout_pin: # The pin connected to the HX717 data output line. This parameter must be # provided. #gain: A-128 # Valid values for gain are A-128, B-64, A-64, B-8. # 'A' denotes the input channel and the number denotes the gain setting. # Only the 4 listed combinations are supported by the chip. Note that # changing the gain setting also selects the channel being read. #sample_rate: 320 # Valid values for sample_rate are: 10, 20, 80, 320. The default is 320. # This must match the wiring of the chip. The sample rate cannot be changed # in software.
uk: [load_cell] тип_датчика: hx717 sclk_pin: Штифт, підключений до тактової лінії HX717. Цей параметр необхідно вказати. dout_pin: Штифт, підключений до лінії виведення даних HX717. Цей параметр повинен бути надано. #посилення: A-128 Дійсні значення посилення: A-128, B-64, A-64, B-8. 'A' позначає вхідний канал, а цифра позначає налаштування посилення. Чіп підтримує тільки 4 перераховані комбінації. Зауважте, що зміна налаштування посилення також вибирає канал, який зчитується. #sample_rate: 320 Дійсні значення для sample_rate: 10, 20, 80, 320. За замовчуванням 320. Це має відповідати розводці чіпа. Частоту дискретизації не можна змінити в програмному забезпеченні.

source: The ADS1220 is a 24 bit ADC supporting up to a 2Khz sample rate configurable in software.
uk: ADS1220 — це 24-розрядний АЦП, що підтримує частоту дискретизації до 2 КГц, яку можна налаштувати програмно.

source: [load_cell] sensor_type: ads1220 cs_pin: # The pin connected to the ADS1220 chip select line. This parameter must # be provided. #spi_speed: 512000 # This chip supports 2 speeds: 256000 or 512000. The faster speed is only # enabled when one of the Turbo sample rates is used. The correct spi_speed # is selected based on the sample rate. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. data_ready_pin: # Pin connected to the ADS1220 data ready line. This parameter must be # provided. #gain: 128 # Valid gain values are 128, 64, 32, 16, 8, 4, 2, 1 # The default is 128 #sample_rate: 660 # This chip supports two ranges of sample rates, Normal and Turbo. In turbo # mode the chips c internal clock runs twice as fast and the SPI communication # speed is also doubled. # Normal sample rates: 20, 45, 90, 175, 330, 600, 1000 # Turbo sample rates: 40, 90, 180, 350, 660, 1200, 2000 # The default is 660
uk: [load_cell] sensor_type: ads1220 cs_pin: Штифт, підключений до лінії вибору мікросхеми ADS1220. Цей параметр повинен бути надано. #spi_speed: 512000 Цей чіп підтримує 2 швидкості: 256000 або 512000. Швидша швидкість лише увімкнено, коли використовується одна з частот дискретизації Turbo. Правильна spi_speed вибирається на основі частоти дискретизації. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис параметр вище. data_ready_pin: Pin, підключений до лінії готовності даних ADS1220. Цей параметр повинен бути надано. #прибуток: 128 Дійсні значення посилення: 128, 64, 32, 16, 8, 4, 2, 1 За замовчуванням 128 #sample_rate: 660 Цей чіп підтримує два діапазони частот дискретизації: звичайний і турбо. У турбо режим чіпів c внутрішнім годинником працює вдвічі швидше і зв'язок SPI швидкість також подвоюється. Нормальна частота дискретизації: 20, 45, 90, 175, 330, 600, 1000 Частота дискретизації Turbo: 40, 90, 180, 350, 660, 1200, 2000 За замовчуванням 660
