Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Changes.po
Languages: ru

source: This document covers recent software changes to the config file that are not backwards compatible. It is a good idea to review this document when upgrading the Klipper software.
ru: В этом документе описываются последние изменения программного обеспечения в файле конфигурации, которые не являются обратно совместимыми. Рекомендуется ознакомиться с этим документом при обновлении программного обеспечения Klipper.

source: All dates in this document are approximate.
ru: Все даты в этом документе являются приблизительными.

source: Changes
ru: Изменение

source: 20210612: The `pid_integral_max` config option in heater and temperature_fan sections is deprecated. The option will be removed in the near future.
ru: 20210612: Параметр конфигурации `pid_integral_max` в разделах heater и temperature_fan устарел. Эта опция будет удалена в ближайшем будущем.

source: 20210430: The SET_VELOCITY_LIMIT (and M204) command may now set a velocity, acceleration, and square_corner_velocity larger than the specified values in the config file.
ru: 20210430: Команда SET_VELOCITY_LIMIT (и M204) теперь может устанавливать скорость, ускорение и square_corner_velocity, превышающие указанные значения в файле конфигурации.

source: 20210325: Support for the `pin_map` config option is deprecated. Use the [sample-aliases.cfg](../config/sample-aliases.cfg) file to translate to the actual micro-controller pin names. The `pin_map` config option will be removed in the near future.
ru: 20210325: Поддержка опции конфигурации `pin_map` устарела. Используйте файл [sample-aliases.cfg](../config/sample-aliases.cfg) для перевода в реальные имена выводов микроконтроллера. Опция конфигурации `pin_map` будет удалена в ближайшем будущем.

source: 20210313: Klipper's support for micro-controllers that communicate with CAN bus has changed. If using CAN bus then all micro-controllers must be reflashed and the [Klipper configuration must be updated](CANBUS.md).
ru: 20210313: В Klipper изменилась поддержка микроконтроллеров, работающих с шиной CAN. При использовании шины CAN необходимо перепрошить все микроконтроллеры и обновить [конфигурацию Klipper](CANBUS.md).

source: 20210310: The TMC2660 default for driver_SFILT has been changed from 1 to 0.
ru: 20210310: В TMC2660 значение по умолчанию для driver_SFILT было изменено с 1 на 0.

source: 20210227: TMC stepper motor drivers in UART or SPI mode are now queried once per second whenever they are enabled - if the driver can not be contacted or if the driver reports an error, then Klipper will transition to a shutdown state.
ru: 20210227: драйверы шаговых двигателей TMC в режиме UART или SPI теперь запрашиваются раз в секунду, когда они включены - если с драйвером не удается связаться или он сообщает об ошибке, Klipper переходит в состояние отключения.

source: 20210219: The `rpi_temperature` module has been renamed to `temperature_host`. Replace any occurrences of `sensor_type: rpi_temperature` with `sensor_type: temperature_host`. The path to the temperature file may be specified in the `sensor_path` config variable. The `rpi_temperature` name is deprecated and will be removed in the near future.
ru: 20210219: Модуль `rpi_temperature` был переименован в `temperature_host`. Замените все вхождения `sensor_type: rpi_temperature` на `sensor_type: temperature_host`. Путь к файлу температуры может быть указан в конфигурационной переменной `sensor_path`. Имя `rpi_temperature` устарело и будет удалено в ближайшем будущем.

source: 20210201: The `TEST_RESONANCES` command will now disable input shaping if it was previously enabled (and re-enable it after the test). In order to override this behavior and keep the input shaping enabled, one can pass an additional parameter `INPUT_SHAPING=1` to the command.
ru: 20210201: Команда `TEST_RESONANCES` теперь отключает формирование входного сигнала, если он был ранее включен (и снова включает его после теста). Чтобы отменить это поведение и сохранить включенным входной шейпинг, можно передать команде дополнительный параметр `INPUT_SHAPING=1`.

source: 20210201: The `ACCELEROMETER_MEASURE` command will now append the name of the accelerometer chip to the output file name if the chip was given a name in the corresponding adxl345 section of the printer.cfg.
ru: 20210201: Команда `ACCELEROMETER_MEASURE` теперь будет добавлять имя микросхемы акселерометра к имени выходного файла, если микросхеме было присвоено имя в соответствующем разделе adxl345 файла printer.cfg.

source: 20201222: The `step_distance` setting in the stepper config sections is deprecated. It is advised to update the config to use the [`rotation_distance`](Rotation_Distance.md) setting. Support for `step_distance` will be removed in the near future.
ru: 20201222: Настройка `step_distance` в секциях конфига степпера устарела. Рекомендуется обновить конфигурацию, чтобы использовать настройку [`rotation_distance`](Rotation_Distance.md). Поддержка `step_distance` будет удалена в ближайшем будущем.

source: 20201218: The `endstop_phase` setting in the endstop_phase module has been replaced with `trigger_phase`. If using the endstop phases module then it will be necessary to convert to [`rotation_distance`](Rotation_Distance.md) and recalibrate any endstop phases by running the ENDSTOP_PHASE_CALIBRATE command.
ru: 20201218: Настройка `endstop_phase` в модуле endstop_phase была заменена на `trigger_phase`. При использовании модуля endstop phases необходимо преобразовать в [`вращательное_расстояние`](Rotation_Distance.md) и откалибровать все endstop фазы, выполнив команду ENDSTOP_PHASE_CALIBRATE.

source: 20201218: Rotary delta and polar printers must now specify a `gear_ratio` for their rotary steppers, and they may no longer specify a `step_distance` parameter. See the [config reference](Config_Reference.md#stepper) for the format of the new gear_ratio paramter.
ru: 20201218: Поворотные дельта- и полярные принтеры теперь должны указывать `gear_ratio` для своих поворотных степперов, и они больше не могут указывать параметр `step_distance`. Формат нового параметра gear_ratio см. в [ ссылка на конфигурацию ](Config_Reference.md#stepper).

source: 20201213: It is not valid to specify a Z "position_endstop" when using "probe:z_virtual_endstop". An error will now be raised if a Z "position_endstop" is specified with "probe:z_virtual_endstop". Remove the Z "position_endstop" definition to fix the error.
ru: 20201213: Недопустимо указывать Z "position_endstop" при использовании "probe:z_virtual_endstop". Теперь будет возникать ошибка, если Z "position_endstop" указывается с помощью "probe:z_virtual_endstop". Удалите определение Z "position_endstop", чтобы исправить ошибку.

source: 20201120: The `[board_pins]` config section now specifies the mcu name in an explicit `mcu:` parameter. If using board_pins for a secondary mcu, then the config must be updated to specify that name. See the [config reference](Config_Reference.md#board_pins) for further details.
ru: 20201120: В разделе конфигурации `[board_pins]` теперь имя mcu указывается в явном параметре `mcu:`. Если board_pins используется для вторичного mcu, то конфигурацию необходимо обновить, чтобы указать это имя. Дополнительные сведения смотрите в [ссылка на конфигурацию](Config_Reference.md#board_pins).

source: 20201112: The time reported by `print_stats.print_duration` has changed. The duration prior to the first detected extrusion is now excluded.
ru: 20201112: Изменилось время, о котором сообщает `print_stats.print_duration`. Теперь не учитывается время до первой обнаруженной экструзии.

source: 20201029: The neopixel `color_order_GRB` config option has been removed. If necessary, update the config to set the new `color_order` option to RGB, GRB, RGBW, or GRBW.
ru: 20201029: Опция конфигурации neopixel `color_order_GRB` была удалена. При необходимости обновите конфигурацию, чтобы установить новый параметр `color_order` на RGB, GRB, RGBW или GRBW.

source: 20201029: The serial option in the mcu config section no longer defaults to /dev/ttyS0. In the rare situation where /dev/ttyS0 is the desired serial port, it must be specified explicitly.
ru: 20201029: Опция serial в разделе mcu config больше не устанавливает по умолчанию /dev/ttyS0. В редких случаях, когда /dev/ttyS0 является желаемым последовательным портом, его необходимо указывать явно.

source: 20201020: Klipper v0.9.0 released.
ru: 20201020: Выпущена версия Klipper v0.9.0.

source: 20200902: The RTD resistance-to-temperature calculation for MAX31865 converters has been corrected to not read low. If you are using such a device, you should recalibrate your print temperature and PID settings.
ru: 20200902: Расчет сопротивления RTD к температуре для преобразователей MAX31865 был исправлен таким образом, чтобы показания не были низкими. Если вы используете такое устройство, вам следует заново откалибровать температуру печати и настройки ПИД.

source: 20200816: The gcode macro `printer.gcode` object has been renamed to `printer.gcode_move`. Several undocumented variables in `printer.toolhead` and `printer.gcode` have been removed. See docs/Command_Templates.md for a list of available template variables.
ru: 20200816: Объект макроса gcode `printer.gcode` был переименован в `printer.gcode_move`. Несколько недокументированных переменных в `printer.toolhead` и `printer.gcode` были удалены. Список доступных переменных шаблонов смотрите в файле docs/Command_Templates.md.

source: 20200816: The gcode macro "action_" system has changed. Replace any calls to `printer.gcode.action_emergency_stop()` with `action_emergency_stop()`, `printer.gcode.action_respond_info()` with `action_respond_info()`, and `printer.gcode.action_respond_error()` with `action_raise_error()`.
ru: 20200816: Система макросов gcode "action_" изменилась. Замените все вызовы `printer.gcode.action_emergency_stop()` на `action_emergency_stop()`, `printer.gcode.action_respond_info()` на `action_respond_info()`, а `printer.gcode.action_respond_error()` на `action_raise_error()`.

source: 20200809: The menu system has been rewritten. If the menu has been customized then it will be necessary to update to the new configuration. See config/example-menu.cfg for configuration details and see klippy/extras/display/menu.cfg for examples.
ru: 20200809: Система меню была переписана. Если меню было настроено, то его необходимо обновить до новой конфигурации. Подробности конфигурации смотрите в config/example-menu.cfg, а примеры - в klippy/extras/display/menu.cfg.

source: 20200731: The behavior of the `progress` attribute reported by the `virtual_sdcard` printer object has changed. Progress is no longer reset to 0 when a print is paused. It will now always report progress based on the internal file position, or 0 if no file is currently loaded.
ru: 20200731: Поведение атрибута `прогресс`, сообщаемого объектом принтера `virtual_sdcard`, изменилось. Прогресс больше не сбрасывается в 0, когда печать приостанавливается. Теперь он всегда будет сообщать о прогрессе, основываясь на внутренней позиции файла, или 0, если ни один файл в данный момент не загружен.

source: 20200725: The servo `enable` config parameter and the SET_SERVO `ENABLE` parameter have been removed. Update any macros to use `SET_SERVO SERVO=my_servo WIDTH=0` to disable a servo.
ru: 20200725: Параметр конфигурации серво `включить` и параметр SET_SERVO `включить` были удалены. Обновите все макросы, чтобы использовать `SET_SERVO SERVO=my_servo WIDTH=0` для отключения сервопривода.

source: 20200608: The LCD display support has changed the name of some internal "glyphs". If a custom display layout was implemented it may be necessary to update to the latest glyph names (see klippy/extras/display/display.cfg for a list of available glyphs).
ru: 20200608: Поддержка ЖК-дисплеев изменила названия некоторых внутренних "глифов". Если была реализована пользовательская раскладка дисплея, может потребоваться обновление до последних названий глифов (список доступных глифов см. в klippy/extras/display/display.cfg).

source: 20200606: The pin names on linux mcu have changed. Pins now have names of the form `gpiochip<chipid>/gpio<gpio>`. For gpiochip0 you can also use a short `gpio<gpio>`. For example, what was previously referred to as `P20` now becomes `gpio20` or `gpiochip0/gpio20`.
ru: 20200606: Имена пинов в linux mcu изменились. Теперь пины имеют имена вида `gpiochip<chipid>/gpio<gpio>`. Для gpiochip0 можно также использовать короткое `gpio<gpio>`. Например, то, что раньше называлось `P20`, теперь становится `gpio20` или `gpiochip0/gpio20`.

source: 20200603: The default 16x4 LCD layout will no longer show the estimated time remaining in a print. (Only the elapsed time will be shown.) If the old behavior is desired one can customize the menu display with that information (see the description of display_data in config/example-extras.cfg for details).
ru: 20200603: На ЖК-дисплее 16x4, установленном по умолчанию, больше не будет отображаться предполагаемое время, оставшееся до конца печати. (Будет отображаться только прошедшее время). Если вы хотите сохранить прежнее поведение, вы можете настроить отображение этой информации в меню (см. описание display_data в config/example-extras.cfg).

source: 20200531: The default USB vendor/product id is now 0x1d50/0x614e. These new ids are reserved for Klipper (thanks to the openmoko project). This change should not require any config changes, but the new ids may appear in system logs.
ru: 20200531: Идентификатор производителя/продукта USB по умолчанию теперь равен 0x1d50/0x614e. Эти новые идентификаторы зарезервированы для Klipper (спасибо проекту openmoko). Это изменение не потребует никаких изменений в конфигурации, но новые идентификаторы могут появиться в системных журналах.

source: 20200524: The default value for the tmc5160 pwm_freq field is now zero (instead of one).
ru: 20200524: Значение по умолчанию для поля tmc5160 pwm_freq теперь равно нулю (вместо единицы).

source: 20200425: The gcode_macro command template variable `printer.heater` was renamed to `printer.heaters`.
ru: 20200425: Переменная шаблона команды gcode_macro `printer.heater` была переименована в `printer.heaters`.

source: 20200313: The default lcd layout for multi-extruder printers with a 16x4 screen has changed. The single extruder screen layout is now the default and it will show the currently active extruder. To use the previous display layout set "display_group: _multiextruder_16x4" in the [display] section of the printer.cfg file.
ru: 20200313: Расположение экрана по умолчанию для многоэкструдерных принтеров с экраном 16x4 изменилось. Теперь по умолчанию используется раскладка экрана для одного экструдера, на котором будет отображаться активный в данный момент экструдер. Чтобы использовать предыдущую раскладку экрана, установите "display_group: _multiextruder_16x4" в разделе [display] файла printer.cfg.

source: 20200308: The default `__test` menu item was removed. If the config file has a custom menu then be sure to remove all references to this `__test` menu item.
ru: 20200308: Пункт меню по умолчанию `__test` был удален. Если в конфигурационном файле есть пользовательское меню, то обязательно удалите все ссылки на этот пункт меню `__test`.

source: 20200308: The menu "deck" and "card" options were removed. To customize the layout of an lcd screen use the new display_data config sections (see config/example-extras.cfg for the details).
ru: 20200308: Опции меню "колода" и "карта" были удалены. Для настройки расположения lcd-экрана используйте новые секции конфига display_data (подробности смотрите в config/example-extras.cfg).

source: 20200109: The bed_mesh module now references the probe's location in for the mesh configuration. As such, some configuration options have been renamed to more accurately reflect their intended functionality. For rectangular beds, `min_point` and `max_point` have been renamed to `mesh_min` and `mesh_max` respectively. For round beds, `bed_radius` has been renamed to `mesh_radius`. A new `mesh_origin` option has also been added for round beds. Note that these changes are also incompatible with previously saved mesh profiles. If an incompatible profile is detected it will be ignored and scheduled for removal. The removal process can be completed by issuing the SAVE_CONFIG command. The user will need to re-calibrate each profile.
ru: 20200109: Модуль bed_mesh теперь ссылается на местоположение зонда в конфигурации сетки. В связи с этим некоторые параметры конфигурации были переименованы, чтобы более точно отразить их предполагаемую функциональность. Для прямоугольных кроватей `min_point` и `max_point` были переименованы в `mesh_min` и `mesh_max` соответственно. Для круглых кроватей `bed_radius` был переименован в `mesh_radius`. Для круглых кроватей также добавлена новая опция `mesh_origin`. Обратите внимание, что эти изменения также несовместимы с ранее сохраненными профилями сетки. Если обнаружен несовместимый профиль, он будет проигнорирован и запланирован для удаления. Процесс удаления можно завершить, выполнив команду SAVE_CONFIG. Пользователю необходимо будет заново откалибровать каждый профиль.

source: 20191218: The display config section no longer supports "lcd_type: st7567". Use the "uc1701" display type instead - set "lcd_type: uc1701" and change the "rs_pin: some_pin" to "rst_pin: some_pin". It may also be necessary to add a "contrast: 60" config setting.
ru: 20191218: Раздел конфигурации дисплея больше не поддерживает "lcd_type: st7567". Вместо этого используйте тип дисплея "uc1701" - установите "lcd_type: uc1701" и измените "rs_pin: some_pin" на "rst_pin: some_pin". Также может потребоваться добавить настройку "контрастность: 60".

source: 20191210: The builtin T0, T1, T2, ... commands have been removed. The extruder activate_gcode and deactivate_gcode config options have been removed. If these commands (and scripts) are needed then define individual [gcode_macro T0] style macros that call the ACTIVATE_EXTRUDER command. See the config/sample-idex.cfg and sample-multi-extruder.cfg files for examples.
ru: 20191210: Встроенные команды T0, T1, T2, ... были удалены. Опции конфигурации экструдера activate_gcode и deactivate_gcode были удалены. Если эти команды (и скрипты) необходимы, определите отдельные макросы в стиле [gcode_macro T0], вызывающие команду ACTIVATE_EXTRUDER. Примеры смотрите в файлах config/sample-idex.cfg и sample-multi-extruder.cfg.

source: 20191210: Support for the M206 command has been removed. Replace with calls to SET_GCODE_OFFSET. If support for M206 is needed, add a [gcode_macro M206] config section that calls SET_GCODE_OFFSET. (For example "SET_GCODE_OFFSET Z=-{params.Z}".)
ru: 20191210: Поддержка команды M206 была удалена. Заменена на вызов SET_GCODE_OFFSET. Если поддержка M206 необходима, добавьте секцию конфигурации [gcode_macro M206], которая вызывает SET_GCODE_OFFSET. (Например, "SET_GCODE_OFFSET Z=-{параметры.Z}")

source: 20191202: Support for the undocumented "S" parameter of the "G4" command has been removed. Replace any occurrences of S with the standard "P" parameter (the delay specified in milliseconds).
ru: 20191202: Поддержка недокументированного параметра "S" команды "G4" была удалена. Замените все вхождения S на стандартный параметр "P" (задержка, указанная в миллисекундах).

source: 20191126: The USB names have changed on micro-controllers with native USB support. They now use a unique chip id by default (where available). If an "mcu" config section uses a "serial" setting that starts with "/dev/serial/by-id/" then it may be necessary to update the config. Run "ls /dev/serial/by-id/*" in an ssh terminal to determine the new id.
ru: 20191126: В микроконтроллерах со встроенной поддержкой USB изменились названия USB. Теперь они по умолчанию используют уникальный идентификатор чипа (там, где он доступен). Если в разделе конфигурации "mcu" используется параметр "серийный", который начинается с "/dev/serial/by-id/", то, возможно, необходимо обновить конфигурацию. Выполните команду "ls /dev/serial/by-id/*" в ssh-терминале, чтобы определить новый идентификатор.

source: 20191121: The pressure_advance_lookahead_time parameter has been removed. See example.cfg for alternate configuration settings.
ru: 20191121: Параметр pressure_advance_lookahead_time был удален. Альтернативные параметры конфигурации смотрите в файле example.cfg.

source: 20191112: The tmc stepper driver virtual enable capability is now automatically enabled if the stepper does not have a dedicated stepper enable pin. Remove references to tmcXXXX:virtual_enable from the config. The ability to control multiple pins in the stepper enable_pin config has been removed. If multiple pins are needed then use a multi_pin config section.
ru: 20191112: Возможность виртуального включения драйвера степпера tmc теперь включается автоматически, если степпер не имеет специального вывода включения степпера. Удалите из конфигурации ссылки на tmcXXXX:virtual_enable. Возможность управления несколькими контактами в конфигурации stepper enable_pin была удалена. Если требуется несколько выводов, используйте секцию конфига multi_pin.

source: 20191107: The primary extruder config section must be specified as "extruder" and may no longer be specified as "extruder0". Gcode command templates that query the extruder status are now accessed via "{printer.extruder}".
ru: 20191107: Раздел конфигурации первичного экструдера должен быть указан как " экструдер" и больше не может быть указан как " экструдер0". Шаблоны команд Gcode, запрашивающие статус экструдера, теперь доступны через "{printer.extruder}".

source: 20191021: Klipper v0.8.0 released
ru: 20191021: Выпущена версия Klipper v0.8.0

source: 20191003: The move_to_previous option in [safe_z_homing] now defaults to False. (It was effectively False prior to 20190918.)
ru: 20191003: Опция move_to_previous в [safe_z_homing] теперь по умолчанию имеет значение False. (До 20190918 она была фактически False)

source: 20190918: The zhop option in [safe_z_homing] is always re-applied after Z axis homing completed. This might need users to update custom scripts based on this module.
ru: 20190918: Опция zhop в [safe_z_homing] всегда применяется повторно после завершения наведения по оси Z. Это может потребовать от пользователей обновления пользовательских скриптов, основанных на этом модуле.

source: 20190806: The SET_NEOPIXEL command has been renamed to SET_LED.
ru: 20190806: Команда SET_NEOPIXEL была переименована в SET_LED.

source: 20190726: The mcp4728 digital-to-analog code has changed. The default i2c_address is now 0x60 and the voltage reference is now relative to the mcp4728's internal 2.048 volt reference.
ru: 20190726: Цифро-аналоговый код mcp4728 изменился. По умолчанию i2c_address теперь 0x60, а опорное напряжение теперь относительно внутреннего опорного напряжения mcp4728 2.048 вольт.

source: 20190710: The z_hop option was removed from the [firmware_retract] config section. The z_hop support was incomplete and could cause incorrect behavior with several common slicers.
ru: 20190710: Опция z_hop была удалена из раздела конфигурации [firmware_retract]. Поддержка z_hop была неполной и могла привести к некорректному поведению с несколькими распространенными слайсерами.

source: 20190710: The optional parameters of the PROBE_ACCURACY command have changed. It may be necessary to update any macros or scripts that use that command.
ru: 20190710: Необязательные параметры команды PROBE_ACCURACY изменились. Возможно, потребуется обновить все макросы или сценарии, использующие эту команду.
