Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Changes.po
Languages: ru

source: 20190607: The "variable_X" parameters of gcode_macro (along with the VALUE parameter of SET_GCODE_VARIABLE) are now parsed as Python literals. If a value needs to be assigned a string then wrap the value in quotes so that it is evaluated as a string.
ru: 20190607: Параметры "variable_X" в gcode_macro (а также параметр VALUE в SET_GCODE_VARIABLE) теперь анализируются как литералы Python. Если значению нужно присвоить строку, оберните его в кавычки, чтобы оно было оценено как строка.

source: 20190606: The "samples", "samples_result", and "sample_retract_dist" config options have been moved to the "probe" config section. These options are no longer supported in the "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt", or "quad_gantry_level" config sections.
ru: 20190606: Опции конфигурации " образцы", " samples_result" и " sample_retract_dist" были перемещены в раздел конфигурации "probe". Эти опции больше не поддерживаются в секциях конфигурации "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt" или "quad_gantry_level".

source: 20190528: The magic "status" variable in gcode_macro template evaluation has been renamed to "printer".
ru: 20190528: Магическая переменная "status" в оценке шаблона gcode_macro была переименована в "printer".

source: 20190520: The SET_GCODE_OFFSET command has changed; update any g-code macros accordingly. The command will no longer apply the requested offset to the next G1 command. The old behavior may be approximated by using the new "MOVE=1" parameter.
ru: 20190520: Команда SET_GCODE_OFFSET изменилась; обновите все макросы g-кода соответствующим образом. Команда больше не будет применять запрошенное смещение к следующей команде G1. Прежнее поведение можно приблизить, используя новый параметр "MOVE=1".

source: 20190404: The Python host software packages were updated. Users will need to rerun the ~/klipper/scripts/install-octopi.sh script (or otherwise upgrade the python dependencies if not using a standard OctoPi installation).
ru: 20190404: Обновлены пакеты хост-программ Python. Пользователям необходимо повторно запустить скрипт ~/klipper/scripts/install-octopi.sh (или иным образом обновить зависимости python, если не используется стандартная установка OctoPi).

source: 20190404: The i2c_bus and spi_bus parameters (in various config sections) now take a bus name instead of a number.
ru: 20190404: Параметры i2c_bus и spi_bus (в различных разделах конфигурации) теперь принимают имя шины, а не номер.

source: 20190404: The sx1509 config parameters have changed. The 'address' parameter is now 'i2c_address' and it must be specified as a decimal number. Where 0x3E was previously used, specify 62.
ru: 20190404: Параметры конфигурации sx1509 изменились. Параметр 'address' теперь 'i2c_address' и должен быть указан в виде десятичного числа. Там, где раньше использовалось 0x3E, теперь указывается 62.

source: 20190328: The min_speed value in [temperature_fan] config will now be respected and the fan will always run at this speed or higher in PID mode.
ru: 20190328: Значение min_speed в конфигурации [temperature_fan] теперь будет соблюдаться, и вентилятор всегда будет работать на этой скорости или выше в режиме PID.

source: 20190322: The default value for "driver_HEND" in [tmc2660] config sections was changed from 6 to 3. The "driver_VSENSE" field was removed (it is now automatically calculated from run_current).
ru: 20190322: Значение по умолчанию для "driver_HEND" в секциях конфигурации [tmc2660] было изменено с 6 на 3. Поле "driver_VSENSE" было удалено (теперь оно автоматически вычисляется из run_current).

source: 20190310: The [controller_fan] config section now always takes a name (such as [controller_fan my_controller_fan]).
ru: 20190310: Секция конфигурации [controller_fan] теперь всегда принимает имя (например, [controller_fan my_controller_fan]).

source: 20190308: The "driver_BLANK_TIME_SELECT" field in [tmc2130] and [tmc2208] config sections has been renamed to "driver_TBL".
ru: 20190308: Поле "driver_BLANK_TIME_SELECT" в разделах конфигурации [tmc2130] и [tmc2208] было переименовано в "driver_TBL".

source: 20190308: The [tmc2660] config section has changed. A new sense_resistor config parameter must now be provided. The meaning of several of the driver_XXX parameters has changed.
ru: 20190308: Раздел конфигурации [tmc2660] изменился. Теперь необходимо указывать новый параметр конфигурации sense_resistor. Изменилось значение нескольких параметров driver_XXX.

source: 20190228: Users of SPI or I2C on SAMD21 boards must now specify the bus pins via a [samd_sercom] config section.
ru: 20190228: Пользователи SPI или I2C на платах SAMD21 теперь должны указывать выводы шины в секции конфигурации [samd_sercom].

source: 20190224: The bed_shape option has been removed from bed_mesh. The radius option has been renamed to bed_radius. Users with round beds should supply the bed_radius and round_probe_count options.
ru: 20190224: Опция bed_shape была удалена из bed_mesh. Опция radius была переименована в bed_radius. Пользователи с круглыми кроватями должны указать параметры bed_radius и round_probe_count.

source: 20190107: The i2c_address parameter in the mcp4451 config section changed. This is a common setting on Smoothieboards. The new value is half the old value (88 should be changed to 44, and 90 should be changed to 45).
ru: 20190107: Изменен параметр i2c_address в разделе конфигурации mcp4451. Это обычная настройка для плат Smoothieboards. Новое значение в два раза меньше старого (88 должно быть заменено на 44, а 90 - на 45).

source: 20181220: Klipper v0.7.0 released
ru: 20181220: Выпущена версия Klipper v0.7.0

source: 20210703: A `samd_sercom` config section must now specify the sercom bus it is configuring via the `sercom` option.
ru: 20210703: Секция конфигурации `samd_sercom` теперь должна указывать шину sercom, которую она конфигурирует, с помощью опции `sercom`.

source: 20210720: A controller_fan section now monitors all stepper motors by default (not just the kinematic stepper motors). If the previous behavior is desired, see the `stepper` config option in the [config reference](Config_Reference.md#controller_fan).
ru: 20210720: Секция controller_fan теперь по умолчанию контролирует все шаговые двигатели (а не только кинематические шаговые двигатели). Если требуется прежнее поведение, см. опцию конфигурации `stepper` в [ссылке на конфигурацию](Config_Reference.md#controller_fan).

source: Configuration Changes
ru: Изменения конфигурации

source: 20210819: In some cases, a `G28` homing move may end in a position that is nominally outside the valid movement range. In rare situations this may result in confusing "Move out of range" errors after homing. If this occurs, change your start scripts to move the toolhead to a valid position immediately after homing.
ru: 20210819: В некоторых случаях ход наведения `G28` может закончиться в позиции, которая номинально находится за пределами допустимого диапазона движения. В редких случаях это может привести к запутанным ошибкам "Move out of range" после наведения. Если это происходит, измените скрипты запуска, чтобы переместить инструментальную головку в допустимую позицию сразу после наведения.

source: 20210814: The analog only pseudo-pins on the atmega168 and atmega328 have been renamed from PE0/PE1 to PE2/PE3.
ru: 20210814: Аналоговые псевдоконтакты atmega168 и atmega328 были переименованы из PE0/PE1 в PE2/PE3.

source: 20210903: The default [`smooth_time`](Config_Reference.md#extruder) for heaters has changed to 1 second (from 2 seconds). For most printers this will result in more stable temperature control.
ru: 20210903: Значение по умолчанию [`smooth_time`](Config_Reference.md#extruder) для нагревателей изменилось на 1 секунду (с 2 секунд). Для большинства принтеров это приведет к более стабильному контролю температуры.

source: 20210830: The default adxl345 name is now "adxl345". The default CHIP parameter for the `ACCELEROMETER_MEASURE` and `ACCELEROMETER_QUERY` is now also "adxl345".
ru: 20210830: Имя adxl345 по умолчанию теперь "adxl345". Параметр CHIP по умолчанию для `ACCELEROMETER_MEASURE` и `ACCELEROMETER_QUERY` теперь также "adxl345".

source: 20210830: The adxl345 ACCELEROMETER_MEASURE command no longer supports a RATE parameter. To alter the query rate, update the printer.cfg file and issue a RESTART command.
ru: 20210830: Команда adxl345 ACCELEROMETER_MEASURE больше не поддерживает параметр RATE. Чтобы изменить скорость запроса, обновите файл printer.cfg и выполните команду RESTART.

source: 20210821: Several config settings in `printer.configfile.settings` will now be reported as lists instead of raw strings. If the actual raw string is desired, use `printer.configfile.config` instead.
ru: 20210821: Некоторые параметры конфигурации в `printer.configfile.settings` теперь будут отображаться в виде списков, а не необработанных строк. Если требуется фактическая необработанная строка, используйте вместо нее `printer.configfile.config`.

source: 20211110: The "NTC 100K beta 3950" temperature sensor is deprecated. This sensor will be removed in the near future. Most users will find the "Generic 3950" temperature sensor more accurate. To continue to use the older (typically less accurate) definition, define a custom [thermistor](Config_Reference.md#thermistor) with `temperature1: 25`, `resistance1: 100000`, and `beta: 3950`.
ru: 20211110: Датчик температуры "NTC 100K beta 3950" устарел. Этот датчик будет удален в ближайшем будущем. Большинство пользователей сочтут температурный датчик "Generic 3950" более точным. Чтобы продолжать использовать старое (обычно менее точное) определение, определите пользовательский [термистор](Config_Reference.md#thermistor) с `temperature1: 25`, `resistance1: 100000` и `beta: 3950`.

source: 20211102: Several deprecated features have been removed. The stepper `step_distance` option has been removed (deprecated on 20201222). The `rpi_temperature` sensor alias has been removed (deprecated on 20210219). The mcu `pin_map` option has been removed (deprecated on 20210325). The gcode_macro `default_parameter_<name>` and macro access to command parameters other than via the `params` pseudo-variable has been removed (deprecated on 20210503). The heater `pid_integral_max` option has been removed (deprecated on 20210612).
ru: 20211102: Несколько устаревших функций были удалены. Опция шага `step_distance` была удалена (устарела на 20201222). Псевдоним датчика `rpi_temperature` был удален (устарел на 20210219). Опция mcu `pin_map` была удалена (устарела на 20210325). Опция gcode_macro `default_parameter_<name>` и доступ макроса к параметрам команды, отличным от псевдопеременной `params`, удалены (deprecated on 20210503). Опция heater `pid_integral_max` удалена (deprecated on 20210612).

source: 20210929: Klipper v0.10.0 released.
ru: 20210929: Выпущена версия Klipper v0.10.0.

source: 20210503: The gcode_macro `default_parameter_<name>` config option is deprecated. Use the `params` pseudo-variable to access macro parameters. Other methods for accessing macro parameters will be removed in the near future. Most users can replace a `default_parameter_NAME: VALUE` config option with a line like the following in the start of the macro: ` {% set NAME = params.NAME|default(VALUE)|float %}`. See the [Command Templates document](Command_Templates.md#macro-parameters) for examples.
ru: 20210503: Опция конфигурации gcode_macro `default_parameter_<name>` устарела. Для доступа к параметрам макроса используйте псевдопеременную `params`. Другие методы доступа к параметрам макросов будут удалены в ближайшем будущем. Большинство пользователей могут заменить параметр `default_parameter_NAME: VALUE` в начале макроса строкой, подобной следующей: ` {% set NAME = params.NAME|default(VALUE)|float %}`. Примеры см. в документе [Шаблоны команд](Command_Templates.md#macro-parameters).

source: 20190628: All configuration options have been removed from the [skew_correction] section. Configuration for skew_correction is now done via the SET_SKEW gcode. See [Skew Correction](Skew_Correction.md) for recommended usage.
ru: 20190628: Из секции [skew_correction] были удалены все опции конфигурации. Конфигурация для skew_correction теперь выполняется через gcode SET_SKEW. Рекомендации по использованию см. в разделе [Skew Correction](Skew_Correction.md).

source: 20211104: The "step pulse duration" option in "make menuconfig" has been removed. The default step duration for TMC drivers configured in UART or SPI mode is now 100ns. A new `step_pulse_duration` setting in the [stepper config section](Config_Reference.md#stepper) should be set for all steppers that need a custom pulse duration.
ru: 20211104: Опция "длительность импульса шага" в "make menuconfig" была удалена. Длительность шага по умолчанию для драйверов TMC, сконфигурированных в режиме UART или SPI, теперь составляет 100ns. Новый параметр `step_pulse_duration` в разделе [stepper config](Config_Reference.md#stepper) должен быть установлен для всех степперов, которым требуется пользовательская длительность импульса.

source: 20220116: The tmc2130, tmc2208, tmc2209, and tmc2660 `run_current` calculation code has changed. For some `run_current` settings the drivers may now be configured differently. This new configuration should be more accurate, but it may invalidate previous tmc driver tuning.
ru: 20220116: Изменился код расчета `run_current` в драйверах tmc2130, tmc2208, tmc2209 и tmc2660. Для некоторых параметров `run_current` драйверы теперь могут быть настроены по-другому. Новая конфигурация должна быть более точной, но она может аннулировать предыдущую настройку драйверов tmc.

source: 20211230: Scripts to tune input shaper (`scripts/calibrate_shaper.py` and `scripts/graph_accelerometer.py`) were migrated to use Python3 by default. As a result, users must install Python3 versions of certain packages (e.g. `sudo apt install python3-numpy python3-matplotlib`) to continue using these scripts. For more details, refer to [Software installation](Measuring_Resonances.md#software-installation). Alternatively, users can temporarily force the execution of these scripts under Python 2 by explicitly calling Python2 interpretor in the console: `python2 ~/klipper/scripts/calibrate_shaper.py ...`
ru: 20211230: Скрипты для настройки входного формирователя (`scripts/calibrate_shaper.py` и `scripts/graph_accelerometer.py`) были переведены на использование Python3 по умолчанию. В результате пользователи должны установить Python3-версии некоторых пакетов (например, `sudo apt install python3-numpy python3-matplotlib`), чтобы продолжить использовать эти скрипты. Более подробная информация приведена в разделе [Установка программного обеспечения](Measuring_Resonances.md#software-installation). Кроме того, пользователи могут временно принудительно запустить выполнение этих скриптов под Python 2, явно вызвав интерпретатор Python2 в консоли: `python2 ~/klipper/scripts/calibrate_shaper.py ...`

source: 20220210: The `SYNC_STEPPER_TO_EXTRUDER` command is deprecated; the `SET_EXTRUDER_STEP_DISTANCE` command is deprecated; the [extruder](Config_Reference.md#extruder) `shared_heater` config option is deprecated. These features will be removed in the near future. Replace `SET_EXTRUDER_STEP_DISTANCE` with `SET_EXTRUDER_ROTATION_DISTANCE`. Replace `SYNC_STEPPER_TO_EXTRUDER` with `SYNC_EXTRUDER_MOTION`. Replace extruder config sections using `shared_heater` with [extruder_stepper](Config_Reference.md#extruder_stepper) config sections and update any activation macros to use [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).
ru: 20220210: Команда `SYNC_STEPPER_TO_EXTRUDER` устарела; команда `SET_EXTRUDER_STEP_DISTANCE` устарела; опция конфигурации [extruder](Config_Reference.md#extruder) `shared_heater` устарела. Эти функции будут удалены в ближайшем будущем. Замените `SET_EXTRUDER_STEP_DISTANCE` на `SET_EXTRUDER_ROTATION_DISTANCE`. Замените `SYNC_STEPPER_TO_EXTRUDER` на `SYNC_EXTRUDER_MOTION`. Замените секции конфигурации экструдера, использующие `shared_heater`, на секции конфигурации [extruder_stepper](Config_Reference.md#extruder_stepper) и обновите все макросы активации для использования [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).

source: 20220304: There is no longer a default for the `extruder` parameter of [extruder_stepper](Config_Reference.md#extruder_stepper) config sections. If desired, specify `extruder: extruder` explicitly to associate the stepper motor with the "extruder" motion queue at startup.
ru: 20220304: Больше нет значения по умолчанию для параметра `extruder` в секциях конфигурации [extruder_stepper](Config_Reference.md#extruder_stepper). При желании укажите `extruder: extruder` явно, чтобы при запуске связать шаговый двигатель с очередью движения " экструдер".

source: 20220307: `M73` will no longer set print progress to 0 if `P` is missing.
ru: 20220307: `M73` больше не будет устанавливать прогресс печати на 0, если отсутствует `P`.

source: 20220407: The temperature_fan `pid_integral_max` config option has been removed (it was deprecated on 20210612).
ru: 20220407: Опция конфигурации temperature_fan `pid_integral_max` была удалена (она была устаревшей на 20210612).

source: 20220407: The default color order for pca9632 LEDs is now "RGBW". Add an explicit `color_order: RBGW` setting to the pca9632 config section to obtain the previous behavior.
ru: 20220407: Порядок цветов по умолчанию для светодиодов pca9632 теперь "RGBW". Добавьте явную настройку `color_order: RBGW` в секцию конфигурации pca9632, чтобы получить прежнее поведение.

source: 20220330: The format of the `printer.neopixel.color_data` status information for neopixel and dotstar modules has changed. The information is now stored as a list of color lists (instead of a list of dictionaries). See the [status reference](Status_Reference.md#led) for details.
ru: 20220330: Изменился формат информации о состоянии `printer.neopixel.color_data` для модулей neopixel и dotstar. Теперь информация хранится в виде списка списков цветов (вместо списка словарей). Подробности см. в [ссылке на статус](Status_Reference.md#led).

source: 20220616: It was previously possible to flash an rp2040 in bootloader mode by running `make flash FLASH_DEVICE=first`. The equivalent command is now `make flash FLASH_DEVICE=2e8a:0003`.
ru: 20220616: Ранее можно было прошить rp2040 в режиме загрузчика, выполнив команду `make flash FLASH_DEVICE=first`. Теперь эквивалентной командой является `make flash FLASH_DEVICE=2e8a:0003`.

source: 20220612: The rp2040 micro-controller now has a workaround for the "rp2040-e5" USB errata. This should make initial USB connections more reliable. However, it may result in a change in behavior for the gpio15 pin. It is unlikely the gpio15 behavior change will be noticeable.
ru: 20220612: Микроконтроллер rp2040 теперь имеет обходное решение для ошибки USB "rp2040-e5". Это должно сделать первые USB-соединения более надежными. Однако это может привести к изменению поведения вывода gpio15. Маловероятно, что изменение поведения gpio15 будет заметным.

source: 20221122: Previously, with safe_z_home, it was possible that the z_hop after the g28 homing would go in the negative z direction. Now, a z_hop is performed after g28 only if it results in a positive hop, mirroring the behavior of the z_hop that occurs before the g28 homing.
ru: 20221122: Ранее, при использовании safe_z_home, было возможно, что z_hop после наведения g28 пойдет в отрицательном направлении z. Теперь z_hop выполняется после g28 только в том случае, если он приводит к положительному прыжку, что отражает поведение z_hop, который происходит перед наведением g28.

source: 20230201: The `[bed_mesh]` module no longer loads the `default` profile on startup. It is recommended that users who use the `default` profile add `BED_MESH_PROFILE LOAD=default` to their `START_PRINT` macro (or to their slicer's "Start G-Code" configuration when applicable).
ru: 20230201: Модуль `[bed_mesh]` больше не загружает профиль `default` при запуске. Пользователям, использующим профиль `default`, рекомендуется добавить `BED_MESH_PROFILE LOAD=default` в макрос `START_PRINT` (или в конфигурацию "Start G-Code" своего слайсера, если это применимо).

source: 20230103: It is now possible with the flash-sdcard.sh script to flash both variants of the Bigtreetech SKR-2, STM32F407 and STM32F429. This means that the original tag of btt-skr2 now has changed to either btt-skr-2-f407 or btt-skr-2-f429.
ru: 20230103: Теперь с помощью скрипта flash-sdcard.sh можно прошить оба варианта Bigtreetech SKR-2, STM32F407 и STM32F429. Это означает, что оригинальный тег btt-skr2 теперь изменился на btt-skr-2-f407 или btt-skr-2-f429.

source: 20221128: Klipper v0.11.0 released.
ru: 20221128: Выпущена версия Klipper v0.11.0.

source: 20230304: The `SET_TMC_CURRENT` command now properly adjusts the globalscaler register for drivers that have it. This removes a limitation where on tmc5160, the currents could not be raised higher with `SET_TMC_CURRENT` than the `run_current` value set in the config file. However, this has a side effect: After running `SET_TMC_CURRENT`, the stepper must be held at standstill for >130ms in case StealthChop2 is used so that the AT#1 calibration gets executed by the driver.
ru: 20230304: Команда `SET_TMC_CURRENT` теперь правильно настраивает регистр глобального скейлера для драйверов, у которых он есть. Это устраняет ограничение, при котором на tmc5160 с помощью `SET_TMC_CURRENT` нельзя было поднять ток выше, чем значение `run_current`, установленное в конфигурационном файле. Однако это имеет побочный эффект: После выполнения `SET_TMC_CURRENT` шаговик должен находиться в состоянии покоя в течение >130 мс в случае использования StealthChop2, чтобы драйвер выполнил калибровку AT#1.

source: 20230202: The format of the `printer.screws_tilt_adjust` status information has changed. The information is now stored as a dictionary of screws with the resulting measurements. See the [status reference](Status_Reference.md#screws_tilt_adjust) for details.
ru: 20230202: Формат информации о состоянии `printer.screws_tilt_adjust` изменился. Теперь информация хранится в виде словаря винтов с полученными измерениями. Подробности см. в [ссылке на статус](Status_Reference.md#screws_tilt_adjust).

source: 20230826: If `safe_distance` is set or calculated to be 0 in `[dual_carriage]`, the carriages proximity checks will be disabled as per documentation. A user may wish to configure `safe_distance` explicitly to prevent accidental crashes of the carriages with each other. Additionally, the homing order of the primary and the dual carriage is changed in some configurations (certain configurations when both carriages home in the same direction, see [[dual_carriage] configuration reference](./Config_Reference.md#dual_carriage) for more details).
ru: 20230826: Если в `[dual_carriage]` задано или вычислено значение 0 в `[dual_carriage]`, проверка близости кареток будет отключена согласно документации. Пользователь может захотеть настроить `safe_distance явно, чтобы предотвратить случайные столкновения кареток друг с другом. Кроме того, в некоторых конфигурациях изменяется порядок движения основной и сдвоенной каретки (в некоторых конфигурациях обе каретки движутся в одном направлении, подробнее см. в [[Ссылка на конфигурацию dual_carriage]](./Config_Reference.md#dual_carriage)).
