Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [gcode_macro my_cmd] #gcode: # A list of G-Code commands to execute in place of "my_cmd". See # docs/Command_Templates.md for G-Code format. This parameter must # be provided. #variable_<name>: # One may specify any number of options with a "variable_" prefix. # The given variable name will be assigned the given value (parsed # as a Python literal) and will be available during macro expansion. # For example, a config with "variable_fan_speed = 75" might have # gcode commands containing "M106 S{ fan_speed * 255 }". Variables # can be changed at run-time using the SET_GCODE_VARIABLE command # (see docs/Command_Templates.md for details). Variable names may # not use upper case characters. #rename_existing: # This option will cause the macro to override an existing G-Code # command and provide the previous definition of the command via the # name provided here. This can be used to override builtin G-Code # commands. Care should be taken when overriding commands as it can # cause complex and unexpected results. The default is to not # override an existing G-Code command. #description: G-Code macro # This will add a short description used at the HELP command or while # using the auto completion feature. Default "G-Code macro"
uk: [gcode_macro my_cmd] #gcode: Список команд G-Code для виконання замість "my_cmd". див docs/Command_Templates.md для формату G-Code. Цей параметр повинен бути надано. #variable_ : Можна вказати будь-яку кількість параметрів із префіксом "variable_". Даному імені змінної буде присвоєно вказане значення (розібрано як літерал Python) і буде доступним під час розширення макросу. Наприклад, конфігурація з "variable_fan_speed = 75" може мати команди gcode, що містять "M106 S{fan_speed * 255 }". Змінні можна змінити під час виконання за допомогою команди SET_GCODE_VARIABLE (докладніше див. docs/Command_Templates.md). Імена змінних можуть не використовувати символи верхнього регістру. #rename_existing: Цей параметр призведе до того, що макрос замінить існуючий G-код команда та надайте попереднє визначення команди через Тут указано # ім’я. Це можна використовувати для заміни вбудованого G-коду команди. Слід бути обережним, перевизначаючи команди, наскільки це можливо викликають складні та несподівані результати. За замовчуванням – ні перевизначити існуючу команду G-коду. #опис: макрос G-коду Це додасть короткий опис, який використовується в команді HELP або під час за допомогою функції автозаповнення. За умовчанням "макрос G-коду"

source: [delayed_gcode my_delayed_gcode] gcode: # A list of G-Code commands to execute when the delay duration has # elapsed. G-Code templates are supported. This parameter must be # provided. #initial_duration: 0.0 # The duration of the initial delay (in seconds). If set to a # non-zero value the delayed_gcode will execute the specified number # of seconds after the printer enters the "ready" state. This can be # useful for initialization procedures or a repeating delayed_gcode. # If set to 0 the delayed_gcode will not execute on startup. # Default is 0.
uk: [delayed_gcode my_delayed_gcode] gcode: Список команд G-Code для виконання, якщо тривалість затримки має минуло. Підтримуються шаблони G-Code. Цей параметр повинен бути надано. #початкова_тривалість: 0.0 Тривалість початкової затримки (у секундах). Якщо встановлено значення a ненульове значення delayed_gcode виконає вказане число секунд після переходу принтера в стан «готовність». Це може бути корисно для процедур ініціалізації або повторюваного delayed_gcode. Якщо встановлено значення 0, delayed_gcode не виконуватиметься під час запуску. За замовчуванням 0.

source: [save_variables] filename: # Required - provide a filename that would be used to save the # variables to disk e.g. ~/variables.cfg
uk: [зберегти_змінні] ім'я файлу: # Обов'язково - вкажіть ім'я файлу, яке використовуватиметься для збереження # змінні на диск, напр. ~/variables.cfg

source: [idle_timeout] #gcode: # A list of G-Code commands to execute on an idle timeout. See # docs/Command_Templates.md for G-Code format. The default is to run # "TURN_OFF_HEATERS" and "M84". #timeout: 600 # Idle time (in seconds) to wait before running the above G-Code # commands. The default is 600 seconds.
uk: [idle_timeout] #gcode: Список команд G-коду для виконання після тайм-ауту простою. див docs/Command_Templates.md для формату G-Code. За замовчуванням запущено "TURN_OFF_HEATERS" і "M84". #тайм-аут: 600 Час простою (у секундах) перед запуском вищезазначеного G-коду команди. За замовчуванням 600 секунд.

source: [force_move] #enable_force_move: False # Set to true to enable FORCE_MOVE and SET_KINEMATIC_POSITION # extended G-Code commands. The default is false.
uk: [force_move] #enable_force_move: Помилка Установіть значення true, щоб увімкнути FORCE_MOVE і SET_KINEMATIC_POSITION розширені команди G-коду. Типовим значенням є false.

source: [pause_resume] #recover_velocity: 50. # When capture/restore is enabled, the speed at which to return to # the captured position (in mm/s). Default is 50.0 mm/s.
uk: призупинити_відновити

source: [firmware_retraction] #retract_length: 0 # The length of filament (in mm) to retract when G10 is activated, # and to unretract when G11 is activated (but see # unretract_extra_length below). The default is 0 mm. #retract_speed: 20 # The speed of retraction, in mm/s. The default is 20 mm/s. #unretract_extra_length: 0 # The length (in mm) of *additional* filament to add when # unretracting. #unretract_speed: 10 # The speed of unretraction, in mm/s. The default is 10 mm/s.
uk: [firmware_retraction] #retract_length: 0 Довжина нитки (у мм), яку потрібно втягнути, коли активовано G10, і скасувати втягування, коли G11 активовано (але див unretract_extra_length нижче). За замовчуванням 0 мм. #retract_speed: 20 Швидкість втягування, мм/с. За замовчуванням 20 мм/с. #unretract_extra_length: 0 Довжина (у мм) додаткової нитки, яку потрібно додати скасування відкликання. #unretract_speed: 10 Швидкість розвороту, мм/с. За замовчуванням 10 мм/с.

source: [gcode_arcs] #resolution: 1.0 # An arc will be split into segments. Each segment's length will # equal the resolution in mm set above. Lower values will produce a # finer arc, but also more work for your machine. Arcs smaller than # the configured value will become straight lines. The default is # 1mm.
uk: [gcode_arcs] #роздільна здатність: 1.0 Дуга буде розділена на сегменти. Довжина кожного сегмента буде дорівнює роздільній здатності в мм, встановленій вище. Менші значення дадуть a тонша дуга, але також більше роботи для вашої машини. Дуги менші за налаштоване значення стане прямими лініями. За замовчуванням 1mm.

source: [respond] #default_type: echo # Sets the default prefix of the "M118" and "RESPOND" output to one # of the following: # echo: "echo: " (This is the default) # command: "// " # error: "!! " #default_prefix: echo: # Directly sets the default prefix. If present, this value will # override the "default_type".
uk: [відповісти] #тип_за замовчуванням: луна # Встановлює префікс за замовчуванням для виходу "M118" і "RESPOND" на одиницю # з наступного: # echo: "echo: " (це за замовчуванням) # команда: "// " # помилка: "!!" #default_prefix: echo: # Безпосередньо встановлює префікс за умовчанням. Якщо присутнє, це значення буде # перевизначити "default_type".

source: [input_shaper] #shaper_freq_x: 0 # A frequency (in Hz) of the input shaper for X axis. This is # usually a resonance frequency of X axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for X axis. #shaper_freq_y: 0 # A frequency (in Hz) of the input shaper for Y axis. This is # usually a resonance frequency of Y axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for Y axis. #shaper_type: mzv # A type of the input shaper to use for both X and Y axes. Supported # shapers are zv, mzv, zvd, ei, 2hump_ei, and 3hump_ei. The default # is mzv input shaper. #shaper_type_x: #shaper_type_y: # If shaper_type is not set, these two parameters can be used to # configure different input shapers for X and Y axes. The same # values are supported as for shaper_type parameter. #damping_ratio_x: 0.1 #damping_ratio_y: 0.1 # Damping ratios of vibrations of X and Y axes used by input shapers # to improve vibration suppression. Default value is 0.1 which is a # good all-round value for most printers. In most circumstances this # parameter requires no tuning and should not be changed.
uk: [input_shaper] #shaper_freq_x: 0 Частота (у Гц) вхідного формувача для осі X. Це є зазвичай це резонансна частота осі X, яка вхідний формувач слід придушити. Для більш складних формувачів, таких як 2- та 3-горби EI формувачі вводу, цей параметр можна встановити з різних міркування. Значення за замовчуванням — 0, що вимикає введення формування для осі X. #shaper_freq_y: 0 Частота (у Гц) вхідного формувача для осі Y. Це є зазвичай це резонансна частота осі Y, що вхідний формувач слід придушити. Для більш складних формувачів, таких як 2- та 3-горби EI формувачі вводу, цей параметр можна встановити з різних міркування. Значення за замовчуванням — 0, що вимикає введення формування для осі Y. #shaper_type: mzv Тип формувача вхідних даних для використання як для осей X, так і для осей Y. Підтримується формувачами є zv, mzv, zvd, ei, 2hump_ei і 3hump_ei. За замовчуванням є формувачем вводу mzv. #shaper_type_x: #shaper_type_y: Якщо shaper_type не встановлено, можна використовувати ці два параметри налаштувати різні форми введення для осей X і Y. Те саме Підтримуються # значення параметра shaper_type. #damping_ratio_x: 0,1 #damping_ratio_y: 0,1 Коефіцієнти демпфування коливань осей X і Y, які використовуються вхідними формувачами для покращення придушення вібрації. Значення за замовчуванням становить 0,1, тобто a хороше універсальне значення для більшості принтерів. У більшості випадків це параметр не потребує налаштування та не повинен змінюватися.

source: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for the definition of the above parameters. #endstop_pin: # If an endstop_pin is defined for the additional stepper then the # stepper will home until the endstop is triggered. Otherwise, the # stepper will home until the endstop on the primary stepper for the # axis is triggered.
uk: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #мікрокроки: #rotation_distance: # Дивіться розділ «кроковий» для визначення наведених вище параметрів. #endstop_pin: # Якщо endstop_pin визначено для додаткового кроку, то # степер повертається, доки не спрацює кінцевий упор. В іншому випадку, # степпер буде повертатися до кінцевого упору на основному степпері для Спрацьовує # вісь.

source: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for a description of these parameters. #velocity: # Set the default velocity (in mm/s) for the stepper. This value # will be used if a MANUAL_STEPPER command does not specify a SPEED # parameter. The default is 5mm/s. #accel: # Set the default acceleration (in mm/s^2) for the stepper. An # acceleration of zero will result in no acceleration. This value # will be used if a MANUAL_STEPPER command does not specify an ACCEL # parameter. The default is zero. #endstop_pin: # Endstop switch detection pin. If specified, then one may perform # "homing moves" by adding a STOP_ON_ENDSTOP parameter to # MANUAL_STEPPER movement commands.
uk: [ручний_степпер мій_степпер] #step_pin: #dir_pin: #enable_pin: #мікрокроки: #rotation_distance: Опис цих параметрів див. у розділі «кроковий». #швидкість: Встановіть швидкість за замовчуванням (у мм/с) для степпера. Це значення буде використано, якщо команда MANUAL_STEPPER не визначає ШВИДКІСТЬ параметр. За замовчуванням 5 мм/с. #accel: Встановіть стандартне прискорення (у мм/с^2) для степпера. Ан прискорення нуля призведе до відсутності прискорення. Це значення буде використано, якщо команда MANUAL_STEPPER не визначає ACCEL параметр. За умовчанням дорівнює нулю. #endstop_pin: Штифт виявлення кінцевого перемикача. Якщо вказано, можна виконувати "наведення" шляхом додавання параметра STOP_ON_ENDSTOP Команди руху MANUAL_STEPPER.

source: [verify_heater heater_config_name] #max_error: 120 # The maximum "cumulative temperature error" before raising an # error. Smaller values result in stricter checking and larger # values allow for more time before an error is reported. # Specifically, the temperature is inspected once a second and if it # is close to the target temperature then an internal "error # counter" is reset; otherwise, if the temperature is below the # target range then the counter is increased by the amount the # reported temperature differs from that range. Should the counter # exceed this "max_error" then an error is raised. The default is # 120. #check_gain_time: # This controls heater verification during initial heating. Smaller # values result in stricter checking and larger values allow for # more time before an error is reported. Specifically, during # initial heating, as long as the heater increases in temperature # within this time frame (specified in seconds) then the internal # "error counter" is reset. The default is 20 seconds for extruders # and 60 seconds for heater_bed. #hysteresis: 5 # The maximum temperature difference (in Celsius) to a target # temperature that is considered in range of the target. This # controls the max_error range check. It is rare to customize this # value. The default is 5. #heating_gain: 2 # The minimum temperature (in Celsius) that the heater must increase # by during the check_gain_time check. It is rare to customize this # value. The default is 2.
uk: [verify_heater heater_config_name] #max_error: 120 # Максимальна "сукупна температурна помилка" перед підвищенням an # помилка. Менші значення призводять до суворішої перевірки, а більші # значення дозволяють пройти більше часу, перш ніж буде повідомлено про помилку. # Зокрема, температура перевіряється раз на секунду і якщо вона # близька до цільової температури, тоді внутрішня "помилка # лічильник" скидається; інакше, якщо температура нижча # діапазон цілі, тоді лічильник збільшується на величину the # зареєстрована температура відрізняється від цього діапазону. Слід лічильник # перевищує це "max_error", тоді виникає помилка. За замовчуванням # 120. #check_gain_time: # Це контролює перевірку нагрівача під час початкового нагрівання. Менший # значення призводять до суворішої перевірки та дозволяють більші значення Ще # раз до повідомлення про помилку. Зокрема, під час # початкове нагрівання, доки температура нагрівача підвищується # протягом цього періоду часу (зазначеного в секундах), а потім внутрішнього # "лічильник помилок" скинуто. За замовчуванням 20 секунд для екструдерів # і 60 секунд для heater_bed. #гістерезис: 5 # Максимальна різниця температур (у градусах Цельсія) до цілі # температура, яка вважається в діапазоні цілі. Це # контролює перевірку діапазону max_error. Це рідко можна налаштувати # значення. За замовчуванням 5. #посилення_нагріву: 2 # Мінімальна температура (у градусах Цельсія), яку має підвищити нагрівач # під час перевірки check_gain_time. Це рідко можна налаштувати # значення. За замовчуванням 2.

source: [homing_heaters] #steppers: # A comma separated list of steppers that should cause heaters to be # disabled. The default is to disable heaters for any homing/probing # move. # Typical example: stepper_z #heaters: # A comma separated list of heaters to disable during homing/probing # moves. The default is to disable all heaters. # Typical example: extruder, heater_bed
uk: [homing_heaters] #степери: Відокремлений комами список степперів, які мають викликати нагрівачі вимкнено. За замовчуванням нагрівачі вимикаються для будь-якого наведення/зондування рух. Типовий приклад: stepper_z #нагрівачі: Розділений комами список нагрівачів, які потрібно вимкнути під час наведення/зондування ходи. За замовчуванням усі нагрівачі вимкнено. Типовий приклад: екструдер, heater_bed

source: [thermistor my_thermistor] #temperature1: #resistance1: #temperature2: #resistance2: #temperature3: #resistance3: # Three resistance measurements (in Ohms) at the given temperatures # (in Celsius). The three measurements will be used to calculate the # Steinhart-Hart coefficients for the thermistor. These parameters # must be provided when using Steinhart-Hart to define the # thermistor. #beta: # Alternatively, one may define temperature1, resistance1, and beta # to define the thermistor parameters. This parameter must be # provided when using "beta" to define the thermistor.
uk: [термістор my_thermistor] #temperature1: #опір1: #temperature2: #опір2: #temperature3: #опір3: # Три вимірювання опору (в Омах) при заданих температурах # (у градусах Цельсія). Три вимірювання будуть використані для розрахунку # Коефіцієнти Штейнхарта-Харта для термістора. Ці параметри У разі використання Steinhart-Hart для визначення необхідно вказати # #термістор. #бета: # Крім того, можна визначити температуру1, опір1 та бета # для визначення параметрів термістора. Цей параметр повинен бути # надається при використанні "бета" для визначення термістора.

source: [adc_temperature my_sensor] #temperature1: #voltage1: #temperature2: #voltage2: #... # A set of temperatures (in Celsius) and voltages (in Volts) to use # as reference when converting a temperature. A heater section using # this sensor may also specify adc_voltage and voltage_offset # parameters to define the ADC voltage (see "Common temperature # amplifiers" section for details). At least two measurements must # be provided. #temperature1: #resistance1: #temperature2: #resistance2: #... # Alternatively one may specify a set of temperatures (in Celsius) # and resistance (in Ohms) to use as reference when converting a # temperature. A heater section using this sensor may also specify a # pullup_resistor parameter (see "extruder" section for details). At # least two measurements must be provided.
uk: [adc_temperature my_sensor] #temperature1: #voltage1: #temperature2: #voltage2: #... Набір температур (у градусах Цельсія) і напруг (у вольтах) для використання як еталон під час перетворення температури. Використання секції обігрівача цей датчик також може вказувати adc_voltage і voltage_offset параметри для визначення напруги АЦП (див. «Загальна температура підсилювачі" для детальної інформації). Необхідно провести принаймні два вимірювання бути надано. #temperature1: #опір1: #temperature2: #опір2: #... Крім того, можна вказати набір температур (у градусах Цельсія) і опір (в Омах) для використання в якості еталонного під час перетворення a температура. Секція нагрівача, яка використовує цей датчик, також може вказувати a параметр pullup_resistor (подробиці див. у розділі «екструдер»). на необхідно надати принаймні два вимірювання.

source: [heater_generic my_generic_heater] #gcode_id: # The id to use when reporting the temperature in the M105 command. # This parameter must be provided. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # See the "extruder" section for the definition of the above # parameters.
uk: [heater_generic my_generic_heater] #gcode_id: Ідентифікатор для використання під час повідомлення температури в команді M105. Цей параметр необхідно вказати. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: See the "extruder" section for the definition of the above параметри.

source: [temperature_sensor my_sensor] #sensor_type: #sensor_pin: #min_temp: #max_temp: # See the "extruder" section for the definition of the above # parameters. #gcode_id: # See the "heater_generic" section for the definition of this # parameter.
uk: [датчик_температури мій_сенсор] #sensor_type: #sensor_pin: #min_temp: #max_temp: # Дивіться розділ «екструдер» для визначення наведеного вище # параметри. #gcode_id: # Перегляньте розділ "heater_generic" для визначення цього # параметр.

source: sensor_type: # One of "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496", or "AD8497". sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #adc_voltage: 5.0 # The ADC comparison voltage (in Volts). The default is 5 volts. #voltage_offset: 0 # The ADC voltage offset (in Volts). The default is 0.
uk: тип_датчика: # Один із «PT100 INA826», «AD595», «AD597», «AD8494», «AD8495», # "AD8496" або "AD8497". sensor_pin: # Аналоговий вхід, підключений до датчика. Цей параметр повинен бути # надано. #adc_voltage: 5,0 # Напруга порівняння АЦП (у вольтах). За замовчуванням 5 вольт. #voltage_offset: 0 # Зсув напруги АЦП (у вольтах). За замовчуванням 0.

source: sensor_type: PT1000 sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the sensor. The # default is 4700 ohms.
uk: тип датчика: PT1000 sensor_pin: # Аналоговий вхід, підключений до датчика. Цей параметр повинен бути # надано. #pullup_resistor: 4700 # Опір (в Омах) підтягування, прикріпленого до датчика. The # за замовчуванням 4700 Ом.

source: sensor_type: # One of "MAX6675", "MAX31855", "MAX31856", or "MAX31865". sensor_pin: # The chip select line for the sensor chip. This parameter must be # provided. #spi_speed: 4000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # The above parameters control the sensor parameters of MAX31856 # chips. The defaults for each parameter are next to the parameter # name in the above list. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # The above parameters control the sensor parameters of MAX31865 # chips. The defaults for each parameter are next to the parameter # name in the above list.
uk: тип_датчика: # Один із «MAX6675», «MAX31855», «MAX31856» або «MAX31865». sensor_pin: # Лінія вибору чіпа для чіпа датчика. Цей параметр повинен бути # надано. #spi_speed: 4000000 # Швидкість SPI (у Гц), яка використовується під час обміну даними з чіпом. # За замовчуванням 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис # параметр вище. #tc_type: К #tc_use_50Hz_filter: помилка #tc_everaging_count: 1 # Наведені вище параметри керують параметрами датчика MAX31856 # фішки. Значення за замовчуванням для кожного параметра вказані поруч із параметром # ім'я у списку вище. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: помилка # Наведені вище параметри керують параметрами датчика MAX31865 # фішки. Значення за замовчуванням для кожного параметра вказані поруч із параметром # ім'я у списку вище.
