Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Changes.po
Languages: ru

source: 20230810: The flash-sdcard.sh script now supports both variants of the Bigtreetech SKR-3, STM32H743 and STM32H723. For this, the original tag of btt-skr-3 now has changed to be either btt-skr-3-h743 or btt-skr-3-h723.
ru: 20230810: Скрипт flash-sdcard.sh теперь поддерживает оба варианта Bigtreetech SKR-3, STM32H743 и STM32H723. Для этого оригинальный тег btt-skr-3 теперь изменен на btt-skr-3-h743 или btt-skr-3-h723.

source: 20230729: The exported status for `dual_carriage` is changed. Instead of exporting `mode` and `active_carriage`, the individual modes for each carriage are exported as `printer.dual_carriage.carriage_0` and `printer.dual_carriage.carriage_1`.
ru: 20230729: Изменен экспортируемый статус для `dual_carriage`. Вместо экспорта `mode` и `active_carriage`, отдельные режимы для каждой каретки экспортируются как `printer.dual_carriage.carriage_0` и `printer.dual_carriage.carriage_1`.

source: 20230619: The `relative_reference_index` option has been deprecated and superceded by the `zero_reference_position` option. Refer to the [Bed Mesh Documentation](./Bed_Mesh.md#the-deprecated-relative_reference_index) for details on how to update the configuration. With this deprecation the `RELATIVE_REFERENCE_INDEX` is no longer available as a parameter for the `BED_MESH_CALIBRATE` gcode command.
ru: 20230619: Опция `relative_reference_index` была устаревшей и заменена опцией `zero_reference_position`. Обратитесь к документации [Bed Mesh Documentation](./Bed_Mesh.md#the-deprecated-relative_reference_index) для получения подробной информации о том, как обновить конфигурацию. В связи с этим `RELATIVE_REFERENCE_INDEX` больше не доступен в качестве параметра для gcode-команды `BED_MESH_CALIBRATE`.

source: 20230530: The default canbus frequency in "make menuconfig" is now 1000000. If using canbus and using canbus with some other frequency is required, then be sure to select "Enable extra low-level configuration options" and specify the desired "CAN bus speed" in "make menuconfig" when compiling and flashing the micro-controller.
ru: 20230530: Частота canbus по умолчанию в "make menuconfig" теперь равна 1000000. Если требуется использование canbus и использование canbus с другой частотой, то обязательно выберите " Включить дополнительные низкоуровневые опции конфигурации" и укажите желаемую "Скорость шины CAN" в "make menuconfig" при компиляции и прошивке микроконтроллера.

source: 20230525: `SHAPER_CALIBRATE` command immediately applies input shaper parameters if `[input_shaper]` was enabled already.
ru: 20230525: Команда `SHAPER_CALIBRATE` немедленно применяет параметры входного шейпера, если `[input_shaper]` уже был включен.

source: 20230407: The `stalled_bytes` counter in the log and in the `printer.mcu.last_stats` field has been renamed to `upcoming_bytes`.
ru: 20230407: Счетчик `установленных_байт` в журнале и в поле `printer.mcu.last_stats` был переименован в `upcoming_bytes`.

source: 20230323: On tmc5160 drivers `multistep_filt` is now enabled by default. Set `driver_MULTISTEP_FILT: False` in the tmc5160 config for the previous behavior.
ru: 20230323: На драйверах tmc5160 `multistep_filt` теперь включен по умолчанию. Установите `driver_MULTISTEP_FILT: False` в конфигурации tmc5160 для прежнего поведения.

source: 20240313: The `max_accel_to_decel` parameter in the `[printer]` config section has been deprecated. The `ACCEL_TO_DECEL` parameter of the `SET_VELOCITY_LIMIT` command has been deprecated. The `printer.toolhead.max_accel_to_decel` status has been removed. Use the [minimum_cruise_ratio parameter](./Config_Reference.md#printer) instead. The deprecated features will be removed in the near future, and using them in the interim may result in subtly different behavior.
ru: 20240313: Параметр `max_accel_to_decel` в разделе конфигурации `[printer]` был устаревшим. Параметр `ACCEL_TO_DECEL` команды `SET_VELOCITY_LIMIT` был устаревшим. Статус `printer.toolhead.max_accel_to_decel` был удален. Вместо него используйте параметр [minimum_cruise_ratio](./Config_Reference.md#printer). Устаревшие функции будут удалены в ближайшем будущем, а их использование в это время может привести к незначительному изменению поведения.

source: 20240215: Several deprecated features have been removed. Using "NTC 100K beta 3950" as a thermistor name has been removed (deprecated on 20211110). The `SYNC_STEPPER_TO_EXTRUDER` and `SET_EXTRUDER_STEP_DISTANCE` commands have been removed, and the extruder `shared_heater` config option has been removed (deprecated on 20220210). The bed_mesh `relative_reference_index` option has been removed (deprecated on 20230619).
ru: 20240215: Удалены некоторые устаревшие функции. Использование "NTC 100K beta 3950" в качестве имени термистора было удалено (устарело на 20211110). Команды `SYNC_STEPPER_TO_EXTRUDER` и `SET_EXTRUDER_STEP_DISTANCE` были удалены, а опция конфигурации экструдера `shared_heater` была удалена (устарела на 20220210). Опция bed_mesh `relative_reference_index` была удалена (устарела на 20230619).

source: 20240123: The output_pin SET_PIN CYCLE_TIME parameter has been removed. Use the new [pwm_cycle_time](Config_Reference.md#pwm_cycle_time) module if it is necessary to dynamically change a pwm pin's cycle time.
ru: 20240123: Параметр output_pin SET_PIN CYCLE_TIME был удален. Используйте новый модуль [pwm_cycle_time](Config_Reference.md#pwm_cycle_time), если необходимо динамически изменить время цикла вывода pwm.

source: 20240123: The output_pin `maximum_mcu_duration` parameter is deprecated. Use a [pwm_tool config section](Config_Reference.md#pwm_tool) instead. The option will be removed in the near future.
ru: 20240123: Параметр output_pin `maximum_mcu_duration` устарел. Вместо него используйте секцию конфигурации [pwm_tool](Config_Reference.md#pwm_tool). Параметр будет удален в ближайшем будущем.

source: 20240123: The output_pin `static_value` parameter is deprecated. Replace with `value` and `shutdown_value` parameters. The option will be removed in the near future.
ru: 20240123: Параметр `static_value` в output_pin устарел. Замените его параметрами `значение` и `выключение_значения`. Параметр будет удален в ближайшем будущем.

source: 20231216: The `[hall_filament_width_sensor]` is changed to trigger filament runout when the thickness of the filament exceeds `max_diameter`. The maximum diameter defaults to `default_nominal_filament_diameter + max_difference`. See [[hall_filament_width_sensor] configuration reference](./Config_Reference.md#hall_filament_width_sensor) for more details.
ru: 20231216: Датчик `[hall_filament_width_sensor]` изменен таким образом, чтобы срабатывать на биение нити, когда толщина нити превышает `max_diameter`. Максимальный диаметр по умолчанию равен `default_nominal_filament_diameter + max_difference`. Дополнительные сведения см. в справочнике конфигурации [[hall_filament_width_sensor](./Config_Reference.md#hall_filament_width_sensor).

source: 20231207: Several undocumented config parameters in the `[printer]` config section have been removed (the buffer_time_low, buffer_time_high, buffer_time_start, and move_flush_time parameters).
ru: 20231207: Несколько недокументированных параметров конфигурации в разделе конфигурации `[printer]` были удалены (параметры buffer_time_low, buffer_time_high, buffer_time_start и move_flush_time).

source: 20231110: Klipper v0.12.0 released.
ru: 20231110: Выпущена версия Klipper v0.12.0.

source: 20240415: The `on_error_gcode` parameter in the `[virtual_sdcard]` config section now has a default. If this parameter is not specified it now defaults to `TURN_OFF_HEATERS`. If the previous behavior is desired (take no default action on an error during a virtual_sdcard print) then define `on_error_gcode` with an empty value.
ru: 20240415: Параметр `on_error_gcode` в секции конфигурации `[virtual_sdcard]` теперь имеет значение по умолчанию. Если этот параметр не указан, то по умолчанию теперь устанавливается значение `TURN_OFF_HEATERS`. Если требуется прежнее поведение (не предпринимать никаких действий по умолчанию при ошибке во время печати virtual_sdcard), задайте параметр `on_error_gcode` с пустым значением.
