Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: This document is a reference for options available in the Klipper config file.
uk: Цей документ є довідкою для опцій доступник у файлі конфігурації Klipper.

source: The descriptions in this document are formatted so that it is possible to cut-and-paste them into a printer config file. See the [installation document](Installation.md) for information on setting up Klipper and choosing an initial config file.
uk: Описи в цьому документі відформатовано таким чином, що їх можна вирізати та вставити у файл конфігурації принтера. Перегляньте [документ інсталяції](Installation.md) для отримання інформації щодо налаштування Klipper та вибору початкового конфігураційного файлу.

source: Micro-controller configuration
uk: Конфігурація мікроконтролера

source: Format of micro-controller pin names
uk: Формат імен контактів мікроконтролера

source: Many config options require the name of a micro-controller pin. Klipper uses the hardware names for these pins - for example `PA4`.
uk: Багато параметрів конфігурації вимагають назви контакту мікроконтролера. Klipper використовує апаратні назви для цих контактів, наприклад PA4 .

source: Pin names may be preceded by `!` to indicate that a reverse polarity should be used (eg, trigger on low instead of high).
uk: Назві контактів може передувати ! , щоб вказати, що слід використовувати зворотну полярність (наприклад, тригер на низькому рівні замість високого).

source: Input pins may be preceded by `^` to indicate that a hardware pull-up resistor should be enabled for the pin. If the micro-controller supports pull-down resistors then an input pin may alternatively be preceded by `~`.
uk: Вхідним контактам може передувати ^ , щоб вказати, що апаратний підтягуючий резистор повинен бути включений для контакту. Якщо мікроконтролер підтримує висувні резистори, перед вхідним висновком може стояти «~».

source: Note, some config sections may "create" additional pins. Where this occurs, the config section defining the pins must be listed in the config file before any sections using those pins.
uk: Зауважте, що деякі розділи конфігурації можуть «створювати» додаткові шпильки. Якщо це трапляється, розділ конфігурації, що визначає контакти, має бути вказаний у файлі конфігурації перед будь-якими розділами, які використовують ці контакти.

source: Configuration of the primary micro-controller.
uk: Конфігурація основного мікроконтролера.

source: Additional micro-controllers (one may define any number of sections with an "mcu" prefix). Additional micro-controllers introduce additional pins that may be configured as heaters, steppers, fans, etc.. For example, if an "[mcu extra_mcu]" section is introduced, then pins such as "extra_mcu:ar9" may then be used elsewhere in the config (where "ar9" is a hardware pin name or alias name on the given mcu).
uk: Додаткові мікроконтролери (можна визначити будь-яку кількість секцій з префіксом "mcu"). Додаткові мікроконтролери вводять додаткові контакти, які можуть бути налаштовані як нагрівачі, кроки, вентилятори тощо. Наприклад, якщо введено розділ «[mcu extra_mcu]», тоді такі контакти, як «extra_mcu:ar9», можна використовувати в іншому місці у конфігурації (де «ar9» — це ім’я апаратного контакту або псевдонім на даному мікроконтроллері).

source: Common kinematic settings
uk: Загальні кінематичні налаштування

source: The printer section controls high level printer settings.
uk: Розділ принтера керує налаштуваннями принтера високого рівня.

source: Stepper motor definitions. Different printer types (as specified by the "kinematics" option in the [printer] config section) require different names for the stepper (eg, `stepper_x` vs `stepper_a`). Below are common stepper definitions.
uk: Визначення крокового двигуна. Різні типи принтерів (як зазначено параметром "kinematics" у розділі конфігурації [printer]) вимагають різних імен для крокового пристрою (наприклад, `stepper_x` проти `stepper_a`). Нижче наведено загальні визначення степера.

source: Cartesian Kinematics
uk: Декартова кінематика

source: See [example-cartesian.cfg](../config/example-cartesian.cfg) for an example cartesian kinematics config file.
uk: Перегляньте [example-cartesian.cfg](../config/example-cartesian.cfg) для прикладу конфігураційного файлу декартової кінематики.

source: Only parameters specific to cartesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для декартових принтерів - див. загальні кінематичні параметри для доступних параметрів.

source: Linear Delta Kinematics
uk: Лінійна дельта-кінематика

source: See [example-delta.cfg](../config/example-delta.cfg) for an example linear delta kinematics config file. See the [delta calibrate guide](Delta_Calibrate.md) for information on calibration.
uk: Перегляньте [example-delta.cfg](../config/example-delta.cfg) для прикладу файлу конфігурації лінійної дельта-кінематики. Перегляньте [посібник із дельта-калібрування](Delta_Calibrate.md), щоб отримати інформацію про калібрування.

source: Only parameters specific to linear delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для лінійних дельта-принтерів - див. загальні кінематичні налаштування для доступних параметрів.

source: CoreXY Kinematics
uk: Кінематика CoreXY

source: See [example-corexy.cfg](../config/example-corexy.cfg) for an example corexy (and h-bot) kinematics file.
uk: Перегляньте [example-corexy.cfg](../config/example-corexy.cfg) для прикладу файлу кінематики corexy (і h-bot).

source: Only parameters specific to corexy printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для принтерів corexy – доступні параметри див. у загальних кінематичних налаштуваннях.

source: CoreXZ Kinematics
uk: Кінематика CoreXZ

source: See [example-corexz.cfg](../config/example-corexz.cfg) for an example corexz kinematics config file.
uk: Перегляньте [example-corexz.cfg](../config/example-corexz.cfg) для прикладу файлу конфігурації кінематики corexz.

source: Only parameters specific to corexz printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для принтерів Corexz - див. загальні кінематичні налаштування для доступних параметрів.

source: Hybrid-CoreXY Kinematics
uk: Кінематика Hybrid-CoreXY

source: See [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) for an example hybrid corexy kinematics config file.
uk: Перегляньте [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) для прикладу файлу конфігурації гібридної кінематики corexy.

source: This kinematic is also known as Markforged kinematic.
uk: Ця кінематика також відома як кінематика Markforged.

source: Only parameters specific to hybrid corexy printers are described here see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для гібридних принтерів corexy. Доступні параметри можна знайти в загальних кінематичних параметрах.

source: Hybrid-CoreXZ Kinematics
uk: Кінематика Hybrid-CoreXZ

source: See [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) for an example hybrid corexz kinematics config file.
uk: Перегляньте [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) для прикладу файлу конфігурації кінематики hybrid corexz.

source: Polar Kinematics
uk: Полярна кінематика

source: See [example-polar.cfg](../config/example-polar.cfg) for an example polar kinematics config file.
uk: Перегляньте [example-polar.cfg](../config/example-polar.cfg) для прикладу конфігураційного файлу полярної кінематики.

source: Only parameters specific to polar printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для полярних принтерів - див. загальні кінематичні налаштування для доступних параметрів.

source: Rotary delta Kinematics
uk: Кінематика поворотної дельти

source: See [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) for an example rotary delta kinematics config file.
uk: Перегляньте [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) для прикладу файлу конфігурації поворотної дельта-кінематики.

source: Only parameters specific to rotary delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для ротаційних дельта-принтерів – доступні параметри див. у загальних кінематичних налаштуваннях.

source: ROTARY DELTA KINEMATICS ARE A WORK IN PROGRESS. Homing moves may timeout and some boundary checks are not implemented.
uk: КІНЕМАТИКА РОТАЦІЙНОЇ ДЕЛЬТА РОБОТА В ПРОЦЕСІ. Переміщення до початку може закінчитися, а деякі перевірки меж не реалізуються.

source: Cable winch Kinematics
uk: Тросова лебідка Кінематика

source: See the [example-winch.cfg](../config/example-winch.cfg) for an example cable winch kinematics config file.
uk: Перегляньте файл [example-winch.cfg](../config/example-winch.cfg) для прикладу конфігураційного файлу кінематики тросової лебідки.

source: Only parameters specific to cable winch printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для принтерів із тросовою лебідкою – доступні параметри див. у загальних кінематичних налаштуваннях.

source: None Kinematics
uk: Немає Кінематика

source: It is possible to define a special "none" kinematics to disable kinematic support in Klipper. This may be useful for controlling devices that are not typical 3d-printers or for debugging purposes.
uk: Можна визначити спеціальну кінематику "немає", щоб вимкнути кінематичну підтримку в Klipper. Це може бути корисно для керування пристроями, які не є типовими 3d-принтерами, або для налагодження.

source: Common extruder and heated bed support
uk: Загальний екструдер і підставка з підігрівом

source: The heater_bed section describes a heated bed. It uses the same heater settings described in the "extruder" section.
uk: Розділ heater_bed описує ліжко з підігрівом. Він використовує ті самі налаштування нагрівача, які описані в розділі «Екструдер».

source: Bed level support
uk: Підтримка рівня ліжка

source: Mesh Bed Leveling. One may define a bed_mesh config section to enable move transformations that offset the z axis based on a mesh generated from probed points. When using a probe to home the z-axis, it is recommended to define a safe_z_home section in printer.cfg to home toward the center of the print area.
uk: Вирівнювання сітки. Можна визначити розділ конфігурації bed_mesh, щоб увімкнути трансформації переміщення, які зміщують вісь z на основі сітки, згенерованої із зондованих точок. У разі використання датчика для встановлення осі z у початковий кут, рекомендовано визначити розділ safe_z_home у файлі printer.cfg, щоб він був спрямований у центр області друку.

source: Visual Examples:
uk: Візуальні приклади:

source: Bed tilt compensation. One may define a bed_tilt config section to enable move transformations that account for a tilted bed. Note that bed_mesh and bed_tilt are incompatible; both cannot be defined.
uk: Компенсація нахилу ліжка. Можна визначити розділ конфігурації bed_tilt, щоб увімкнути переміщення, які враховують нахилене ліжко. Зауважте, що bed_mesh і bed_tilt несумісні; обидва не можуть бути визначені.

source: Tool to help adjust bed leveling screws. One may define a [bed_screws] config section to enable a BED_SCREWS_ADJUST g-code command.
uk: Інструмент для регулювання гвинтів вирівнювання ліжка. Щоб увімкнути команду g-коду BED_SCREWS_ADJUST, можна визначити розділ конфігурації [bed_screws].

source: Tool to help adjust bed screws tilt using Z probe. One may define a screws_tilt_adjust config section to enable a SCREWS_TILT_CALCULATE g-code command.
uk: Інструмент, який допомагає регулювати нахил кріпильних гвинтів за допомогою Z-щупа. Можна визначити розділ конфігурації screws_tilt_adjust, щоб увімкнути команду g-коду SCREWS_TILT_CALCULATE.

source: Moving gantry leveling using 4 independently controlled Z motors. Corrects hyperbolic parabola effects (potato chip) on moving gantry which is more flexible. WARNING: Using this on a moving bed may lead to undesirable results. If this section is present then a QUAD_GANTRY_LEVEL extended G-Code command becomes available. This routine assumes the following Z motor configuration:
uk: Рухоме вирівнювання порталу за допомогою 4 незалежно керованих двигунів Z. Виправляє ефекти гіперболічної параболи (картопляна стружка) на рухомому порталі, що є більш гнучким. ПОПЕРЕДЖЕННЯ: використання цього на рухомому ліжку може призвести до небажаних результатів. Якщо цей розділ присутній, стає доступною розширена команда G-коду QUAD_GANTRY_LEVEL. Ця процедура передбачає наступну конфігурацію двигуна Z:

source: [skew_correction]
uk: [виправлення перекосу]

source: Customized homing
uk: Індивідуальне самонаведення

source: Homing override. One may use this mechanism to run a series of g-code commands in place of a G28 found in the normal g-code input. This may be useful on printers that require a specific procedure to home the machine.
uk: Перевизначення початкового положення. Можна використати цей механізм для виконання ряду команд g-коду замість G28, який міститься у звичайному введенні g-коду. Це може бути корисним для принтерів, які потребують певної процедури для встановлення апарата.

source: [endstop_phase]
uk: [кінцева_фаза]

source: Stepper phase adjusted endstops. To use this feature, define a config section with an "endstop_phase" prefix followed by the name of the corresponding stepper config section (for example, "[endstop_phase stepper_z]"). This feature can improve the accuracy of endstop switches. Add a bare "[endstop_phase]" declaration to enable the ENDSTOP_PHASE_CALIBRATE command.
uk: Кінцеві упори з кроковою фазою. Щоб скористатися цією функцією, визначте розділ конфігурації з префіксом "endstop_phase", за яким слідує назва відповідного розділу конфігурації степера (наприклад, "[endstop_phase stepper_z]"). Ця функція може підвищити точність кінцевих вимикачів. Додайте голе оголошення "[endstop_phase]", щоб увімкнути команду ENDSTOP_PHASE_CALIBRATE.

source: G-Code macros and events
uk: Макроси та події G-коду

source: G-Code macros (one may define any number of sections with a "gcode_macro" prefix). See the [command template guide](Command_Templates.md) for more information.
uk: Макроси G-Code (можна визначити будь-яку кількість розділів із префіксом "gcode_macro"). Додаткову інформацію див. у посібнику з шаблонів команд.

source: [save_variables]
uk: [зберегти_змінні]

source: Idle timeout. An idle timeout is automatically enabled - add an explicit idle_timeout config section to change the default settings.
uk: Час простою. Тайм-аут простою вмикається автоматично - додайте явний розділ конфігурації idle_timeout, щоб змінити параметри за замовчуванням.

source: Optional G-Code features
uk: Додаткові функції G-Code

source: A virtual sdcard may be useful if the host machine is not fast enough to run OctoPrint well. It allows the Klipper host software to directly print gcode files stored in a directory on the host using standard sdcard G-Code commands (eg, M24).
uk: Віртуальна sdcard може бути корисною, якщо хост-комп’ютер недостатньо швидкий для нормального запуску OctoPrint. Це дозволяє програмному забезпеченню хоста Klipper безпосередньо друкувати файли gcode, що зберігаються в каталозі на хості, за допомогою стандартних команд G-коду sdcard (наприклад, M24).

source: Some printers with stage-clearing features, such as a part ejector or a belt printer, can find use in looping sections of the sdcard file. (For example, to print the same part over and over, or repeat the a section of a part for a chain or other repeated pattern).
uk: Деякі принтери з функціями очищення сцени, такі як виштовхувач частин або стрічковий принтер, можуть використовуватися в циклічних розділах файлу sdcard. (Наприклад, щоб друкувати ту саму деталь знову і знову або повторювати частину частини для ланцюжка чи іншого повторюваного візерунка).

source: Support for gcode arc (G2/G3) commands.
uk: Підтримка команд gcode arc (G2/G3).

source: [respond]
uk: [відповісти]

source: Resonance compensation
uk: Резонансна компенсація

source: Config file helpers
uk: Помічники конфігураційних файлів

source: Board pin aliases (one may define any number of sections with a "board_pins" prefix). Use this to define aliases for the pins on a micro-controller.
uk: Псевдоніми контактів дошки (можна визначити будь-яку кількість розділів із префіксом "board_pins"). Використовуйте це, щоб визначити псевдоніми для контактів на мікроконтролері.

source: [include]
uk: [включити]

source: Include file support. One may include additional config file from the main printer config file. Wildcards may also be used (eg, "configs/*.cfg").
uk: Включити підтримку файлів. Можна включити додатковий файл конфігурації з основного файлу конфігурації принтера. Також можна використовувати символи підстановки (наприклад, "configs/*.cfg").

source: Bed probing hardware
uk: Обладнання для зондування ліжка

source: [probe]
uk: [зонд]

source: Z height probe. One may define this section to enable Z height probing hardware. When this section is enabled, PROBE and QUERY_PROBE extended [g-code commands](G-Codes.md#probe) become available. Also, see the [probe calibrate guide](Probe_Calibrate.md). The probe section also creates a virtual "probe:z_virtual_endstop" pin. One may set the stepper_z endstop_pin to this virtual pin on cartesian style printers that use the probe in place of a z endstop. If using "probe:z_virtual_endstop" then do not define a position_endstop in the stepper_z config section.
uk: Зонд висоти Z. Можна визначити цей розділ, щоб увімкнути обладнання для вимірювання висоти Z. Коли цей розділ увімкнено, PROBE та QUERY_PROBE розширені [команди g-коду] (G-Codes.md#probe) стають доступними. Також перегляньте [посібник із калібрування зонда](Probe_Calibrate.md). Розділ зонду також створює віртуальний пін «probe:z_virtual_endstop». Можна встановити stepper_z endstop_pin на цей віртуальний штифт на принтерах у декартовому стилі, які використовують зонд замість z endstop. Якщо використовується «probe:z_virtual_endstop», не визначайте position_endstop у розділі конфігурації stepper_z.

source: BLTouch probe. One may define this section (instead of a probe section) to enable a BLTouch probe. See [BL-Touch guide](BLTouch.md) and [command reference](G-Codes.md#bltouch) for further information. A virtual "probe:z_virtual_endstop" pin is also created (see the "probe" section for the details).
uk: Зонд BLTouch. Можна визначити цей розділ (замість розділу зонда), щоб увімкнути зонд BLTouch. Додаткову інформацію див. у посібнику BL-Touch і командній довідці. Також створюється віртуальний пін «probe:z_virtual_endstop» (детальніше див. розділ «зонд»).

source: Additional stepper motors and extruders
uk: Додаткові крокові двигуни та екструдери

source: Multi-stepper axes. On a cartesian style printer, the stepper controlling a given axis may have additional config blocks defining steppers that should be stepped in concert with the primary stepper. One may define any number of sections with a numeric suffix starting at 1 (for example, "stepper_z1", "stepper_z2", etc.).
uk: Багатокрокові осі. На принтері в декартовому стилі кроковий механізм, який керує заданою віссю, може мати додаткові конфігураційні блоки, що визначають крокові кроки, які мають працювати разом із основним кроковим механізмом. Можна визначити будь-яку кількість розділів із цифровим суфіксом, починаючи з 1 (наприклад, «stepper_z1», «stepper_z2» тощо).

source: [extruder1]
uk: [екструдер1]

source: In a multi-extruder printer add an additional extruder section for each additional extruder. The additional extruder sections should be named "extruder1", "extruder2", "extruder3", and so on. See the "extruder" section for a description of available parameters.
uk: У мультиекструдерному принтері додайте додаткову секцію екструдера для кожного додаткового екструдера. Додаткові секції екструдера мають називатися «екструдер1», «екструдер2», «екструдер3» і так далі. Опис доступних параметрів див. у розділі «Екструдер».

source: See [sample-multi-extruder.cfg](../config/sample-multi-extruder.cfg) for an example configuration.
uk: Перегляньте [sample-multi-extruder.cfg](../config/sample-multi-extruder.cfg) для прикладу конфігурації.

source: See [sample-idex.cfg](../config/sample-idex.cfg) for an example configuration.
uk: Перегляньте [sample-idex.cfg](../config/sample-idex.cfg) для прикладу конфігурації.

source: Support for additional steppers synchronized to the movement of an extruder (one may define any number of sections with an "extruder_stepper" prefix).
uk: Підтримка додаткових степерів, синхронізованих з рухом екструдера (можна визначити будь-яку кількість секцій з префіксом "extruder_stepper").

source: [manual_stepper]
uk: [ручний_степпер]

source: Custom heaters and sensors
uk: Нагрівачі та датчики на замовлення

source: Heater and temperature sensor verification. Heater verification is automatically enabled for each heater that is configured on the printer. Use verify_heater sections to change the default settings.
uk: Повірка обігрівача і датчика температури. Перевірка нагрівача автоматично вмикається для кожного нагрівача, налаштованого на принтері. Використовуйте розділи verify_heater, щоб змінити налаштування за замовчуванням.

source: Tool to disable heaters when homing or probing an axis.
uk: Інструмент для відключення нагрівачів під час наведення або зондування осі.

source: [thermistor]
uk: [термістор]

source: Custom thermistors (one may define any number of sections with a "thermistor" prefix). A custom thermistor may be used in the sensor_type field of a heater config section. (For example, if one defines a "[thermistor my_thermistor]" section then one may use a "sensor_type: my_thermistor" when defining a heater.) Be sure to place the thermistor section in the config file above its first use in a heater section.
uk: Нестандартні терморезистори (можна визначити будь-яку кількість секцій з префіксом «термістор»). Спеціальний термістор можна використовувати в полі sensor_type розділу конфігурації нагрівача. (Наприклад, якщо визначено розділ «[thermistor my_thermistor]», тоді можна використовувати «sensor_type: my_thermistor» під час визначення нагрівача.) Обов’язково розмістіть розділ термістора у файлі конфігурації над його першим використанням у розділі нагрівача. .
