Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [mcp4451 my_digipot] i2c_address: # The i2c address that the chip is using on the i2c bus. This # parameter must be provided. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # The value to statically set the given MCP4451 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a wiper is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'wiper_x' parameters # are interpreted. If provided, then the 'wiper_x' parameters should # be between 0.0 and 'scale'. This may be useful when the MCP4451 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4451 were at its highest # resistance, and then the 'wiper_x' parameters can be specified # using the desired amperage value for the stepper. The default is # to not scale the 'wiper_x' parameters.
uk: [mcp4451 my_digipot] i2c_address: Нема Адреса i2c, що використовує на i2c автобусі. Про нас # параметр повинен бути надана. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: Нема Див. розділ "компонентні налаштування I2C" для опису # над параметрами. #wiper_0: #wiper_1: #wiper_2: #wiper_3: Нема Значення статично встановити дану MCP4451 "фіпер" до. Це #, як правило, встановити номер між 0.0 і 1,0 з 1,0 будучи # найвищий опір і 0,0 будучи найнижчою стійкістю. Однак # діапазон може бути змінений з параметром 'розмір' (див. нижче). Нема Якщо ви не вказали, то він залишається неналаштуваним. #масштабний: Нема Цей параметр можна використовувати для зміни параметрів 'wiper_x' # перекладаються. Якщо передбачено, то параметри 'wiper_x' повинні # бути між 0.0 і 'розміром'. Це може бути корисним при MCP4451 # використовується для встановлення крокової напруги посилань. «масштабний» може бути встановлений # еквівалент амперажу крокової залози, якщо MCP4451 був на найвищому рівні # опір, а потім параметри 'wiper_x' можна вказати # за допомогою необхідного значення амперажу для степпера. За замовчуванням # не масштабувати параметри 'wiper_x'. .

source: [mcp4728 my_dac] #i2c_address: 96 # The i2c address that the chip is using on the i2c bus. The default # is 96. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #channel_a: #channel_b: #channel_c: #channel_d: # The value to statically set the given MCP4728 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest voltage (2.048V) and 0.0 being the lowest voltage. # However, the range may be changed with the 'scale' parameter (see # below). If a channel is not specified then it is left # unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # MCP4728 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the MCP4728 were at # its highest voltage (2.048V), and then the 'channel_x' parameters # can be specified using the desired amperage value for the # stepper. The default is to not scale the 'channel_x' parameters.
uk: [mcp4728 my_dac] #i2c_адреса: 96 Адреса i2c, яку чіп використовує на шині i2c. За замовчуванням дорівнює 96. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис параметр вище. #channel_a: #channel_b: #channel_c: #channel_d: Значення для статичної установки даного каналу MCP4728. Це є зазвичай встановлюється на число від 0,0 до 1,0, де 1,0 є найвища напруга (2,048 В), а 0,0 — найнижча напруга. Однак діапазон можна змінити за допомогою параметра 'scale' (див нижче). Якщо канал не вказано, він залишиться не налаштовано. #масштаб: Цей параметр можна використовувати для зміни параметрів 'channel_x' інтерпретуються. Параметри 'channel_x', якщо надано має бути між 0,0 і 'scale'. Це може бути корисним, коли MCP4728 використовується для встановлення опорної напруги крокової напруги. «Шкала» може бути встановлено на еквівалентну силу струму крокового кроку, якби MCP4728 був на рівні найвища напруга (2,048 В), а потім параметри 'channel_x' можна вказати за допомогою бажаного значення сили струму для степпер. За замовчуванням параметри 'channel_x' не масштабуються.

source: [display] lcd_type: # Set to either "ssd1306" or "sh1106" for the given display type. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Optional parameters available for displays connected via an i2c # bus. See the "common I2C settings" section for a description of # the above parameters. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # The pins connected to the lcd when in "4-wire" spi mode. See the # "common SPI settings" section for a description of the parameters # that start with "spi_". The default is to use i2c mode for the # display. #reset_pin: # A reset pin may be specified on the display. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 256 and the # default is 239. #vcomh: 0 # Set the Vcomh value on the display. This value is associated with # a "smearing" effect on some OLED displays. The value may range # from 0 to 63. Default is 0. #invert: False # TRUE inverts the pixels on certain OLED displays. The default is # False. #x_offset: 0 # Set the horizontal offset value on SH1106 displays. The default is # 0. ...
uk: [дисплей] lcd_type: Встановіть значення "ssd1306" або "sh1106" для заданого типу дисплея. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: Доступні додаткові параметри для дисплеїв, підключених через i2c автобус. Опис див. у розділі «Загальні налаштування I2C». наведені вище параметри. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: Контакти, підключені до РК-дисплея в режимі «4-провідний» spi. Див розділ «загальні налаштування SPI» для опису параметрів #, які починаються на "spi_". За замовчуванням використовується режим i2c для дисплей. #reset_pin: На дисплеї може бути вказаний PIN-код скидання. Якщо це не так зазначено, тоді апаратне забезпечення повинно мати підтягування на відповідна лінія РК-дисплея. #контраст: Контраст для встановлення. Значення може бути в діапазоні від 0 до 256 і за замовчуванням 239. #vcomh: 0 Встановіть значення Vcomh на дисплеї. Це значення пов'язане з ефект "розмазування" на деяких OLED-дисплеях. Значення може коливатися від 0 до 63. За замовчуванням 0. #invert: False TRUE інвертує пікселі на певних OLED-дисплеях. За замовчуванням Неправда. #x_offset: 0 Встановіть значення горизонтального зсуву на дисплеях SH1106. За замовчуванням 0. ...

source: [sx1509 my_sx1509] i2c_address: # I2C address used by this expander. Depending on the hardware # jumpers this is one out of the following addresses: 62 63 112 # 113. This parameter must be provided. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters.
uk: [sx1509 my_sx1509] i2c_адреса: # Адреса I2C, що використовується цим розширювачем. Залежно від обладнання # перемички це одна з наступних адрес: 62 63 112 # 113. Цей параметр необхідно вказати. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: # Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис # параметр вище.

source: #i2c_address: # The i2c address of the device. This must specified as a decimal # number (not in hex). The default depends on the type of device. #i2c_mcu: # The name of the micro-controller that the chip is connected to. # The default is "mcu". #i2c_bus: # If the micro-controller supports multiple I2C busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #i2c_software_scl_pin: #i2c_software_sda_pin: # Specify these parameters to use micro-controller software based # I2C "bit-banging" support. The two parameters should the two pins # on the micro-controller to use for the scl and sda wires. The # default is to use hardware based I2C support as specified by the # i2c_bus parameter. #i2c_speed: # The I2C speed (in Hz) to use when communicating with the device. # The Klipper implementation on most micro-controllers is hard-coded # to 100000 and changing this value has no effect. The default is # 100000. Linux, RP2040 and ATmega support 400000.
uk: #i2c_адреса: i2c-адреса пристрою. Це має бути вказано як десяткове число число (не в шістнадцятковому). Стандартне значення залежить від типу пристрою. #i2c_mcu: Назва мікроконтролера, до якого підключено чіп. Типовим є "mcu". #i2c_bus: Якщо мікроконтролер підтримує кілька шин I2C, то одна може вкажіть тут назву шини мікроконтролера. За замовчуванням залежить від тип мікроконтролера. #i2c_software_scl_pin: #i2c_software_sda_pin: Укажіть ці параметри, щоб використовувати програмне забезпечення на основі мікроконтролера Підтримка I2C "bit-banging". Два параметри мають бути двома контактами на мікроконтролері для використання проводів scl і sda. The за замовчуванням використовується апаратна підтримка I2C, як зазначено в Параметр i2c_bus. #i2c_швидкість: Швидкість I2C (у Гц), яка використовується під час обміну даними з пристроєм. Реалізація Klipper на більшості мікроконтролерів жорстко закодована до 100000, і зміна цього значення не має ефекту. За замовчуванням 100000. Linux, RP2040 і ATmega підтримують 400000.

source: [printer] kinematics: # The type of printer in use. This option may be one of: cartesian, # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta, # deltesian, polar, winch, or none. This parameter must be specified. max_velocity: # Maximum velocity (in mm/s) of the toolhead (relative to the # print). This parameter must be specified. max_accel: # Maximum acceleration (in mm/s^2) of the toolhead (relative to the # print). Although this parameter is described as a "maximum" # acceleration, in practice most moves that accelerate or decelerate # will do so at the rate specified here. The value specified here # may be changed at runtime using the SET_VELOCITY_LIMIT command. # This parameter must be specified. #minimum_cruise_ratio: 0.5 # Most moves will accelerate to a cruising speed, travel at that # cruising speed, and then decelerate. However, some moves that # travel a short distance could nominally accelerate and then # immediately decelerate. This option reduces the top speed of these # moves to ensure there is always a minimum distance traveled at a # cruising speed. That is, it enforces a minimum distance traveled # at cruising speed relative to the total distance traveled. It is # intended to reduce the top speed of short zigzag moves (and thus # reduce printer vibration from these moves). For example, a # minimum_cruise_ratio of 0.5 would ensure that a standalone 1.5mm # move would have a minimum cruising distance of 0.75mm. Specify a # ratio of 0.0 to disable this feature (there would be no minimum # cruising distance enforced between acceleration and deceleration). # The value specified here may be changed at runtime using the # SET_VELOCITY_LIMIT command. The default is 0.5. #square_corner_velocity: 5.0 # The maximum velocity (in mm/s) that the toolhead may travel a 90 # degree corner at. A non-zero value can reduce changes in extruder # flow rates by enabling instantaneous velocity changes of the # toolhead during cornering. This value configures the internal # centripetal velocity cornering algorithm; corners with angles # larger than 90 degrees will have a higher cornering velocity while # corners with angles less than 90 degrees will have a lower # cornering velocity. If this is set to zero then the toolhead will # decelerate to zero at each corner. The value specified here may be # changed at runtime using the SET_VELOCITY_LIMIT command. The # default is 5mm/s. #max_accel_to_decel: # This parameter is deprecated and should no longer be used.
uk: [принтер] кінематика: # Тип використовуваного принтера. Цей параметр може бути одним із: декартовий, # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta, # дельтезіан, полярний, лебідка або жодного. Цей параметр необхідно вказати. max_velocity: # Максимальна швидкість (мм/с) інструментальної головки (відносно # друк). Цей параметр необхідно вказати. max_accel: # Максимальне прискорення (у мм/с^2) інструментальної головки (відносно # друк). Хоча цей параметр описується як «максимальний» # прискорення, на практиці більшість рухів прискорюють або сповільнюють # зробить це за тарифом, указаним тут. Значення, вказане тут # можна змінити під час виконання за допомогою команди SET_VELOCITY_LIMIT. # Цей параметр необхідно вказати. #мінімальний_коефіцієнт_круїзу: 0,5 # Більшість рухів прискорюється до крейсерської швидкості, подорожуйте при цьому # крейсерська швидкість, а потім сповільніться. Однак деякі рухи, що # подорож на коротку відстань може номінально прискоритися, а потім # негайно гальмувати. Ця опція зменшує їх максимальну швидкість # рухів, щоб завжди була мінімальна пройдена відстань на a # крейсерська швидкість. Тобто забезпечується мінімальна пройдена відстань # на крейсерській швидкості відносно загальної пройденої відстані. Це так # призначений для зменшення максимальної швидкості коротких зигзагоподібних рухів (і таким чином # зменшити вібрацію принтера через ці рухи). Наприклад, a # minimum_cruise_ratio 0,5 гарантує, що автономний 1,5 мм # хід матиме мінімальну крейсерську дистанцію 0,75 мм. Вкажіть a # співвідношення 0,0, щоб вимкнути цю функцію (мінімального значення не буде # крейсерська дистанція, що дотримується між прискоренням і уповільненням). # Вказане тут значення можна змінити під час виконання за допомогою # Команда SET_VELOCITY_LIMIT. За замовчуванням 0,5. #square_corner_velocity: 5,0 # Максимальна швидкість (у мм/с), яку може рухати інструментальна головка, становить 90 # градусний кут на. Ненульове значення може зменшити зміни в екструдері # швидкості потоку, дозволяючи миттєві зміни швидкості # насадка під час поворотів. Це значення налаштовує внутрішній # алгоритм проходження поворотів доцентрової швидкості; кути з кутами # більший за 90 градусів матиме вищу швидкість на поворотах # кути з кутами менше 90 градусів матимуть нижчий # швидкість на поворотах. Якщо це значення встановлено на нуль, то інструментальна головка буде # сповільнення до нуля на кожному повороті. Вказане тут значення може бути # змінено під час виконання за допомогою команди SET_VELOCITY_LIMIT. The # за замовчуванням 5 мм/с. #max_accel_to_decel: # Цей параметр застарів і більше не повинен використовуватися.

source: [output_pin my_pin] pin: # The pin to configure as an output. This parameter must be # provided. #pwm: False # Set if the output pin should be capable of pulse-width-modulation. # If this is true, the value fields should be between 0 and 1; if it # is false the value fields should be either 0 or 1. The default is # False. #value: # The value to initially set the pin to during MCU configuration. # The default is 0 (for low voltage). #shutdown_value: # The value to set the pin to on an MCU shutdown event. The default # is 0 (for low voltage). #cycle_time: 0.100 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.100 seconds for pwm pins. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #scale: # This parameter can be used to alter how the 'value' and # 'shutdown_value' parameters are interpreted for pwm pins. If # provided, then the 'value' parameter should be between 0.0 and # 'scale'. This may be useful when configuring a PWM pin that # controls a stepper voltage reference. The 'scale' can be set to # the equivalent stepper amperage if the PWM were fully enabled, and # then the 'value' parameter can be specified using the desired # amperage for the stepper. The default is to not scale the 'value' # parameter. #maximum_mcu_duration: #static_value: # These options are deprecated and should no longer be specified.
uk: [вихід_pin my_pin] шпилька: Нема шпилька для налаштування як виходу. Цей параметр повинен бути # надано. #pwm: False Нема Встановити, якщо вихідний штифт повинен бути здатний пульс-широт-моделювання. Нема Якщо це правда, поля значення повинні бути між 0 і 1; якщо це правда, значення має бути між 0 і 1; якщо це правда, поля значення повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; якщо це правда, значення поля повинні бути між 0 і 1; # помилкові поля значення повинні бути або 0 або 1. За замовчуванням # Фальсе. #значення: Нема Значення спочатку встановити шпильку під час конфігурації МКУ. Нема За замовчуванням 0 (для низької напруги). #shutdown_value: Нема Вартість встановлення шпильки на випадок відключення MCU. За замовчуванням # - 0 (для низької напруги). #цикл_час: 0.100 Нема Кількість часу (в секундах) за цикл PWM. Рекомендовано # це буде 10 мілісекундів або більше при використанні програмного забезпечення на основі PWM. Нема За замовчуванням 0.100 секунд для шпильок pwm. #hardware_pwm: Фальзе Нема Увімкнути це для використання апаратних PWM замість програмного забезпечення PWM. Коли # за допомогою апаратного PWM фактичний час циклу обмежений # виконання і може бути значно різним, ніж # запитаний цикл_час. За замовчуванням False. #масштабний: Нема Цей параметр можна використовувати для зміни значення 'value' і Параметри "shutdown_value" інтерпретуються для штифтів. Якщо # передбачено, потім параметр 'value' повинен бути між 0.0 і # 'розмір'. Це може бути корисним при налаштуванні штифта PWM, який # Контроль за посиланням на степпер напруги. «масштабний» може бути встановлений # еквівалентний кроковий ампераж, якщо PWM повністю ввімкнено, і # потім параметр 'value' можна вказати за допомогою бажаного параметра # ампераж для степпера. За замовчуванням не потрібно масштабувати 'value' # параметр. #maximum_mcu_duration: #static_value: Нема Ці параметри депресовані і не повинні бути вказані. .

source: [pwm_tool]
uk: [pwm_інструмент]

source: Pulse width modulation digital output pins capable of high speed updates (one may define any number of sections with an "output_pin" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1" type extended [g-code commands](G-Codes.md#output_pin).
uk: Цифрові вихідні контакти широтно-імпульсної модуляції, здатні виконувати високошвидкісні оновлення (можна визначити будь-яку кількість секцій за допомогою префікса "output_pin"). Налаштовані тут контакти буде встановлено як вихідні контакти, і їх можна буде змінити під час виконання за допомогою розширеного типу "SET_PIN PIN=my_pin VALUE=.1" [команди g-коду](G-Codes.md#output_pin).

source: [pwm_tool my_tool] pin: # The pin to configure as an output. This parameter must be provided. #maximum_mcu_duration: # The maximum duration a non-shutdown value may be driven by the MCU # without an acknowledge from the host. # If host can not keep up with an update, the MCU will shutdown # and set all pins to their respective shutdown values. # Default: 0 (disabled) # Usual values are around 5 seconds. #value: #shutdown_value: #cycle_time: 0.100 #hardware_pwm: False #scale: # See the "output_pin" section for the definition of these parameters.
uk: [pwm_tool мій_інструмент] прикріпити: # Пін, який потрібно налаштувати як вихід. Цей параметр необхідно вказати. #maximum_mcu_duration: # Максимальна тривалість значення без відключення може керуватися MCU # без підтвердження від хоста. # Якщо хост не встигає за оновленнями, MCU вимкнеться # і встановіть для всіх пінів відповідні значення вимкнення. # За замовчуванням: 0 (вимкнено) # Звичайні значення становлять близько 5 секунд. #value: #shutdown_value: #час_циклу: 0,100 #hardware_pwm: Помилка #масштаб: # Перегляньте розділ «output_pin» для визначення цих параметрів.

source: Run-time configurable output pins with dynamic pwm cycle timing (one may define any number of sections with an "pwm_cycle_time" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1 CYCLE_TIME=0.100" type extended [g-code commands](G-Codes.md#pwm_cycle_time).
uk: Настроювані під час виконання вихідні контакти з динамічною синхронізацією циклу ШІМ (можна визначити будь-яку кількість секцій за допомогою префікса "pwm_cycle_time"). Налаштовані тут контакти будуть встановлені як вихідні контакти, і їх можна буде змінити під час виконання за допомогою розширеного типу "SET_PIN PIN=my_pin VALUE=.1 CYCLE_TIME=0.100" [команди g-коду](G-Codes.md#pwm_cycle_time).

source: [pwm_cycle_time my_pin] pin: #value: #shutdown_value: #cycle_time: 0.100 #scale: # See the "output_pin" section for information on these parameters.
uk: [pwm_cycle_time my_pin] прикріпити: #value: #shutdown_value: #час_циклу: 0,100 #масштаб: # Перегляньте розділ "output_pin" для інформації про ці параметри.
