Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [mcu] serial: # The serial port to connect to the MCU. If unsure (or if it # changes) see the "Where's my serial port?" section of the FAQ. # This parameter must be provided when using a serial port. #baud: 250000 # The baud rate to use. The default is 250000. #canbus_uuid: # If using a device connected to a CAN bus then this sets the unique # chip identifier to connect to. This value must be provided when using # CAN bus for communication. #canbus_interface: # If using a device connected to a CAN bus then this sets the CAN # network interface to use. The default is 'can0'. #restart_method: # This controls the mechanism the host will use to reset the # micro-controller. The choices are 'arduino', 'cheetah', 'rpi_usb', # and 'command'. The 'arduino' method (toggle DTR) is common on # Arduino boards and clones. The 'cheetah' method is a special # method needed for some Fysetc Cheetah boards. The 'rpi_usb' method # is useful on Raspberry Pi boards with micro-controllers powered # over USB - it briefly disables power to all USB ports to # accomplish a micro-controller reset. The 'command' method involves # sending a Klipper command to the micro-controller so that it can # reset itself. The default is 'arduino' if the micro-controller # communicates over a serial port, 'command' otherwise.
uk: [mcu] серійний: # Послідовний порт для підключення до MCU. Якщо не впевнений (або якщо # зміни) перегляньте "Де мій послідовний порт?" розділ поширених запитань. # Цей параметр необхідно вказати, якщо використовується послідовний порт. #бод: 250000 # Швидкість передачі даних для використання. За замовчуванням 250000. #canbus_uuid: # Якщо використовується пристрій, підключений до шини CAN, це встановлює унікальність # ідентифікатор мікросхеми для підключення. Це значення необхідно вказати під час використання # Шина CAN для зв'язку. #canbus_interface: # Якщо використовується пристрій, підключений до шини CAN, це встановлює CAN # мережевий інтерфейс для використання. Типовим є 'can0'. #restart_method: # Це керує механізмом, який хост використовуватиме для скидання # мікроконтролер. Можливі варіанти: «arduino», «cheetah», «rpi_usb», # і 'команда'. Метод «arduino» (перемикач DTR) поширений на # Плати та клони Arduino. Метод «гепард» особливий # метод необхідний для деяких дощок Fysetc Cheetah. Метод «rpi_usb». # корисний на платах Raspberry Pi з живленням мікроконтролерів # через USB - короткочасно вимикає живлення всіх портів USB # виконати скидання мікроконтролера. «Командний» метод передбачає # надсилання команди Klipper до мікроконтролера, щоб він міг # скинути себе. За замовчуванням це «arduino», якщо мікроконтролер # спілкується через послідовний порт, 'command' інакше.

source: [mcu my_extra_mcu] # See the "mcu" section for configuration parameters.
uk: [mcu my_extra_mcu] Параметри конфігурації див. у розділі "mcu".

source: [printer] kinematics: cartesian max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the stepper controlling # the X axis in a cartesian robot. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis in a cartesian robot. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis in a cartesian robot. [stepper_z]
uk: [принтер] кінематика: декартова max_z_velocity: Це встановлює максимальну швидкість (у мм/с) руху вздовж z вісь. Цей параметр можна використовувати для обмеження максимальної швидкості кроковий двигун z. За умовчанням використовується max_velocity для max_z_velocity. max_z_accel: Це встановлює максимальне прискорення (у мм/с^2) руху вздовж вісь z. Він обмежує прискорення крокового двигуна z. The за замовчуванням для max_z_accel використовується max_accel. Розділ stepper_x використовується для опису керування кроком вісь X у декартовому роботі. [stepper_x] Секція stepper_y використовується для опису керування кроком вісь Y у декартовому роботі. [stepper_y] Секція stepper_z використовується для опису керування кроком вісь Z у декартовому роботі. [stepper_z]

source: [printer] kinematics: corexy max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Y movement. [stepper_x] # The stepper_y section is used to describe the Y axis as well as the # stepper controlling the X-Y movement. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
uk: [принтер] кінематика: корексія max_z_velocity: Це встановлює максимальну швидкість (у мм/с) руху вздовж z вісь. Цей параметр можна використовувати для обмеження максимальної швидкості кроковий двигун z. За умовчанням використовується max_velocity для max_z_velocity. max_z_accel: Це встановлює максимальне прискорення (у мм/с^2) руху вздовж вісь z. Він обмежує прискорення крокового двигуна z. The за замовчуванням для max_z_accel використовується max_accel. Секція stepper_x використовується для опису осі X, а також степпер, що контролює рух X+Y. [stepper_x] Секція stepper_y використовується для опису осі Y, а також степпер, що контролює рух XY. [stepper_y] Секція stepper_z використовується для опису керування кроком вісь Z. [stepper_z]

source: [printer] kinematics: corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the Z axis as well as the # stepper controlling the X-Z movement. [stepper_z]
uk: [принтер] кінематика: corexz max_z_velocity: Це встановлює максимальну швидкість (у мм/с) руху вздовж z вісь. За замовчуванням для max_z_velocity використовується max_velocity. max_z_accel: Це встановлює максимальне прискорення (у мм/с^2) руху вздовж вісь z. За замовчуванням для max_z_accel використовується max_accel. Секція stepper_x використовується для опису осі X, а також степпер, що контролює рух X+Z. [stepper_x] Секція stepper_y використовується для опису керування кроком вісь Y. [stepper_y] Секція stepper_z використовується для опису осі Z, а також степпер контролює рух XZ. [stepper_z]

source: [printer] kinematics: hybrid_corexy max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X-Y movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
uk: [принтер] кінематика: hybrid_corexy max_z_velocity: # Це встановлює максимальну швидкість (у мм/с) руху вздовж z # вісь. За замовчуванням для max_z_velocity використовується max_velocity. max_z_accel: # Це встановлює максимальне прискорення (у мм/с^2) руху вздовж # вісь z. За замовчуванням для max_z_accel використовується max_accel. # Секція stepper_x використовується для опису осі X, а також # степпер, що контролює рух X-Y. [stepper_x] # Розділ stepper_y використовується для опису керування кроком # вісь Y. [stepper_y] # Секція stepper_z використовується для опису керування кроком # вісь Z. [stepper_z]

source: [printer] kinematics: hybrid_corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X-Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
uk: [принтер] кінематика: hybrid_corexz max_z_velocity: # Це встановлює максимальну швидкість (у мм/с) руху вздовж z # вісь. За замовчуванням для max_z_velocity використовується max_velocity. max_z_accel: # Це встановлює максимальне прискорення (у мм/с^2) руху вздовж # вісь z. За замовчуванням для max_z_accel використовується max_accel. # Секція stepper_x використовується для опису осі X, а також # степпер, що контролює рух X-Z. [stepper_x] # Розділ stepper_y використовується для опису керування кроком # вісь Y. [stepper_y] # Секція stepper_z використовується для опису керування кроком # вісь Z. [stepper_z]

source: [printer] kinematics: rotary_delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. shoulder_radius: # Radius (in mm) of the horizontal circle formed by the three # shoulder joints, minus the radius of the circle formed by the # effector joints. This parameter may also be calculated as: # shoulder_radius = (delta_f - delta_e) / sqrt(12) # This parameter must be provided. shoulder_height: # Distance (in mm) of the shoulder joints from the bed, minus the # effector toolhead height. This parameter must be provided. # The stepper_a section describes the stepper controlling the rear # right arm (at 30 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all arms. [stepper_a] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the arm has an 80 toothed pulley driven # by a pulley with 16 teeth, which is in turn connected to a 60 # toothed pulley driven by a stepper with a 16 toothed pulley, then # one would specify a gear ratio of "80:16, 60:16". This parameter # must be provided. position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. upper_arm_length: # Length (in mm) of the arm connecting the "shoulder joint" to the # "elbow joint". This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. lower_arm_length: # Length (in mm) of the arm connecting the "elbow joint" to the # "effector joint". This parameter must be provided for stepper_a; # for stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the arm is at. # The default is 30 for stepper_a, 150 for stepper_b, and 270 for # stepper_c. # The stepper_b section describes the stepper controlling the rear # left arm (at 150 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the front # arm (at 270 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the shoulder endstop positions. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
uk: [принтер] кінематика: rotary_delta max_z_velocity: # Для дельта-принтерів це обмежує максимальну швидкість (у мм/с). # рухається з рухом осі z. Цей параметр можна використовувати для зменшення # максимальна швидкість рухів вгору/вниз (для яких потрібна більша швидкість кроку # ніж інші рухи на дельта-принтері). За умовчанням використовується # max_velocity для max_z_velocity. #minimum_z_position: 0 # Мінімальне положення Z, яке користувач може наказати рухати головою # до. За замовчуванням 0. радіус плеча: # Радіус (у мм) горизонтального кола, утвореного трьома # плечових суглобів, мінус радіус кола, утвореного # ефекторні суглоби. Цей параметр також можна розрахувати як: # радіус_плеча = (delta_f - delta_e) / sqrt(12) # Цей параметр необхідно вказати. висота плечей: # Відстань (у мм) плечових суглобів від ліжка, мінус # Висота інструментальної головки ефектора. Цей параметр необхідно вказати. # Розділ stepper_a описує степпер, який контролює задню частину # права рука (під кутом 30 градусів). Цей розділ також керує самонаведенням # параметри (homing_speed, homing_retract_dist) для всіх рук. [stepper_a] передаточне число: # Необхідно вказати gear_ratio, а rotation_distance — не можна # вказано. Наприклад, якщо важіль має шків із 80 зубцями # шківом із 16 зубцями, який у свою чергу з’єднаний із 60 # зубчастий шків, що приводиться в рух кроковим механізмом з 16-зубчастим шківом, тоді # можна вказати передавальне число "80:16, 60:16". Цей параметр Потрібно вказати #. position_endstop: # Відстань (у мм) між соплом і ліжком, коли сопло є # у центрі області збірки та спрацьовує кінцевий упор. Це # параметр повинен бути наданий для stepper_a; для stepper_b і # stepper_c цей параметр за умовчанням має значення, указане для # степпер_а. upper_arm_length: # Довжина (у мм) плеча, що з’єднує «плечовий суглоб» із # «ліктьовий суглоб». Цей параметр необхідно надати для stepper_a; для # stepper_b і stepper_c цей параметр має значення за замовчуванням # вказано для stepper_a. нижня_довжина_руки: # Довжина (у мм) руки, що з’єднує «ліктьовий суглоб» з # «ефекторний суглоб». Цей параметр необхідно надати для stepper_a; # для stepper_b і stepper_c цей параметр має значення за замовчуванням # вказано для stepper_a. #кут: # Ця опція вказує кут (у градусах), під яким знаходиться плече. # За замовчуванням 30 для stepper_a, 150 для stepper_b і 270 для # кроковий_c. # Розділ stepper_b описує степпер, який контролює задню частину # ліва рука (на 150 градусів). [stepper_b] # Розділ stepper_c описує степпер, який керує фронтом # рука (на 270 градусів). [stepper_c] # Розділ delta_calibrate дозволяє розширений DELTA_CALIBRATE # Команда g-коду, яка може відкалібрувати позиції кінцевих упорів плеча. [delta_calibrate] радіус: # Радіус (у мм) зони, яка може бути досліджена. Це радіус # координат сопла, що досліджується; якщо використовується автоматичний зонд # зі зміщенням XY, а потім виберіть достатньо малий радіус, щоб # зонд завжди підходить над ліжком. Цей параметр необхідно вказати. #швидкість: 50 # Швидкість (у мм/с) незондувальних рухів під час калібрування. # За замовчуванням 50. #horizontal_move_z: 5 # Висота (у мм), на яку слід наказати рухатися голові # безпосередньо перед початком операції зондування. За замовчуванням 5.

source: [printer] kinematics: none max_velocity: 1 max_accel: 1 # The max_velocity and max_accel parameters must be defined. The # values are not used for "none" kinematics.
uk: [принтер] кінематика: немає максимальна_швидкість: 1 max_accel: 1 # Необхідно визначити параметри max_velocity і max_accel. The # значення не використовуються для кінематики "немає".

source: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # See the "extruder" section for a description of the above parameters.
uk: [heater_bed] heater_pin: тип_датчика: sensor_pin: КОНТРОЛЬ: min_temp: max_temp: # Опис наведених вище параметрів див. у розділі «Екструдер».

source: ---------------- |Z1 Z2| | --------- | | | | | | | | | | x-------- | |Z Z3| ----------------
uk: ---------------- |Z1 Z2| | --------- | | | | | | | | | | х-------- | |Z Z3| ----------------

source: [skew_correction]
uk: [виправлення перекосу]

source: [homing_override] gcode: # A list of G-Code commands to execute in place of G28 commands # found in the normal g-code input. See docs/Command_Templates.md # for G-Code format. If a G28 is contained in this list of commands # then it will invoke the normal homing procedure for the printer. # The commands listed here must home all axes. This parameter must # be provided. #axes: xyz # The axes to override. For example, if this is set to "z" then the # override script will only be run when the z axis is homed (eg, via # a "G28" or "G28 Z0" command). Note, the override script should # still home all axes. The default is "xyz" which causes the # override script to be run in place of all G28 commands. #set_position_x: #set_position_y: #set_position_z: # If specified, the printer will assume the axis is at the specified # position prior to running the above g-code commands. Setting this # disables homing checks for that axis. This may be useful if the # head must move prior to invoking the normal G28 mechanism for an # axis. The default is to not force a position for an axis.
uk: [homing_override] gcode: Список команд G-Code для виконання замість команд G28 знайдено у звичайному введенні g-коду. Перегляньте docs/Command_Templates.md для формату G-коду. Якщо G28 міститься в цьому списку команд тоді він викличе звичайну процедуру початкового переходу для принтера. Перелічені тут команди мають налаштувати всі осі. Цей параметр повинен бути надано. #осі: xyz Осі для перевизначення. Наприклад, якщо встановлено значення "z", то Сценарій # перевизначення буде запущено лише тоді, коли вісь z переведена на вихідну (наприклад, через команда "G28" або "G28 Z0"). Зауважте, сценарій перевизначення повинен ще вдома всі осі. Типовим є "xyz", що викликає сценарій перевизначення, який буде запущено замість усіх команд G28. #set_position_x: #set_position_y: #set_position_z: Якщо вказано, принтер вважатиме, що вісь знаходиться на вказаному місці позиція перед виконанням наведених вище команд g-коду. Налаштування цього вимикає перевірку початкового положення для цієї осі. Це може бути корисним, якщо голова повинна рухатися перед тим, як викликати звичайний механізм G28 для an вісь. За замовчуванням положення осі не примусово встановлюється.

source: [endstop_phase stepper_z] #endstop_accuracy: # Sets the expected accuracy (in mm) of the endstop. This represents # the maximum error distance the endstop may trigger (eg, if an # endstop may occasionally trigger 100um early or up to 100um late # then set this to 0.200 for 200um). The default is # 4*rotation_distance/full_steps_per_rotation. #trigger_phase: # This specifies the phase of the stepper motor driver to expect # when hitting the endstop. It is composed of two numbers separated # by a forward slash character - the phase and the total number of # phases (eg, "7/64"). Only set this value if one is sure the # stepper motor driver is reset every time the mcu is reset. If this # is not set, then the stepper phase will be detected on the first # home and that phase will be used on all subsequent homes. #endstop_align_zero: False # If true then the position_endstop of the axis will effectively be # modified so that the zero position for the axis occurs at a full # step on the stepper motor. (If used on the Z axis and the print # layer height is a multiple of a full step distance then every # layer will occur on a full step.) The default is False.
uk: [endstop_phase stepper_z] #endstop_accuracy: Встановлює очікувану точність (у мм) кінцевого упору. Це представляє максимальна відстань помилки, яку може викликати кінцевий упор (наприклад, якщо an Кінцева зупинка може іноді запускати 100um раніше або до 100um пізніше потім встановіть значення 0,200 для 200um). За замовчуванням 4*відстань_обертання/повні_кроки_обертання. #trigger_phase: Це визначає очікувану фазу драйвера крокового двигуна при попаданні в кінцевий упор. Він складається з двох розділених чисел через косу риску - фаза і загальна кількість фази (наприклад, "7/64"). Встановлюйте це значення, лише якщо впевнені драйвер крокового двигуна скидається щоразу, коли скидається мікроконтролер. Якщо це не встановлено, то крокову фазу буде виявлено першою будинок, і ця фаза використовуватиметься в усіх наступних будинках. #endstop_align_zero: невірно Якщо істинно, тоді position_endstop осі фактично буде таким змінено таким чином, що нульове положення для осі відбувається на повному рівні крок на кроковому двигуні. (Якщо використовується на осі Z і друку Висота # шару є кратною відстані повного кроку, а потім кожні шар з'явиться на повному кроці.) Типовим значенням є False.
