Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [axis_twist_compensation] #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. calibrate_start_x: 20 # Defines the minimum X coordinate of the calibration # This should be the X coordinate that positions the nozzle at the starting # calibration position. This parameter must be provided. calibrate_end_x: 200 # Defines the maximum X coordinate of the calibration # This should be the X coordinate that positions the nozzle at the ending # calibration position. This parameter must be provided. calibrate_y: 112.5 # Defines the Y coordinate of the calibration # This should be the Y coordinate that positions the nozzle during the # calibration process. This parameter must be provided and is recommended to # be near the center of the bed
uk: [axis_twist_compensation] #швидкість: 50 Швидкість (у мм/с) незондувальних рухів під час калібрування. За замовчуванням 50. #horizontal_move_z: 5 Висота (у мм), на яку слід наказати рухатися голові безпосередньо перед початком операції зондування. За замовчуванням 5. calibrate_start_x: 20 Визначає мінімальну координату X калібрування Це має бути координата X, яка розташовує сопло на початку позиція калібрування. Цей параметр необхідно вказати. calibrate_end_x: 200 Визначає максимальну координату X калібрування Це має бути координата X, яка розташовує сопло в кінці позиція калібрування. Цей параметр необхідно вказати. calibrate_y: 112,5 Визначає координату Y калібрування Це має бути координата Y, яка розташовує сопло під час процес калібрування. Цей параметр повинен бути наданий і рекомендований бути біля центру ліжка

source: Support for cartesian and hybrid_corexy/z printers with dual carriages on a single axis. The carriage mode can be set via the SET_DUAL_CARRIAGE extended g-code command. For example, "SET_DUAL_CARRIAGE CARRIAGE=1" command will activate the carriage defined in this section (CARRIAGE=0 will return activation to the primary carriage). Dual carriage support is typically combined with extra extruders - the SET_DUAL_CARRIAGE command is often called at the same time as the ACTIVATE_EXTRUDER command. Be sure to park the carriages during deactivation. Note that during G28 homing, typically the primary carriage is homed first followed by the carriage defined in the `[dual_carriage]` config section. However, the `[dual_carriage]` carriage will be homed first if both carriages home in a positive direction and the [dual_carriage] carriage has a `position_endstop` greater than the primary carriage, or if both carriages home in a negative direction and the `[dual_carriage]` carriage has a `position_endstop` less than the primary carriage.
uk: Підтримка декартових і hybrid_corexy/z принтерів із подвійними каретками на одній осі. Режим каретки можна встановити за допомогою розширеної команди g-коду SET_DUAL_CARRIAGE. Наприклад, команда "SET_DUAL_CARRIAGE CARRIAGE=1" активує каретку, визначену в цьому розділі (CARRIAGE=0 поверне активацію до основної каретки). Підтримка подвійної каретки зазвичай поєднується з додатковими екструдерами - команда SET_DUAL_CARRIAGE часто викликається одночасно з командою ACTIVATE_EXTRUDER. Обов'язково припаркуйте коляски під час дезактивації. Зауважте, що під час наведення G28 зазвичай первинна каретка спочатку повертається, а потім каретка, визначена в розділі конфігурації `[dual_carriage]`. Однак каретка `[dual_carriage]` буде відправлена першою, якщо обидві каретки повертаються додому в позитивному напрямку, а каретка [dual_carriage] має значення `position_endstop` більше, ніж основна каретка, або якщо обидві каретки повертаються додому в негативному напрямку, а ` [dual_carriage]` каретка має `position_endstop` менше, ніж основна каретка.

source: Additionally, one could use "SET_DUAL_CARRIAGE CARRIAGE=1 MODE=COPY" or "SET_DUAL_CARRIAGE CARRIAGE=1 MODE=MIRROR" commands to activate either copying or mirroring mode of the dual carriage, in which case it will follow the motion of the carriage 0 accordingly. These commands can be used to print two parts simultaneously - either two identical parts (in COPY mode) or mirrored parts (in MIRROR mode). Note that COPY and MIRROR modes also require appropriate configuration of the extruder on the dual carriage, which can typically be achieved with "SYNC_EXTRUDER_MOTION MOTION_QUEUE=extruder EXTRUDER=<dual_carriage_extruder>" or a similar command.
uk: Крім того, можна використовувати команди «SET_DUAL_CARRIAGE CARRIAGE=1 MODE=COPY» або «SET_DUAL_CARRIAGE CARRIAGE=1 MODE=MIRROR», щоб активувати режим копіювання або дзеркального відображення подвійної каретки, у цьому випадку вона відповідним чином слідуватиме руху каретки 0. . Ці команди можна використовувати для друку двох частин одночасно - двох ідентичних частин (у режимі КОПІЮВАННЯ) або дзеркальних частин (у режимі ДЗЕРКАЛО). Зауважте, що режими COPY та MIRROR також вимагають відповідної конфігурації екструдера на подвійній каретці, що зазвичай можна досягти за допомогою "SYNC_EXTRUDER_MOTION MOTION_QUEUE=extruder EXTRUDER=<dual_carriage_extruder> " або подібна команда.

source: [dual_carriage] axis: # The axis this extra carriage is on (either x or y). This parameter # must be provided. #safe_distance: # The minimum distance (in mm) to enforce between the dual and the primary # carriages. If a G-Code command is executed that will bring the carriages # closer than the specified limit, such a command will be rejected with an # error. If safe_distance is not provided, it will be inferred from # position_min and position_max for the dual and primary carriages. If set # to 0 (or safe_distance is unset and position_min and position_max are # identical for the primary and dual carraiges), the carriages proximity # checks will be disabled. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # See the "stepper" section for the definition of the above parameters.
uk: [dual_carriage] вісь: Вісь, на якій знаходиться ця додаткова каретка (або x, або y). Цей параметр Потрібно вказати #. #безпечна_відстань: Мінімальна відстань (у мм), яку слід дотримуватися між подвійним і основним вагони. Якщо буде виконано команду G-Code, вона перенесе каретки ближче за вказане обмеження, таку команду буде відхилено за допомогою an помилка. Якщо safe_distance не вказано, воно буде виведено з position_min і position_max для подвійної та первинної кареток. Якщо встановлено до 0 (або safe_distance не встановлено, а position_min і position_max є ідентичні для основного та подвійного вагонів), близькість вагонів перевірки буде вимкнено. #step_pin: #dir_pin: #enable_pin: #мікрокроки: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: Дивіться розділ «кроковий» для визначення наведених вище параметрів.

source: AHT10/AHT20/AHT21 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C) and relative humidity. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report humidity in addition to temperature.
uk: Датчики навколишнього середовища з двопровідним інтерфейсом (I2C) AHT10/AHT20/AHT21. Зауважте, що ці датчики не призначені для використання з екструдерами та нагрівальними ліжками, а скоріше для моніторингу температури навколишнього середовища (C) і відносної вологості. Перегляньте sample-macros.cfg для gcode_macro, який можна використовувати для повідомлення вологості на додаток до температури.

source: sensor_type: AHT10 # Also use AHT10 for AHT20 and AHT21 sensors. #i2c_address: # Default is 56 (0x38). Some AHT10 sensors give the option to use # 57 (0x39) by moving a resistor. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #aht10_report_time: # Interval in seconds between readings. Default is 30, minimum is 5
uk: тип датчика: AHT10 # Також використовуйте AHT10 для датчиків AHT20 і AHT21. #i2c_адреса: # За замовчуванням 56 (0x38). Деякі датчики AHT10 дають можливість використовувати # 57 (0x39) шляхом переміщення резистора. #i2c_mcu: #i2c_bus: #i2c_швидкість: # Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис # параметр вище. #aht10_report_time: # Інтервал у секундах між читаннями. За замовчуванням 30, мінімум 5

source: sensor_type: # Must be "HTU21D" , "SI7013", "SI7020", "SI7021" or "SHT21" #i2c_address: # Default is 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #htu21d_hold_master: # If the sensor can hold the I2C buf while reading. If True no other # bus communication can be performed while reading is in progress. # Default is False. #htu21d_resolution: # The resolution of temperature and humidity reading. # Valid values are: # 'TEMP14_HUM12' -> 14bit for Temp and 12bit for humidity # 'TEMP13_HUM10' -> 13bit for Temp and 10bit for humidity # 'TEMP12_HUM08' -> 12bit for Temp and 08bit for humidity # 'TEMP11_HUM11' -> 11bit for Temp and 11bit for humidity # Default is: "TEMP11_HUM11" #htu21d_report_time: # Interval in seconds between readings. Default is 30
uk: тип_датчика: # Має бути "HTU21D", "SI7013", "SI7020", "SI7021" або "SHT21" #i2c_адреса: # За замовчуванням 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: # Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис # параметр вище. #htu21d_hold_master: # Якщо датчик може утримувати буфер I2C під час читання. Якщо True, немає іншого # Зв'язок по шині може здійснюватися під час читання. # За замовчуванням значення False. #htu21d_resolution: # Роздільна здатність зчитування температури та вологості. # Дійсні значення: # 'TEMP14_HUM12' -> 14 біт для температури та 12 біт для вологості # 'TEMP13_HUM10' -> 13 біт для температури та 10 біт для вологості # 'TEMP12_HUM08' -> 12 біт для температури та 08 біт для вологості # 'TEMP11_HUM11' -> 11 біт для температури та 11 біт для вологості # За замовчуванням: "TEMP11_HUM11" #htu21d_report_time: # Інтервал у секундах між читаннями. За замовчуванням 30

source: sensor_type: LM75 #i2c_address: # Default is 72 (0x48). Normal range is 72-79 (0x48-0x4F) and the 3 # low bits of the address are configured via pins on the chip # (usually with jumpers or hard wired). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #lm75_report_time: # Interval in seconds between readings. Default is 0.8, with minimum # 0.5.
uk: тип датчика: LM75 #i2c_адреса: # За замовчуванням 72 (0x48). Нормальний діапазон становить 72-79 (0x48-0x4F) і 3 # молодших бітів адреси налаштовуються через контакти на мікросхемі # (зазвичай з перемичками або з жорстким проводом). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: # Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис # параметр вище. #lm75_report_time: # Інтервал у секундах між читаннями. За замовчуванням 0,8, мінімальний # 0,5.

source: Combined temperature sensor
uk: Комбінований датчик температури

source: Combined temperature sensor is a virtual temperature sensor based on several other sensors. This sensor can be used with extruders, heater_generic and heater beds.
uk: Комбінований датчик температури — це віртуальний датчик температури на основі кількох інших датчиків. Цей датчик можна використовувати з екструдерами, heater_generic і нагрівальними ліжками.

source: sensor_type: temperature_combined #sensor_list: # Must be provided. List of sensors to combine to new "virtual" # sensor. # E.g. 'temperature_sensor sensor1,extruder,heater_bed' #combination_method: # Must be provided. Combination method used for the sensor. # Available options are 'max', 'min', 'mean'. #maximum_deviation: # Must be provided. Maximum permissible deviation between the sensors # to combine (e.g. 5 degrees). To disable it, use a large value (e.g. 999.9)
uk: тип_сенсора: комбінований_температурний #sensor_list: # Необхідно надати. Список датчиків для об’єднання в новий «віртуальний» # датчик. # Наприклад 'temperature_sensor sensor1,extruder,heater_bed' #combination_method: # Необхідно надати. Для датчика використовується комбінований метод. # Доступні параметри: «max», «min», «mean». #maximum_deviation: # Необхідно надати. Максимально допустиме відхилення між датчиками # для поєднання (наприклад, 5 градусів). Щоб вимкнути його, використовуйте велике значення (наприклад, 999,9)

source: [heater_fan heatbreak_cooling_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #heater: extruder # Name of the config section defining the heater that this fan is # associated with. If a comma separated list of heater names is # provided here, then the fan will be enabled when any of the given # heaters are enabled. The default is "extruder". #heater_temp: 50.0 # A temperature (in Celsius) that the heater must drop below before # the fan is disabled. The default is 50 Celsius. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when its associated heater is enabled. The default # is 1.0
uk: [heater_fan heatbreak_cooling_fan] #pin: #max_power: #shutdown_speed: #час_циклу: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #тахометр_ppr: #tachometer_poll_interval: #enable_pin: Дивіться розділ "вентилятор" для опису наведених вище параметрів. #нагрівач: екструдер Назва розділу конфігурації, що визначає нагрівач, яким є цей вентилятор пов'язано з. Якщо розділений комами список імен нагрівачів наведено тут, тоді вентилятор буде ввімкнено, коли будь-який із наведених Увімкнено # обігрівача. Типовим є "екструдер". #heater_temp: 50.0 Температура (у градусах Цельсія), нижче якої нагрівач повинен опуститися раніше вентилятор вимкнено. За замовчуванням 50 за Цельсієм. #швидкість_вентилятора: 1.0 Швидкість вентилятора (виражена значенням від 0,0 до 1,0), яку вентилятор буде встановлено, коли відповідний обігрівач увімкнено. За замовчуванням is 1.0

source: [pca9533 my_pca9533] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. Use 98 for # the PCA9533/1, 99 for the PCA9533/2. The default is 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
uk: [pca9533 my_pca9533] #i2c_адреса: 98 Адреса i2c, яку чіп використовує на шині i2c. Використовуйте 98 для PCA9533/1, 99 для PCA9533/2. За замовчуванням 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис параметр вище. #initial_RED: 0,0 #initial_GREEN: 0,0 #початковий_СИНІЙ: 0,0 #початковий_БІЛИЙ: 0,0 Дивіться розділ "led", щоб отримати інформацію про ці параметри.

source: [pca9632 my_pca9632] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. This may be # 96, 97, 98, or 99. The default is 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #scl_pin: #sda_pin: # Alternatively, if the pca9632 is not connected to a hardware I2C # bus, then one may specify the "clock" (scl_pin) and "data" # (sda_pin) pins. The default is to use hardware I2C. #color_order: RGBW # Set the pixel order of the LED (using a string containing the # letters R, G, B, W). The default is RGBW. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
uk: [pca9632 my_pca9632] #i2c_адреса: 98 Адреса i2c, яку чіп використовує на шині i2c. Це може бути 96, 97, 98 або 99. За замовчуванням 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис параметр вище. #scl_pin: #sda_pin: Альтернативно, якщо pca9632 не підключено до апаратного I2C шина, тоді можна вказати "годинник" (scl_pin) і "дані" (sda_pin) контактів. За замовчуванням використовується апаратне забезпечення I2C. #color_order: RGBW Встановити порядок пікселів світлодіода (використовуючи рядок, що містить літери R, G, B, W). Типовим є RGBW. #initial_RED: 0,0 #initial_GREEN: 0,0 #початковий_СИНІЙ: 0,0 #початковий_БІЛИЙ: 0,0 Дивіться розділ "led", щоб отримати інформацію про ці параметри.

source: [tmc2208 stepper_x] uart_pin: # The pin connected to the TMC2208 PDN_UART line. This parameter # must be provided. #tx_pin: # If using separate receive and transmit lines to communicate with # the driver then set uart_pin to the receive pin and tx_pin to the # transmit pin. The default is to use uart_pin for both reading and # writing. #select_pins: # A comma separated list of pins to set prior to accessing the # tmc2208 UART. This may be useful for configuring an analog mux for # UART communication. The default is to not configure any pins. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This interpolation does # introduce a small systemic positional deviation - see # TMC_Drivers.md for details. The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.110 # The resistance (in ohms) of the motor sense resistor. The default # is 0.110 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_MULTISTEP_FILT: True #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # Set the given register during the configuration of the TMC2208 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list.
uk: [tmc2208 stepper_x] uart_pin: # Вивід, підключений до лінії TMC2208 PDN_UART. Цей параметр Потрібно вказати #. #tx_pin: # Якщо для зв’язку використовуються окремі лінії прийому та передачі # драйвер потім встановлює uart_pin на приймальний pin і tx_pin на # PIN передачі. За замовчуванням uart_pin використовується як для читання, так і для # написання. #select_pins: # Розділений комами список контактів, які потрібно встановити перед доступом до # tmc2208 UART. Це може бути корисним для налаштування аналогового мультиплексора # Зв'язок UART. За замовчуванням жодні контакти не налаштовуються. #interpolate: Правда # Якщо істина, увімкнути крокову інтерполяцію (драйвер буде внутрішньо # крок зі швидкістю 256 мікрокроків). Ця інтерполяція робить # ввести невелике системне позиційне відхилення - див # TMC_Drivers.md для деталей. Типовим значенням є True. run_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # під час руху степера. Цей параметр необхідно вказати. #hold_current: # Величина струму (в амперах RMS), щоб налаштувати драйвер для використання # коли степпер не рухається. Налаштування hold_current не є # рекомендовано (подробиці див. на TMC_Drivers.md). Типовим значенням є # не зменшувати струм. #сенс_резистор: 0,110 # Опір (в Омах) резистора датчика двигуна. За замовчуванням # дорівнює 0,110 Ом. #stealthchop_threshold: 0 # Швидкість (у мм/с), на яку потрібно встановити порогове значення "stealthChop". Коли # set, режим "stealthChop" буде ввімкнено, якщо кроковий двигун # швидкість нижче цього значення. За замовчуванням 0, що вимикає # режим "stealthChop". #driver_MULTISTEP_FILT: Правда #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #драйвер_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: Правда #driver_PWM_AUTOSCALE: Правда #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # Встановіть заданий регістр під час конфігурації TMC2208 # чіп. Це може бути використано для встановлення власних параметрів двигуна. The # значення за замовчуванням для кожного параметра вказано поруч із назвою параметра в # вище списку.

source: Configure a TMC2240 stepper motor driver via SPI bus or UART. To use this feature, define a config section with a "tmc2240" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2240 stepper_x]").
uk: Налаштуйте драйвер крокового двигуна TMC2240 через шину SPI або UART. Щоб скористатися цією функцією, визначте розділ конфігурації з префіксом «tmc2240», за яким слідує назва відповідного розділу конфігурації степера (наприклад, «[tmc2240 stepper_x]»).
