Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [angle my_angle_sensor] sensor_type: # The type of the magnetic hall sensor chip. Available choices are # "a1333", "as5047d", and "tle5012b". This parameter must be # specified. #sample_period: 0.000400 # The query period (in seconds) to use during measurements. The # default is 0.000400 (which is 2500 samples per second). #stepper: # The name of the stepper that the angle sensor is attached to (eg, # "stepper_x"). Setting this value enables an angle calibration # tool. To use this feature, the Python "numpy" package must be # installed. The default is to not enable angle calibration for the # angle sensor. cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters.
uk: [angle my_angle_sensor] тип_датчика: Тип мікросхеми магнітного датчика Холла. Доступні варіанти "a1333", "as5047d" і "tle5012b". Цей параметр повинен бути вказано. #період_вибірки: 0,000400 Період запиту (у секундах) для використання під час вимірювань. The за замовчуванням 0,000400 (що становить 2500 вибірок на секунду). #степер: Назва степпера, до якого прикріплено датчик кута (наприклад, "stepper_x"). Встановлення цього значення вмикає калібрування кута інструмент. Щоб використовувати цю функцію, потрібен пакет Python "numpy". встановлено. За замовчуванням не вмикається калібрування кута для датчик кута. cs_pin: Штифт увімкнення SPI для датчика. Цей параметр необхідно вказати. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис параметр вище.

source: [resonance_tester] #probe_points: # A list of X, Y, Z coordinates of points (one point per line) to test # resonances at. At least one point is required. Make sure that all # points with some safety margin in XY plane (~a few centimeters) # are reachable by the toolhead. #accel_chip: # A name of the accelerometer chip to use for measurements. If # adxl345 chip was defined without an explicit name, this parameter # can simply reference it as "accel_chip: adxl345", otherwise an # explicit name must be supplied as well, e.g. "accel_chip: adxl345 # my_chip_name". Either this, or the next two parameters must be # set. #accel_chip_x: #accel_chip_y: # Names of the accelerometer chips to use for measurements for each # of the axis. Can be useful, for instance, on bed slinger printer, # if two separate accelerometers are mounted on the bed (for Y axis) # and on the toolhead (for X axis). These parameters have the same # format as 'accel_chip' parameter. Only 'accel_chip' or these two # parameters must be provided. #max_smoothing: # Maximum input shaper smoothing to allow for each axis during shaper # auto-calibration (with 'SHAPER_CALIBRATE' command). By default no # maximum smoothing is specified. Refer to Measuring_Resonances guide # for more details on using this feature. #min_freq: 5 # Minimum frequency to test for resonances. The default is 5 Hz. #max_freq: 133.33 # Maximum frequency to test for resonances. The default is 133.33 Hz. #accel_per_hz: 75 # This parameter is used to determine which acceleration to use to # test a specific frequency: accel = accel_per_hz * freq. Higher the # value, the higher is the energy of the oscillations. Can be set to # a lower than the default value if the resonances get too strong on # the printer. However, lower values make measurements of # high-frequency resonances less precise. The default value is 75 # (mm/sec). #hz_per_sec: 1 # Determines the speed of the test. When testing all frequencies in # range [min_freq, max_freq], each second the frequency increases by # hz_per_sec. Small values make the test slow, and the large values # will decrease the precision of the test. The default value is 1.0 # (Hz/sec == sec^-2).
uk: [resonance_tester] #probe_points: # Список координат X, Y, Z точок (по одній точці на лінію) для перевірки # резонансів при. Необхідно принаймні один бал. Переконайтеся, що всі # точки з деяким запасом міцності в площині XY (~кілька сантиметрів) # доступні за допомогою інструментальної головки. #accel_chip: # Назва чіпа акселерометра, який буде використовуватися для вимірювань. Якщо # чіп adxl345 був визначений без явного імені, цей параметр # можна просто посилатися на нього як на "accel_chip: adxl345", інакше an #Також має бути вказано # явне ім’я, напр. "accel_chip: adxl345 # my_chip_name". Має бути або цей, або наступні два параметри # набір. #accel_chip_x: #accel_chip_y: # Назви чіпів акселерометрів, які будуть використовуватися для вимірювань для кожного # осі. Може бути корисним, наприклад, на принтері bed slinger, # якщо на ліжку встановлено два окремих акселерометри (для осі Y) # і на інструментальній головці (для осі X). Ці параметри однакові # формат як параметр "accel_chip". Тільки 'accel_chip' або ці два Потрібно вказати # параметр. #max_smoothing: # Максимальне згладжування вхідного шейпера для кожної осі під час шейпера # автокалібрування (за допомогою команди 'SHAPER_CALIBRATE'). За замовчуванням ні # вказано максимальне згладжування. Див. посібник Measuring_Resonances #, щоб дізнатися більше про використання цієї функції. #min_freq: 5 # Мінімальна частота для перевірки резонансів. За замовчуванням 5 Гц. #max_freq: 133,33 # Максимальна частота для перевірки резонансів. За замовчуванням 133,33 Гц. #accel_per_hz: 75 # Цей параметр використовується для визначення того, яке прискорення використовувати # перевірка певної частоти: accel = accel_per_hz * freq. Вище # значення, тим більша енергія коливань. Можна встановити на # нижче значення за замовчуванням, якщо резонанси стають занадто сильними #принтер. Однак нижчі значення роблять вимірювання # високочастотні резонанси менш точні. Значення за замовчуванням – 75 # (мм/с). #hz_per_sec: 1 # Визначає швидкість тесту. При тестуванні всіх частот в # діапазон [min_freq, max_freq], щосекунди частота збільшується на # Гц_за_сек. Малі значення роблять тест повільним, а великі # зменшить точність тесту. Значення за замовчуванням — 1,0 # (Гц/сек == сек^-2).

source: The "Smart Effector" from Duet3d implements a Z probe using a force sensor. One may define this section instead of `[probe]` to enable the Smart Effector specific features. This also enables [runtime commands](G-Codes.md#smart_effector) to adjust the parameters of the Smart Effector at run time.
uk: «Розумний ефектор» від Duet3d реалізує зонд Z за допомогою датчика сили. Можна визначити цей розділ замість `[probe]`, щоб увімкнути особливі функції Smart Effector. Це також дає змогу [командам виконання] (G-Codes.md#smart_effector) регулювати параметри Smart Effector під час виконання.

source: [smart_effector] pin: # Pin connected to the Smart Effector Z Probe output pin (pin 5). Note that # pullup resistor on the board is generally not required. However, if the # output pin is connected to the board pin with a pullup resistor, that # resistor must be high value (e.g. 10K Ohm or more). Some boards have a low # value pullup resistor on the Z probe input, which will likely result in an # always-triggered probe state. In this case, connect the Smart Effector to # a different pin on the board. This parameter is required. #control_pin: # Pin connected to the Smart Effector control input pin (pin 7). If provided, # Smart Effector sensitivity programming commands become available. #probe_accel: # If set, limits the acceleration of the probing moves (in mm/sec^2). # A sudden large acceleration at the beginning of the probing move may # cause spurious probe triggering, especially if the hotend is heavy. # To prevent that, it may be necessary to reduce the acceleration of # the probing moves via this parameter. #recovery_time: 0.4 # A delay between the travel moves and the probing moves in seconds. A fast # travel move prior to probing may result in a spurious probe triggering. # This may cause 'Probe triggered prior to movement' errors if no delay # is set. Value 0 disables the recovery delay. # Default value is 0.4. #x_offset: #y_offset: # Should be left unset (or set to 0). z_offset: # Trigger height of the probe. Start with -0.1 (mm), and adjust later using # `PROBE_CALIBRATE` command. This parameter must be provided. #speed: # Speed (in mm/s) of the Z axis when probing. It is recommended to start # with the probing speed of 20 mm/s and adjust it as necessary to improve # the accuracy and repeatability of the probe triggering. #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # See the "probe" section for more information on the parameters above.
uk: [smart_effector] прикріпити: # Штифт, підключений до вихідного контакту зонда Smart Effector Z (контакт 5). Зауважте, що # Підтягуючий резистор на платі зазвичай не потрібен. Однак, якщо # вихідний висновок підключений до контакту плати за допомогою підтягуючого резистора, тобто # резистор має мати велике значення (наприклад, 10 кОм або більше). Деякі дошки мають низький # значення підтягуючого резистора на вході датчика Z, що, ймовірно, призведе до # стан зонда, що завжди запускається. У цьому випадку підключіть Smart Effector до # інший контакт на платі. Цей параметр обов'язковий. #control_pin: # Штифт, підключений до вхідного контакту керування Smart Effector (контакт 7). Якщо передбачено, # Стають доступними команди програмування чутливості Smart Effector. #probe_accel: # Якщо встановлено, обмежує прискорення рухів зондування (у мм/с^2). # Можливе раптове велике прискорення на початку зондувального руху # спричинити помилкове спрацьовування зонда, особливо якщо хотенд важкий. # Щоб запобігти цьому, може знадобитися зменшити прискорення # зондування рухається через цей параметр. #час_відновлення: 0,4 # Затримка в секундах між рухом руху та рухом зондування. Швидкий # пересування перед зондуванням може призвести до помилкового запуску зонда. # Це може спричинити помилку «Зонд спрацьовує перед рухом», якщо немає затримки # встановлено. Значення 0 вимикає затримку відновлення. # Значення за замовчуванням 0,4. #x_offset: #y_offset: # Не має бути встановлено (або встановлено на 0). z_offset: # Висота тригера зонда. Почніть з -0,1 (мм) і налаштуйте пізніше за допомогою # Команда `PROBE_CALIBRATE`. Цей параметр необхідно вказати. #швидкість: # Швидкість (у мм/с) осі Z під час вимірювання. Рекомендується почати # зі швидкістю зондування 20 мм/с і відрегулюйте її за необхідності для покращення # точність і повторюваність спрацьовування зонда. #зразки: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # Перегляньте розділ "зонд", щоб отримати додаткові відомості про параметри вище.

source: Note that the [linux mcu](RPi_microcontroller.md) implementation does not currently support directly connected neopixels. The current design using the Linux kernel interface does not allow this scenario because the kernel GPIO interface is not fast enough to provide the required pulse rates.
uk: Зауважте, що реалізація linux mcu наразі не підтримує безпосередньо підключені неопікселі. Поточний дизайн із використанням інтерфейсу ядра Linux не дозволяє цей сценарій, оскільки інтерфейс GPIO ядра недостатньо швидкий, щоб забезпечити необхідну частоту імпульсів.

source: [neopixel my_neopixel] pin: # The pin connected to the neopixel. This parameter must be # provided. #chain_count: # The number of Neopixel chips that are "daisy chained" to the # provided pin. The default is 1 (which indicates only a single # Neopixel is connected to the pin). #color_order: GRB # Set the pixel order required by the LED hardware (using a string # containing the letters R, G, B, W with W optional). Alternatively, # this may be a comma separated list of pixel orders - one for each # LED in the chain. The default is GRB. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
uk: [neopixel my_neopixel] прикріпити: Штифт, підключений до neopixel. Цей параметр повинен бути надано. #chain_count: Кількість чіпів Neopixel, які «шлейфово прив’язані» до наданий PIN-код. За замовчуванням 1 (що вказує лише на один Neopixel підключений до контакту). #color_order: GRB Встановіть порядок пікселів, необхідний для обладнання світлодіодів (за допомогою рядка містить літери R, G, B, W з W необов’язковим). Як альтернатива, це може бути розділений комами список порядків пікселів - по одному для кожного Світлодіод в ланцюжку. Типовим є GRB. #initial_RED: 0,0 #initial_GREEN: 0,0 #початковий_СИНІЙ: 0,0 #початковий_БІЛИЙ: 0,0 Дивіться розділ "led", щоб отримати інформацію про ці параметри.

source: [safe_z_home] home_xy_position: # A X, Y coordinate (e.g. 100, 100) where the Z homing should be # performed. This parameter must be provided. #speed: 50.0 # Speed at which the toolhead is moved to the safe Z home # coordinate. The default is 50 mm/s #z_hop: # Distance (in mm) to lift the Z axis prior to homing. This is # applied to any homing command, even if it doesn't home the Z axis. # If the Z axis is already homed and the current Z position is less # than z_hop, then this will lift the head to a height of z_hop. If # the Z axis is not already homed the head is lifted by z_hop. # The default is to not implement Z hop. #z_hop_speed: 15.0 # Speed (in mm/s) at which the Z axis is lifted prior to homing. The # default is 15 mm/s. #move_to_previous: False # When set to True, the X and Y axes are reset to their previous # positions after Z axis homing. The default is False.
uk: [safe_z_home] home_xy_position: # Координати X, Y (наприклад, 100, 100), де повинна бути точка наведення Z # виконано. Цей параметр необхідно вказати. #швидкість: 50.0 # Швидкість, з якою інструментальна головка переміщується до безпечного місця Z # координата. За замовчуванням 50 мм/с #z_hop: # Відстань (у мм) для підйому осі Z перед поверненням до початку. Це є # застосовується до будь-якої команди повернення до початку, навіть якщо вона не повертає вісь Z. # Якщо вісь Z уже налаштована, а поточна позиція Z менша # ніж z_hop, тоді це підніме голову на висоту z_hop. Якщо # вісь Z ще не повернута, голова піднімається за допомогою z_hop. # За замовчуванням не реалізовано Z-хоп. #z_hop_speed: 15,0 # Швидкість (у мм/с), з якою вісь Z піднімається перед поверненням у початкове положення. The # за замовчуванням 15 мм/с. #move_to_previous: false # Якщо встановлено значення True, осі X і Y скидаються до попередніх # позиції після наведення осі Z. За замовчуванням значення False.

source: Enables support to exclude or cancel individual objects during the printing process.
uk: Вмикає підтримку для виключення або скасування окремих об’єктів під час процесу друку.

source: See the [exclude objects guide](Exclude_Object.md) and [command reference](G-Codes.md#excludeobject) for additional information. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.
uk: Додаткову інформацію див. у [посібнику з виключення об’єктів](Exclude_Object.md) і [довідці про команди](G-Codes.md#excludeobject). Перегляньте файл [sample-macros.cfg](../config/sample-macros.cfg) для макросу M486 G-Code, сумісного з Marlin/RepRapFirmware.

source: Klipper includes definitions for many types of temperature sensors. These sensors may be used in any config section that requires a temperature sensor (such as an `[extruder]` or `[heater_bed]` section).
uk: Klipper містить визначення для багатьох типів датчиків температури. Ці датчики можна використовувати в будь-якому розділі конфігурації, для якого потрібен датчик температури (наприклад, у розділі [extruder] або [heater_bed] ).

source: Deltesian Kinematics
uk: Кінематика Дельта

source: See [example-deltesian.cfg](../config/example-deltesian.cfg) for an example deltesian kinematics config file.
uk: Перегляньте [example-deltesian.cfg](../config/example-deltesian.cfg) для прикладу конфігураційного файлу дельтесової кінематики.

source: Only parameters specific to deltesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
uk: Тут описано лише параметри, характерні для дельтезійних принтерів - див. загальні кінематичні налаштування для доступних параметрів.

source: [fan] pin: # Output pin controlling the fan. This parameter must be provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # pin may be set to. The value 1.0 allows the pin to be set fully # enabled for extended periods, while a value of 0.5 would allow the # pin to be enabled for no more than half the time. This setting may # be used to limit the total power output (over extended periods) to # the fan. If this value is less than 1.0 then fan speed requests # will be scaled between zero and max_power (for example, if # max_power is .9 and a fan speed of 80% is requested then the fan # power will be set to 72%). The default is 1.0. #shutdown_speed: 0 # The desired fan speed (expressed as a value from 0.0 to 1.0) if # the micro-controller software enters an error state. The default # is 0. #cycle_time: 0.010 # The amount of time (in seconds) for each PWM power cycle to the # fan. It is recommended this be 10 milliseconds or greater when # using software based PWM. The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. Most fans # do not work well with hardware PWM, so it is not recommended to # enable this unless there is an electrical requirement to switch at # very high speeds. When using hardware PWM the actual cycle time is # constrained by the implementation and may be significantly # different than the requested cycle_time. The default is False. #kick_start_time: 0.100 # Time (in seconds) to run the fan at full speed when either first # enabling or increasing it by more than 50% (helps get the fan # spinning). The default is 0.100 seconds. #off_below: 0.0 # The minimum input speed which will power the fan (expressed as a # value from 0.0 to 1.0). When a speed lower than off_below is # requested the fan will instead be turned off. This setting may be # used to prevent fan stalls and to ensure kick starts are # effective. The default is 0.0. # # This setting should be recalibrated whenever max_power is adjusted. # To calibrate this setting, start with off_below set to 0.0 and the # fan spinning. Gradually lower the fan speed to determine the lowest # input speed which reliably drives the fan without stalls. Set # off_below to the duty cycle corresponding to this value (for # example, 12% -> 0.12) or slightly higher. #tachometer_pin: # Tachometer input pin for monitoring fan speed. A pullup is generally # required. This parameter is optional. #tachometer_ppr: 2 # When tachometer_pin is specified, this is the number of pulses per # revolution of the tachometer signal. For a BLDC fan this is # normally half the number of poles. The default is 2. #tachometer_poll_interval: 0.0015 # When tachometer_pin is specified, this is the polling period of the # tachometer pin, in seconds. The default is 0.0015, which is fast # enough for fans below 10000 RPM at 2 PPR. This must be smaller than # 30/(tachometer_ppr*rpm), with some margin, where rpm is the # maximum speed (in RPM) of the fan. #enable_pin: # Optional pin to enable power to the fan. This can be useful for fans # with dedicated PWM inputs. Some of these fans stay on even at 0% PWM # input. In such a case, the PWM pin can be used normally, and e.g. a # ground-switched FET(standard fan pin) can be used to control power to # the fan.
uk: [шанувальник] прикріпити: # Вихідний контакт для керування вентилятором. Цей параметр необхідно вказати. #max_power: 1,0 # Максимальна потужність (виражена значенням від 0,0 до 1,0), яку # pin може бути встановлено на. Значення 1,0 дозволяє встановити штифт повністю # увімкнено протягом тривалого часу, тоді як значення 0,5 дозволить # PIN має бути ввімкнено не більше половини часу. Цей параметр може # використовувати для обмеження загальної вихідної потужності (протягом тривалих періодів). # вентилятор. Якщо це значення менше 1,0, запитується швидкість вентилятора # буде масштабовано від нуля до max_power (наприклад, якщо # max_power дорівнює 0,9, а швидкість вентилятора становить 80%. # потужність буде встановлено на 72%). За замовчуванням 1.0. #shutdown_speed: 0 # Бажана швидкість вентилятора (виражена значенням від 0,0 до 1,0), якщо # програмне забезпечення мікроконтролера переходить у стан помилки. За замовчуванням # дорівнює 0. #час_циклу: 0,010 # Час (у секундах) для кожного циклу живлення ШІМ до # шанувальник. Рекомендується, щоб це було 10 мілісекунд або більше # з використанням програмної ШІМ. За замовчуванням 0,010 секунди. #hardware_pwm: Помилка # Увімкніть це, щоб використовувати апаратну ШІМ замість програмної ШІМ. Більшість уболівальників # погано працюють з апаратною ШІМ, тому не рекомендується # увімкніть це, якщо немає електричних вимог для перемикання # дуже високі швидкості. При використанні апаратної ШІМ фактичний час циклу становить # обмежена впровадженням і може бути значною # відрізняється від запитуваного cycle_time. За замовчуванням значення False. #кік_старт_час: 0,100 # Час (у секундах) для запуску вентилятора на повній швидкості, коли будь-який перший # увімкнення або збільшення більш ніж на 50% (допомагає отримати вентилятор # спінінг). За замовчуванням 0,100 секунди. #off_below: 0,0 # Мінімальна вхідна швидкість, яка забезпечує живлення вентилятора (виражена як a # значення від 0,0 до 1,0). Коли швидкість нижче, ніж off_below # запитав, вентилятор буде вимкнено. Цей параметр може бути # використовується для запобігання зупинці вентилятора та для забезпечення швидкого запуску # ефективний. За замовчуванням 0,0. # # Цей параметр потрібно повторно калібрувати щоразу, коли регулюється max_power. # Щоб відкалібрувати це налаштування, почніть з off_below, встановленого на 0.0, і # вентилятор обертається. Поступово знижуйте швидкість вентилятора, щоб визначити найнижчу # вхідна швидкість, яка надійно керує вентилятором без зупинок. встановити # off_below до робочого циклу, що відповідає цьому значенню (для # наприклад, 12% -> 0,12) або трохи вище. #tachometer_pin: # Вхідний контакт тахометра для контролю швидкості вентилятора. Підтягування - це взагалі # потрібно. Цей параметр необов'язковий. #тахометр_ppr: 2 # Коли вказано tachometer_pin, це кількість імпульсів на # оборот сигналу тахометра. Це для фаната BLDC # зазвичай половина кількості полюсів. За замовчуванням 2. #інтервал_опитування_тахометра: 0,0015 # Якщо вказано tachometer_pin, це період опитування # штифт тахометра, у секундах. За замовчуванням 0,0015, що є швидким # достатньо для вентиляторів нижче 10000 об/хв при 2 PPR. Це має бути менше ніж # 30/(tachometer_ppr*rpm), з деяким запасом, де кількість обертів на хвилину є # максимальна швидкість (об/хв) вентилятора. #enable_pin: # Додатковий штифт для підключення живлення вентилятора. Це може бути корисним для вболівальників # з виділеними входами ШІМ. Деякі з цих вентиляторів залишаються включеними навіть при 0% ШІМ # вхід. У такому випадку штифт ШІМ можна використовувати як звичайно, наприклад a # FET з перемиканням на землю (стандартний контакт вентилятора) можна використовувати для керування живленням # вентилятор.
