Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: Custom ADC temperature sensors (one may define any number of sections with an "adc_temperature" prefix). This allows one to define a custom temperature sensor that measures a voltage on an Analog to Digital Converter (ADC) pin and uses linear interpolation between a set of configured temperature/voltage (or temperature/resistance) measurements to determine the temperature. The resulting sensor can be used as a sensor_type in a heater section. (For example, if one defines a "[adc_temperature my_sensor]" section then one may use a "sensor_type: my_sensor" when defining a heater.) Be sure to place the sensor section in the config file above its first use in a heater section.
uk: Спеціальні датчики температури ADC (можна визначити будь-яку кількість секцій з префіксом "adc_temperature"). Це дозволяє визначити настроюваний датчик температури, який вимірює напругу на контакті аналого-цифрового перетворювача (АЦП) і використовує лінійну інтерполяцію між набором налаштованих вимірювань температури/напруги (або температури/опору) для визначення температури. Отриманий датчик можна використовувати як тип датчика в секції нагрівача. (Наприклад, якщо визначено розділ «[adc_temperature my_sensor]», тоді можна використовувати «sensor_type: my_sensor» під час визначення нагрівача.) Обов’язково розмістіть розділ датчика у файлі конфігурації над його першим використанням у розділі нагрівача. .

source: Generic temperature sensors. One can define any number of additional temperature sensors that are reported via the M105 command.
uk: Загальні датчики температури. Можна визначити будь-яку кількість додаткових датчиків температури, які повідомляються за допомогою команди M105.

source: Temperature sensors
uk: Датчики температури

source: Common thermistors
uk: Звичайні термістори

source: Common thermistors. The following parameters are available in heater sections that use one of these sensors.
uk: Звичайні термістори. Наступні параметри доступні в секціях нагрівача, які використовують один із цих датчиків.

source: Common temperature amplifiers
uk: Загальні підсилювачі температури

source: Common temperature amplifiers. The following parameters are available in heater sections that use one of these sensors.
uk: Загальні підсилювачі температури. Наступні параметри доступні в секціях нагрівача, які використовують один із цих датчиків.

source: Directly connected PT1000 sensor
uk: Безпосередньо підключений датчик PT1000

source: Directly connected PT1000 sensor. The following parameters are available in heater sections that use one of these sensors.
uk: Безпосередньо підключений датчик PT1000. Наступні параметри доступні в секціях нагрівача, які використовують один із цих датчиків.

source: MAXxxxxx temperature sensors
uk: Датчики температури MAXxxxxx

source: MAXxxxxx serial peripheral interface (SPI) temperature based sensors. The following parameters are available in heater sections that use one of these sensor types.
uk: Датчики температури на основі послідовного периферійного інтерфейсу (SPI) MAXxxxxx. Наступні параметри доступні в секціях нагрівача, які використовують один із цих типів датчиків.

source: HTU21D sensor
uk: Датчик HTU21D

source: HTU21D family two wire interface (I2C) environmental sensor. Note that this sensor is not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C) and relative humidity. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report humidity in addition to temperature.
uk: Датчик навколишнього середовища сімейства HTU21D з двопровідним інтерфейсом (I2C). Зауважте, що цей датчик не призначений для використання з екструдерами та нагрівальними ліжками, а скоріше для моніторингу температури навколишнього середовища (C) і відносної вологості. Перегляньте sample-macros.cfg для gcode_macro, який можна використовувати для повідомлення вологості на додаток до температури.

source: LM75 temperature sensor
uk: Датчик температури LM75

source: Builtin micro-controller temperature sensor
uk: Вбудований датчик температури мікроконтролера

source: The atsam, atsamd, and stm32 micro-controllers contain an internal temperature sensor. One can use the "temperature_mcu" sensor to monitor these temperatures.
uk: Мікроконтролери atsam, atsamd і stm32 містять внутрішній датчик температури. Для моніторингу цих температур можна використовувати датчик «temperature_mcu».

source: Host temperature sensor
uk: Датчик температури хоста

source: Temperature from the machine (eg Raspberry Pi) running the host software.
uk: Температура машини (наприклад, Raspberry Pi), на якій запущено програмне забезпечення.

source: DS18B20 temperature sensor
uk: Датчик температури DS18B20

source: DS18B20 is a 1-wire (w1) digital temperature sensor. Note that this sensor is not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C). These sensors have range up to 125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers. DS18B20 sensors are only supported on the "host mcu", e.g. the Raspberry Pi. The w1-gpio Linux kernel module must be installed.
uk: DS18B20 — це 1-провідний (w1) цифровий датчик температури. Зверніть увагу, що цей датчик не призначений для використання з екструдерами та нагрівальними ліжками, а скоріше для моніторингу температури навколишнього середовища (C). Ці датчики мають діапазон до 125 C, тому їх можна використовувати, наприклад, для моніторингу температури в камері. Вони також можуть функціонувати як прості контролери вентилятора/нагрівача. Датчики DS18B20 підтримуються лише на «host mcu», наприклад, Raspberry Pi. Необхідно встановити модуль ядра Linux w1-gpio.

source: Fans
uk: вболівальники

source: [fan]
uk: [шанувальник]

source: Print cooling fan.
uk: Вентилятор охолодження друку.

source: [heater_fan]
uk: [обігрівач_вентилятор]

source: Heater cooling fans (one may define any number of sections with a "heater_fan" prefix). A "heater fan" is a fan that will be enabled whenever its associated heater is active. By default, a heater_fan has a shutdown_speed equal to max_power.
uk: Вентилятори охолодження обігрівача (за допомогою префікса "heater_fan" можна визначити будь-яку кількість секцій). «Вентилятор обігрівача» — це вентилятор, який буде ввімкнено щоразу, коли пов’язаний з ним нагрівач активний. За замовчуванням heater_fan має shutdown_speed, що дорівнює max_power.

source: Temperature-triggered cooling fans (one may define any number of sections with a "temperature_fan" prefix). A "temperature fan" is a fan that will be enabled whenever its associated sensor is above a set temperature. By default, a temperature_fan has a shutdown_speed equal to max_power.
uk: Вентилятори охолодження, що працюють за температурою (можна визначити будь-яку кількість секцій за допомогою префікса "temperature_fan"). «Температурний вентилятор» — це вентилятор, який вмикатиметься щоразу, коли його пов’язаний датчик буде вище заданої температури. За замовчуванням temperature_fan має shutdown_speed, що дорівнює max_power.

source: [servo]
uk: [серво]

source: [neopixel]
uk: [неопіксель]

source: PCA9533 LED support. The PCA9533 is used on the mightyboard.
uk: Підтримка світлодіодів PCA9533. PCA9533 використовується на могутній платі.

source: Execute gcode when a button is pressed or released (or when a pin changes state). You can check the state of the button by using `QUERY_BUTTON button=my_gcode_button`.
uk: Виконувати gcode, коли кнопку натискають або відпускають (або коли пін змінює стан). Ви можете перевірити стан кнопки за допомогою QUERY_BUTTON button=my_gcode_button .

source: [output_pin]
uk: [вихідний_контакт]

source: [static_digital_output]
uk: [статичний_цифровий_вихід]

source: Statically configured digital output pins (one may define any number of sections with a "static_digital_output" prefix). Pins configured here will be setup as a GPIO output during MCU configuration. They can not be changed at run-time.
uk: Статично налаштовані цифрові виводи (можна визначити будь-яку кількість секцій за допомогою префікса "static_digital_output"). Налаштовані тут контакти будуть налаштовані як вихід GPIO під час налаштування MCU. Їх не можна змінити під час виконання.

source: Multiple pin outputs (one may define any number of sections with a "multi_pin" prefix). A multi_pin output creates an internal pin alias that can modify multiple output pins each time the alias pin is set. For example, one could define a "[multi_pin my_fan]" object containing two pins and then set "pin=multi_pin:my_fan" in the "[fan]" section - on each fan change both output pins would be updated. These aliases may not be used with stepper motor pins.
uk: Кілька пінових виходів (можна визначити будь-яку кількість секцій з префіксом "multi_pin"). Вихід multi_pin створює внутрішній псевдонім піна, який може змінювати кілька вихідних пінів кожного разу, коли встановлено псевдонім піна. Наприклад, можна визначити об’єкт «[multi_pin my_fan]», що містить два контакти, а потім встановити «pin=multi_pin:my_fan» у розділі «[fan]» — при кожній зміні вентилятора обидва вихідні контакти оновлюватимуться. Ці псевдоніми не можна використовувати з контактами крокового двигуна.

source: TMC stepper driver configuration
uk: Конфігурація крокового драйвера TMC

source: Configure a TMC2130 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc2130" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2130 stepper_x]").
uk: Налаштуйте драйвер крокового двигуна TMC2130 через шину SPI. Щоб скористатися цією функцією, визначте розділ конфігурації з префіксом «tmc2130», за яким слідує назва відповідного розділу конфігурації степера (наприклад, «[tmc2130 stepper_x]»).

source: Configure a TMC2208 (or TMC2224) stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2208" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2208 stepper_x]").
uk: Налаштуйте драйвер крокового двигуна TMC2208 (або TMC2224) через однопровідний UART. Щоб скористатися цією функцією, визначте розділ конфігурації з префіксом «tmc2208», за яким слідує назва відповідного розділу конфігурації степера (наприклад, «[tmc2208 stepper_x]»).

source: Configure a TMC2209 stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2209" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2209 stepper_x]").
uk: Налаштуйте драйвер крокового двигуна TMC2209 через однопровідний UART. Щоб скористатися цією функцією, визначте розділ конфігурації з префіксом «tmc2209», за яким слідує назва відповідного розділу конфігурації степера (наприклад, «[tmc2209 stepper_x]»).

source: Configure a TMC2660 stepper motor driver via SPI bus. To use this feature, define a config section with a tmc2660 prefix followed by the name of the corresponding stepper config section (for example, "[tmc2660 stepper_x]").
uk: Налаштуйте драйвер крокового двигуна TMC2660 через шину SPI. Щоб скористатися цією функцією, визначте розділ конфігурації з префіксом tmc2660 і назвою відповідного розділу конфігурації степера (наприклад, «[tmc2660 stepper_x]»).

source: Configure a TMC5160 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc5160" prefix followed by the name of the corresponding stepper config section (for example, "[tmc5160 stepper_x]").
uk: Налаштуйте драйвер крокового двигуна TMC5160 через шину SPI. Щоб скористатися цією функцією, визначте розділ конфігурації з префіксом «tmc5160», за яким слідує назва відповідного розділу конфігурації степера (наприклад, «[tmc5160 stepper_x]»).

source: Run-time stepper motor current configuration
uk: Конфігурація струму крокового двигуна під час роботи

source: Statically configured AD5206 digipots connected via SPI bus (one may define any number of sections with an "ad5206" prefix).
uk: Статично налаштовані дигіпоти AD5206, підключені через шину SPI (можна визначити будь-яку кількість секцій з префіксом "ad5206").

source: Statically configured MCP4451 digipot connected via I2C bus (one may define any number of sections with an "mcp4451" prefix).
uk: Статично налаштований дигіпот MCP4451, підключений через шину I2C (можна визначити будь-яку кількість секцій з префіксом "mcp4451").

source: Statically configured MCP4728 digital-to-analog converter connected via I2C bus (one may define any number of sections with an "mcp4728" prefix).
uk: Статично налаштований цифро-аналоговий перетворювач MCP4728, підключений через шину I2C (можна визначити будь-яку кількість секцій з префіксом "mcp4728").

source: Statically configured MCP4018 digipot connected via two gpio "bit banging" pins (one may define any number of sections with an "mcp4018" prefix).
uk: Статично налаштований цифровий пот MCP4018, підключений через два контакти gpio "bit banging" (можна визначити будь-яку кількість секцій з префіксом "mcp4018").

source: Display support
uk: Підтримка дисплея

source: [display]
uk: [дисплей]

source: Support for a display attached to the micro-controller.
uk: Підтримка дисплея, підключеного до мікроконтролера.

source: hd44780 display
uk: дисплей hd44780

source: Information on configuring hd44780 displays (which is used in "RepRapDiscount 2004 Smart Controller" type displays).
uk: Інформація щодо налаштування дисплеїв hd44780 (який використовується в дисплеях типу «RepRapDiscount 2004 Smart Controller»).

source: hd44780_spi display
uk: дисплей hd44780_spi

source: Information on configuring an hd44780_spi display - a 20x04 display controlled via a hardware "shift register" (which is used in mightyboard based printers).
uk: Інформація про конфігурацію дисплея hd44780_spi — дисплея 20x04, керованого через апаратний «регістр зсуву» (який використовується в принтерах на базі mightyboard).

source: st7920 display
uk: дисплей st7920

source: Information on configuring st7920 displays (which is used in "RepRapDiscount 12864 Full Graphic Smart Controller" type displays).
uk: Інформація щодо налаштування дисплеїв st7920 (який використовується в дисплеях типу «RepRapDiscount 12864 Full Graphic Smart Controller»).

source: emulated_st7920 display
uk: emulated_st7920 дисплей

source: Information on configuring an emulated st7920 display - found in some "2.4 inch touchscreen devices" and similar.
uk: Інформація щодо налаштування емульованого дисплея st7920 – зустрічається в деяких «пристроях із сенсорним екраном 2,4 дюйма» тощо.

source: uc1701 display
uk: дисплей uc1701

source: Information on configuring uc1701 displays (which is used in "MKS Mini 12864" type displays).
uk: Інформація про налаштування дисплеїв uc1701 (який використовується в дисплеях типу «МКС Міні 12864»).

source: ssd1306 and sh1106 displays
uk: дисплеї ssd1306 і sh1106

source: Information on configuring ssd1306 and sh1106 displays.
uk: Інформація про налаштування дисплеїв ssd1306 і sh1106.

source: [display_data]
uk: [відображати_дані]

source: Support for displaying custom data on an lcd screen. One may create any number of display groups and any number of data items under those groups. The display will show all the data items for a given group if the display_group option in the [display] section is set to the given group name.
uk: Підтримка відображення користувацьких даних на РК-екрані. Можна створити будь-яку кількість груп відображення та будь-яку кількість елементів даних у цих групах. На дисплеї відображатимуться всі елементи даних для певної групи, якщо для параметра display_group у розділі [display] встановлено вказане ім’я групи.

source: A [default set of display groups](../klippy/extras/display/display.cfg) are automatically created. One can replace or extend these display_data items by overriding the defaults in the main printer.cfg config file.
uk: [Набір груп відображення за замовчуванням] (../klippy/extras/display/display.cfg) створюється автоматично. Можна замінити або розширити ці елементи display_data, перевизначивши значення за замовчуванням у головному конфігураційному файлі printer.cfg.

source: [display_template]
uk: [шаблон_відображення]

source: Display a custom glyph on displays that support it. The given name will be assigned the given display data which can then be referenced in the display templates by their name surrounded by two "tilde" symbols i.e. `~my_display_glyph~`
uk: Відображати спеціальний гліф на дисплеях, які його підтримують. Даному імені буде присвоєно задані дані відображення, на які потім можна буде посилатися в шаблонах відображення за їхнім іменем, оточеним двома символами «тильда», тобто ~my_display_glyph~

source: See [sample-glyphs.cfg](../config/sample-glyphs.cfg) for some examples.
uk: Перегляньте [sample-glyphs.cfg](../config/sample-glyphs.cfg) для деяких прикладів.

source: [display my_extra_display]
uk: [відобразити my_extra_display]

source: If a primary [display] section has been defined in printer.cfg as shown above it is possible to define multiple auxiliary displays. Note that auxiliary displays do not currently support menu functionality, thus they do not support the "menu" options or button configuration.
uk: Якщо основний розділ [display] було визначено у printer.cfg, як показано вище, можна визначити кілька допоміжних дисплеїв. Зауважте, що допоміжні дисплеї наразі не підтримують функції меню, тому вони не підтримують параметри «меню» або конфігурацію кнопок.

source: [menu]
uk: [меню]

source: Customizable lcd display menus.
uk: Настроювані меню РК-дисплея.

source: A [default set of menus](../klippy/extras/display/menu.cfg) are automatically created. One can replace or extend the menu by overriding the defaults in the main printer.cfg config file.
uk: [Набір меню за замовчуванням] (../klippy/extras/display/menu.cfg) створюється автоматично. Меню можна замінити або розширити, змінивши значення за замовчуванням у головному конфігураційному файлі printer.cfg.

source: See the [command template document](Command_Templates.md#menu-templates) for information on menu attributes available during template rendering.
uk: Перегляньте [документ шаблону команди](Command_Templates.md#menu-templates), щоб отримати інформацію про атрибути меню, доступні під час візуалізації шаблону.

source: Filament sensors
uk: Датчики розжарювання

source: Filament Switch Sensor. Support for filament insert and runout detection using a switch sensor, such as an endstop switch.
uk: Датчик перемикання нитки. Підтримка виявлення вставки та биття нитки за допомогою датчика перемикача, наприклад кінцевого перемикача.

source: Filament Motion Sensor. Support for filament insert and runout detection using an encoder that toggles the output pin during filament movement through the sensor.
uk: Датчик руху нитки. Підтримка виявлення вставки та биття нитки за допомогою кодера, який перемикає вихідний штифт під час руху нитки через датчик.

source: TSLl401CL Based Filament Width Sensor. See the [guide](TSL1401CL_Filament_Width_Sensor.md) for more information.
uk: Датчик ширини нитки на основі TSLl401CL. Додаткову інформацію див. у [посібнику](TSL1401CL_Filament_Width_Sensor.md).

source: [hall_filament_width_sensor]
uk: [сенсор_ширини_нитки_холу]

source: Board specific hardware support
uk: Спеціальна апаратна підтримка плати

source: Configure an SX1509 I2C to GPIO expander. Due to the delay incurred by I2C communication you should NOT use SX1509 pins as stepper enable, step or dir pins or any other pin that requires fast bit-banging. They are best used as static or gcode controlled digital outputs or hardware-pwm pins for e.g. fans. One may define any number of sections with an "sx1509" prefix. Each expander provides a set of 16 pins (sx1509_my_sx1509:PIN_0 to sx1509_my_sx1509:PIN_15) which can be used in the printer configuration.
uk: Налаштуйте розширювач SX1509 I2C на GPIO. Через затримку, спричинену зв’язком I2C, вам НЕ слід використовувати контакти SX1509 як крокові ввімкнення, крокові або напрямні контакти або будь-які інші контакти, які потребують швидкої обробки бітів. Їх найкраще використовувати як статичні чи керовані gcode цифрові виходи або штифти апаратної ШІМ для, наприклад, вентиляторів. Можна визначити будь-яку кількість розділів із префіксом "sx1509". Кожен розширювач має набір із 16 контактів (sx1509_my_sx1509:PIN_0 до sx1509_my_sx1509:PIN_15), які можна використовувати в конфігурації принтера.

source: See the [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg) file for an example.
uk: Перегляньте приклад файлу [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg).

source: Duet2 Maestro analog scaling by vref and vssa readings. Defining an adc_scaled section enables virtual adc pins (such as "my_name:PB0") that are automatically adjusted by the board's vref and vssa monitoring pins. Be sure to define this config section above any config sections that use one these virtual pins.
uk: Аналогове масштабування Duet2 Maestro за показниками vref і vssa. Визначення розділу adc_scaled увімкне віртуальні контакти ADC (наприклад, «my_name:PB0»), які автоматично регулюються контактами моніторингу vref і vssa плати. Обов’язково визначте цей розділ конфігурації над усіма розділами конфігурації, які використовують ці віртуальні контакти.

source: See the [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg) file for an example.
uk: Перегляньте приклад файлу [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg).

source: [replicape]
uk: [репліка]

source: Other Custom Modules
uk: Інші спеціальні модулі

source: [palette2]
uk: [палітра2]

source: Palette 2 multimaterial support - provides a tighter integration supporting Palette 2 devices in connected mode.
uk: Багатоматеріальна підтримка Palette 2 - забезпечує більш тісну інтеграцію, підтримуючи пристрої Palette 2 у підключеному режимі.

source: This modules also requires `[virtual_sdcard]` and `[pause_resume]` for full functionality.
uk: Ці модулі також потребують `[virtual_sdcard]` і `[pause_resume]` для повної функціональності.

source: If you use this module, do not use the Palette 2 plugin for Octoprint as they will conflict, and 1 will fail to initialize properly likely aborting your print.
uk: Якщо ви використовуєте цей модуль, не використовуйте плагін Palette 2 для Octoprint, оскільки вони конфліктуватимуть, і 1 не вдасться правильно ініціалізувати, імовірно, ваш друк буде перервано.

source: If you use Octoprint and stream gcode over the serial port instead of printing from virtual_sd, then remo **M1** and **M0** from *Pausing commands* in *Settings > Serial Connection > Firmware & protocol* will prevent the need to start print on the Palette 2 and unpausing in Octoprint for your print to begin.
uk: Якщо ви використовуєте Octoprint і передаєте gcode через послідовний порт замість друку з virtual_sd, тоді видалення M1 і M0 із Призупинення команд у Налаштуваннях > Послідовне з’єднання > Мікропрограмне забезпечення та протокол запобігає необхідності щоб розпочати друк на Palette 2 і відновити паузу в Octoprint для початку друку.

source: Common bus parameters
uk: Загальні параметри шини

source: Common SPI settings
uk: Загальні налаштування SPI

source: The following parameters are generally available for devices using an SPI bus.
uk: Наступні параметри зазвичай доступні для пристроїв, які використовують шину SPI.

source: Common I2C settings
uk: Загальні налаштування I2C

source: The following parameters are generally available for devices using an I2C bus.
uk: Наступні параметри зазвичай доступні для пристроїв, які використовують шину I2C.
