Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: sensor_type: temperature_mcu #sensor_mcu: mcu # The micro-controller to read from. The default is "mcu". #sensor_temperature1: #sensor_adc1: # Specify the above two parameters (a temperature in Celsius and an # ADC value as a float between 0.0 and 1.0) to calibrate the # micro-controller temperature. This may improve the reported # temperature accuracy on some chips. A typical way to obtain this # calibration information is to completely remove power from the # printer for a few hours (to ensure it is at the ambient # temperature), then power it up and use the QUERY_ADC command to # obtain an ADC measurement. Use some other temperature sensor on # the printer to find the corresponding ambient temperature. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification. #sensor_temperature2: #sensor_adc2: # If sensor_temperature1/sensor_adc1 is specified then one may also # specify sensor_temperature2/sensor_adc2 calibration data. Doing so # may provide calibrated "temperature slope" information. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification.
uk: тип_датчика: temperature_mcu #sensor_mcu: mcu # Мікроконтролер для читання. Типовим є "mcu". #sensor_temperature1: #sensor_adc1: # Вкажіть два параметри вище (температуру в градусах Цельсія та ан # Значення АЦП як плаваюче значення між 0,0 і 1,0) для калібрування # мікроконтролер температури. Це може покращити звіт # точність температури на деяких мікросхемах. Типовий спосіб отримати це # інформація про калібрування полягає в повному відключенні живлення від # принтер протягом кількох годин (щоб переконатися, що він знаходиться при температурі навколишнього середовища # температура), потім увімкніть його та скористайтеся командою QUERY_ADC, щоб # отримати вимірювання АЦП. Використовуйте інший датчик температури # принтер, щоб знайти відповідну температуру навколишнього середовища. The # за замовчуванням використовуються дані заводського калібрування # мікроконтролер (за наявності) або номінальні значення з # Специфікація мікроконтролера. #sensor_temperature2: #sensor_adc2: # Якщо вказано sensor_temperature1/sensor_adc1, можна також # вказати дані калібрування sensor_temperature2/sensor_adc2. Роблячи так # може надати відкалібровану інформацію про "нахил температури". The # за замовчуванням використовуються дані заводського калібрування # мікроконтролер (за наявності) або номінальні значення з # Специфікація мікроконтролера.

source: sensor_type: temperature_host #sensor_path: # The path to temperature system file. The default is # "/sys/class/thermal/thermal_zone0/temp" which is the temperature # system file on a Raspberry Pi computer.
uk: тип_сенсора: host_temperature #sensor_path: # Шлях до системного файлу температури. За замовчуванням # "/sys/class/thermal/thermal_zone0/temp", що є температурою # системний файл на комп’ютері Raspberry Pi.

source: sensor_type: DS18B20 serial_no: # Each 1-wire device has a unique serial number used to identify the device, # usually in the format 28-031674b175ff. This parameter must be provided. # Attached 1-wire devices can be listed using the following Linux command: # ls /sys/bus/w1/devices/ #ds18_report_time: # Interval in seconds between readings. Default is 3.0, with a minimum of 1.0 #sensor_mcu: # The micro-controller to read from. Must be the host_mcu
uk: тип датчика: DS18B20 serial_no: # Кожен 1-провідний пристрій має унікальний серійний номер, який використовується для ідентифікації пристрою, # зазвичай у форматі 28-031674b175ff. Цей параметр необхідно вказати. # Приєднані 1-провідні пристрої можна перерахувати за допомогою такої команди Linux: # ls /sys/bus/w1/devices/ #ds18_report_time: # Інтервал у секундах між читаннями. За замовчуванням 3.0, мінімум 1.0 #sensor_mcu: # Мікроконтролер для читання. Має бути host_mcu

source: [servo my_servo] pin: # PWM output pin controlling the servo. This parameter must be # provided. #maximum_servo_angle: 180 # The maximum angle (in degrees) that this servo can be set to. The # default is 180 degrees. #minimum_pulse_width: 0.001 # The minimum pulse width time (in seconds). This should correspond # with an angle of 0 degrees. The default is 0.001 seconds. #maximum_pulse_width: 0.002 # The maximum pulse width time (in seconds). This should correspond # with an angle of maximum_servo_angle. The default is 0.002 # seconds. #initial_angle: # Initial angle (in degrees) to set the servo to. The default is to # not send any signal at startup. #initial_pulse_width: # Initial pulse width time (in seconds) to set the servo to. (This # is only valid if initial_angle is not set.) The default is to not # send any signal at startup.
uk: [servo my_servo] прикріпити: # Вихід ШІМ, що керує сервоприводом. Цей параметр повинен бути # надано. #maximum_servo_angle: 180 # Максимальний кут (у градусах), на який можна встановити цей сервопривід. The # за замовчуванням 180 градусів. #мінімальна_широта_імпульсу: 0,001 # Мінімальна тривалість імпульсу (у секундах). Це має відповідати # з кутом 0 градусів. За замовчуванням 0,001 секунди. #максимальна_широта_імпульсу: 0,002 # Максимальна тривалість імпульсу (у секундах). Це має відповідати # з кутом max_servo_angle. За замовчуванням 0,002 # секунди. #початковий_кут: # Початковий кут (у градусах), на який потрібно встановити сервопривід. За умовчанням встановлено значення # не посилати жодного сигналу під час запуску. #initial_pulse_width: # Початковий час ширини імпульсу (у секундах), на який потрібно встановити сервопривід. (Це # дійсний, лише якщо початковий_кут не встановлено.) Типовим значенням є ні # посилати будь-який сигнал під час запуску.

source: [gcode_button my_gcode_button] pin: # The pin on which the button is connected. This parameter must be # provided. #analog_range: # Two comma separated resistances (in Ohms) specifying the minimum # and maximum resistance range for the button. If analog_range is # provided then the pin must be an analog capable pin. The default # is to use digital gpio for the button. #analog_pullup_resistor: # The pullup resistance (in Ohms) when analog_range is specified. # The default is 4700 ohms. #press_gcode: # A list of G-Code commands to execute when the button is pressed. # G-Code templates are supported. This parameter must be provided. #release_gcode: # A list of G-Code commands to execute when the button is released. # G-Code templates are supported. The default is to not run any # commands on a button release.
uk: [gcode_button my_gcode_button] прикріпити: Штифт, до якого приєднана кнопка. Цей параметр повинен бути надано. #analog_range: Два опори (в Омах), розділені комами, із зазначенням мінімуму і максимальний діапазон опору для кнопки. Якщо analog_range є за умови, що контакт має бути аналоговим контактом. За замовчуванням використовувати цифровий gpio для кнопки. #analog_pullup_resistor: Опір підтягування (в Омах), коли вказано analog_range. За замовчуванням 4700 Ом. #press_gcode: Список команд G-Code для виконання, коли натиснуто кнопку. Підтримуються # шаблони G-Code. Цей параметр необхідно вказати. #release_gcode: Список команд G-Code для виконання після відпускання кнопки. Підтримуються # шаблони G-Code. За умовчанням жодного не запускати команд під час відпускання кнопки.

source: [static_digital_output my_output_pins] pins: # A comma separated list of pins to be set as GPIO output pins. The # pin will be set to a high level unless the pin name is prefaced # with "!". This parameter must be provided.
uk: [static_digital_output my_output_pins] шпильки: # Розділений комами список контактів, які будуть встановлені як вихідні контакти GPIO. The # пін буде встановлено на високий рівень, якщо перед ним не буде назва пін-коду # з "!". Цей параметр необхідно вказати.

source: [multi_pin my_multi_pin] pins: # A comma separated list of pins associated with this alias. This # parameter must be provided.
uk: [multi_pin my_multi_pin] шпильки: Розділений комами список пінів, пов’язаних із цим псевдонімом. Це Потрібно вказати # параметр.

source: [ad5206 my_digipot] enable_pin: # The pin corresponding to the AD5206 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # The value to statically set the given AD5206 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a channel is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # AD5206 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the AD5206 were at # its highest resistance, and then the 'channel_x' parameters can be # specified using the desired amperage value for the stepper. The # default is to not scale the 'channel_x' parameters.
uk: [ad5206 my_digipot] enable_pin: Вивід, що відповідає лінії вибору мікросхеми AD5206. Ця шпилька буде встановлено на низький рівень на початку повідомлень SPI і підвищено на високий після завершення повідомлення. Цей параметр необхідно вказати. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис параметр вище. #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: Значення для статичної установки даного каналу AD5206. Це є зазвичай встановлюється на число від 0,0 до 1,0, де 1,0 є найвищий опір і 0,0 — найнижчий опір. однак, діапазон можна змінити за допомогою параметра 'scale' (див. нижче). Якщо канал не вказано, він не налаштований. #масштаб: Цей параметр можна використовувати для зміни параметрів 'channel_x' інтерпретуються. Параметри 'channel_x', якщо надано має бути між 0,0 і 'scale'. Це може бути корисним, коли AD5206 використовується для встановлення опорної напруги крокової напруги. «Шкала» може бути встановлено на еквівалентну силу струму крокового кроку, якщо AD5206 був на рівні його найвищий опір, а потім можуть бути параметри 'channel_x' вказано за допомогою бажаного значення сили струму для крокового кроку. The за замовчуванням параметри 'channel_x' не масштабуються.

source: [mcp4018 my_digipot] scl_pin: # The SCL "clock" pin. This parameter must be provided. sda_pin: # The SDA "data" pin. This parameter must be provided. wiper: # The value to statically set the given MCP4018 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # This parameter must be provided. #scale: # This parameter can be used to alter how the 'wiper' parameter is # interpreted. If provided, then the 'wiper' parameter should be # between 0.0 and 'scale'. This may be useful when the MCP4018 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4018 is at its highest # resistance, and then the 'wiper' parameter can be specified using # the desired amperage value for the stepper. The default is to not # scale the 'wiper' parameter.
uk: [mcp4018 my_digipot] scl_pin: Штифт SCL "годинник". Цей параметр необхідно вказати. sda_pin: Пін SDA "data". Цей параметр необхідно вказати. склоочисник: Значення для статичної установки даного "wiper" MCP4018. Це є зазвичай встановлюється на число від 0,0 до 1,0, де 1,0 є найвищий опір і 0,0 — найнижчий опір. однак, діапазон можна змінити за допомогою параметра 'scale' (див. нижче). Цей параметр необхідно вказати. #масштаб: Цей параметр можна використовувати для зміни параметра wiper інтерпретовано. Якщо надано, то має бути параметр wiper між 0,0 і 'scale'. Це може бути корисним, коли MCP4018 працює використовується для встановлення опорної напруги кроку. «Шкала» може бути встановлена на еквівалентна сила струму крокового кроку, якщо MCP4018 має максимальне значення опору, а потім можна вказати параметр wiper за допомогою бажане значення сили струму для степпера. За замовчуванням – ні масштабувати параметр wiper.

source: [display] lcd_type: hd44780 # Set to "hd44780" for hd44780 displays. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # The pins connected to an hd44780 type lcd. These parameters must # be provided. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
uk: [дисплей] lcd_type: hd44780 Встановіть "hd44780" для дисплеїв hd44780. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: Контакти, підключені до РК-дисплея типу hd44780. Ці параметри повинні be provided. #hd44780_protocol_init: True Виконайте ініціалізацію 8-бітного/4-бітного протоколу на дисплеї hd44780. This is necessary on real hd44780 devices. However, one may need щоб вимкнути це на деяких "клонованих" пристроях. Типовим значенням є True. #line_length: Set the number of characters per line for an hd44780 type lcd. Possible values are 20 (default) and 16. The number of lines is fixed to 4. ...

source: [display] lcd_type: hd44780_spi # Set to "hd44780_spi" for hd44780_spi displays. latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to the shift register controlling the display. # The spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the shift register does not have a MISO pin, # but the software spi implementation requires this pin to be # configured. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
uk: [дисплей] Тип_дисплея: hd44780_spi Встановіть значення "hd44780_spi" для дисплеїв hd44780_spi. фіксатор: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: Виводи, підключені до регістру зсуву, що керує дисплеєм. Для spi_software_miso_pin потрібно встановити невикористаний пін материнська плата принтера, оскільки регістр зсуву не має контакту MISO, але програмна реалізація spi вимагає наявності цього PIN-коду налаштовано. #hd44780_protocol_init: Правда Виконайте ініціалізацію 8-бітного/4-бітного протоколу на дисплеї hd44780. Це необхідно на справжніх пристроях hd44780. Однак може знадобитися щоб вимкнути це на деяких "клонованих" пристроях. Типовим значенням є True. #line_length: Встановіть кількість символів у рядку для РК-дисплея типу hd44780. Можливі значення: 20 (за замовчуванням) і 16. Кількість рядків встановлено на 4. ...

source: [display] lcd_type: st7920 # Set to "st7920" for st7920 displays. cs_pin: sclk_pin: sid_pin: # The pins connected to an st7920 type lcd. These parameters must be # provided. ...
uk: [display] Тип_дисплея: st7920 Set to "st7920" for st7920 displays. cs_pin: sclk_pin: sid_pin: The pins connected to an st7920 type lcd. These parameters must be надано. ...

source: [display] lcd_type: emulated_st7920 # Set to "emulated_st7920" for emulated_st7920 displays. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to an emulated_st7920 type lcd. The en_pin # corresponds to the cs_pin of the st7920 type lcd, # spi_software_sclk_pin corresponds to sclk_pin and # spi_software_mosi_pin corresponds to sid_pin. The # spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the st7920 as no MISO pin but the software # spi implementation requires this pin to be configured. ...
uk: [дисплей] lcd_type: emulated_st7920 Встановіть значення "emulated_st7920" для дисплеїв emulated_st7920. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: Контакти, підключені до РК-дисплея типу emulated_st7920. en_pin відповідає cs_pin lcd типу st7920, spi_software_sclk_pin відповідає sclk_pin і spi_software_mosi_pin відповідає sid_pin. The spi_software_miso_pin потрібно встановити на невикористаний PIN-код материнська плата принтера як st7920 без контакту MISO, але програмного забезпечення Реалізація # spi вимагає налаштувати цей PIN-код. ...

source: [display] lcd_type: uc1701 # Set to "uc1701" for uc1701 displays. cs_pin: a0_pin: # The pins connected to a uc1701 type lcd. These parameters must be # provided. #rst_pin: # The pin connected to the "rst" pin on the lcd. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 63 and the # default is 40. ...
uk: [дисплей] LCD_type: uc1701 Встановіть значення "uc1701" для дисплеїв uc1701. cs_pin: a0_pin: The pins connected to a uc1701 type lcd. These parameters must be надано. #rst_pin: Штифт, підключений до «першого» контакту на РК-дисплеї. Якщо це не так зазначено, тоді апаратне забезпечення повинно мати підтягування на відповідна лінія РК-дисплея. #контраст: Контраст для встановлення. Значення може бути в діапазоні від 0 до 63 і за замовчуванням 40. ...

source: [display_data my_group_name my_data_name] position: # Comma separated row and column of the display position that should # be used to display the information. This parameter must be # provided. text: # The text to show at the given position. This field is evaluated # using command templates (see docs/Command_Templates.md). This # parameter must be provided.
uk: [display_data my_group_name my_data_name] посада: Розділені комами рядок і стовпець позиції відображення, яка повинна використовувати для відображення інформації. Цей параметр повинен бути надано. текст: Текст для відображення у вказаній позиції. Це поле оцінюється використання шаблонів команд (див. docs/Command_Templates.md). Це Потрібно вказати # параметр.

source: [display_glyph my_display_glyph] #data: # The display data, stored as 16 lines consisting of 16 bits (1 per # pixel) where '.' is a blank pixel and '*' is an on pixel (e.g., # "****************" to display a solid horizontal line). # Alternatively, one can use '0' for a blank pixel and '1' for an on # pixel. Put each display line into a separate config line. The # glyph must consist of exactly 16 lines with 16 bits each. This # parameter is optional. #hd44780_data: # Glyph to use on 20x4 hd44780 displays. The glyph must consist of # exactly 8 lines with 5 bits each. This parameter is optional. #hd44780_slot: # The hd44780 hardware index (0..7) to store the glyph at. If # multiple distinct images use the same slot then make sure to only # use one of those images in any given screen. This parameter is # required if hd44780_data is specified.
uk: [display_glyph my_display_glyph] #дані: Дані дисплея, збережені у вигляді 16 рядків, що складаються з 16 бітів (1 на піксель), де '.' – це порожній піксель, а «*» – увімкнений піксель (наприклад, "****************" для відображення суцільної горизонтальної лінії). Крім того, можна використовувати '0' для порожнього пікселя і '1' для ввімкнення піксель. Помістіть кожен рядок дисплея в окремий рядок конфігурації. The гліф має складатися рівно з 16 рядків по 16 біт кожен. Це параметр необов'язковий. #hd44780_data: Гліф для використання на дисплеях 20x4 hd44780. Гліф повинен складатися з рівно 8 рядків по 5 біт кожен. Цей параметр необов'язковий. #hd44780_slot: Апаратний індекс hd44780 (0..7) для зберігання гліфа. Якщо кілька різних зображень використовують один і той самий слот, тоді переконайтеся, що лише використовуйте одне з цих зображень на будь-якому екрані. Цей параметр є потрібно, якщо вказано hd44780_data.

source: [display my_extra_display] # See the "display" section for available parameters.
uk: [відобразити my_extra_display] Доступні параметри див. у розділі «Дисплей».
