Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [printer] kinematics: delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. delta_radius: # Radius (in mm) of the horizontal circle formed by the three linear # axis towers. This parameter may also be calculated as: # delta_radius = smooth_rod_offset - effector_offset - carriage_offset # This parameter must be provided. #print_radius: # The radius (in mm) of valid toolhead XY coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. The default is to use # delta_radius for print_radius (which would normally prevent a # tower collision). # The stepper_a section describes the stepper controlling the front # left tower (at 210 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all towers. [stepper_a] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. arm_length: # Length (in mm) of the diagonal rod that connects this tower to the # print head. This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the tower is # at. The default is 210 for stepper_a, 330 for stepper_b, and 90 # for stepper_c. # The stepper_b section describes the stepper controlling the front # right tower (at 330 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the rear # tower (at 90 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the tower endstop positions and # angles. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
uk: [принтер] кінематика: дельта max_z_velocity: # Для дельта-принтерів це обмежує максимальну швидкість (у мм/с). # рухається з рухом осі z. Цей параметр можна використовувати для зменшення # максимальна швидкість рухів вгору/вниз (для яких потрібна більша швидкість кроку # ніж інші рухи на дельта-принтері). За умовчанням використовується # max_velocity для max_z_velocity. #max_z_accel: # Це встановлює максимальне прискорення (у мм/с^2) руху вздовж # вісь z. Це налаштування може бути корисним, якщо принтер може досягати більших значень # прискорення рухів XY, ніж рухів Z (наприклад, під час використання формувача введення). # За замовчуванням для max_z_accel використовується max_accel. #minimum_z_position: 0 # Мінімальне положення Z, яке користувач може наказати рухати головою # до. За замовчуванням 0. delta_radius: # Радіус (у мм) горизонтального кола, утвореного трьома лінійними # осьові вежі. Цей параметр також можна розрахувати як: # дельта_радіус = гладкий_зсув_стрижня - зміщення_ефектора - зміщення_каретки # Цей параметр необхідно вказати. #print_radius: # Радіус (у мм) дійсних координат головки XY. Можна використовувати # це налаштування для налаштування діапазону перевірки рухів інструментальної головки. Якщо # тут вказано велике значення, тоді його можна вказати # головка інструменту в зіткнення з вежею. За умовчанням використовується # delta_radius для print_radius (що зазвичай запобігає a # зіткнення веж). # Розділ stepper_a описує степпер, який керує фронтом # ліва вежа (на 210 градусів). Цей розділ також керує самонаведенням # параметри (homing_speed, homing_retract_dist) для всіх веж. [stepper_a] position_endstop: # Відстань (у мм) між соплом і ліжком, коли сопло є # у центрі області збірки та спрацьовує кінцевий упор. Це # параметр повинен бути наданий для stepper_a; для stepper_b і # stepper_c цей параметр за умовчанням має значення, указане для # степпер_а. arm_length: # Довжина (у мм) діагонального стрижня, який з’єднує цю вежу з # друкуюча головка. Цей параметр необхідно надати для stepper_a; для # stepper_b і stepper_c цей параметр має значення за замовчуванням # вказано для stepper_a. #кут: # Ця опція вказує кут (у градусах), під яким розташована вежа # в. За замовчуванням 210 для stepper_a, 330 для stepper_b і 90 # для stepper_c. # Розділ stepper_b описує степпер, який керує фронтом # права вежа (на 330 градусів). [stepper_b] # Розділ stepper_c описує степпер, який контролює задню частину # башта (на 90 градусів). [stepper_c] # Розділ delta_calibrate дозволяє розширений DELTA_CALIBRATE # Команда g-коду, яка може відкалібрувати положення кінцевих упорів вежі та # кути. [delta_calibrate] радіус: # Радіус (у мм) зони, яка може бути досліджена. Це радіус # координат сопла, що досліджується; якщо використовується автоматичний зонд # зі зміщенням XY, а потім виберіть достатньо малий радіус, щоб # зонд завжди підходить над ліжком. Цей параметр необхідно вказати. #швидкість: 50 # Швидкість (у мм/с) незондувальних рухів під час калібрування. # За замовчуванням 50. #horizontal_move_z: 5 # Висота (у мм), на яку слід наказати рухатися голові # безпосередньо перед початком операції зондування. За замовчуванням 5.

source: [tmc2660 stepper_x] cs_pin: # The pin corresponding to the TMC2660 chip select line. This pin # will be set to low at the start of SPI messages and set to high # after the message transfer completes. This parameter must be # provided. #spi_speed: 4000000 # SPI bus frequency used to communicate with the TMC2660 stepper # driver. The default is 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This only works if microsteps # is set to 16. Interpolation does introduce a small systemic # positional deviation - see TMC_Drivers.md for details. The default # is True. run_current: # The amount of current (in amps RMS) used by the driver during # stepper movement. This parameter must be provided. #sense_resistor: # The resistance (in ohms) of the motor sense resistor. This # parameter must be provided. #idle_current_percent: 100 # The percentage of the run_current the stepper driver will be # lowered to when the idle timeout expires (you need to set up the # timeout using a [idle_timeout] config section). The current will # be raised again once the stepper has to move again. Make sure to # set this to a high enough value such that the steppers do not lose # their position. There is also small delay until the current is # raised again, so take this into account when commanding fast moves # while the stepper is idling. The default is 100 (no reduction). #driver_TBL: 2 #driver_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #driver_TS2G: 3 # Set the given parameter during the configuration of the TMC2660 # chip. This may be used to set custom driver parameters. The # defaults for each parameter are next to the parameter name in the # list above. See the TMC2660 datasheet about what each parameter # does and what the restrictions on parameter combinations are. Be # especially aware of the CHOPCONF register, where setting CHM to # either zero or one will lead to layout changes (the first bit of # HDEC) is interpreted as the MSB of HSTRT in this case).
uk: [tmc2660 stepper_x] cs_pin: # Пін, що відповідає лінії вибору мікросхеми TMC2660. Ця шпилька # буде встановлено на низький рівень на початку повідомлень SPI і встановлено на високий # після завершення передачі повідомлення. Цей параметр повинен бути # надано. #spi_speed: 4000000 # Частота шини SPI, яка використовується для зв’язку з кроковим процесором TMC2660 # водій. За замовчуванням 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис # параметр вище. #interpolate: Правда # Якщо істина, увімкнути покрокову інтерполяцію (драйвер буде внутрішньо # крок зі швидкістю 256 мікрокроків). Це працює лише з мікрокроками # встановлено на 16. Інтерполяція вводить невелику системність # позиційне відхилення - подробиці див. TMC_Drivers.md. За замовчуванням # вірно. run_current: # Величина струму (в амперах RMS), що використовується драйвером під час # кроковий рух. Цей параметр необхідно вказати. #sense_resistor: # Опір (в Омах) резистора датчика двигуна. Це Потрібно вказати # параметр. #idle_current_percent: 100 # Відсоток run_current крокового драйвера # знижено до закінчення часу простою (необхідно налаштувати # тайм-аут за допомогою розділу конфігурації [idle_timeout]. Нинішня воля # підняти знову, як тільки степпер повинен рухатися знову. Переконайтеся, що # встановіть досить високе значення, щоб степери не програвали # їх позиція. Існує також невелика затримка до появи струму # піднятий знову, тому візьміть це до уваги, коли командуєте швидкими рухами # під час холостого ходу степпера. За замовчуванням 100 (без зменшення). #драйвер_TBL: 2 #драйвер_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #драйвер_TS2G: 3 # Встановіть заданий параметр під час налаштування TMC2660 # чіп. Це може бути використано для встановлення власних параметрів драйвера. The # значення за замовчуванням для кожного параметра вказано поруч із назвою параметра в # список вище. Перегляньте таблицю даних TMC2660 про те, що таке кожен параметр # робить і які обмеження на комбінації параметрів. бути # особливо пам'ятайте про регістр CHOPCONF, де встановлено значення CHM # нуль або одиниця призведуть до змін макета (перший біт # HDEC) інтерпретується як MSB HSTRT у цьому випадку).

source: POLAR KINEMATICS ARE A WORK IN PROGRESS. Moves around the 0, 0 position are known to not work properly.
uk: Polar kinematics

source: CABLE WINCH SUPPORT IS EXPERIMENTAL. Homing is not implemented on cable winch kinematics. In order to home the printer, manually send movement commands until the toolhead is at 0, 0, 0 and then issue a `G28` command.
uk: ОПОРА КАНАТНОЇ ЛЕБІДКИ Є ЕКСПЕРИМЕНТАЛЬНОЮ. На кінематиці тросової лебідки не реалізовано самонаведення. Щоб повернути принтер, вручну надішліть команди руху, доки інструментальна головка не буде на 0, 0, 0, а потім видайте команду G28 .

source: [printer] kinematics: winch # The stepper_a section describes the stepper connected to the first # cable winch. A minimum of 3 and a maximum of 26 cable winches may be # defined (stepper_a to stepper_z) though it is common to define 4. [stepper_a] rotation_distance: # The rotation_distance is the nominal distance (in mm) the toolhead # moves towards the cable winch for each full rotation of the # stepper motor. This parameter must be provided. anchor_x: anchor_y: anchor_z: # The X, Y, and Z position of the cable winch in cartesian space. # These parameters must be provided.
uk: [принтер] кінематика: лебідка # Розділ stepper_a описує степер, підключений до першого # тросова лебідка. Можуть бути мінімум 3 і максимум 26 тросових лебідок # визначено (від stepper_a до stepper_z), хоча зазвичай визначати 4. [stepper_a] відстань_обертання: # Відстань_обертання — це номінальна відстань (у мм) головки інструменту # рухається до тросової лебідки для кожного повного оберту # кроковий двигун. Цей параметр необхідно вказати. anchor_x: anchor_y: anchor_z: # Положення X, Y та Z тросової лебідки в декартовому просторі. # Ці параметри мають бути надані.

source: rectangular bed, probe_count = 3, 3: x---x---x (max_point) | x---x---x | (min_point) x---x---x round bed, round_probe_count = 5, bed_radius = r: x (0, r) end / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) start
uk: прямокутна грядка, probe_count = 3, 3: x---x---x (max_point) | х---х---х | (min_point) x---x---x кругле ліжко, round_probe_count = 5, bed_radius = r: x (0, r) кінець / х---х---х \ (-r, 0) x---x---x---x---x (r, 0) \ х---х---х / x (0, -r) початок

source: [bed_tilt] #x_adjust: 0 # The amount to add to each move's Z height for each mm on the X # axis. The default is 0. #y_adjust: 0 # The amount to add to each move's Z height for each mm on the Y # axis. The default is 0. #z_adjust: 0 # The amount to add to the Z height when the nozzle is nominally at # 0, 0. The default is 0. # The remaining parameters control a BED_TILT_CALIBRATE extended # g-code command that may be used to calibrate appropriate x and y # adjustment parameters. #points: # A list of X, Y coordinates (one per line; subsequent lines # indented) that should be probed during a BED_TILT_CALIBRATE # command. Specify coordinates of the nozzle and be sure the probe # is above the bed at the given nozzle coordinates. The default is # to not enable the command. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
uk: [bed_tilt] #x_adjust: 0 Сума, яку потрібно додати до висоти Z кожного ходу для кожного мм на X вісь. За замовчуванням 0. #y_adjust: 0 Сума, яку потрібно додати до висоти Z кожного ходу для кожного мм на Y вісь. За замовчуванням 0. #z_adjust: 0 Кількість, яку потрібно додати до висоти Z, коли сопло знаходиться на номінальному рівні 0, 0. За замовчуванням 0. Решта параметрів керують розширенням BED_TILT_CALIBRATE команда g-коду, яку можна використовувати для калібрування відповідних x і y параметри коригування. #бали: Список координат X, Y (по одній на рядок; наступні рядки з відступом), які слід перевірити під час BED_TILT_CALIBRATE команда. Вкажіть координати насадки і обов'язково щуп знаходиться над шаром у заданих координатах сопла. За замовчуванням щоб не ввімкнути команду. #швидкість: 50 Швидкість (у мм/с) незондувальних рухів під час калібрування. За замовчуванням 50. #horizontal_move_z: 5 Висота (у мм), на яку слід наказати рухатися голові безпосередньо перед початком операції зондування. За замовчуванням 5.

source: [z_tilt] #z_positions: # A list of X, Y coordinates (one per line; subsequent lines # indented) describing the location of each bed "pivot point". The # "pivot point" is the point where the bed attaches to the given Z # stepper. It is described using nozzle coordinates (the X, Y position # of the nozzle if it could move directly above the point). The # first entry corresponds to stepper_z, the second to stepper_z1, # the third to stepper_z2, etc. This parameter must be provided. #points: # A list of X, Y coordinates (one per line; subsequent lines # indented) that should be probed during a Z_TILT_ADJUST command. # Specify coordinates of the nozzle and be sure the probe is above # the bed at the given nozzle coordinates. This parameter must be # provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #retries: 0 # Number of times to retry if the probed points aren't within # tolerance. #retry_tolerance: 0 # If retries are enabled then retry if largest and smallest probed # points differ more than retry_tolerance. Note the smallest unit of # change here would be a single step. However if you are probing # more points than steppers then you will likely have a fixed # minimum value for the range of probed points which you can learn # by observing command output.
uk: [z_tilt] #z_positions: # Список координат X, Y (по одній на рядок; наступні рядки # з відступом), що описує розташування кожної ліжка «точка опори». The # "точка опори" - це точка, де ліжко прикріплюється до даної Z # степпер. Це описується за допомогою координат сопла (положення X, Y # сопла, якщо воно могло рухатися безпосередньо над точкою). The # перший запис відповідає stepper_z, другий — stepper_z1, # третій до stepper_z2 і т. д. Цей параметр повинен бути наданий. #бали: # Список координат X, Y (по одній на рядок; наступні рядки # з відступом), який слід перевірити під час команди Z_TILT_ADJUST. # Вкажіть координати сопла та переконайтеся, що зонд знаходиться вище # ложе при заданих координатах сопла. Цей параметр повинен бути # надано. #швидкість: 50 # Швидкість (у мм/с) незондувальних рухів під час калібрування. # За замовчуванням 50. #horizontal_move_z: 5 # Висота (у мм), на яку слід наказати рухатися голові # безпосередньо перед початком операції зондування. За замовчуванням 5. #повторні спроби: 0 # Кількість повторних спроб, якщо досліджувані точки не знаходяться в межах #толерантність. #retry_tolerance: 0 # Якщо повторні спроби ввімкнено, повторіть спробу, якщо перевірено найбільший і найменший # точки відрізняються більше, ніж retry_tolerance. Зверніть увагу на найменшу одиницю # зміна тут буде одним кроком. Однак якщо ви досліджуєте На # балів більше, ніж у степперів, тоді ви, ймовірно, матимете фіксований результат # мінімальне значення для діапазону досліджуваних точок, яке ви можете дізнатися # шляхом спостереження за виведенням команди.

source: Where x is the 0, 0 point on the bed
uk: Де x — точка 0, 0 на ліжку

source: [quad_gantry_level] #gantry_corners: # A newline separated list of X, Y coordinates describing the two # opposing corners of the gantry. The first entry corresponds to Z, # the second to Z2. This parameter must be provided. #points: # A newline separated list of four X, Y points that should be probed # during a QUAD_GANTRY_LEVEL command. Order of the locations is # important, and should correspond to Z, Z1, Z2, and Z3 location in # order. This parameter must be provided. For maximum accuracy, # ensure your probe offsets are configured. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #max_adjust: 4 # Safety limit if an adjustment greater than this value is requested # quad_gantry_level will abort. #retries: 0 # Number of times to retry if the probed points aren't within # tolerance. #retry_tolerance: 0 # If retries are enabled then retry if largest and smallest probed # points differ more than retry_tolerance.
uk: [quad_gantry_level] #gantry_corners: # Розділений новим рядком список координат X, Y, що описує обидва # протилежні кути порталу. Перший запис відповідає Z, # другий до Z2. Цей параметр необхідно вказати. #бали: # Розділений новим рядком список із чотирьох точок X, Y, які слід перевірити # під час команди QUAD_GANTRY_LEVEL. Порядок розташування є # важливий і має відповідати місцезнаходженням Z, Z1, Z2 і Z3 # замовлення. Цей параметр необхідно вказати. Для максимальної точності, # переконайтеся, що ваші зсуви зонду налаштовані. #швидкість: 50 # Швидкість (у мм/с) незондувальних рухів під час калібрування. # За замовчуванням 50. #horizontal_move_z: 5 # Висота (у мм), на яку слід наказати рухатися голові # безпосередньо перед початком операції зондування. За замовчуванням 5. #max_adjust: 4 # Безпечна межа, якщо вимагається коригування, що перевищує це значення # quad_gantry_level буде перервано. #повторні спроби: 0 # Кількість повторних спроб, якщо досліджувані точки не знаходяться в межах #толерантність. #retry_tolerance: 0 # Якщо повторні спроби ввімкнено, повторіть спробу, якщо перевірено найбільший і найменший # точки відрізняються більше, ніж retry_tolerance.

source: Safe Z homing. One may use this mechanism to home the Z axis at a specific X, Y coordinate. This is useful if the toolhead, for example has to move to the center of the bed before Z can be homed.
uk: Безпечне наведення Z. Можна використати цей механізм для встановлення осі Z на конкретну координату X, Y. Це корисно, наприклад, якщо інструментальна головка повинна переміститися в центр станини, перш ніж Z можна буде повернути на вихід.

source: [adxl345] cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: 5000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #axes_map: x, y, z # The accelerometer axis for each of the printer's X, Y, and Z axes. # This may be useful if the accelerometer is mounted in an # orientation that does not match the printer orientation. For # example, one could set this to "y, x, z" to swap the X and Y axes. # It is also possible to negate an axis if the accelerometer # direction is reversed (eg, "x, z, -y"). The default is "x, y, z". #rate: 3200 # Output data rate for ADXL345. ADXL345 supports the following data # rates: 3200, 1600, 800, 400, 200, 100, 50, and 25. Note that it is # not recommended to change this rate from the default 3200, and # rates below 800 will considerably affect the quality of resonance # measurements.
uk: [adxl345] cs_pin: Штифт увімкнення SPI для датчика. Цей параметр необхідно вказати. #spi_speed: 5000000 Швидкість SPI (у Гц), яка використовується під час обміну даними з чіпом. За замовчуванням 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: Перегляньте розділ «Загальні налаштування SPI», щоб отримати опис параметр вище. #axes_map: x, y, z Вісь акселерометра для кожної з осей X, Y і Z принтера. Це може бути корисним, якщо акселерометр встановлено в орієнтація не відповідає орієнтації принтера. для Наприклад, можна встановити значення "y, x, z", щоб поміняти місцями осі X і Y. Також можна заперечити вісь, якщо акселерометр напрямок змінюється (наприклад, "x, z, -y"). За замовчуванням "x, y, z". #тариф: 3200 Вихідна швидкість передачі даних для ADXL345. ADXL345 підтримує такі дані ставки: 3200, 1600, 800, 400, 200, 100, 50 і 25. Зауважте, що це не рекомендується змінювати цю ставку з 3200 за замовчуванням, і показники нижче 800 значно вплинуть на якість резонансу вимірювання.
