Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: [bed_mesh] #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #mesh_radius: # Defines the radius of the mesh to probe for round beds. Note that # the radius is relative to the coordinate specified by the # mesh_origin option. This parameter must be provided for round beds # and omitted for rectangular beds. #mesh_origin: # Defines the center X, Y coordinate of the mesh for round beds. This # coordinate is relative to the probe's location. It may be useful # to adjust the mesh_origin in an effort to maximize the size of the # mesh radius. Default is 0, 0. This parameter must be omitted for # rectangular beds. #mesh_min: # Defines the minimum X, Y coordinate of the mesh for rectangular # beds. This coordinate is relative to the probe's location. This # will be the first point probed, nearest to the origin. This # parameter must be provided for rectangular beds. #mesh_max: # Defines the maximum X, Y coordinate of the mesh for rectangular # beds. Adheres to the same principle as mesh_min, however this will # be the furthest point probed from the bed's origin. This parameter # must be provided for rectangular beds. #probe_count: 3, 3 # For rectangular beds, this is a comma separate pair of integer # values X, Y defining the number of points to probe along each # axis. A single value is also valid, in which case that value will # be applied to both axes. Default is 3, 3. #round_probe_count: 5 # For round beds, this integer value defines the maximum number of # points to probe along each axis. This value must be an odd number. # Default is 5. #fade_start: 1.0 # The gcode z position in which to start phasing out z-adjustment # when fade is enabled. Default is 1.0. #fade_end: 0.0 # The gcode z position in which phasing out completes. When set to a # value below fade_start, fade is disabled. It should be noted that # fade may add unwanted scaling along the z-axis of a print. If a # user wishes to enable fade, a value of 10.0 is recommended. # Default is 0.0, which disables fade. #fade_target: # The z position in which fade should converge. When this value is # set to a non-zero value it must be within the range of z-values in # the mesh. Users that wish to converge to the z homing position # should set this to 0. Default is the average z value of the mesh. #split_delta_z: .025 # The amount of Z difference (in mm) along a move that will trigger # a split. Default is .025. #move_check_distance: 5.0 # The distance (in mm) along a move to check for split_delta_z. # This is also the minimum length that a move can be split. Default # is 5.0. #mesh_pps: 2, 2 # A comma separated pair of integers X, Y defining the number of # points per segment to interpolate in the mesh along each axis. A # "segment" can be defined as the space between each probed point. # The user may enter a single value which will be applied to both # axes. Default is 2, 2. #algorithm: lagrange # The interpolation algorithm to use. May be either "lagrange" or # "bicubic". This option will not affect 3x3 grids, which are forced # to use lagrange sampling. Default is lagrange. #bicubic_tension: .2 # When using the bicubic algorithm the tension parameter above may # be applied to change the amount of slope interpolated. Larger # numbers will increase the amount of slope, which results in more # curvature in the mesh. Default is .2. #zero_reference_position: # An optional X,Y coordinate that specifies the location on the bed # where Z = 0. When this option is specified the mesh will be offset # so that zero Z adjustment occurs at this location. The default is # no zero reference. #faulty_region_1_min: #faulty_region_1_max: # Optional points that define a faulty region. See docs/Bed_Mesh.md # for details on faulty regions. Up to 99 faulty regions may be added. # By default no faulty regions are set. #adaptive_margin: # An optional margin (in mm) to be added around the bed area used by # the defined print objects when generating an adaptive mesh. #scan_overshoot: # The maximum amount of travel (in mm) available outside of the mesh. # For rectangular beds this applies to travel on the X axis, and for round beds # it applies to the entire radius. The tool must be able to travel the amount # specified outside of the mesh. This value is used to optimize the travel # path when performing a "rapid scan". The minimum value that may be specified # is 1. The default is no overshoot.
uk: [bed_mesh] #швидкість: 50 Швидкість (у мм/с) незондувальних рухів під час калібрування. За замовчуванням 50. #horizontal_move_z: 5 Висота (у мм), на яку слід наказати рухатися голові безпосередньо перед початком операції зондування. За замовчуванням 5. #mesh_radius: Визначає радіус сітки для зондування для круглих грядок. Зауважте, що радіус є відносно координати, заданої в mesh_origin option. This parameter must be provided for round beds і опущено для прямокутних ліжок. #mesh_origin: Defines the center X, Y coordinate of the mesh for round beds. This координата відносно місця розташування зонда. Це може бути корисним to adjust the mesh_origin in an effort to maximize the size of the радіус сітки. За замовчуванням 0, 0. Цей параметр потрібно пропустити для прямокутні ліжка. #mesh_min: Визначає мінімальну координату X, Y прямокутної сітки ліжко. Ця координата відноситься до місця розташування зонда. Це буде першою досліджуваною точкою, найближчою до початку координат. Це Для прямокутних грядок потрібно вказати # параметр. #mesh_max: Визначає максимальну координату X, Y прямокутної сітки ліжко. Дотримується того самого принципу, що й mesh_min, однак це буде be the furthest point probed from the bed's origin. This parameter необхідно передбачити для прямокутних ліжок. #probe_count: 3, 3 Для прямокутних ліжок це пара цілих чисел, розділених комою values X, Y defining the number of points to probe along each вісь. Єдине значення також є дійсним, і в цьому випадку це значення буде be applied to both axes. Default is 3, 3. #round_probe_count: 5 For round beds, this integer value defines the maximum number of точки для зондування вздовж кожної осі. Це значення має бути непарним числом. За замовчуванням 5. #fade_start: 1.0 Позиція g-коду z, у якій розпочинається поступова відміна z-коригування коли ввімкнено згасання. За замовчуванням 1.0. #fade_end: 0.0 Позиція gcode z, у якій завершується поетапна відмова. Якщо встановлено значення a значення нижче fade_start, затухання вимкнено. Слід зазначити, що fade може додати небажане масштабування вздовж осі z друку. Якщо a user wishes to enable fade, a value of 10.0 is recommended. За замовчуванням 0.0, що вимикає згасання. #fade_target: The z position in which fade should converge. When this value is set to a non-zero value it must be within the range of z-values in сітка. Користувачі, які бажають наблизитися до початкової позиції z має встановити значення 0. За замовчуванням це середнє значення z сітки. #split_delta_z: .025 Величина різниці Z (у мм) уздовж ходу, який спрацює a split. Default is .025. #move_check_distance: 5.0 Відстань (у мм) уздовж ходу для перевірки split_delta_z. Це також мінімальна довжина, на яку можна розділити хід. За замовчуванням is 5.0. #mesh_pps: 2, 2 Пара цілих чисел X, Y, розділених комами, визначає кількість points per segment to interpolate in the mesh along each axis. A "segment" can be defined as the space between each probed point. Користувач може ввести одне значення, яке буде застосовано до обох осей. За замовчуванням 2, 2. #алгоритм: Лагранжа Алгоритм інтерполяції для використання. Може бути або «Лагранжа», або "бікубічний". Цей параметр не вплине на сітки 3x3, які є примусовими для використання вибірки Лагранжа. За замовчуванням — Лагранж. #бікубічний_натяг: .2 При використанні бікубічного алгоритму параметр натягу вище може застосовувати для зміни величини інтерпольованого нахилу. Більший число збільшить величину нахилу, що призведе до більшого кривизна в сітці. Типовим є .2. #zero_reference_position: An optional X,Y coordinate that specifies the location on the bed where Z = 0. When this option is specified the mesh will be offset щоб у цьому місці відбулося коригування нуля Z. За замовчуванням немає нульового посилання. #faulty_region_1_min: #faulty_region_1_max: Необов'язкові точки, які визначають дефектну область. Див. docs/Bed_Mesh.md для детальної інформації про несправні регіони. Можна додати до 99 дефектних регіонів. By default no faulty regions are set. #adaptive_margin: Додаткове поле (у мм), яке потрібно додати навколо використовуваної площі ліжка визначені об'єкти друку під час генерації адаптивної сітки. #scan_overshoot: Максимальний хід (у мм), доступний за межами сітки. Для прямокутних ліжок це стосується руху по осі X, а для круглих ліжок застосовується до всього радіусу. Інструмент повинен мати можливість переміщати кількість вказано за межами сітки. Це значення використовується для оптимізації подорожі шлях під час виконання "швидкого сканування". Мінімальне значення, яке можна вказати дорівнює 1. За умовчанням немає перевищення.

source: [virtual_sdcard] path: # The path of the local directory on the host machine to look for # g-code files. This is a read-only directory (sdcard file writes # are not supported). One may point this to OctoPrint's upload # directory (generally ~/.octoprint/uploads/ ). This parameter must # be provided. #on_error_gcode: # A list of G-Code commands to execute when an error is reported. # See docs/Command_Templates.md for G-Code format. The default is to # run TURN_OFF_HEATERS.
uk: [virtual_sdcard] шлях: # Шлях до локального каталогу на головній машині, який потрібно шукати # файли g-code. Це каталог лише для читання (файл sdcard записує # не підтримуються). Це можна вказати на завантаження OctoPrint # каталог (зазвичай ~/.octoprint/uploads/ ). Цей параметр повинен # бути надано. #on_error_gcode: # Список команд G-Code для виконання, коли повідомляється про помилку. # Перегляньте docs/Command_Templates.md для формату G-коду. За умовчанням встановлено значення # запустити TURN_OFF_HEATERS.

source: Support for eddy current inductive probes. One may define this section (instead of a probe section) to enable this probe. See the [command reference](G-Codes.md#probe_eddy_current) for further information.
uk: Підтримка вихрострумових індуктивних зондів. Можна визначити цей розділ (замість розділу зонда), щоб увімкнути це зондування. Дивіться [довідку про команди](G-Codes.md#probe_eddy_current) для отримання додаткової інформації.

source: [probe_eddy_current my_eddy_probe] sensor_type: ldc1612 # The sensor chip used to perform eddy current measurements. This # parameter must be provided and must be set to ldc1612. #intb_pin: # MCU gpio pin connected to the ldc1612 sensor's INTB pin (if # available). The default is to not use the INTB pin. #z_offset: # The nominal distance (in mm) between the nozzle and bed that a # probing attempt should stop at. This parameter must be provided. #i2c_address: #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # The i2c settings for the sensor chip. See the "common I2C # settings" section for a description of the above parameters. #x_offset: #y_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # See the "probe" section for information on these parameters.
uk: [probe_eddy_current my_eddy_probe] тип_датчика: ldc1612 # Сенсорний чіп, який використовується для вимірювання вихрових струмів. Це Потрібно вказати # параметр і встановити значення ldc1612. #intb_pin: # Штифт gpio MCU, підключений до контакту INTB датчика ldc1612 (якщо # доступно). За замовчуванням PIN-код INTB не використовується. #z_offset: # Номінальна відстань (у мм) між соплом і ложем, що a # спроба зондування має закінчитися. Цей параметр необхідно вказати. #i2c_адреса: #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: # Налаштування i2c для сенсорного чіпа. Див. розділ «загальний I2C # налаштування" для опису наведених вище параметрів. #x_offset: #y_offset: #швидкість: #ліфт_швидкість: #зразки: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # Перегляньте розділ "зонд", щоб отримати інформацію про ці параметри.

source: Reports probe coil temperature. Includes optional thermal drift calibration for eddy current based probes. A `[temperature_probe]` section may be linked to a `[probe_eddy_current]` by using the same postfix for both sections.
uk: Повідомляє температуру котушки датчика. Включає додаткове калібрування теплового дрейфу для датчиків на основі вихрових струмів. Секція `[temperature_probe]` може бути пов’язана з `[probe_eddy_current]` за допомогою того самого постфікса для обох секцій.“

source: [temperature_probe my_probe] #sensor_type: #sensor_pin: #min_temp: #max_temp: # Temperature sensor configuration. # See the "extruder" section for the definition of the above # parameters. #smooth_time: # A time value (in seconds) over which temperature measurements will # be smoothed to reduce the impact of measurement noise. The default # is 2.0 seconds. #gcode_id: # See the "heater_generic" section for the definition of this # parameter. #speed: # The travel speed [mm/s] for xy moves during calibration. Default # is the speed defined by the probe. #horizontal_move_z: # The z distance [mm] from the bed at which xy moves will occur # during calibration. Default is 2mm. #resting_z: # The z distance [mm] from the bed at which the tool will rest # to heat the probe coil during calibration. Default is .4mm #calibration_position: # The X, Y, Z position where the tool should be moved when # probe drift calibration initializes. This is the location # where the first manual probe will occur. If omitted, the # default behavior is not to move the tool prior to the first # manual probe. #calibration_bed_temp: # The maximum safe bed temperature (in C) used to heat the probe # during probe drift calibration. When set, the calibration # procedure will turn on the bed after the first sample is # taken. When the calibration procedure is complete the bed # temperature will be set to zero. When omitted the default # behavior is not to set the bed temperature. #calibration_extruder_temp: # The extruder temperature (in C) set probe during drift calibration. # When this option is supplied the procedure will wait for until the # specified temperature is reached before requesting the first manual # probe. When the calibration procedure is complete the extruder # temperature will be set to 0. When omitted the default behavior is # not to set the extruder temperature. #extruder_heating_z: 50. # The Z location where extruder heating will occur if the # "calibration_extruder_temp" option is set. Its recommended to heat # the extruder some distance from the bed to minimize its impact on # the probe coil temperature. The default is 50.
uk: [temperature_probe my_probe] #sensor_type: #sensor_pin: #min_temp: #max_temp: # Конфігурація датчика температури. # Дивіться розділ «екструдер» для визначення наведеного вище # параметри. #smooth_time: # Значення часу (у секундах), протягом якого відбуватимуться вимірювання температури # бути згладженими для зменшення впливу шуму вимірювання. За замовчуванням # становить 2,0 секунди. #gcode_id: # Перегляньте розділ "heater_generic" для визначення цього # параметр. #швидкість: # Швидкість руху [мм/с] для xy рухається під час калібрування. За замовчуванням # — це швидкість, визначена зондом. #horizontal_move_z: # Відстань z [мм] від ліжка, на якій відбуватимуться переміщення xy # під час калібрування. За замовчуванням 2 мм. #відпочинок_z: # Відстань z [мм] від станини, на якій буде стояти інструмент # для нагріву котушки зонда під час калібрування. За замовчуванням — 0,4 мм #calibration_position: # Положення X, Y, Z, куди слід перемістити інструмент # ініціалізація калібрування дрейфу зонда. Це місце розташування # де відбудеться перше ручне дослідження. Якщо опущено, # типовою поведінкою є не переміщення інструмента перед першим # ручний зонд. #calibration_bed_temp: # Максимальна безпечна температура шару (в C), яка використовується для нагрівання зонда # під час калібрування дрейфу зонда. Коли встановлено, калібрування # процедура включить ліжко після першого зразка # прийнято. Після завершення процедури калібрування станини # температура буде встановлена на нуль. Якщо опущено, за замовчуванням # поведінка - не встановлювати температуру ліжка. #calibration_extruder_temp: # Температура екструдера (у C), встановлена зондом під час калібрування дрейфу. # Якщо вказано цей параметр, процедура чекатиме, доки не завершиться # задана температура досягнута перед запитом першого посібника # зонд. Після завершення процедури калібрування екструдера # температура буде встановлена на 0. Якщо опущено, поведінка за замовчуванням # не встановлювати температуру екструдера. #extruder_heating_z: 50. # Розташування Z, де відбуватиметься нагрівання екструдера, якщо # Параметр "calibration_extruder_temp" встановлено. Рекомендується нагріти # екструдер на деякій відстані від станини, щоб мінімізувати його вплив # температура котушки датчика. За замовчуванням 50.

source: BMP180/BMP280/BME280/BMP388/BME680 temperature sensor
uk: Датчик температури BMP180/BMP280/BME280/BMP388/BME680

source: BMP180/BMP280/BME280/BMP388/BME680 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C), pressure (hPa), relative humidity and in case of the BME680 gas level. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report pressure and humidity in addition to temperature.
uk: BMP180/BMP280/BME280/BMP388/BME680 двопровідні датчики навколишнього середовища (I2C). Зауважте, що ці датчики не призначені для використання з екструдерами та нагрівальними ліжками, а скоріше для моніторингу температури навколишнього середовища (C), тиску (hPa), відносної вологості та у випадку рівня газу BME680. Перегляньте sample-macros.cfg для макросу gcode_macro, який можна використовувати для повідомлення тиску та вологості на додаток до температури.

source: sensor_type: BME280 #i2c_address: # Default is 118 (0x76). The BMP180, BMP388 and some BME280 sensors # have an address of 119 (0x77). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters.
uk: тип_датчика: BME280 #i2c_адреса: # За замовчуванням 118 (0x76). Датчики BMP180, BMP388 і деякі BME280 # мають адресу 119 (0x77). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: # Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис # параметр вище.

source: SHT3X sensor
uk: Датчик SHT3X

source: SHT3X family two wire interface (I2C) environmental sensor. These sensors have a range of -55~125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers.
uk: Датчик навколишнього середовища сімейства SHT3X з двопровідним інтерфейсом (I2C). Ці датчики мають діапазон -55~125 C, тому їх можна використовувати, наприклад, для контроль температури камери. Вони також можуть функціонувати як прості контролери вентилятора/нагрівача.

source: sensor_type: SHT3X #i2c_address: # Default is 68 (0x44). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters.
uk: тип_датчика: SHT3X #i2c_адреса: # За замовчуванням 68 (0x44). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_швидкість: # Перегляньте розділ «Загальні налаштування I2C», щоб отримати опис # параметр вище.
