Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: uk

source: # Common parameters available for all menu config sections. #[menu __some_list __some_name] #type: disabled # Permanently disabled menu element, only required attribute is 'type'. # Allows you to easily disable/hide existing menu items. #[menu some_name] #type: # One of command, input, list, text: # command - basic menu element with various script triggers # input - same like 'command' but has value changing capabilities. # Press will start/stop edit mode. # list - it allows for menu items to be grouped together in a # scrollable list. Add to the list by creating menu # configurations using "some_list" as a prefix - for # example: [menu some_list some_item_in_the_list] # vsdlist - same as 'list' but will append files from virtual sdcard # (will be removed in the future) #name: # Name of menu item - evaluated as a template. #enable: # Template that evaluates to True or False. #index: # Position where an item needs to be inserted in list. By default # the item is added at the end. #[menu some_list] #type: list #name: #enable: # See above for a description of these parameters. #[menu some_list some_command] #type: command #name: #enable: # See above for a description of these parameters. #gcode: # Script to run on button click or long click. Evaluated as a # template. #[menu some_list some_input] #type: input #name: #enable: # See above for a description of these parameters. #input: # Initial value to use when editing - evaluated as a template. # Result must be float. #input_min: # Minimum value of range - evaluated as a template. Default -99999. #input_max: # Maximum value of range - evaluated as a template. Default 99999. #input_step: # Editing step - Must be a positive integer or float value. It has # internal fast rate step. When "(input_max - input_min) / # input_step > 100" then fast rate step is 10 * input_step else fast # rate step is same input_step. #realtime: # This attribute accepts static boolean value. When enabled then # gcode script is run after each value change. The default is False. #gcode: # Script to run on button click, long click or value change. # Evaluated as a template. The button click will trigger the edit # mode start or end.
uk: Загальні параметри доступні для всіх розділів конфігурації меню. #[menu __some_list __some_name] #тип: вимкнено Постійно вимкнений елемент меню, єдиним обов'язковим атрибутом є 'type'. Дозволяє легко вимкнути/приховати наявні пункти меню. #[меню some_name] #тип: Один із команд, введення, списку, тексту: команда - основний елемент меню з різними тригерами скриптів input — те саме, що й 'command', але має можливість змінювати значення. Натисніть, щоб запустити/зупинити режим редагування. список - дозволяє згрупувати пункти меню в a список, який можна прокручувати. Додайте до списку, створивши меню конфігурації з використанням "some_list" як префікса - для приклад: [menu some_list some_item_in_the_list] vsdlist — те саме, що й «список», але додаватиме файли з віртуальної sdcard (буде видалено в майбутньому) #ім'я: Назва пункту меню - оцінюється як шаблон. #включити: Шаблон, який має значення True або False. #index: Позиція, де потрібно вставити елемент у список. За умовчанням елемент додається в кінці. #[меню some_list] #тип: список #ім'я: #включити: Опис цих параметрів див. вище. #[меню some_list some_command] #тип: команда #ім'я: #включити: Опис цих параметрів див. вище. #gcode: Скрипт для запуску після натискання кнопки або тривалого натискання. Оцінюється як a шаблон. #[меню some_list some_input] #тип: вхід #ім'я: #включити: Опис цих параметрів див. вище. #вхід: Початкове значення для використання під час редагування - оцінюється як шаблон. Результат має бути float. #input_min: Мінімальне значення діапазону - оцінюється як шаблон. За замовчуванням -99999. #input_max: Максимальне значення діапазону - оцінюється як шаблон. За замовчуванням 99999. #input_step: Крок редагування – має бути додатним цілим числом або значенням з плаваючою точкою. Це має внутрішній швидкий крок. Коли "(input_max - input_min) / input_step > 100", тоді швидкий крок становить 10 * input_step, інакше швидко крок швидкості – це той самий input_step. #в реальному часі: Цей атрибут приймає статичне логічне значення. Коли ввімкнено тоді сценарій gcode запускається після кожної зміни значення. За замовчуванням значення False. #gcode: Скрипт для запуску після натискання кнопки, тривалого натискання або зміни значення. Оцінюється як шаблон. Натискання кнопки запустить редагування початок або кінець режиму.

source: [filament_switch_sensor my_sensor] #pause_on_runout: True # When set to True, a PAUSE will execute immediately after a runout # is detected. Note that if pause_on_runout is False and the # runout_gcode is omitted then runout detection is disabled. Default # is True. #runout_gcode: # A list of G-Code commands to execute after a filament runout is # detected. See docs/Command_Templates.md for G-Code format. If # pause_on_runout is set to True this G-Code will run after the # PAUSE is complete. The default is not to run any G-Code commands. #insert_gcode: # A list of G-Code commands to execute after a filament insert is # detected. See docs/Command_Templates.md for G-Code format. The # default is not to run any G-Code commands, which disables insert # detection. #event_delay: 3.0 # The minimum amount of time in seconds to delay between events. # Events triggered during this time period will be silently # ignored. The default is 3 seconds. #pause_delay: 0.5 # The amount of time to delay, in seconds, between the pause command # dispatch and execution of the runout_gcode. It may be useful to # increase this delay if OctoPrint exhibits strange pause behavior. # Default is 0.5 seconds. #switch_pin: # The pin on which the switch is connected. This parameter must be # provided.
uk: [filament_switch_sensor my_sensor] #pause_on_runout: Правда Якщо встановлено значення True, ПАУЗА виконуватиметься одразу після завершення виявлено. Зауважте, що якщо pause_on_runout має значення False і runout_gcode пропущено, тоді виявлення биття вимкнено. За замовчуванням є правдою. #runout_gcode: Список команд G-Code для виконання після закінчення розжарювання виявлено. Перегляньте docs/Command_Templates.md для формату G-коду. Якщо pause_on_runout має значення True, цей G-код запускатиметься після ПАУЗА завершена. За умовчанням жодні команди G-коду не запускаються. #insert_gcode: Список команд G-коду для виконання після вставки нитки є виявлено. Перегляньте docs/Command_Templates.md для формату G-коду. The за замовчуванням не запускаються жодні команди G-коду, що вимикає вставку виявлення. #event_delay: 3.0 Мінімальний час у секундах для затримки між подіями. Події, ініційовані протягом цього періоду часу, відбуватимуться без звуку проігноровано. За замовчуванням 3 секунди. #pause_delay: 0,5 Час затримки, у секундах, між командою паузи відправка та виконання runout_gcode. Це може бути корисним для збільшити цю затримку, якщо OctoPrint демонструє дивну поведінку паузи. За замовчуванням 0,5 секунди. #switch_pin: Штифт, до якого підключено перемикач. Цей параметр повинен бути надано.

source: [filament_motion_sensor my_sensor] detection_length: 7.0 # The minimum length of filament pulled through the sensor to trigger # a state change on the switch_pin # Default is 7 mm. extruder: # The name of the extruder section this sensor is associated with. # This parameter must be provided. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
uk: [filament_motion_sensor my_sensor] довжина_виявлення: 7,0 Мінімальна довжина нитки розжарення, протягнутої через датчик для спрацьовування зміна стану на switch_pin За замовчуванням 7 мм. екструдер: Назва секції екструдера, з якою пов’язаний цей датчик. Цей параметр необхідно вказати. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: Перегляньте розділ "filament_switch_sensor" для опису параметр вище.

source: [tsl1401cl_filament_width_sensor] #pin: #default_nominal_filament_diameter: 1.75 # (mm) # Maximum allowed filament diameter difference as mm. #max_difference: 0.2 # The distance from sensor to the melting chamber as mm. #measurement_delay: 100
uk: [tsl1401cl_filament_width_sensor] #pin: #default_nominal_filament_diameter: 1,75 # (мм) Максимально допустима різниця діаметрів нитки розжарення в мм. #max_difference: 0,2 Відстань від датчика до плавильної камери в мм. #затримка_вимірювання: 100

source: [hall_filament_width_sensor] adc1: adc2: # Analog input pins connected to the sensor. These parameters must # be provided. #cal_dia1: 1.50 #cal_dia2: 2.00 # The calibration values (in mm) for the sensors. The default is # 1.50 for cal_dia1 and 2.00 for cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 # The raw calibration values for the sensors. The default is 9500 # for raw_dia1 and 10500 for raw_dia2. #default_nominal_filament_diameter: 1.75 # The nominal filament diameter. This parameter must be provided. #max_difference: 0.200 # Maximum allowed filament diameter difference in millimeters (mm). # If difference between nominal filament diameter and sensor output # is more than +- max_difference, extrusion multiplier is set back # to %100. The default is 0.200. #measurement_delay: 70 # The distance from sensor to the melting chamber/hot-end in # millimeters (mm). The filament between the sensor and the hot-end # will be treated as the default_nominal_filament_diameter. Host # module works with FIFO logic. It keeps each sensor value and # position in an array and POP them back in correct position. This # parameter must be provided. #enable: False # Sensor enabled or disabled after power on. The default is to # disable. #measurement_interval: 10 # The approximate distance (in mm) between sensor readings. The # default is 10mm. #logging: False # Out diameter to terminal and klipper.log can be turn on|of by # command. #min_diameter: 1.0 # Minimal diameter for trigger virtual filament_switch_sensor. #use_current_dia_while_delay: False # Use the current diameter instead of the nominal diameter while # the measurement delay has not run through. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
uk: [сенсор_ширини_нитки_холу] adc1: adc2: Аналогові входи, підключені до датчика. Ці параметри повинні бути надано. #cal_dia1: 1,50 #cal_dia2: 2.00 Значення калібрування (у мм) для датчиків. За замовчуванням 1.50 для cal_dia1 і 2.00 для cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 Необроблені значення калібрування для датчиків. За замовчуванням 9500 для raw_dia1 і 10500 для raw_dia2. #default_nominal_filament_diameter: 1,75 Номінальний діаметр нитки. Цей параметр необхідно вказати. #max_difference: 0,200 Максимально допустима різниця діаметрів нитки в міліметрах (мм). Якщо різниця між номінальним діаметром нитки і вихідним сигналом датчика більше ніж +- max_difference, множник екструзії встановлюється назад до %100. За замовчуванням 0,200. #затримка_вимірювання: 70 Відстань від датчика до плавильної камери/гарячого кінця міліметрів (мм). Нитка розжарення між датчиком і гарячим кінцем буде розглядатися як номінальний_діаметр нитки за замовчуванням. Хост модуль працює з логікою FIFO. Він зберігає значення кожного датчика та позицію в масиві та POP їх назад у правильну позицію. Це Потрібно вказати # параметр. #enable: False Датчик увімкнено або вимкнено після ввімкнення. Типовим значенням є відключити. #інтервал_вимірів: 10 Приблизна відстань (у мм) між показаннями датчика. The за замовчуванням 10 мм. #logging: False Вихідний діаметр до терміналу та klipper.log можна ввімкнути команда. #мін_діаметр: 1,0 Мінімальний діаметр для запуску віртуального filament_switch_sensor. #use_current_dia_while_delay: невірно Використовуйте поточний діаметр замість номінального затримка вимірювання не закінчилася. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: Перегляньте розділ "filament_switch_sensor" для опису параметр вище.

source: [adc_scaled my_name] vref_pin: # The ADC pin to use for VREF monitoring. This parameter must be # provided. vssa_pin: # The ADC pin to use for VSSA monitoring. This parameter must be # provided. #smooth_time: 2.0 # A time value (in seconds) over which the vref and vssa # measurements will be smoothed to reduce the impact of measurement # noise. The default is 2 seconds.
uk: [adc_scaled my_name] vref_pin: Штифт АЦП для моніторингу VREF. Цей параметр повинен бути надано. vssa_pin: Штифт АЦП для моніторингу VSSA. Цей параметр повинен бути надано. #smooth_time: 2.0 Значення часу (у секундах), протягом якого vref і vssa вимірювання буде згладжено, щоб зменшити вплив вимірювання #шум. За замовчуванням 2 секунди.

source: #spi_speed: # The SPI speed (in hz) to use when communicating with the device. # The default depends on the type of device. #spi_bus: # If the micro-controller supports multiple SPI busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Specify the above parameters to use "software based SPI". This # mode does not require micro-controller hardware support (typically # any general purpose pins may be used). The default is to not use # "software spi".
uk: #spi_speed: # Швидкість SPI (у Гц), яка використовується під час обміну даними з пристроєм. # Значення за замовчуванням залежить від типу пристрою. #spi_bus: # Якщо мікроконтролер підтримує кілька шин SPI, то одна може # вкажіть тут назву шини мікроконтролера. За замовчуванням залежить від # тип мікроконтролера. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Вкажіть наведені вище параметри, щоб використовувати "SPI на основі програмного забезпечення". Це Режим # не вимагає апаратної підтримки мікроконтролера (зазвичай # можна використовувати будь-які штифти загального призначення). За умовчанням не використовувати # "програмне забезпечення spi".

source: This tool allows a single micro-controller pin to be defined multiple times in a config file without normal error checking. This is intended for diagnostic and debugging purposes. This section is not needed where Klipper supports using the same pin multiple times, and using this override may cause confusing and unexpected results.
uk: Цей інструмент дозволяє визначати один контакт мікроконтролера кілька разів у файлі конфігурації без звичайної перевірки помилок. Це призначено для діагностики та налагодження. Цей розділ непотрібний, якщо Klipper підтримує використання одного і того ж PIN-коду кілька разів, і використання цього перевизначення може призвести до незрозумілих і неочікуваних результатів.

source: [duplicate_pin_override] pins: # A comma separated list of pins that may be used multiple times in # a config file without normal error checks. This parameter must be # provided.
uk: [duplicate_pin_override] шпильки: # Розділений комами список пінів, які можна використовувати кілька разів # конфігураційний файл без звичайної перевірки помилок. Цей параметр повинен бути # надано.

source: SAMD SERCOM configuration to specify which pins to use on a given SERCOM. One may define any number of sections with a "samd_sercom" prefix. Each SERCOM must be configured prior to using it as SPI or I2C peripheral. Place this config section above any other section that makes use of SPI or I2C buses.
uk: Конфігурація SAMD SERCOM, щоб визначити, які контакти використовувати на певному SERCOM. Можна визначити будь-яку кількість розділів із префіксом "samd_sercom". Кожен SERCOM необхідно налаштувати перед використанням як периферійного пристрою SPI або I2C. Розмістіть цей розділ конфігурації над будь-яким іншим розділом, який використовує шини SPI або I2C.

source: [samd_sercom my_sercom] sercom: # The name of the sercom bus to configure in the micro-controller. # Available names are "sercom0", "sercom1", etc.. This parameter # must be provided. tx_pin: # MOSI pin for SPI communication, or SDA (data) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided. #rx_pin: # MISO pin for SPI communication. This pin is not used for I2C # communication (I2C uses tx_pin for both sending and receiving). # The pin must have a valid pinmux configuration for the given # SERCOM peripheral. This parameter is optional. clk_pin: # CLK pin for SPI communication, or SCL (clock) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided.
uk: [samd_sercom my_sercom] sercom: # Назва шини Sercom для налаштування в мікроконтролері. # Доступні імена: "sercom0", "sercom1" тощо. Цей параметр Потрібно вказати #. tx_pin: # PIN-код MOSI для зв’язку SPI або контакт SDA (дані) для I2C # спілкування. PIN-код повинен мати дійсну конфігурацію pinmux # для даного периферійного пристрою SERCOM. Цей параметр необхідно вказати. #rx_pin: # PIN MISO для зв'язку SPI. Цей контакт не використовується для I2C # зв'язок (I2C використовує tx_pin як для надсилання, так і для отримання). # PIN-код повинен мати дійсну конфігурацію pinmux для даного # Периферійний пристрій SERCOM. Цей параметр необов'язковий. clk_pin: # Штифт CLK для зв'язку SPI або контакт SCL (тактовий сигнал) для I2C # спілкування. PIN-код повинен мати дійсну конфігурацію pinmux # для даного периферійного пристрою SERCOM. Цей параметр необхідно вказати.

source: Configuration reference
uk: Посилання на конфігурацію

source: Controller cooling fan (one may define any number of sections with a "controller_fan" prefix). A "controller fan" is a fan that will be enabled whenever its associated heater or its associated stepper driver is active. The fan will stop whenever an idle_timeout is reached to ensure no overheating will occur after deactivating a watched component.
uk: Контролер вентилятора охолодження (можна визначити будь-яку кількість секцій за допомогою префікса «controller_fan»). «Вентилятор контролера» — це вентилятор, який буде ввімкнено щоразу, коли пов’язаний із ним нагрівач або пов’язаний із ним кроковий драйвер активний. Вентилятор зупинятиметься щоразу, коли буде досягнуто idle_timeout, щоб гарантувати відсутність перегріву після дезактивації компонента, який контролюється.

source: See the [rotation distance document](Rotation_Distance.md) for information on calculating the `rotation_distance` parameter. See the [Multi-MCU homing](Multi_MCU_Homing.md) document for information on homing using multiple micro-controllers.
uk: Перегляньте [документ про відстань обертання](Rotation_Distance.md), щоб отримати інформацію про обчислення параметра `rotation_distance`. Див. документ [Multi-MCU homing](Multi_MCU_Homing.md) для отримання інформації про наведення за допомогою кількох мікроконтролерів.
