Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/CONTRIBUTING.po
Languages: ru, ta

source: Contributing to Klipper
ru: Вклад в Klipper
ta: இரண்டு பாறைகளுக்கு பங்களிக்கிறது

source: It is important to have a "Signed-off-by" line on each commit - it certifies that you agree to the [developer certificate of origin](developer-certificate-of-origin). It must contain your real name (sorry, no pseudonyms or anonymous contributions) and contain a current email address.
ru: Важно иметь строку "Подписано" (Signed-off-by) при каждой фиксации - она подтверждает, что вы согласны с [developer certificate of origin](developer-certificate-of-origin). В нем должно быть указано ваше настоящее имя (извините, никаких псевдонимов или анонимных сообщений) и текущий адрес электронной почты.
ta: ஒவ்வொரு உறுதிப்பாட்டிலும் "கையொப்பமிடப்பட்ட-மூலம்" வரியைக் கொண்டிருப்பது முக்கியம்-[டெவலப்பர் சான்றிதழ்] (டெவலப்பர்-சான்றிதழ்-ஆரிசின்) நீங்கள் ஒப்புக்கொள்கிறீர்கள் என்பதை இது சான்றளிக்கிறது. இது உங்கள் உண்மையான பெயரைக் கொண்டிருக்க வேண்டும் (மன்னிக்கவும், புனைப்பெயர்கள் அல்லது அநாமதேய பங்களிப்புகள் இல்லை) மற்றும் தற்போதைய மின்னஞ்சல் முகவரியைக் கொண்டிருக்க வேண்டும்.

source: module: Capitalized, short (50 chars or less) summary More detailed explanatory text, if necessary. Wrap it to about 75 characters or so. In some contexts, the first line is treated as the subject of an email and the rest of the text as the body. The blank line separating the summary from the body is critical (unless you omit the body entirely); tools like rebase can get confused if you run the two together. Further paragraphs come after blank lines.. Signed-off-by: My Name <myemail@example.org>
ru: модуль: Краткое резюме с заглавной буквы (не более 50 символов) Более подробный пояснительный текст, если это необходимо. Сократите его примерно до 75 символов или около того. В некоторых контекстах первая строка рассматривается как тема электронного письма, а остальная часть текста - как основной текст. Пустая строка, отделяющая сводку от основного текста, имеет решающее значение (если только вы не опустите тело полностью); такие инструменты, как rebase, могут запутаться, если вы запустите их вместе. Дальнейшие абзацы следуют за пустыми строками.. Подписано: Мое имя <myemail@example.org >

source: Contributing to Klipper Translations
ru: Вклад в переводы Klipper
ta: கிளிப்பர் மொழிபெயர்ப்புகளுக்கு பங்களிப்பு

source: 75% Total coverage
ru: 75% Общее покрытие
ta: 75% மொத்த பாதுகாப்பு

source: An updated navigation hierarchy PR in klipper-translations.
ru: Обновленная навигационная иерархия PR в klipper-translations.
ta: கிளிப்பர்-மொழிபெயர்ப்புகளில் புதுப்பிக்கப்பட்ட வழிசெலுத்தல் வரிசைமுறை பி.ஆர்.

source: To reduce the frustration of translating domain-specific terms and gain awareness of the ongoing translations, you can submit a PR modifying the [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) `readme.md`. Once a translation is ready, the corresponding modification to the Klipper project can be made.
ru: Чтобы уменьшить трудности перевода специфических терминов и получить информацию о текущих переводах, вы можете отправить PR, изменяющий [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) `readme.md`. Как только перевод будет готов, можно внести соответствующую модификацию в проект Klipper.
ta: டொமைன்-குறிப்பிட்ட சொற்களை மொழிபெயர்ப்பதில் விரக்தியைக் குறைக்கவும், தற்போதைய மொழிபெயர்ப்புகளைப் பற்றிய விழிப்புணர்வைப் பெறவும், நீங்கள் [Klipper- மொழிபெயர்ப்பு திட்டத்தை] மாற்றியமைக்கும் PR ஐ சமர்ப்பிக்கலாம் (https://github.com/klipper3d/klipper- மொழிபெயர்ப்பு) `ReadMe.Md `. ஒரு மொழிபெயர்ப்பு தயாரானதும், கிளிப்பர் திட்டத்துடன் தொடர்புடைய மாற்றத்தை உருவாக்க முடியும்.

source: If a translation already exists in the Klipper repository and no longer meets the checklist above, it will be marked out-of-date after a month without updates.
ru: Если перевод уже существует в репозитории Klipper и больше не соответствует приведенному выше контрольному списку, он будет помечен как устаревший через месяц без обновлений.
ta: கிளிப்பர் களஞ்சியத்தில் ஏற்கனவே ஒரு மொழிபெயர்ப்பு இருந்தால், மேலே உள்ள சரிபார்ப்பு பட்டியலை இனி சந்திக்கவில்லை என்றால், அது புதுப்பிப்புகள் இல்லாமல் ஒரு மாதத்திற்குப் பிறகு காலாவதியானது என்று குறிக்கப்படும்.

source: Thank you for contributing to Klipper! This document describes the process for contributing changes to Klipper.
ru: Благодарим вас за внесение изменений в Klipper! Этот документ описывает процесс внесения изменений в Klipper.
ta: கிளிப்பருக்கு பங்களித்ததற்கு நன்றி! இந்த ஆவணம் கிளிப்பரில் மாற்றங்களை பங்களிப்பதற்கான செயல்முறையை விவரிக்கிறது.

source: Please see the [contact page](Contact.md) for information on reporting an issue or for details on contacting the developers.
ru: Пожалуйста, обратитесь к странице [contact page](Contact.md) для получения информации о сообщении о проблеме или для получения подробной информации о том, как связаться с разработчиками.
ta: ஒரு சிக்கலைப் புகாரளிப்பது குறித்த தகவலுக்கு அல்லது டெவலப்பர்களைத் தொடர்புகொள்வது குறித்த விவரங்களுக்கு [தொடர்பு பக்கம்] (தொடர்பு.

source: Overview of Contribution Process
ru: Обзор процесса внесения вклада
ta: பங்களிப்பு செயல்முறையின் கண்ணோட்டம்

source: Contributions to Klipper generally follow a high-level process:
ru: Вклад в Klipper, как правило, осуществляется в соответствии с высокоуровневым процессом:
ta: கிளிப்பருக்கு பங்களிப்புகள் பொதுவாக உயர் மட்ட செயல்முறையைப் பின்பற்றுகின்றன:

source: A submitter starts by creating a [GitHub Pull Request](https://github.com/Klipper3d/klipper/pulls) when a submission is ready for widespread deployment.
ru: Участник начинает с создания [GitHub Pull Request](https://github.com/Klipper3d/klipper/pulls), когда представленная работа готова к широкому развертыванию.
ta: ஒரு சமர்ப்பிப்பு பரவலான வரிசைப்படுத்தலுக்கு தயாராக இருக்கும்போது [Github Bull respect] (https://github.com/klipper3d/klipper/pulls) உருவாக்குவதன் மூலம் சமர்ப்பிப்பவர் தொடங்குகிறார்.

source: When a [reviewer](#reviewers) is available to [review](#what-to-expect-in-a-review) the submission, they will assign themselves to the Pull Request on GitHub. The goal of the review is to look for defects and to check that the submission follows documented guidelines.
ru: Когда [рецензент](#reviewers) будет доступен для [рассмотрения](#what-to-expect-in-a-review) представленного материала, он назначит себя на Pull Request на GitHub. Целью рецензирования является поиск дефектов и проверка того, что представленный материал соответствует документированным рекомендациям.
ta: ஒரு [மதிப்பாய்வாளர்] (#மதிப்பாய்வாளர்கள்) [மதிப்பாய்வு] (#ஒரு மதிப்பாய்வு-ஒரு மதிப்பாய்வு) சமர்ப்பிப்புக்கு கிடைக்கும்போது, அவர்கள் கிதுபில் இழுக்கும் கோரிக்கைக்கு தங்களை ஒதுக்குவார்கள். மதிப்பாய்வின் குறிக்கோள் குறைபாடுகளைத் தேடுவதும், சமர்ப்பிப்பு ஆவணப்படுத்தப்பட்ட வழிகாட்டுதல்களைப் பின்பற்றுகிறதா என்பதை சரிபார்க்கவும்.

source: After a successful review, the reviewer will "approve the review" on GitHub and a [maintainer](#reviewers) will commit the change to the Klipper master branch.
ru: После успешной проверки рецензент "одобрит проверку" на GitHub, а [сопровождающий](#reviewers) зафиксирует изменение в основной ветке Klipper.
ta: ஒரு வெற்றிகரமான மதிப்பாய்வுக்குப் பிறகு, மதிப்பாய்வாளர் கிட்அப்பில் "மதிப்பாய்வை அங்கீகரிப்பார்" மற்றும் ஒரு [பராமரிப்பாளர்] (#விமர்சகர்கள்) கிளிப்பர் மாச்டர் கிளையில் மாற்றத்தை செய்வார்.

source: When working on enhancements, consider starting (or contributing to) a topic on [Klipper Discourse](Contact.md). An ongoing discussion on the forum can improve visibility of development work and may attract others interested in testing new work.
ru: При работе над усовершенствованиями подумайте о том, чтобы начать (или внести свой вклад) тему на [Klipper Discourse](Contact.md). Постоянное обсуждение на форуме может улучшить видимость работы над улучшением и привлечь других людей, заинтересованных в тестировании новой работы.
ta: மேம்பாடுகளில் பணிபுரியும் போது, [கிளிப்பர் சொற்பொழிவு] (Contict.md) இல் ஒரு தலைப்பைத் தொடங்க (அல்லது பங்களிப்பு) கருத்தில் கொள்ளுங்கள். மன்றத்தில் நடந்துகொண்டிருக்கும் கலந்துரையாடல் மேம்பாட்டுப் பணிகளின் தெரிவுநிலையை மேம்படுத்தலாம் மற்றும் புதிய வேலைகளைச் சோதிக்க ஆர்வமுள்ள மற்றவர்களை ஈர்க்கக்கூடும்.

source: What to expect in a review
ru: Что ожидать от рецензии
ta: மதிப்பாய்வில் என்ன எதிர்பார்க்க வேண்டும்

source: Contributions to Klipper are reviewed before merging. The primary goal of the review process is to check for defects and to check that the submission follows guidelines specified in the Klipper documentation.
ru: Вклад в Klipper проверяется перед слиянием. Основная цель процесса рецензирования - проверить наличие дефектов и убедиться, что представленные материалы соответствуют рекомендациям, указанным в документации Klipper.
ta: ஒன்றிணைவதற்கு முன் கிளிப்பருக்கு பங்களிப்புகள் மதிப்பாய்வு செய்யப்படுகின்றன. மறுஆய்வு செயல்முறையின் முதன்மை குறிக்கோள் குறைபாடுகளை சரிபார்த்து, சமர்ப்பிப்பு கிளிப்பர் ஆவணத்தில் குறிப்பிடப்பட்டுள்ள வழிகாட்டுதல்களைப் பின்பற்றுகிறது என்பதை சரிபார்க்க வேண்டும்.

source: It is understood that there are many ways to accomplish a task; it is not the intent of the review to discuss the "best" implementation. Where possible, review discussions focused on facts and measurements are preferable.
ru: Понятно, что существует множество способов выполнения задачи; целью обзора не является обсуждение "лучшей" реализации. Там, где это возможно, предпочтительны обсуждения, сосредоточенные на фактах и измерениях.
ta: ஒரு பணியை நிறைவேற்ற பல வழிகள் உள்ளன என்பது புரிந்து கொள்ளப்படுகிறது; "சிறந்த" செயலாக்கத்தைப் பற்றி விவாதிப்பது மதிப்பாய்வின் நோக்கம் அல்ல. சாத்தியமான இடங்களில், உண்மைகள் மற்றும் அளவீடுகளில் கவனம் செலுத்தும் விவாதங்கள் விரும்பத்தக்கவை.

source: The majority of submissions will result in feedback from a review. Be prepared to obtain feedback, provide further details, and to update the submission if needed.
ru: Большинство поданных работ будут сопровождаться отзывами. Будьте готовы получить отзыв, предоставить дополнительные сведения и при необходимости обновить работу.
ta: சமர்ப்பிப்புகளில் பெரும்பாலானவை மதிப்பாய்வின் பின்னூட்டங்களை ஏற்படுத்தும். கருத்துகளைப் பெறவும், மேலும் விவரங்களை வழங்கவும், தேவைப்பட்டால் சமர்ப்பிப்பைப் புதுப்பிக்கவும் தயாராக இருங்கள்.

source: Common things a reviewer will look for:
ru: Обычные вещи, на которые обращает внимание рецензент:
ta: மதிப்பாய்வாளர் தேடும் பொதுவான விசயங்கள்:

source: Is the submission free of defects and is it ready to be widely deployed?
ru: Нет ли в представленном материале дефектов и готов ли он к широкому внедрению?
ta: சமர்ப்பிப்பு குறைபாடுகள் இல்லாதது மற்றும் பரவலாக பயன்படுத்தத் தயாரா?

source: Submitters are expected to test their changes prior to submission. The reviewers look for errors, but they don't, in general, test submissions. An accepted submission is often deployed to thousands of printers within a few weeks of acceptance. Quality of submissions is therefore considered a priority.
ru: Ожидается, что авторы будут тестировать свои изменения перед отправкой. Рецензенты ищут ошибки, но, как правило, не тестируют представленные материалы. Принятая заявка часто распространяется на тысячи принтеров в течение нескольких недель после принятия. Поэтому качество подаваемых материалов считается приоритетным.
ta: சமர்ப்பிப்பாளர்கள் சமர்ப்பிப்பதற்கு முன்னர் தங்கள் மாற்றங்களைச் சோதிப்பார்கள் என்று எதிர்பார்க்கப்படுகிறது. விமர்சகர்கள் பிழைகளைத் தேடுகிறார்கள், ஆனால் அவர்கள் பொதுவாக சமர்ப்பிப்புகளை சோதிக்க மாட்டார்கள். ஏற்றுக்கொள்ளப்பட்ட சமர்ப்பிப்பு பெரும்பாலும் ஆயிரக்கணக்கான அச்சுப்பொறிகளுக்கு ஏற்றுக்கொள்ளப்பட்ட சில வாரங்களுக்குள் பயன்படுத்தப்படுகிறது. எனவே சமர்ப்பிப்புகளின் தகுதி முன்னுரிமையாகக் கருதப்படுகிறது.

source: The main [Klipper3d/klipper](https://github.com/Klipper3d/klipper) GitHub repository does not accept experimental work. Submitters should perform experimentation, debugging, and testing in their own repositories. The [Klipper Discourse](Contact.md) server is a good place to raise awareness of new work and to find users interested in providing real-world feedback.
ru: Основной репозиторий [Klipper3d/klipper](https://github.com/Klipper3d/klipper) GitHub не принимает экспериментальные работы. Участники должны проводить эксперименты, отладку и тестирование в своих собственных репозиториях. Сервер [Klipper Discourse](Contact.md) - хорошее место для повышения осведомленности о новой работе и поиска пользователей, заинтересованных в предоставлении реальных отзывов.
ta: முதன்மையான [klipper3d/klipper] (https://github.com/klipper3d/klipper) அறிவிலிமையம் களஞ்சியம் சோதனை வேலைகளை ஏற்காது. சமர்ப்பிப்பாளர்கள் தங்கள் சொந்த களஞ்சியங்களில் ஆய்வு, பிழைத்திருத்தம் மற்றும் சோதனைகளைச் செய்ய வேண்டும். [கிளிப்பர் சொற்பொழிவு] (தொடர்பு. எம்.டி) சேவையகம் புதிய வேலையைப் பற்றிய விழிப்புணர்வை ஏற்படுத்தவும், நிச உலக கருத்துக்களை வழங்க ஆர்வமுள்ள பயனர்களைக் காணவும் ஒரு நல்ல இடம்.

source: Submissions must pass all [regression test cases](Debugging.md).
ru: Представленные материалы должны пройти все [регрессионные тесты](Debugging.md).
ta: சமர்ப்பிப்புகள் அனைத்து [பின்னடைவு சோதனை வழக்குகள்] (பிழைத்திருத்தம். எம்.டி) கடந்து செல்ல வேண்டும்.

source: Code submissions should not contain excessive debugging code, debugging options, nor run-time debug logging.
ru: Представленный код не должен содержать избыточного отладочного кода, отладочных опций или регистрации отладки во время выполнения.
ta: குறியீடு சமர்ப்பிப்புகளில் அதிகப்படியான பிழைத்திருத்தக் குறியீடு, பிழைத்திருத்த விருப்பங்கள் அல்லது ரன்-டைம் பிழைத்திருத்த பதிவு இருக்கக்கூடாது.

source: Comments in code submissions should focus on enhancing code maintenance. Submissions should not contain "commented out code" nor excessive comments describing past implementations. There should not be excessive "todo" comments.
ru: Комментарии в представленном коде должны быть направлены на улучшение сопровождения кода. Материалы не должны содержать "закомментированный код" или чрезмерные комментарии, описывающие прошлые реализации. Не должно быть чрезмерных комментариев "todo".
ta: குறியீடு சமர்ப்பிப்புகளில் உள்ள கருத்துகள் குறியீடு பராமரிப்பை மேம்படுத்துவதில் கவனம் செலுத்த வேண்டும். சமர்ப்பிப்புகளில் "கருத்து தெரிவிக்கப்பட்ட குறியீடு" அல்லது கடந்த கால செயலாக்கங்களை விவரிக்கும் அதிகப்படியான கருத்துகள் இருக்கக்கூடாது. அதிகப்படியான "செய்யவேண்டிய" கருத்துக்கள் இருக்கக்கூடாது.

source: Updates to documentation should not declare that they are a "work in progress".
ru: Обновления документации не должны заявлять, что они являются "незавершенными".
ta: ஆவணங்களுக்கான புதுப்பிப்புகள் அவை "செயலில் உள்ள வேலை" என்று அறிவிக்கக்கூடாது.

source: Is the copyright of the submission clear, non-gratuitous, and compatible?
ru: Ясно ли авторское право, не является ли оно безвозмездным и совместимым?
ta: சமர்ப்பிப்பின் பதிப்புரிமை தெளிவாக, கிரேட் அல்லாத மற்றும் இணக்கமானதா?

source: New C files and Python files should have an unambiguous copyright statement. See the existing files for the preferred format. Declaring a copyright on an existing file when making minor changes to that file is discouraged.
ru: Новые файлы на Си и файлы на Python должны содержать недвусмысленное заявление об авторских правах. Предпочтительный формат см. в существующих файлах. Не рекомендуется объявлять авторские права на существующий файл при внесении в него незначительных изменений.
ta: புதிய சி கோப்புகள் மற்றும் பைதான் கோப்புகளில் தெளிவற்ற பதிப்புரிமை அறிக்கை இருக்க வேண்டும். விருப்பமான வடிவமைப்பிற்கு இருக்கும் கோப்புகளைப் பார்க்கவும். அந்த கோப்பில் சிறிய மாற்றங்களைச் செய்யும்போது ஏற்கனவே உள்ள கோப்பில் பதிப்புரிமையை அறிவிப்பது ஊக்கமளிக்கிறது.

source: Code taken from 3rd party sources must be compatible with the Klipper license (GNU GPLv3). Large 3rd party code additions should be added to the `lib/` directory (and follow the format described in [lib/README](../lib/README)).
ru: Код, взятый из сторонних источников, должен быть совместим с лицензией Klipper (GNU GPLv3). Крупные дополнения к стороннему коду должны быть добавлены в каталог `lib/` (и соответствовать формату, описанному в [lib/README](../lib/README)).
ta: 3 வது தரப்பு மூலங்களிலிருந்து எடுக்கப்பட்ட குறியீடு கிளிப்பர் உரிமத்துடன் (குனு சி.பி.எல்.வி 3) இணக்கமாக இருக்க வேண்டும். பெரிய 3 வது தரப்பு குறியீடு சேர்த்தல் `லிப்/` கோப்பகத்தில் சேர்க்கப்பட வேண்டும் (மேலும் [lib/readme] (../ lib/readme) இல் விவரிக்கப்பட்டுள்ள வடிவமைப்பைப் பின்பற்றவும்).

source: Submitters must provide a [Signed-off-by line](#format-of-commit-messages) using their full real name. It indicates the submitter agrees with the [developer certificate of origin](developer-certificate-of-origin).
ru: Отправители должны предоставить строку [Signed-off-by](#format-of-commit-messages), используя свое полное настоящее имя. Она указывает, что отправитель согласен с [сертификатом происхождения разработчика](developer-certificate-of-origin).
ta: சமர்ப்பிப்பாளர்கள் தங்கள் முழு உண்மையான பெயரைப் பயன்படுத்தி [கையொப்பமிடப்பட்ட-ஆஃப்-பை வரி] (#வடிவமைப்பு-குழு-செய்தி) வழங்க வேண்டும். [டெவலப்பர் சான்றிதழ்] (டெவலப்பர்-சான்றிதழ்-ஆரிசின்) உடன் சமர்ப்பிப்பவர் உடன்படுகிறார் என்பதை இது குறிக்கிறது.

source: Does the submission follow guidelines specified in the Klipper documentation?
ru: Соответствует ли подача материала рекомендациям, указанным в документации Klipper?
ta: சமர்ப்பிப்பு கிளிப்பர் ஆவணத்தில் குறிப்பிடப்பட்டுள்ள வழிகாட்டுதல்களைப் பின்பற்றுகிறதா?

source: In particular, code should follow the guidelines in <Code_Overview.md> and config files should follow the guidelines in <Example_Configs.md>.
ru: В частности, код должен следовать рекомендациям в <Code_Overview.md>, а файлы конфигурации - рекомендациям в <Example_Configs.md>.
ta: குறிப்பாக, குறியீடு <code_overview.md> இல் உள்ள வழிகாட்டுதல்களைப் பின்பற்ற வேண்டும், மேலும் கட்டமைப்பு கோப்புகள் <extram_configs.md> இல் உள்ள வழிகாட்டுதல்களைப் பின்பற்ற வேண்டும்.

source: Is the Klipper documentation updated to reflect new changes?
ru: Обновляется ли документация Klipper, чтобы отразить новые изменения?
ta: புதிய மாற்றங்களை பிரதிபலிக்கும் வகையில் கிளிப்பர் ஆவணங்கள் புதுப்பிக்கப்பட்டுள்ளதா?

source: At a minimum, the reference documentation must be updated with corresponding changes to the code:
ru: Как минимум, справочная документация должна быть обновлена с учетом соответствующих изменений в коде:
ta: குறைந்தபட்சம், குறியீட்டில் தொடர்புடைய மாற்றங்களுடன் குறிப்பு ஆவணங்கள் புதுப்பிக்கப்பட வேண்டும்:

source: All commands and command parameters must be documented in <G-Codes.md>.
ru: Все команды и параметры команд должны быть задокументированы в <G-Codes.md>.
ta: அனைத்து கட்டளைகள் மற்றும் கட்டளை அளவுருக்கள் <g-codes.md> இல் ஆவணப்படுத்தப்பட வேண்டும்.

source: All user facing modules and their config parameters must be documented in <Config_Reference.md>.
ru: Все модули, предназначенные для пользователей, и их параметры конфигурации должны быть задокументированы в <Config_Reference.md>.
ta: அனைத்து பயனர் எதிர்கொள்ளும் தொகுதிகள் மற்றும் அவற்றின் கட்டமைப்பு அளவுருக்கள் <config_reference.md> இல் ஆவணப்படுத்தப்பட வேண்டும்.

source: All exported "status variables" must be documented in <Status_Reference.md>.
ru: Все экспортируемые "переменные состояния" должны быть задокументированы в <Status_Reference.md>.
ta: ஏற்றுமதி செய்யப்பட்ட அனைத்து "நிலை மாறிகள்" <status_reference.md> இல் ஆவணப்படுத்தப்பட வேண்டும்.

source: All new "webhooks" and their parameters must be documented in <API_Server.md>.
ru: Все новые "веб-крючки" и их параметры должны быть задокументированы в <API_Server.md>.
ta: அனைத்து புதிய "வெப்ஊக்குகள்" மற்றும் அவற்றின் அளவுருக்கள் <api_server.md> இல் ஆவணப்படுத்தப்பட வேண்டும்.

source: Any change that makes a non-backwards compatible change to a command or config file setting must be documented in <Config_Changes.md>.
ru: Любое изменение, которое вносит несовместимые с обратным ходом изменения в команду или настройки файла конфигурации, должно быть задокументировано в <Config_Changes.md>.
ta: ஒரு கட்டளை அல்லது கட்டமைப்பு கோப்பு அமைப்பில் பின்னோக்கி அல்லாத இணக்கமான மாற்றத்தை ஏற்படுத்தும் எந்த மாற்றமும் <config_changes.md> இல் ஆவணப்படுத்தப்பட வேண்டும்.

source: New documents should be added to <Overview.md> and be added to the website index [docs/_klipper3d/mkdocs.yml](../docs/_klipper3d/mkdocs.yml).
ru: Новые документы должны быть добавлены в <Overview.md> и добавлены в индекс сайта [docs/_klipper3d/mkdocs.yml](../docs/_klipper3d/mkdocs.yml).
ta: புதிய ஆவணங்கள் <egonview.md> இல் சேர்க்கப்பட வேண்டும், மேலும் வலைத்தளக் குறியீட்டில் [டாக்ச்/_klipper3d/mkdocs.yml] (../ docs/_klipper3d/mkdocs.yml) சேர்க்கப்பட வேண்டும்.

source: Are commits well formed, address a single topic per commit, and independent?
ru: Хорошо ли сформированы коммиты, касаются ли они одной темы в каждом коммите и являются ли они независимыми?
ta: கமிட்டுகள் நன்கு உருவாகின்றன, ஒரு கமிட்டத்திற்கு ஒரு தலைப்பைக் குறிக்கின்றன, சுயாதீனமா?

source: Commit messages should follow the [preferred format](#format-of-commit-messages).
ru: Сообщения коммитов должны соответствовать [предпочтительному формату](#format-of-commit-messages).
ta: கமிட் செய்திகள் [விருப்பமான வடிவத்தை] பின்பற்ற வேண்டும் (#கம்யூட்-ஆஃப்-கமிட்-மெசேச்கள்).

source: Commits must not have a merge conflict. New additions to the Klipper master branch are always done via a "rebase" or "squash and rebase". It is generally not necessary for submitters to re-merge their submission on every update to the Klipper master repository. However, if there is a merge conflict, then submitters are recommended to use `git rebase` to address the conflict.
ru: Коммиты не должны иметь конфликтов слияния. Новые добавления в мастер-ветку Klipper всегда выполняются через "rebase" или "слияние и возврат". Как правило, сабмиттерам нет необходимости повторно сливать свои коммиты при каждом обновлении мастер-репозитория Klipper. Однако, если возникает конфликт слияния, рекомендуется использовать `git rebase` для устранения конфликта.
ta: கமிட்டுகளுக்கு ஒன்றிணைக்கும் மோதல் இருக்கக்கூடாது. கிளிப்பர் மாச்டர் கிளையில் புதிய சேர்த்தல்கள் எப்போதும் "மறுப்பு" அல்லது "ச்குவாச் மற்றும் ரீபேச்" வழியாக செய்யப்படுகின்றன. க்ளிப்பர் மாச்டர் களஞ்சியத்திற்கு ஒவ்வொரு புதுப்பிப்பிலும் சமர்ப்பிப்பவர்கள் தங்கள் சமர்ப்பிப்பை மீண்டும் குளிர்விக்க வேண்டிய அவசியமில்லை. இருப்பினும், ஒன்றிணைக்கும் மோதல் இருந்தால், மோதலை நிவர்த்தி செய்ய `கிட் ரெபேச்` ஐப் பயன்படுத்த சமர்ப்பிப்பாளர்கள் பரிந்துரைக்கப்படுகிறார்கள்.

source: Each commit should address a single high-level change. Large changes should be broken up into multiple independent commits. Each commit should "stand on its own" so that tools like `git bisect` and `git revert` work reliably.
ru: Каждый коммит должен относиться к одному высокоуровневому изменению. Большие изменения должны быть разбиты на несколько независимых коммитов. Каждый коммит должен "стоять на своём", чтобы такие инструменты, как `git bisect` и `git revert`, работали надёжно.
ta: ஒவ்வொரு உறுதிப்பாடும் ஒரு உயர் மட்ட மாற்றத்தை நிவர்த்தி செய்ய வேண்டும். பெரிய மாற்றங்கள் பல சுயாதீனமான கமிட்டுகளாக பிரிக்கப்பட வேண்டும். ஒவ்வொரு உறுதிப்பாடும் "சொந்தமாக நிற்க வேண்டும்", இதனால் `கிட் பிசெக்ட்` மற்றும்` அறிவிலி ரிவர்ட்` போன்ற கருவிகள் நம்பத்தகுந்ததாக வேலை செய்கின்றன.

source: Whitespace changes should not be mixed with functional changes. In general, gratuitous whitespace changes are not accepted unless they are from the established "owner" of the code being modified.
ru: Изменения пробельных символов не должны смешиваться с функциональными изменениями. В целом, беспричинные изменения пробельных символов не принимаются, если только они не исходят от признанного "владельца" модифицируемого кода.
ta: வைட்ச்பேச் மாற்றங்கள் செயல்பாட்டு மாற்றங்களுடன் கலக்கக்கூடாது. பொதுவாக, குறியீட்டின் நிறுவப்பட்ட "உரிமையாளரிடமிருந்து" அவை மாற்றப்படாவிட்டால், நன்றியற்ற இடைவெளி மாற்றங்கள் ஏற்றுக்கொள்ளப்படாது.
