Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/CONTRIBUTING.po
Languages: ru, ta

source: Does the submission provide a "high impact" benefit to real-world users performing real-world tasks?
ru: Приносит ли заявка "большую пользу" реальным пользователям, выполняющим реальные задачи?
ta: நிச உலகப் பணிகளைச் செய்யும் நிச உலக பயனர்களுக்கு சமர்ப்பிப்பு "அதிக தாக்கம்" நன்மையை அளிக்கிறதா?

source: Reviewers need to identify, at least in their own minds, roughly "who the target audience is", a rough scale of "the size of that audience", the "benefit" they will obtain, how the "benefit is measured", and the "results of those measurement tests". In most cases this will be obvious to both the submitter and the reviewer, and it is not explicitly stated during a review.
ru: Рецензенты должны хотя бы приблизительно определить, "кто является целевой аудиторией", приблизительную шкалу "размера этой аудитории", "пользу", которую они получат, как "польза измеряется" и "результаты этих измерений". В большинстве случаев это очевидно как для автора, так и для рецензента, и не указывается в явном виде во время рецензирования.
ta: விமர்சகர்கள் குறைந்தபட்சம் தங்கள் மனதில், தோராயமாக "இலக்கு பார்வையாளர்கள் யார்", "அந்த பார்வையாளர்களின் அளவு", அவர்கள் பெறும் "நன்மை", "நன்மை எவ்வாறு அளவிடப்படுகிறது", மற்றும் "அந்த அளவீட்டு சோதனைகளின் முடிவுகள்". பெரும்பாலான சந்தர்ப்பங்களில் இது சமர்ப்பிப்பவர் மற்றும் மதிப்பாய்வாளர் ஆகிய இரண்டிற்கும் தெளிவாக இருக்கும், மேலும் இது ஒரு மதிப்பாய்வின் போது வெளிப்படையாகக் கூறப்படவில்லை.

source: Submissions to the master Klipper branch are expected to have a noteworthy target audience. As a general "rule of thumb", submissions should target a user base of at least a 100 real-world users.
ru: Ожидается, что материалы, отправляемые в мастер-ветку Klipper, будут иметь заметную целевую аудиторию. В качестве общего "эмпирического правила", представленные материалы должны быть нацелены на базу пользователей, состоящую не менее чем из 100 реальных пользователей.
ta: மாச்டர் கிளிப்பர் கிளைக்கு சமர்ப்பிப்புகள் குறிப்பிடத்தக்க இலக்கு பார்வையாளர்களைக் கொண்டிருக்கும் என்று எதிர்பார்க்கப்படுகிறது. ஒரு பொதுவான "கட்டைவிரல் விதி" ஆக, சமர்ப்பிப்புகள் குறைந்தது 100 நிச உலக பயனர்களின் பயனர் தளத்தை குறிவைக்க வேண்டும்.

source: If a reviewer asks for details on the "benefit" of a submission, please don't consider it criticism. Being able to understand the real-world benefits of a change is a natural part of a review.
ru: Если рецензент просит подробно рассказать о "пользе" работы, не считайте это критикой. Возможность понять реальную пользу от изменений - естественная часть рецензирования.
ta: சமர்ப்பிப்பின் "நன்மை" குறித்த விவரங்களை ஒரு மதிப்பாய்வாளர் கேட்டால், தயவுசெய்து அதை விமர்சனமாகக் கருத வேண்டாம். ஒரு மாற்றத்தின் நிச உலக நன்மைகளைப் புரிந்து கொள்ள முடிந்தது ஒரு மதிப்பாய்வின் இயல்பான பகுதியாகும்.

source: All new modules, config options, commands, command parameters, and documents should have "high impact". We do not want to burden users with options that they can not reasonably configure nor do we want to burden them with options that don't provide a notable benefit.
ru: Все новые модули, опции конфигурации, команды, параметры команд и документы должны иметь "высокую степень воздействия". Мы не хотим нагружать пользователей опциями, которые они не могут разумно настроить, а также не хотим нагружать их опциями, которые не дают заметных преимуществ.
ta: அனைத்து புதிய தொகுதிகள், கட்டமைப்பு விருப்பங்கள், கட்டளைகள், கட்டளை அளவுருக்கள் மற்றும் ஆவணங்கள் "அதிக தாக்கத்தை" கொண்டிருக்க வேண்டும். பயனர்கள் நியாயமான முறையில் கட்டமைக்க முடியாத விருப்பங்களை சுமக்க நாங்கள் விரும்பவில்லை அல்லது குறிப்பிடத்தக்க நன்மையை வழங்காத விருப்பங்களுடன் அவர்களுக்கு சுமக்க விரும்பவில்லை.

source: A reviewer may ask for clarification on how a user is to configure an option - an ideal response will contain details on the process - for example, "users of the MegaX500 are expected to set option X to 99.3 while users of the Elite100Y are expected to calibrate option X using procedure ...".
ru: Рецензент может попросить разъяснить, как пользователь должен настраивать ту или иную опцию - идеальный ответ будет содержать подробную информацию о процессе, например, "пользователи MegaX500 должны установить опцию X на 99,3, а пользователи Elite100Y должны откалибровать опцию X с помощью процедуры ...".
ta: ஒரு பயனர் ஒரு விருப்பத்தை எவ்வாறு உள்ளமைப்பது என்பது குறித்து ஒரு மதிப்பாய்வாளர் தெளிவுபடுத்தக் கேட்கலாம் - ஒரு சிறந்த பதிலில் செயல்முறையின் விவரங்கள் இருக்கும் - எடுத்துக்காட்டாக, "மெகாக்ச் 500 இன் பயனர்கள் விருப்பத்தை 99.3 ஆக நிர்ணயிப்பார்கள் என்று எதிர்பார்க்கப்படுகிறது, அதே நேரத்தில் எலைட் 100y இன் பயனர்கள் எதிர்பார்க்கப்படுகிறார்கள் நடைமுறையைப் பயன்படுத்தி விருப்பம் ஃச் ஐ அளவீடு செய்யுங்கள் ... ".

source: If the goal of an option is to make the code more modular then prefer using code constants instead of user facing config options.
ru: Если цель опции - сделать код более модульным, то лучше использовать константы кода, а не опции конфигурации, обращенные к пользователю.
ta: ஒரு விருப்பத்தின் குறிக்கோள் குறியீட்டை மேலும் மட்டுப்படுத்துவதாக இருந்தால், பயனர் எதிர்கொள்ளும் கட்டமைப்பு விருப்பங்களுக்கு பதிலாக குறியீடு மாறிலிகளைப் பயன்படுத்த விரும்புங்கள்.

source: New modules, new options, and new parameters should not provide similar functionality to existing modules - if the differences are arbitrary than it's preferable to utilize the existing system or refactor the existing code.
ru: Новые модули, новые опции и новые параметры не должны предоставлять функциональность, аналогичную существующим модулям - если различия произвольны, предпочтительнее использовать существующую систему или рефакторить существующий код.
ta: புதிய தொகுதிகள், புதிய விருப்பங்கள் மற்றும் புதிய அளவுருக்கள் இருக்கும் தொகுதிகளுக்கு ஒத்த செயல்பாட்டை வழங்கக்கூடாது - வேறுபாடுகள் இருக்கும் கணினியைப் பயன்படுத்துவது அல்லது ஏற்கனவே உள்ள குறியீட்டை மறுசீரமைப்பது விரும்பத்தக்கது என்பதை விட தன்னிச்சையாக இருந்தால்.

source: Klipper does not implement a strict "coding style guide", but modifications to existing code should follow the high-level code flow, code indentation style, and format of that existing code. Submissions of new modules and systems have more flexibility in coding style, but it is preferable for that new code to follow an internally consistent style and to generally follow industry wide coding norms.
ru: Klipper не использует строгое "руководство по стилю кодирования", но модификации существующего кода должны следовать высокоуровневому потоку кода, стилю отступов и формату существующего кода. Новые модули и системы могут быть более гибкими в отношении стиля кодирования, но предпочтительно, чтобы новый код следовал внутренне согласованному стилю и в целом соответствовал общепринятым в отрасли нормам кодирования.
ta: கிளிப்பர் ஒரு கண்டிப்பான "குறியீட்டு பாணி வழிகாட்டியை" செயல்படுத்தவில்லை, ஆனால் இருக்கும் குறியீட்டில் மாற்றங்கள் உயர் மட்ட குறியீடு ஓட்டம், குறியீடு உள்தள்ளல் பாணி மற்றும் இருக்கும் குறியீட்டின் வடிவமைப்பைப் பின்பற்ற வேண்டும். புதிய தொகுதிகள் மற்றும் அமைப்புகளின் சமர்ப்பிப்புகள் குறியீட்டு பாணியில் அதிக நெகிழ்வுத்தன்மையைக் கொண்டுள்ளன, ஆனால் அந்த புதிய குறியீடு உள்நாட்டில் சீரான பாணியைப் பின்பற்றுவதும் பொதுவாக தொழில்துறை பரந்த குறியீட்டு விதிமுறைகளைப் பின்பற்றுவதும் விரும்பத்தக்கது.

source: It is not a goal of a review to discuss "better implementations". However, if a reviewer struggles to understand the implementation of a submission, then they may ask for changes to make the implementation more transparent. In particular, if reviewers can not convince themselves that a submission is free of defects then changes may be necessary.
ru: Обсуждение "лучших реализаций" не является целью рецензии. Однако если рецензенту трудно понять реализацию представленного материала, он может попросить внести изменения, чтобы сделать реализацию более прозрачной. В частности, если рецензенты не могут убедить себя в том, что в представленном материале нет дефектов, то могут потребоваться изменения.
ta: "சிறந்த செயலாக்கங்கள்" பற்றி விவாதிப்பது மதிப்பாய்வின் குறிக்கோள் அல்ல. இருப்பினும், ஒரு மதிப்பாய்வாளர் சமர்ப்பிப்பை செயல்படுத்துவதைப் புரிந்துகொள்ள போராடினால், அவர்கள் செயல்படுத்தலை மேலும் வெளிப்படையானதாக மாற்ற மாற்றங்களைக் கேட்கலாம். குறிப்பாக, சமர்ப்பிப்பு குறைபாடுகள் இல்லாதது என்று விமர்சகர்கள் தங்களை நம்ப முடியாவிட்டால், மாற்றங்கள் தேவைப்படலாம்.

source: As part of a review, a reviewer may create an alternate Pull Request for a topic. This may be done to avoid excessive "back and forth" on minor procedural items and thus streamline the submission process. It may also be done because the discussion inspires a reviewer to build an alternative implementation. Both situations are a normal result of a review and should not be considered criticism of the original submission.
ru: В рамках рецензирования рецензент может создать альтернативный Pull Request для темы. Это может быть сделано для того, чтобы избежать чрезмерного обсуждения мелких процедурных вопросов и тем самым упростить процесс отправки. Также это может быть сделано, потому что обсуждение вдохновляет рецензента на создание альтернативной реализации. Обе ситуации являются нормальным результатом рецензирования и не должны рассматриваться как критика исходной заявки.
ta: மதிப்பாய்வின் ஒரு பகுதியாக, ஒரு மதிப்பாய்வாளர் ஒரு தலைப்புக்கான மாற்று இழுப்பு கோரிக்கையை உருவாக்கலாம். சிறிய நடைமுறை உருப்படிகளில் அதிகப்படியான "முன்னும் பின்னுமாக" தவிர்ப்பதற்காக இது செய்யப்படலாம், இதனால் சமர்ப்பிக்கும் செயல்முறையை நெறிப்படுத்தலாம். மாற்றுச் செயலாக்கத்தை உருவாக்க விவாதம் ஒரு விமர்சகரை ஊக்குவிப்பதால் இது செய்யப்படலாம். இரண்டு சூழ்நிலைகளும் ஒரு மதிப்பாய்வின் சாதாரண விளைவாகும், மேலும் அசல் சமர்ப்பிப்பின் விமர்சனமாக கருதப்படக்கூடாது.

source: Helping with reviews
ru: Помощь в написании обзоров
ta: மதிப்புரைகளுக்கு உதவுதல்

source: We appreciate help with reviews! It is not necessary to be a [listed reviewer](#reviewers) to perform a review. Submitters of GitHub Pull Requests are also encouraged to review their own submissions.
ru: Мы благодарны за помощь с рецензиями! Не обязательно быть [перечисленным рецензентом](#reviewers), чтобы выполнять рецензирование. Авторам GitHub Pull Requests также рекомендуется рецензировать свои собственные заявки.
ta: மதிப்புரைகளுக்கான உதவியை நாங்கள் பாராட்டுகிறோம்! மதிப்பாய்வைச் செய்ய [பட்டியலிடப்பட்ட விமர்சகர்] (#விமர்சகர்கள்) இருக்க வேண்டிய அவசியமில்லை. அறிவிலிமையம் புல் கோரிக்கைகளின் சமர்ப்பிப்பாளர்களும் தங்கள் சொந்த சமர்ப்பிப்புகளை மதிப்பாய்வு செய்ய ஊக்குவிக்கப்படுகிறார்கள்.

source: To help with a review, follow the steps outlined in [what to expect in a review](#what-to-expect-in-a-review) to verify the submission. After completing the review, add a comment to the GitHub Pull Request with your findings. If the submission passes the review then please state that explicitly in the comment - for example something like "I reviewed this change according to the steps in the CONTRIBUTING document and everything looks good to me". If unable to complete some steps in the review then please explicitly state which steps were reviewed and which steps were not reviewed - for example something like "I didn't check the code for defects, but I reviewed everything else in the CONTRIBUTING document and it looks good".
ru: Чтобы помочь с рецензированием, выполните шаги, описанные в [What to expect in a review](#what-to-expect-in-a-review), чтобы проверить отправку. После завершения проверки добавьте комментарий к GitHub Pull Request с вашими выводами. Если заявка прошла проверку, укажите это в комментарии - например, что-то вроде "Я проверил это изменение в соответствии с шагами в документе CONTRIBUTING, и мне кажется, что все хорошо". Если вы не смогли выполнить некоторые этапы рецензирования, укажите, какие этапы были рассмотрены, а какие нет - например, что-то вроде "Я не проверял код на наличие дефектов, но я рассмотрел все остальное в документе CONTRIBUTING, и все выглядит хорошо".
ta: மதிப்பாய்வுக்கு உதவ, சமர்ப்பிப்பைச் சரிபார்க்க [மதிப்பாய்வில் என்ன எதிர்பார்க்க வேண்டும்] (#ஒரு மதிப்பாய்வு-ஒரு மதிப்பாய்வு) இல் கோடிட்டுக் காட்டப்பட்டுள்ள படிகளைப் பின்பற்றவும். மதிப்பாய்வை முடித்த பிறகு, உங்கள் கண்டுபிடிப்புகளுடன் அறிவிலிமையம் புல் கோரிக்கையில் ஒரு கருத்தைச் சேர்க்கவும். சமர்ப்பிப்பு மதிப்பாய்வை நிறைவேற்றினால், தயவுசெய்து கருத்தில் வெளிப்படையாகக் கூறுங்கள் - எடுத்துக்காட்டாக "பங்களிக்கும் ஆவணத்தின் படிகளுக்கு ஏற்ப இந்த மாற்றத்தை நான் மதிப்பாய்வு செய்தேன், எல்லாமே எனக்கு நன்றாக இருக்கும்". மதிப்பாய்வில் சில படிகளை முடிக்க முடியாவிட்டால், தயவுசெய்து எந்த படிகள் மதிப்பாய்வு செய்யப்பட்டன, எந்த படிகள் மதிப்பாய்வு செய்யப்படவில்லை என்பதை வெளிப்படையாகக் கூறுங்கள் - எடுத்துக்காட்டாக "குறைபாடுகளுக்கான குறியீட்டை நான் சரிபார்க்கவில்லை, ஆனால் எல்லாவற்றையும் பங்களிக்கும் ஆவணத்திலும் அதில் மதிப்பாய்வு செய்தேன் நன்றாக இருக்கிறது ".

source: We also appreciate testing of submissions. If the code was tested then please add a comment to the GitHub Pull Request with the results of your test - success or failure. Please explicitly state that the code was tested and the results - for example something like "I tested this code on my Acme900Z printer with a vase print and the results were good".
ru: Мы также признательны за тестирование представленных материалов. Если код был протестирован, пожалуйста, добавьте комментарий к GitHub Pull Request с результатами тестирования - успешными или неудачными. Пожалуйста, явно укажите, что код был протестирован, и результаты - например, что-то вроде "Я протестировал этот код на принтере Acme900Z с печатью вазы, и результаты были хорошими".
ta: சமர்ப்பிப்புகளின் சோதனையையும் நாங்கள் பாராட்டுகிறோம். குறியீடு சோதிக்கப்பட்டால், தயவுசெய்து உங்கள் சோதனையின் முடிவுகளுடன் அறிவிலிமையம் புல் கோரிக்கையில் ஒரு கருத்தைச் சேர்க்கவும் - செய் அல்லது தோல்வி. குறியீடு சோதிக்கப்பட்டது மற்றும் முடிவுகள் - எடுத்துக்காட்டாக, "இந்த குறியீட்டை எனது ACME900Z அச்சுப்பொறியில் ஒரு குவளை அச்சுடன் சோதித்தேன், முடிவுகள் நன்றாக இருந்தன" போன்றவை.

source: Reviewers
ru: Рецензенты
ta: விமர்சகர்கள்

source: The Klipper "reviewers" are:
ru: "Рецензентами" Клиппера являются:
ta: கிளிப்பர் "விமர்சகர்கள்":

source: Name
ru: Название
ta: பெயர்

source: Areas of interest
ru: Сферы интересов
ta: ஆர்வமுள்ள பகுதிகள்

source: Dmitry Butyugin
ru: Дмитрий Бутюгин
ta: Dmitry bootyugin

source: Input shaping, resonance testing, kinematics
ru: Формирование входного сигнала, резонансное тестирование, кинематика
ta: உள்ளீட்டு வடிவமைத்தல், அதிர்வு சோதனை, இயக்கவியல்

source: Eric Callahan
ru: Эрик Каллахан
ta: எரிக் கால்ஆன்

source: Bed leveling, MCU flashing
ru: Выравнивание кровати, прошивка MCU
ta: படுக்கை சமப்படுத்துதல், MCU ஒளிரும்

source: Kevin O'Connor
ru: Кевин О'Коннор
ta: கெவின் ஓ'கானர்

source: @KevinOConnor
ru: @КевинОконнор

source: Core motion system, Micro-controller code
ru: Основная система движения, код микроконтроллера
ta: கோர் மோசன் சிச்டம், மைக்ரோ-கன்ட்ரோலர் குறியீடு

source: Please do not "ping" any of the reviewers and please do not direct submissions at them. All of the reviewers monitor the forums and PRs, and will take on reviews when they have time to.
ru: Пожалуйста, не пингуйте рецензентов и не направляйте им заявки. Все рецензенты следят за форумами и PR, и берут на себя рецензии, когда у них есть время.
ta: தயவுசெய்து எந்தவொரு மதிப்பாய்வாளர்களையும் "பிங்" செய்யாதீர்கள், தயவுசெய்து அவற்றை நேரடியாக சமர்ப்பிக்க வேண்டாம். விமர்சகர்கள் அனைவரும் மன்றங்கள் மற்றும் பி.ஆர்.எச் ஆகியவற்றைக் கண்காணிக்கிறார்கள், மேலும் அவை நேரம் இருக்கும்போது மதிப்புரைகளை எடுக்கும்.

source: The Klipper "maintainers" are:
ru: "Сопровождающими" Клиппера являются:
ta: கிளிப்பர் "பராமரிப்பாளர்கள்":

source: GitHub name
ru: Название GitHub
ta: அறிவிலிமையம் பெயர்

source: Format of commit messages
ru: Формат сообщений фиксации
ta: கமிட் செய்திகளின் வடிவம்

source: Each commit should have a commit message formatted similar to the following:
ru: Каждая фиксация должна содержать сообщение о фиксации в следующем формате:
ta: ஒவ்வொரு உறுதிப்பாடும் பின்வருவனவற்றைப் போலவே வடிவமைக்கப்பட்ட செய்தியைக் கொண்டிருக்க வேண்டும்:

source: In the above example, `module` should be the name of a file or directory in the repository (without a file extension). For example, `clocksync: Fix typo in pause() call at connect time`. The purpose of specifying a module name in the commit message is to help provide context for the commit comments.
ru: В приведенном выше примере `module` должно быть именем файла или каталога в репозитории (без расширения файла). Например, `clocksync: Fix typo in pause() call at connect time`. Цель указания имени модуля в сообщении о фиксации - помочь обеспечить контекст для комментариев к фиксации.
ta: மேலே உள்ள எடுத்துக்காட்டில், `தொகுதி` களஞ்சியத்தில் ஒரு கோப்பு அல்லது கோப்பகத்தின் பெயராக இருக்க வேண்டும் (கோப்பு நீட்டிப்பு இல்லாமல்). எடுத்துக்காட்டாக, `கடிகாரம்: இடைநிறுத்தத்தில் எழுத்துப்பிழையை சரிசெய்யவும் () இணைப்பு நேரத்தில் அழைக்கவும்`. கமிட் செய்தியில் ஒரு தொகுதி பெயரைக் குறிப்பிடுவதன் நோக்கம், கமிட் கருத்துகளுக்கான சூழலை வழங்க உதவுவதாகும்.

source: [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) is a project dedicated to translating Klipper to different languages. [Weblate](https://hosted.weblate.org/projects/klipper/) hosts all the Gettext strings for translating and reviewing. Locales can be displayed on [klipper3d.org](https://www.klipper3d.org) once they satisfy the following requirements:
ru: [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) - проект, посвященный переводу Klipper на разные языки. На сайте [Weblate](https://hosted.weblate.org/projects/klipper/) размещены все строки Gettext для перевода и просмотра. Локализации могут быть отображены на [klipper3d.org](https://www.klipper3d.org), если они удовлетворяют следующим требованиям:
ta: . . பின்வரும் தேவைகளை நிறைவு செய்தவுடன் இடங்களை [klipper3d.org] (https://www.klipper3d.org) இல் காட்டலாம்:

source: All titles (H1) are translated
ru: Все заголовки (H1) переведены
ta: அனைத்து தலைப்புகளும் (H1) மொழிபெயர்க்கப்பட்டுள்ளன

source: Once the requirements are met, you need to:
ru: После того как требования будут выполнены, вам необходимо:
ta: தேவைகள் நிறைவு செய்யப்பட்டதும், நீங்கள் செய்ய வேண்டும்:

source: update klipper-tranlations repository [active_translations](https://github.com/Klipper3d/klipper-translations/blob/translations/active_translations)
ru: обновить репозиторий klipper-tranlations [active_translations](https://github.com/Klipper3d/klipper-translations/blob/translations/active_translations)
ta: கிளிப்பர்-டிரான்லேசன்ச் களஞ்சியத்தைப் புதுப்பிக்கவும் [செயலில்_பிரான்ச்லேசன்ச்] (https://github.com/klipper3d/klipper-translations/blob/translations/active_translations)

source: Optional: add a manual-index.md file in klipper-translations repository's `docs\locals\<lang>` folder to replace the language specific index.md (generated index.md does not render correctly).
ru: Дополнительно: добавьте файл manual-index.md в папку `docs\locals\<lang>` репозитория klipper-translations, чтобы заменить специфичный для каждого языка index.md (сгенерированный index.md отображается некорректно).
ta: விரும்பினால்: கிளிப்பர்-மொழிபெயர்ப்பு களஞ்சியத்தின் `டாக்ச் \ உள்ளூர்வாசிகள் \ <lang>` மொழி குறிப்பிட்ட குறியீட்டை மாற்றுவதற்கு கோப்புறை (உருவாக்கப்பட்ட index.md சரியாக வழங்காது).

source: Known Issues:
ru: Известные проблемы:
ta: அறியப்பட்ட சிக்கல்கள்:

source: Currently, there isn't a method for correctly translating pictures in the documentation
ru: В настоящее время в документации нет метода правильного перевода изображений
ta: தற்போது, ஆவணத்தில் படங்களை சரியாக மொழிபெயர்க்க ஒரு முறை இல்லை

source: It is impossible to translate titles in mkdocs.yml.
ru: Невозможно перевести заголовки в mkdocs.yml.
ta: தலைப்புகளை mkdocs.yml இல் மொழிபெயர்க்க முடியாது.

source: When discussing benefits it is preferable to discuss "facts and measurements". In general, reviewers are not looking for responses of the form "someone may find option X useful", nor are they looking for responses of the form "this submission adds a feature that firmware X implements". Instead, it is generally preferable to discuss details on how the quality improvement was measured and what were the results of those measurements - for example, "tests on Acme X1000 printers show improved corners as seen in picture ...", or for example "print time of real-world object X on a Foomatic X900 printer went from 4 hours to 3.5 hours". It is understood that testing of this type can take significant time and effort. Some of Klipper's most notable features took months of discussion, rework, testing, and documentation prior to being merged into the master branch.
ru: При обсуждении преимуществ предпочтительнее обсуждать "факты и измерения". В целом, рецензенты не ищут ответов типа "кто-то может найти опцию X полезной", равно как и ответов типа "эта заявка добавляет функцию, которая реализована в прошивке X". Вместо этого, как правило, предпочтительнее обсудить детали того, как измерялось улучшение качества и каковы были результаты этих измерений - например, "тесты на принтерах Acme X1000 показали улучшение углов, как видно на рисунке...", или, например, "время печати реального объекта X на принтере Foomatic X900 сократилось с 4 часов до 3,5 часов". Понятно, что тестирование такого рода может занять много времени и сил. Некоторые из наиболее заметных функций Klipper потребовались месяцы обсуждений, доработок, тестирования и документирования, прежде чем они были добавлены в основную ветку.
ta: நன்மைகளைப் பற்றி விவாதிக்கும்போது "உண்மைகள் மற்றும் அளவீடுகள்" பற்றி விவாதிப்பது விரும்பத்தக்கது. பொதுவாக, விமர்சகர்கள் "யாரோ விருப்பம் ஃச் பயனுள்ளதாக இருக்கலாம்" என்ற படிவத்தின் பதில்களைத் தேடவில்லை, அல்லது "இந்த சமர்ப்பிப்பு ஃபார்ம்வேர் ஃச் செயல்படுத்தும் ஒரு அம்சத்தை சேர்க்கிறது" என்ற படிவத்தின் பதில்களை அவர்கள் தேடவில்லை. அதற்கு பதிலாக, தர மேம்பாடு எவ்வாறு அளவிடப்பட்டது மற்றும் அந்த அளவீடுகளின் முடிவுகள் என்ன என்பது குறித்த விவரங்களைப் பற்றி விவாதிப்பது பொதுவாக விரும்பத்தக்கது - எடுத்துக்காட்டாக, "ACME X1000 அச்சுப்பொறிகளில் சோதனைகள் படத்தில் காணப்படுவது போல் மேம்பட்ட மூலைகளைக் காட்டுகின்றன, அல்லது எடுத்துக்காட்டாக" ஒரு ஃபூமடிக் ஃச் 900 அச்சுப்பொறியில் நிச-உலக பொருள் ஃச் இன் அச்சு நேரம் 4 மணி முதல் 3.5 மணி நேரம் வரை சென்றது ". இந்த வகையின் சோதனை குறிப்பிடத்தக்க நேரத்தையும் முயற்சியையும் எடுக்கக்கூடும் என்பது புரிந்து கொள்ளப்படுகிறது. கிளிப்பரின் மிகவும் குறிப்பிடத்தக்க நற்பொருத்தங்கள் சில மாச்டர் கிளையில் ஒன்றிணைவதற்கு முன்னர் பல மாதங்கள் விவாதம், மறுவேலை, சோதனை மற்றும் ஆவணங்களை எடுத்தன.

source: When fixing a defect in the code, submitters should have a general understanding of the root cause of that defect, and the fix should target that root cause.
ru: Исправляя дефект в коде, отправители должны иметь общее представление о первопричине этого дефекта, и исправление должно быть направлено на эту первопричину.
ta: குறியீட்டில் ஒரு குறைபாட்டை சரிசெய்யும்போது, சமர்ப்பிப்பாளர்களுக்கு அந்த குறைபாட்டின் மூல காரணத்தைப் பற்றிய பொதுவான புரிதல் இருக்க வேண்டும், மேலும் பிழைத்திருத்தம் அந்த மூல காரணத்தை குறிவைக்க வேண்டும்.

source: James Hartley
ru: Джеймс Хартли
ta: சேம்ச் ஆர்ட்லி

source: Configuration files
ru: Конфигурационные файлы
ta: உள்ளமைவு கோப்புகள்

source: GitHub Id
ta: அறிவிலிமையம் ஐடி

source: @JamesH1978
ta: @சாமிச் 1978
