Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Example_Configs.po
Languages: ta

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
ta: இந்த ஆவணத்தில் கிளிப்பர் அறிவிலிமையம் களஞ்சியத்திற்கு ஒரு எடுத்துக்காட்டு கிளிப்பர் உள்ளமைவை வழங்குவதற்கான வழிகாட்டுதல்கள் உள்ளன ([கட்டமைப்பு அடைவு] (../ கட்டமைப்பு/) இல் அமைந்துள்ளது).

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
ta: [கிளிப்பர் சமூக சொற்பொழிவு சேவையகம்] (https://community.klipper3d.org) கட்டமைப்பு கோப்புகளைக் கண்டறிந்து பகிர்வதற்கான பயனுள்ள ஆதாரமாகும் என்பதை நினைவில் கொள்க.

source: Guidelines
ta: வழிகாட்டுதல்கள்

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
ta: `பொதுவான` முன்னொட்டு 3D அச்சுப்பொறி பலகைக்கு பயன்படுத்தப்படுகிறது, இது பல வகையான அச்சுப்பொறிகளில் பயன்படுத்தப்படலாம்.

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
ta: `கிட்` முன்னொட்டு பரவலாகப் பயன்படுத்தப்படும் விவரக்குறிப்பின் படி கூடிய 3 டி அச்சுப்பொறிகளுக்கானது. இந்த "அறிவிலி" அச்சுப்பொறிகள் பொதுவாக சாதாரண "அச்சுப்பொறிகளிலிருந்து" வேறுபடுகின்றன, அவை உற்பத்தியாளரால் விற்கப்படவில்லை.

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
ta: `மாதிரி` முன்னொட்டு உள்ளமைவு" துணுக்குகளுக்கு "பயன்படுத்தப்படுகிறது, இது ஒரு முக்கிய கட்டமைப்பு கோப்பில் நகலெடுத்து ஒட்டலாம்.

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
ta: அச்சுப்பொறி இயக்கவியலை விவரிக்க `எடுத்துக்காட்டு` முன்னொட்டு பயன்படுத்தப்படுகிறது. இந்த வகை கட்டமைப்பு பொதுவாக ஒரு புதிய வகை அச்சுப்பொறி இயக்கவியலுக்கான குறியீட்டோடு மட்டுமே சேர்க்கப்படுகிறது.

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
ta: கிளிப்பர் `அச்சுப்பொறி`,` பொதுவான`, மற்றும் `கிட்` எடுத்துக்காட்டு கட்டமைப்பு கோப்பை பிழை இல்லாமல் தொடங்க முடியும். இந்த கட்டமைப்பு கோப்புகளை [சோதனை/கிளிப்பி/அச்சுப்பொறிகள்] (../ சோதனை/கிளிப்பி/அச்சுப்பொறிகள்) பின்னடைவு சோதனை வழக்கில் சேர்க்க வேண்டும். அந்த சோதனை வழக்கில் புதிய கட்டமைப்பு கோப்புகளை பொருத்தமான பிரிவில் மற்றும் அந்த பிரிவுக்குள் அகர வரிசைப்படி சேர்க்கவும்.

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
ta: எடுத்துக்காட்டு உள்ளமைவு அச்சுப்பொறியின் "பங்கு" உள்ளமைவுக்கு இருக்க வேண்டும். . செயலில் பயன்பாடு). மற்ற கட்டமைப்புகளுக்கு [கிளிப்பர் சமூக சொற்பொழிவு சேவையகம்] (https://community.klipper3d.org) ஐப் பயன்படுத்துங்கள்.

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
ta: கொடுக்கப்பட்ட அச்சுப்பொறி அல்லது பலகையில் இருக்கும் அந்த சாதனங்களை மட்டுமே குறிப்பிடவும். உங்கள் குறிப்பிட்ட அமைப்பிற்கு குறிப்பிட்ட அமைப்புகளைக் குறிப்பிட வேண்டாம். `பொதுவான` கட்டமைப்பு கோப்புகளுக்கு, மெயின்போர்டில் உள்ள அந்த சாதனங்கள் மட்டுமே விவரிக்கப்பட வேண்டும். எடுத்துக்காட்டாக, அந்த வகை காட்சியுடன் பலகை இணைக்கப்படுமா என்பதை அறிய வழி இல்லாததால், ஒரு காட்சி கட்டமைப்பு பகுதியை "பொதுவான" உள்ளமைவில் சேர்ப்பது அர்த்தமல்ல. விருப்பமான புறத்தை (எ.கா., ஒரு பிளிடச் போர்ட்) எளிதாக்க போர்டில் ஒரு குறிப்பிட்ட வன்பொருள் துறைமுகம் இருந்தால், கொடுக்கப்பட்ட சாதனத்திற்கு "கருத்து தெரிவிக்கப்பட்ட" கட்டமைப்பு பகுதியை ஒருவர் சேர்க்கலாம்.

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
ta: ஒரு எடுத்துக்காட்டு உள்ளமைவில் `Pression_advance` ஐக் குறிப்பிட வேண்டாம், ஏனெனில் அந்த மதிப்பு இழைக்கு குறிப்பிட்டது, அச்சுப்பொறி வன்பொருள் அல்ல. இதேபோல், `max_extrude_only_velocity` அல்லது` max_extrude_only_accel` அமைப்புகளைக் குறிப்பிட வேண்டாம்.

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
ta: புரவலன் பாதை அல்லது புரவலன் வன்பொருள் கொண்ட கட்டமைப்பு பகுதியைக் குறிப்பிட வேண்டாம். எடுத்துக்காட்டாக, `[மெய்நிகர்_ச்ட்கார்டு]` அல்லது `[வெப்பநிலை_ஓச்ட்]` கட்டமைப்பு பிரிவுகளைக் குறிப்பிட வேண்டாம்.

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
ta: கொடுக்கப்பட்ட அச்சுப்பொறிக்கு குறிப்பிட்ட செயல்பாட்டைப் பயன்படுத்தும் மேக்ரோக்களை மட்டுமே வரையறுக்கவும் அல்லது கொடுக்கப்பட்ட அச்சுப்பொறிக்கு கட்டமைக்கப்பட்ட ச்லைசர்களால் பொதுவாக வெளிப்படும் சி-குறியீடுகளை வரையறுக்கவும்.

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
ta: சாத்தியமான இடங்களில், அதே சொற்கள், சொற்றொடர், உள்தள்ளல் மற்றும் பிரிவு வரிசைப்படுத்துதல் ஆகியவை தற்போதுள்ள கட்டமைப்பு கோப்புகளைப் பயன்படுத்துவது நல்லது. ஒவ்வொரு கட்டமைப்பு கோப்பின் மேலேயும் பயனர் தேர்ந்தெடுக்க வேண்டிய மைக்ரோ-கன்ட்ரோலரின் வகையை பட்டியலிட வேண்டும். இது "டாக்ச்/config_reference.md" பற்றிய குறிப்பையும் கொண்டிருக்க வேண்டும்.

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
ta: புல ஆவணங்களை எடுத்துக்காட்டு கட்டமைப்பு கோப்புகளில் நகலெடுக்க வேண்டாம். (அவ்வாறு செய்வது ஆவணங்களுக்கான புதுப்பிப்பாக ஒரு பராமரிப்பு சுமையை உருவாக்குகிறது, பின்னர் அதை பல இடங்களில் மாற்ற வேண்டும்.)

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
ta: எடுத்துக்காட்டு கட்டமைப்பு கோப்புகளில் "save_config" பிரிவு இருக்கக்கூடாது. தேவைப்பட்டால், தொடர்புடைய புலங்களை SAVE_CONFIG பிரிவில் இருந்து முதன்மையான கட்டமைப்பு பகுதியில் பொருத்தமான பகுதிக்கு நகலெடுக்கவும்.

source: Use `field: value` syntax instead of `field=value`.
ta: `புலம் = மதிப்பு` க்கு பதிலாக` புலம்: மதிப்பு` தொடரியல் பயன்படுத்தவும்.

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
ta: புலம் மதிப்புகளை அவற்றின் இயல்புநிலை மதிப்புக்கு வரையறுப்பதைத் தவிர்க்கவும். எடுத்துக்காட்டாக, `Min_extrude_temp: 170` ஐக் குறிப்பிடக்கூடாது, ஏனெனில் அது ஏற்கனவே இயல்புநிலை மதிப்பு.

source: Where possible, lines should not exceed 80 columns.
ta: சாத்தியமான இடங்களில், கோடுகள் 80 நெடுவரிசைகளை தாண்டக்கூடாது.

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
ta: கட்டமைப்பு கோப்புகளில் பண்புக்கூறு அல்லது திருத்த செய்திகளைச் சேர்ப்பதைத் தவிர்க்கவும். .

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
ta: எடுத்துக்காட்டு கட்டமைப்பு கோப்பில் இயல்புநிலை பாதுகாப்பு அமைப்பை முடக்க வேண்டாம். எடுத்துக்காட்டாக, ஒரு கட்டமைப்பு ஒரு தனிப்பயன் `max_extrude_cross_section` ஐக் குறிப்பிடக்கூடாது. பிழைத்திருத்த அம்சங்களை இயக்க வேண்டாம். எடுத்துக்காட்டாக `ஃபோர்ச்_மோவ்` கட்டமைப்பு பிரிவு இருக்கக்கூடாது.

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
ta: கிதப் "புல் கோரிக்கை" உருவாக்குவதன் மூலம் எடுத்துக்காட்டு கட்டமைப்பு கோப்புகள் சமர்ப்பிக்கப்படுகின்றன. தயவுசெய்து [பங்களிப்பு ஆவணம்] (பங்களிப்பு. எம்.டி) இல் உள்ள திசைகளையும் பின்பற்றவும்.

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
ta: ஒரு முதன்மையான உற்பத்தியாளரால் விற்கப்படும் பங்கு அச்சுப்பொறிகளுக்கு `அச்சுப்பொறி` முன்னொட்டு பயன்படுத்தப்படுகிறது.

source: Example configurations
ta: எடுத்துக்காட்டு உள்ளமைவுகள்

source: Select the appropriate config filename prefix:
ta: பொருத்தமான கட்டமைப்பு கோப்பு பெயர் முன்னொட்டைத் தேர்ந்தெடுக்கவும்:

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
ta: அனைத்து உள்ளமைவு கோப்புகளும் `.cfg` பின்னொட்டில் முடிவடைய வேண்டும். `அச்சுப்பொறி` கட்டமைப்பு கோப்புகள் ஒரு வருடத்தில் முடிவடைய வேண்டும், அதைத் தொடர்ந்து` .cfg` (எ.கா., `-2019.cfg`). இந்த வழக்கில், கொடுக்கப்பட்ட அச்சுப்பொறி விற்கப்பட்ட தோராயமான ஆண்டு ஆண்டு.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
ta: கட்டமைப்பு கோப்பு பெயரில் இடங்கள் அல்லது சிறப்பு எழுத்துக்களைப் பயன்படுத்த வேண்டாம். கோப்பு பெயரில் `a-z`,` a-z`, `0-9`,` --`, மற்றும் `.` என்ற எழுத்துக்கள் மட்டுமே இருக்க வேண்டும்.

source: Do not use any deprecated features in the example config file.
ta: எடுத்துக்காட்டு கட்டமைப்பு கோப்பில் எந்தவொரு நீக்கப்பட்ட அம்சங்களையும் பயன்படுத்த வேண்டாம்.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
ta: ஒரு எக்ச்ட்ரூடர் `சுழற்சி_டிச்டன்ச்` சேர்க்கும்போது, எக்ச்ட்ரூடருக்கு ஒரு கியரிங் பொறிமுறையைக் கொண்டிருந்தால்` கியர்_ராட்டியோ` ஐக் குறிப்பிடுவது விரும்பத்தக்கது. எடுத்துக்காட்டு உள்ளமைவுகளில் உள்ள சுழற்சி_டி, எக்ச்ட்ரூடரில் உள்ள ஆர்டட் கியரின் சுற்றளவுடன் தொடர்புபடுத்த வேண்டும் என்று நாங்கள் எதிர்பார்க்கிறோம் - இது பொதுவாக 20 முதல் 35 மிமீ வரம்பில் இருக்கும். ஒரு `கியர்_ராட்டியோ` ஐக் குறிப்பிடும்போது, பொறிமுறையின் உண்மையான கியர்களைக் குறிப்பிடுவது விரும்பத்தக்கது (எ.கா. மேலும் தகவலுக்கு [சுழற்சி தூர ஆவணம்] (சுழற்சி_டிச்டன்ச்.எம்டி#-a-gear_ratio ஐப் பயன்படுத்துதல்) காண்க.

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
ta: கிளிப்பர் ஆதரிக்கும் அனைத்து அறியப்பட்ட பலகைகளும் 250000 இன் இயல்புநிலை சீரியல் பாட் வீதத்தைப் பயன்படுத்தலாம். ஒரு எடுத்துக்காட்டு கட்டமைப்பு கோப்பில் வேறு பாட் வீதத்தை பரிந்துரைக்க வேண்டாம்.
