Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Exclude_Object.po
Languages: ta

source: Exclude Objects
ta: பொருட்களை விலக்கு

source: The `[exclude_object]` module allows Klipper to exclude objects while a print is in progress. To enable this feature include an [exclude_object config section](Config_Reference.md#exclude_object) (also see the [command reference](G-Codes.md#exclude-object) and [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.)
ta: ஒரு அச்சு நடந்து கொண்டிருக்கும்போது `[விலக்கு_ஆப்செக்ட்]` தொகுதி கிளிப்பரை பொருட்களை விலக்க அனுமதிக்கிறது. இந்த அம்சத்தை இயக்க ஒரு [விலக்கு_ஆப்செக்ட் கட்டமைப்பு பிரிவு] (config_reference.md#excoude_object) அடங்கும் ([கட்டளை குறிப்பு] (g-codes.md#விலக்கு-பொருள்) மற்றும் [மாதிரி-macros.cfg] (../ கட்டமைப்பு ஐப் பார்க்கவும் /sample-macros.cfg) ஒரு மார்லின்/reprapfirmware இணக்கமான M486 G-Code மேக்ரோவுக்கான கோப்பு.)

source: Unlike other 3D printer firmware options, a printer running Klipper utilizes a suite of components and users have many options to choose from. Therefore, in order to provide a a consistent user experience, the `[exclude_object]` module will establish a contract or API of sorts. The contract covers the contents of the gcode file, how the internal state of the module is controlled, and how that state is provided to clients.
ta: மற்ற 3D அச்சுப்பொறி ஃபார்ம்வேர் விருப்பங்களைப் போலன்றி, கிளிப்பர் இயங்கும் அச்சுப்பொறி கூறுகளின் தொகுப்பைப் பயன்படுத்துகிறது மற்றும் பயனர்களுக்கு தேர்வு செய்ய பல விருப்பங்கள் உள்ளன. ஆகையால், ஒரு நிலையான பயனர் அனுபவத்தை வழங்குவதற்காக, `[விலக்கு_ஆப்செக்ட்]` தொகுதி ஒரு ஒப்பந்தம் அல்லது பநிஇ ஆகியவற்றை நிறுவும். ஒப்பந்தம் GCODE கோப்பின் உள்ளடக்கங்கள், தொகுதியின் உள் நிலை எவ்வாறு கட்டுப்படுத்தப்படுகிறது, வாடிக்கையாளர்களுக்கு அந்த நிலை எவ்வாறு வழங்கப்படுகிறது என்பதை உள்ளடக்கியது.

source: Workflow Overview
ta: பணிப்பாய்வு கண்ணோட்டம்

source: A typical workflow for printing a file might look like this:
ta: ஒரு கோப்பை அச்சிடுவதற்கான ஒரு பொதுவான பணிப்பாய்வு இப்படி தோன்றலாம்:

source: Slicing is completed and the file is uploaded for printing. During the upload, the file is processed and `[exclude_object]` markers are added to the file. Alternately, slicers may be configured to prepare object exclusion markers natively, or in it's own pre-processing step.
ta: வெட்டுதல் முடிந்தது மற்றும் கோப்பு அச்சிட பதிவேற்றப்படுகிறது. பதிவேற்றத்தின் போது, கோப்பு செயலாக்கப்படுகிறது மற்றும் `[விலக்கு_ஆப்செக்ட்]` குறிப்பான்கள் கோப்பில் சேர்க்கப்படுகின்றன. மாற்றாக, பொருள் விலக்கு குறிப்பான்களை சொந்தமாக தயாரிக்க, அல்லது அதன் சொந்த முன் செயலாக்க கட்டத்தில் ச்லைசர்கள் கட்டமைக்கப்படலாம்.

source: When printing starts, Klipper will reset the `[exclude_object]` [status](Status_Reference.md#exclude_object).
ta: அச்சிடுதல் தொடங்கும் போது, கிளிப்பர் `[விலக்கு_ஆப்செக்ட்]` [நிலை] (status_reference.md#excoude_object) ஐ மீட்டமைக்கும்.

source: When Klipper processes the `EXCLUDE_OBJECT_DEFINE` block, it will update the status with the known objects and pass it on to clients.
ta: கிளிப்பர் `விலக்கு_ஆப்செக்ட்_பீஃபைன்` தொகுதியை செயலாக்கும்போது, அது அறியப்பட்ட பொருள்களுடன் அந்தச்தைப் புதுப்பித்து வாடிக்கையாளர்களுக்கு அனுப்பும்.

source: The client may use that information to present a UI to the user so that progress can be tracked. Klipper will update the status to include the currently printing object which the client can use for display purposes.
ta: கிளையன்ட் அந்த தகவலைப் பயன்படுத்தி பயனருக்கு இடைமுகம் ஐ வழங்கலாம், இதனால் முன்னேற்றத்தைக் கண்காணிக்க முடியும். காட்சி நோக்கங்களுக்காக கிளையன்ட் பயன்படுத்தக்கூடிய தற்போது அச்சிடும் பொருளை சேர்க்க கிளிப்பர் நிலையை புதுப்பிக்கும்.

source: If the user requests that an object be cancelled, the client will issue an `EXCLUDE_OBJECT NAME=<name>` command to Klipper.
ta: ஒரு பொருள் ரத்து செய்யப்பட வேண்டும் என்று பயனர் கோரியால், கிளையன்ட் `விலக்கு_ஆப்செக்ட் பெயர் = <பெயர்>` கட்டளை கிளிப்பருக்கு வழங்குவார்.

source: When Klipper process the command, it will add the object to the list of excluded objects and update the status for the client.
ta: கிளிப்பர் கட்டளையை செயலாக்கும்போது, அது விலக்கப்பட்ட பொருள்களின் பட்டியலில் பொருளைச் சேர்த்து வாடிக்கையாளருக்கான நிலையைப் புதுப்பிக்கும்.

source: The client will receive the updated status from Klipper and can use that information to reflect the object's status in the UI.
ta: கிளையன்ட் புதுப்பிக்கப்பட்ட நிலையை கிளிப்பரிடமிருந்து பெறுவார், மேலும் இடைமுகம் இல் உள்ள பொருளின் நிலையை பிரதிபலிக்க அந்த தகவலைப் பயன்படுத்தலாம்.

source: When printing finishes, the `[exclude_object]` status will continue to be available until another action resets it.
ta: அச்சிடுதல் முடிவடையும் போது, `[விலக்கு_ஆப்செக்ட்]` மற்றொரு செயல் மீட்டெடுக்கும் வரை நிலை தொடர்ந்து கிடைக்கும்.

source: The GCode File
ta: GCODE கோப்பு

source: The specialized gcode processing needed to support excluding objects does not fit into Klipper's core design goals. Therefore, this module requires that the file is processed before being sent to Klipper for printing. Using a post-process script in the slicer or having middleware process the file on upload are two possibilities for preparing the file for Klipper. A reference post-processing script is available both as an executable and a python library, see [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).
ta: பொருள்களைத் தவிர்ப்பதற்கு தேவையான சிறப்பு GCODE செயலாக்கம் கிளிப்பரின் முக்கிய வடிவமைப்பு இலக்குகளுக்கு பொருந்தாது. எனவே, இந்த தொகுதி அச்சிடுவதற்காக கிளிப்பருக்கு அனுப்பப்படுவதற்கு முன்பு கோப்பு செயலாக்கப்பட வேண்டும். ச்லைசரில் ஒரு பிந்தைய செயல்முறை ச்கிரிப்டைப் பயன்படுத்துதல் அல்லது மிடில்வேர் செயலாக்கத்தை பதிவேற்றலில் உள்ள கோப்பை கிளிப்பருக்கு கோப்பைத் தயாரிப்பதற்கான இரண்டு சாத்தியக்கூறுகள் உள்ளன. ஒரு குறிப்பு பிந்தைய செயலாக்க ச்கிரிப்ட் ஒரு இயங்கக்கூடிய மற்றும் பைதான் நூலகமாக கிடைக்கிறது, [cancelobject-preprocessor] (https://github.com/kageurufu/cancelobject-preprocesser) ஐப் பார்க்கவும்.

source: Object Definitions
ta: பொருள் வரையறைகள்

source: The `EXCLUDE_OBJECT_DEFINE` command is used to provide a summary of each object in the gcode file to be printed. Provides a summary of an object in the file. Objects don't need to be defined in order to be referenced by other commands. The primary purpose of this command is to provide information to the UI without needing to parse the entire gcode file.
ta: அச்சிடப்பட வேண்டிய GCODE கோப்பில் உள்ள ஒவ்வொரு பொருளின் சுருக்கத்தை வழங்க `விலக்கு_ஆப்செக்ட்_மின்` கட்டளை பயன்படுத்தப்படுகிறது. கோப்பில் ஒரு பொருளின் சுருக்கத்தை வழங்குகிறது. பிற கட்டளைகளால் குறிப்பிடப்படுவதற்கு பொருள்களை வரையறுக்க தேவையில்லை. இந்த கட்டளையின் முதன்மை நோக்கம் முழு GCODE கோப்பையும் அலசத் தேவையில்லாமல் இடைமுகம் க்கு தகவல்களை வழங்குவதாகும்.

source: Object definitions are named, to allow users to easily select an object to be excluded, and additional metadata may be provided to allow for graphical cancellation displays. Currently defined metadata includes a `CENTER` X,Y coordinate, and a `POLYGON` list of X,Y points representing a minimal outline of the object. This could be a simple bounding box, or a complicated hull for showing more detailed visualizations of the printed objects. Especially when gcode files include multiple parts with overlapping bounding regions, center points become hard to visually distinguish. `POLYGONS` must be a json-compatible array of point `[X,Y]` tuples without whitespace. Additional parameters will be saved as strings in the object definition and provided in status updates.
ta: பயனர்கள் விலக்கப்பட வேண்டிய ஒரு பொருளை எளிதாகத் தேர்ந்தெடுக்க அனுமதிக்க, பொருள் வரையறைகள் பெயரிடப்பட்டுள்ளன, மேலும் வரைகலை ரத்து காட்சிகளை அனுமதிக்க கூடுதல் மேனிலை தரவு வழங்கப்படலாம். தற்போது வரையறுக்கப்பட்ட மெட்டாடேட்டாவில் `சென்டர்` ஃச், ஒய் ஒருங்கிணைப்பு, மற்றும் ஃச் இன்` பலகோண 'பட்டியல் ஆகியவை அடங்கும், பொருளின் குறைந்தபட்ச வெளிப்புறத்தைக் குறிக்கும் ஒய் புள்ளிகள். இது ஒரு எளிய எல்லை பெட்டியாக இருக்கலாம் அல்லது அச்சிடப்பட்ட பொருட்களின் விரிவான காட்சிப்படுத்தல்களைக் காண்பிப்பதற்கான சிக்கலான அல். குறிப்பாக GCODE கோப்புகளில் ஒன்றுடன் ஒன்று எல்லைகள் கொண்ட பல பகுதிகள் இருக்கும்போது, மைய புள்ளிகள் பார்வைக்கு வேறுபடுவது கடினம். `பலகோணங்கள்` JSON- இணக்கமான புள்ளியாக இருக்க வேண்டும்` [x, y] `ஒயிட்ச்பேச் இல்லாமல் டூப்ச். கூடுதல் அளவுருக்கள் பொருள் வரையறையில் சரங்களாக சேமிக்கப்படும் மற்றும் நிலை புதுப்பிப்புகளில் வழங்கப்படும்.

source: `EXCLUDE_OBJECT_DEFINE NAME=calibration_pyramid CENTER=50,50 POLYGON=[[40,40],[50,60],[60,40]]`
ta: `விலக்கு_OBJECT_DEFINE பெயர் = அளவுத்திருத்தம்_பைராமிட் நடுவண் = 50,50 பலகோணம் = [[40,40], [50,60], [60,40]]`

source: All available G-Code commands are documented in the [G-Code Reference](./G-Codes.md#excludeobject)
ta: கிடைக்கக்கூடிய அனைத்து சி-குறியீட்டு கட்டளைகளும் [சி-குறியீட்டு குறிப்பு] (./ சி-கோட்ச்.மிடி#விலக்கு ஆப்செக்ட்) இல் ஆவணப்படுத்தப்பட்டுள்ளன

source: Status Information
ta: நிலை செய்தி

source: The state of this module is provided to clients by the [exclude_object status](Status_Reference.md#exclude_object).
ta: இந்த தொகுதியின் நிலை வாடிக்கையாளர்களுக்கு [excalude_object status] (status_reference.md#excalude_object) மூலம் வழங்கப்படுகிறது.

source: The status is reset when:
ta: எப்போது நிலை மீட்டமைக்கப்படுகிறது:

source: The Klipper firmware is restarted.
ta: கிளிப்பர் ஃபார்ம்வேர் மறுதொடக்கம் செய்யப்படுகிறது.

source: There is a reset of the `[virtual_sdcard]`. Notably, this is reset by Klipper at the start of a print.
ta: `[மெய்நிகர்_ச்ட்கார்டு]` இன் மீட்டமைப்பு உள்ளது. குறிப்பிடத்தக்க வகையில், இது ஒரு அச்சின் தொடக்கத்தில் கிளிப்பரால் மீட்டமைக்கப்படுகிறது.

source: When an `EXCLUDE_OBJECT_DEFINE RESET=1` command is issued.
ta: ஒரு `விலக்கு_ஆப்செக்ட்_மின் மீட்டமைப்பை = 1` கட்டளை வழங்கப்படும் போது.

source: The list of defined objects is represented in the `exclude_object.objects` status field. In a well defined gcode file, this will be done with `EXCLUDE_OBJECT_DEFINE` commands at the beginning of the file. This will provide clients with object names and coordinates so the UI can provide a graphical representation of the objects if desired.
ta: வரையறுக்கப்பட்ட பொருட்களின் பட்டியல் `விலக்கு_ஆப்செக்ட்.ஆப்செக்ட்ச்` நிலை புலத்தில் குறிப்பிடப்படுகிறது. நன்கு வரையறுக்கப்பட்ட GCODE கோப்பில், இது கோப்பின் தொடக்கத்தில் `excalude_object_define` கட்டளைகளுடன் செய்யப்படும். இது வாடிக்கையாளர்களுக்கு பொருள் பெயர்கள் மற்றும் ஆயங்களை வழங்கும், எனவே இடைமுகம் விரும்பினால் பொருள்களின் வரைகலை பிரதிநிதித்துவத்தை வழங்க முடியும்.

source: As the print progresses, the `exclude_object.current_object` status field will be updated as Klipper processes `EXCLUDE_OBJECT_START` and `EXCLUDE_OBJECT_END` commands. The `current_object` field will be set even if the object has been excluded. Undefined objects marked with a `EXCLUDE_OBJECT_START` will be added to the known objects to assist in UI hinting, without any additional metadata.
ta: அச்சு முன்னேறும்போது, `விலக்கு_ஆப்செக்ட். பொருள் விலக்கப்பட்டிருந்தாலும் கூட `நடப்பு_ஆப்செக்ட்` புலம் அமைக்கப்படும். எந்தவொரு கூடுதல் மெட்டாடேட்டாவும் இல்லாமல், இடைமுகம் குறிப்புக்கு உதவ அறியப்பட்ட பொருள்களில் `விலக்கு_ஆப்செக்ட்_ச்டார்ட்` உடன் குறிக்கப்படாத பொருள்கள் சேர்க்கப்படும்.

source: As `EXCLUDE_OBJECT` commands are issued, the list of excluded objects is provided in the `exclude_object.excluded_objects` array. Since Klipper looks ahead to process upcoming gcode, there may be a delay between when the command is issued and when the status is updated.
ta: `விலக்கு_ஆப்செக்ட்` கட்டளைகள் வழங்கப்படுவதால், விலக்கப்பட்ட பொருட்களின் பட்டியல்` விலக்கு_ஆப்செக்ட். வரவிருக்கும் GCODE ஐ செயலாக்க கிளிப்பர் எதிர்நோக்குவதால், கட்டளை வழங்கப்படும் போது மற்றும் நிலை புதுப்பிக்கப்படும் போது இடையே நேரந்தவறுகை ஏற்படக்கூடும்.
