Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/G-Codes.po
Languages: uk

source: `PROBE_ACCURACY [PROBE_SPEED=<mm/s>] [SAMPLES=<count>] [SAMPLE_RETRACT_DIST=<mm>]`: Calculate the maximum, minimum, average, median, and standard deviation of multiple probe samples. By default, 10 SAMPLES are taken. Otherwise the optional parameters default to their equivalent setting in the probe config section.
uk: `PROBE_ACCURACY [PROBE_SPEED=<mm/s>] [SAMPLES=<count>] [SAMPLE_RETRACT_DIST=<mm>]`: обчисліть максимальне, мінімальне, середнє, медіане та стандартне відхилення кількох зразків зонда. За замовчуванням береться 10 ЗРАЗКІВ. В іншому випадку додаткові параметри за умовчанням мають еквівалентні налаштування в розділі конфігурації зонда.

source: `PROBE_CALIBRATE [SPEED=<speed>] [<probe_parameter>=<value>]`: Run a helper script useful for calibrating the probe's z_offset. See the PROBE command for details on the optional probe parameters. See the MANUAL_PROBE command for details on the SPEED parameter and the additional commands available while the tool is active. Please note, the PROBE_CALIBRATE command uses the speed variable to move in XY direction as well as Z.
uk: `PROBE_CALIBRATE [SPEED=<швидкість>] [<probe_parameter>=<значення>]`: запустіть допоміжний сценарій, корисний для калібрування z_offset зонда. Дивіться команду PROBE, щоб дізнатися про додаткові параметри зонду. Перегляньте команду MANUAL_PROBE, щоб дізнатися більше про параметр SPEED і додаткові команди, доступні, коли інструмент активний. Зауважте, що команда PROBE_CALIBRATE використовує змінну швидкості для переміщення в напрямку XY, а також у напрямку Z.

source: `BLTOUCH_STORE MODE=<output_mode>`: This stores an output mode in the EEPROM of a BLTouch V3.1 Available output_modes are: `5V`, `OD`
uk: `BLTOUCH_STORE MODE=<output_mode>`: зберігає режим виведення в EEPROM BLTouch V3.1. Доступні режими виводу: `5V`, `OD`

source: `DELTA_ANALYZE`: This command is used during enhanced delta calibration. See [Delta Calibrate](Delta_Calibrate.md) for details.
uk: `DELTA_ANALYZE`: Ця команда використовується під час розширеного дельта-калібрування. Докладніше див. у [Delta Calibrate](Delta_Calibrate.md).

source: `BED_MESH_MAP`: Like to BED_MESH_OUTPUT, this command prints the current state of the mesh to the terminal. Instead of printing the values in a human readable format, the state is serialized in json format. This allows octoprint plugins to easily capture the data and generate height maps approximating the bed's surface.
uk: `BED_MESH_MAP`: як і BED_MESH_OUTPUT, ця команда друкує поточний стан сітки на терміналі. Замість друку значень у форматі, зрозумілому людині, стан серіалізується у форматі json. Це дозволяє плагінам octoprint легко збирати дані та генерувати карти висот, які приблизно відповідають поверхні ліжка.

source: `BED_MESH_CLEAR`: This command clears the mesh and removes all z adjustment. It is recommended to put this in your end-gcode.
uk: `BED_MESH_CLEAR`: ця команда очищає сітку та видаляє всі налаштування z. Рекомендовано розмістити це у вашому кінцевому gcode.

source: `BED_SCREWS_ADJUST`: This command will invoke the bed screws adjustment tool. It will command the nozzle to different locations (as defined in the config file) and allow one to make adjustments to the bed screws so that the bed is a constant distance from the nozzle.
uk: `BED_SCREWS_ADJUST`: Ця команда викличе інструмент регулювання кріпильних гвинтів. Він керуватиме насадкою в різних місцях (як визначено у конфігураційному файлі) і дозволить регулювати гвинти станини так, щоб станина була на постійній відстані від сопла.

source: `ENDSTOP_PHASE_CALIBRATE [STEPPER=<config_name>]`: If no STEPPER parameter is provided then this command will reports statistics on endstop stepper phases during past homing operations. When a STEPPER parameter is provided it arranges for the given endstop phase setting to be written to the config file (in conjunction with the SAVE_CONFIG command).
uk: `ENDSTOP_PHASE_CALIBRATE [STEPPER=<config_name>]`: якщо параметр STEPPER не надано, ця команда звітуватиме про статистику крокових фаз кінцевої зупинки під час попередніх операцій наведення. Якщо надається параметр STEPPER, він організовує запис даного параметра фази кінцевої зупинки у файл конфігурації (у поєднанні з командою SAVE_CONFIG).

source: `FORCE_MOVE STEPPER=<config_name> DISTANCE=<value> VELOCITY=<value> [ACCEL=<value>]`: This command will forcibly move the given stepper the given distance (in mm) at the given constant velocity (in mm/s). If ACCEL is specified and is greater than zero, then the given acceleration (in mm/s^2) will be used; otherwise no acceleration is performed. No boundary checks are performed; no kinematic updates are made; other parallel steppers on an axis will not be moved. Use caution as an incorrect command could cause damage! Using this command will almost certainly place the low-level kinematics in an incorrect state; issue a G28 afterwards to reset the kinematics. This command is intended for low-level diagnostics and debugging.
uk: `FORCE_MOVE STEPPER=<назва_конфігурації> DISTANCE=<значення> VELOCITY=<значення> [ACCEL=<значення>]`: ця команда примусово перемістить заданий крок на задану відстань (у мм) із заданою постійною швидкістю (у мм/ s). Якщо вказано значення ACCEL і воно більше нуля, буде використано задане прискорення (у мм/с^2); інакше прискорення не виконується. Граничні перевірки не проводяться; кінематичні оновлення не виконуються; інші паралельні степери на осі не будуть переміщатися. Будьте обережні, оскільки неправильна команда може призвести до пошкодження! Використання цієї команди майже напевно переведе кінематику низького рівня в неправильний стан. потім видайте G28, щоб скинути кінематику. Ця команда призначена для низькорівневої діагностики та налагодження.

source: `SET_KINEMATIC_POSITION [X=<value>] [Y=<value>] [Z=<value>]`: Force the low-level kinematic code to believe the toolhead is at the given cartesian position. This is a diagnostic and debugging command; use SET_GCODE_OFFSET and/or G92 for regular axis transformations. If an axis is not specified then it will default to the position that the head was last commanded to. Setting an incorrect or invalid position may lead to internal software errors. This command may invalidate future boundary checks; issue a G28 afterwards to reset the kinematics.
uk: `SET_KINEMATIC_POSITION [X=<значення>] [Y=<значення>] [Z=<значення>]`: змушує кінематичний код низького рівня вважати, що головка інструменту знаходиться в заданому декартовому положенні. Це команда діагностики та налагодження; використовуйте SET_GCODE_OFFSET та/або G92 для регулярних трансформацій осі. Якщо вісь не вказано, то за замовчуванням вона буде в положенні, яке останнє було надано головці. Встановлення неправильного або недійсного положення може призвести до внутрішніх помилок програмного забезпечення. Ця команда може зробити недійсними майбутні перевірки меж; потім видайте G28, щоб скинути кінематику.

source: `SDCARD_LOOP_END`: End a looped section in the SD print.
uk: `SDCARD_LOOP_END`: завершує зациклену секцію на SD-друкі.

source: `SDCARD_LOOP_DESIST`: Complete existing loops without further iterations.
uk: `SDCARD_LOOP_DESIST`: завершити існуючі цикли без подальших ітерацій.

source: `M118 <message>`: echo the message prepended with the configured default prefix (or `echo: ` if no prefix is configured).
uk: `M118 <message>`: повторити повідомлення, перед яким налаштований префікс за умовчанням (або `echo:`, якщо префікс не налаштовано).

source: `RESPOND MSG="<message>"`: echo the message prepended with the configured default prefix (or `echo: ` if no prefix is configured).
uk: `RESPOND MSG="<message>"`: повторити повідомлення, перед яким налаштовано налаштований префікс за замовчуванням (або `echo:`, якщо префікс не налаштовано).

source: `RESPOND TYPE=echo MSG="<message>"`: echo the message prepended with `echo: `.
uk: `RESPOND TYPE=echo MSG="<message>"`: повторити повідомлення, перед яким стоїть `echo:`.

source: `RESPOND TYPE=error MSG="<message>"`: echo the message prepended with `!! `.
uk: `RESPOND TYPE=error MSG="<message>"`: повторити повідомлення, перед яким стоїть `!! `.

source: `RESPOND PREFIX=<prefix> MSG="<message>"`: echo the message prepended with `<prefix>`. (The `PREFIX` parameter will take priority over the `TYPE` parameter)
uk: `RESPOND PREFIX=<prefix> MSG="<message>"`: повторити повідомлення, перед яким стоїть `<префікс>`. (Параметр `PREFIX` матиме пріоритет над параметром `TYPE`)

source: The following commands are available when the [pause_resume config section](Config_Reference.md#pause_resume) is enabled:
uk: Наступні команди доступні, коли ввімкнено [розділ конфігурації pause_resume](Config_Reference.md#pause_resume):

source: `PAUSE`: Pauses the current print. The current position is captured for restoration upon resume.
uk: `PAUSE`: призупиняє поточний друк. Поточна позиція фіксується для відновлення після відновлення.

source: `RESUME [VELOCITY=<value>]`: Resumes the print from a pause, first restoring the previously captured position. The VELOCITY parameter determines the speed at which the tool should return to the original captured position.
uk: `RESUME [VELOCITY=<value>]`: відновлює друк із паузи, спочатку відновлюючи попередньо записану позицію. Параметр VELOCITY визначає швидкість, з якою інструмент має повернутися до початкового захопленого положення.

source: `CLEAR_PAUSE`: Clears the current paused state without resuming the print. This is useful if one decides to cancel a print after a PAUSE. It is recommended to add this to your start gcode to make sure the paused state is fresh for each print.
uk: `CLEAR_PAUSE`: Очищає поточний призупинений стан без відновлення друку. Це корисно, якщо ви вирішите скасувати друк після ПАУЗИ. Рекомендовано додати це до вашого стартового gcode, щоб переконатися, що стан паузи є свіжим для кожного друку.

source: `CANCEL_PRINT`: Cancels the current print.
uk: `CANCEL_PRINT`: скасовує поточний друк.

source: `SET_FILAMENT_SENSOR SENSOR=<sensor_name> ENABLE=[0|1]`: Sets the filament sensor on/off. If ENABLE is set to 0, the filament sensor will be disabled, if set to 1 it is enabled.
uk: `SET_FILAMENT_SENSOR SENSOR=<назва_сенсора> ENABLE=[0|1]`: вмикає/вимикає датчик нитки. Якщо ENABLE встановлено на 0, датчик нитки буде вимкнено, якщо встановлено на 1, він увімкнено.

source: `SET_RETRACTION [RETRACT_LENGTH=<mm>] [RETRACT_SPEED=<mm/s>] [UNRETRACT_EXTRA_LENGTH=<mm>] [UNRETRACT_SPEED=<mm/s>]`: Adjust the parameters used by firmware retraction. RETRACT_LENGTH determines the length of filament to retract and unretract. The speed of retraction is adjusted via RETRACT_SPEED, and is typically set relatively high. The speed of unretraction is adjusted via UNRETRACT_SPEED, and is not particularly critical, although often lower than RETRACT_SPEED. In some cases it is useful to add a small amount of additional length on unretraction, and this is set via UNRETRACT_EXTRA_LENGTH. SET_RETRACTION is commonly set as part of slicer per-filament configuration, as different filaments require different parameter settings.
uk: `SET_RETRACTION [RETRACT_LENGTH=<мм>] [RETRACT_SPEED=<мм/с>] [UNRETRACT_EXTRA_LENGTH=<мм>] [UNRETRACT_SPEED=<мм/с>]`: налаштуйте параметри, які використовуються для ретракції мікропрограми. RETRACT_LENGTH визначає довжину нитки для втягування та розтягування. Швидкість втягування регулюється за допомогою RETRACT_SPEED і зазвичай встановлюється відносно високою. Швидкість скасування ретракції регулюється за допомогою UNRETRACT_SPEED і не є критичною, хоча часто нижча, ніж RETRACT_SPEED. У деяких випадках корисно додати невелику додаткову довжину при скасуванні відкликання, і це встановлюється через UNRETRACT_EXTRA_LENGTH. SET_RETRACTION зазвичай встановлюється як частина конфігурації слайсера для кожної нитки, оскільки для різних ниток потрібні різні налаштування параметрів.

source: `GET_RETRACTION`: Queries the current parameters used by firmware retraction and displays them on the terminal.
uk: `GET_RETRACTION`: запитує поточні параметри, які використовуються відкликанням мікропрограми, і відображає їх на терміналі.

source: `G10`: Retracts the extruder using the currently configured parameters.
uk: `G10`: втягує екструдер із використанням поточних налаштованих параметрів.

source: `G11`: Unretracts the extruder using the currently configured parameters.
uk: `G11`: скасовує втягування екструдера за допомогою поточних налаштованих параметрів.

source: `SET_SKEW [XY=<ac_length,bd_length,ad_length>] [XZ=<ac,bd,ad>] [YZ=<ac,bd,ad>] [CLEAR=<0|1>]`: Configures the [skew_correction] module with measurements (in mm) taken from a calibration print. One may enter measurements for any combination of planes, planes not entered will retain their current value. If `CLEAR=1` is entered then all skew correction will be disabled.
uk: `SET_SKEW [XY=<ac_length,bd_length,ad_length>] [XZ=<ac,bd,ad>] [YZ=<ac,bd,ad>] [CLEAR=<0|1>]`: налаштовує [перекос ] модуль із розмірами (у мм), взятими з калібрувального відбитка. Можна ввести вимірювання для будь-якої комбінації площин, невведені площини збережуть своє поточне значення. Якщо введено `CLEAR=1`, усі виправлення перекосів буде вимкнено.

source: `GET_CURRENT_SKEW`: Reports the current printer skew for each plane in both radians and degrees. The skew is calculated based on parameters provided via the `SET_SKEW` gcode.
uk: `GET_CURRENT_SKEW`: повідомляє про поточний перекіс принтера для кожної площини в радіанах і градусах. Перекіс обчислюється на основі параметрів, наданих через gcode `SET_SKEW`.

source: `UPDATE_DELAYED_GCODE [ID=<name>] [DURATION=<seconds>]`: Updates the delay duration for the identified [delayed_gcode] and starts the timer for gcode execution. A value of 0 will cancel a pending delayed gcode from executing.
uk: `UPDATE_DELAYED_GCODE [ID=<name>] [DURATION=<seconds>]`: оновлює тривалість затримки для визначеного [delayed_gcode] і запускає таймер для виконання gcode. Значення 0 скасує виконання відкладеного gcode, що очікує на виконання.

source: `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>`: Saves the variable to disk so that it can be used across restarts. All stored variables are loaded into the `printer.save_variables.variables` dict at startup and can be used in gcode macros. The provided VALUE is parsed as a Python literal.
uk: `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>`: зберігає змінну на диск, щоб її можна було використовувати під час перезапусків. Усі збережені змінні завантажуються в dict `printer.save_variables.variables` під час запуску та можуть використовуватися в макросах gcode. Надане VALUE аналізується як літерал Python.

source: `SET_INPUT_SHAPER [SHAPER_FREQ_X=<shaper_freq_x>] [SHAPER_FREQ_Y=<shaper_freq_y>] [DAMPING_RATIO_X=<damping_ratio_x>] [DAMPING_RATIO_Y=<damping_ratio_y>] [SHAPER_TYPE=<shaper>] [SHAPER_TYPE_X=<shaper_type_x>] [SHAPER_TYPE_Y=<shaper_type_y>]`: Modify input shaper parameters. Note that SHAPER_TYPE parameter resets input shaper for both X and Y axes even if different shaper types have been configured in [input_shaper] section. SHAPER_TYPE cannot be used together with either of SHAPER_TYPE_X and SHAPER_TYPE_Y parameters. See [config reference](Config_Reference.md#input_shaper) for more details on each of these parameters.
uk: `SET_INPUT_SHAPER [SHAPER_FREQ_X=<shaper_freq_x>] [SHAPER_FREQ_Y=<shaper_freq_y>] [DAMPING_RATIO_X=<damping_ratio_x>] [DAMPING_RATIO_Y=<shaper_ratio_y>] [SHAPER_TYPE_X=<shaper_type_x>] [ SHAPER_TYPE_Y=<shaper_type_y> ]`: змінити параметри формувача вхідних даних. Зауважте, що параметр SHAPER_TYPE скидає вхідний формувач для обох осей X і Y, навіть якщо в розділі [input_shaper] налаштовано різні типи формувача. SHAPER_TYPE не можна використовувати разом із параметрами SHAPER_TYPE_X і SHAPER_TYPE_Y. Перегляньте [довідку конфігурації](Config_Reference.md#input_shaper), щоб отримати додаткові відомості про кожен із цих параметрів.

source: `MEASURE_AXES_NOISE`: Measures and outputs the noise for all axes of all enabled accelerometer chips.
uk: `MEASURE_AXES_NOISE`: Вимірює та виводить шум для всіх осей усіх увімкнених мікросхем акселерометра.

source: `PALETTE_CONNECT`: This command initializes the connection with the Palette 2.
uk: `PALETTE_CONNECT`: ця команда ініціалізує з’єднання з палітрою 2.

source: `PALETTE_DISCONNECT`: This command disconnects from the Palette 2.
uk: `PALETTE_DISCONNECT`: ця команда від’єднується від палітри 2.

source: `PALETTE_CLEAR`: This command instructs the Palette 2 to clear all of the input and output paths of filament.
uk: `PALETTE_CLEAR`: Ця команда наказує Palette 2 очистити всі вхідні та вихідні шляхи нитки.

source: `PALETTE_CUT`: This command instructs the Palette 2 to cut the filament currently loaded in the splice core.
uk: `PALETTE_CUT`: ця команда дає вказівку Palette 2 розрізати нитку, яка наразі завантажена в осердя з’єднання.

source: `PALETTE_SMART_LOAD`: This command start the smart load sequence on the Palette 2. Filament is loaded automatically by extruding it the distance calibrated on the device for the printer, and instructs the Palette 2 once the loading has been completed. This command is the same as pressing **Smart Load** directly on the Palette 2 screen after the filament load is complete.
uk: `PALETTE_SMART_LOAD`: ця команда запускає інтелектуальну послідовність завантаження палітри 2. Нитка завантажується автоматично, видавлюючи її на відстань, відкалібровану на пристрої для принтера, і дає вказівки палітрі 2 після завершення завантаження. Ця команда схожа на натискання **Smart Load** безпосередньо на екрані Palette 2 після завершення завантаження нитки.

source: Palette prints work by embedding special OCodes (Omega Codes) in the GCode file:
uk: Друк палітри працює шляхом вбудовування спеціальних OCodes (Omega Codes) у файл GCode:

source: `O1`...`O32`: These codes are read from the GCode stream and processed by this module and passed to the Palette 2 device.
uk: `O1`...`O32`: ці коди зчитуються з потоку GCode, обробляються цим модулем і передаються на пристрій Palette 2.

source: G-Codes
uk: G-коди

source: `Z_OFFSET_APPLY_ENDSTOP`: Take the current Z Gcode offset (aka, babystepping), and subtract it from the stepper_z endstop_position. This acts to take a frequently used babystepping value, and "make it permanent". Requires a `SAVE_CONFIG` to take effect.
uk: `Z_OFFSET_APPLY_ENDSTOP`: взяти поточне зміщення G-коду Z (він же babystepping) і відняти його від stepper_z endstop_position. Це діє, щоб прийняти часто використовуване значення babystepping і "зробити його постійним". Потрібен `SAVE_CONFIG`, щоб вступити в силу.

source: `Z_OFFSET_APPLY_PROBE`: Take the current Z Gcode offset (aka, babystepping), and subtract if from the probe's z_offset. This acts to take a frequently used babystepping value, and "make it permanent". Requires a `SAVE_CONFIG` to take effect.
uk: `Z_OFFSET_APPLY_PROBE`: Візьміть поточне зміщення Z Gcode (він же babystepping) і відніміть його від z_offset зонда. Це діє, щоб прийняти часто використовуване значення babystepping і "зробити його постійним". Потрібен `SAVE_CONFIG`, щоб вступити в силу.

source: `TUNING_TOWER COMMAND=<command> PARAMETER=<name> START=<value> [SKIP=<value>] [FACTOR=<value> [BAND=<value>]] | [STEP_DELTA=<value> STEP_HEIGHT=<value>]`: A tool for tuning a parameter on each Z height during a print. The tool will run the given `COMMAND` with the given `PARAMETER` assigned to a value that varies with `Z` according to a formula. Use `FACTOR` if you will use a ruler or calipers to measure the Z height of the optimum value, or `STEP_DELTA` and `STEP_HEIGHT` if the tuning tower model has bands of discrete values as is common with temperature towers. If `SKIP=<value>` is specified, the tuning process doesn't begin until Z height `<value>` is reached, and below that the value will be set to `START`; in this case, the `z_height` used in the formulas below is actually `max(z - skip, 0)`. There are three possible combinations of options:
uk: `TUNING_TOWER COMMAND=<команда> PARAMETER=<ім'я> START=<значення> [SKIP=<значення>] [FACTOR=<значення> [BAND=<значення>]] | [STEP_DELTA=<значення> STEP_HEIGHT=<значення>]`: інструмент для налаштування параметра для кожної висоти Z під час друку. Інструмент виконає задану `КОМАНДУ` із заданим `ПАРАМЕТРОМ`, призначеним для значення, яке змінюється в залежності від `Z` відповідно до формули. Використовуйте `FACTOR`, якщо ви будете використовувати лінійку або штангенциркуль для вимірювання висоти Z оптимального значення, або `STEP_DELTA` і `STEP_HEIGHT`, якщо модель вежі налаштування має смуги дискретних значень, як це зазвичай буває для веж температур. Якщо вказано `SKIP=<value>`, процес налаштування не починається, доки не буде досягнуто Z висоти `<value>`, а нижче цього значення буде встановлено на `START`; у цьому випадку «z_height», що використовується у формулах нижче, насправді є «max(z - пропуск, 0)». Є три можливі комбінації варіантів:

source: `ACCELEROMETER_MEASURE [CHIP=<config_name>] [NAME=<value>]`: Starts accelerometer measurements at the requested number of samples per second. If CHIP is not specified it defaults to "adxl345". The command works in a start-stop mode: when executed for the first time, it starts the measurements, next execution stops them. The results of measurements are written to a file named `/tmp/adxl345-<chip>-<name>.csv` where `<chip>` is the name of the accelerometer chip (`my_chip_name` from `[adxl345 my_chip_name]`) and `<name>` is the optional NAME parameter. If NAME is not specified it defaults to the current time in "YYYYMMDD_HHMMSS" format. If the accelerometer does not have a name in its config section (simply `[adxl345]`) then `<chip>` part of the name is not generated.
uk: `ACCELEROMETER_MEASURE [CHIP=<config_name>] [NAME=<value>]`: починає вимірювання акселерометра із заданою кількістю вибірок за секунду. Якщо CHIP не вказано, за замовчуванням буде "adxl345". Команда працює в режимі старт-стоп: при першому виконанні запускає вимірювання, наступне виконання припиняє їх. Результати вимірювань записуються у файл з іменем `/tmp/adxl345-<chip>-<name>.csv`, де `<chip>` — це назва мікросхеми акселерометра (`my_chip_name` від `[adxl345 my_chip_name]` ), а `<name>` є необов'язковим параметром NAME. Якщо NAME не вказано, за замовчуванням використовується поточний час у форматі "YYYYMMDDHHMMSS." Якщо акселерометр не має назви в розділі конфігурації (просто `[adxl345]`), то частина назви `<chip>` не генерується.

source: `ACCELEROMETER_QUERY [CHIP=<config_name>] [RATE=<value>]`: queries accelerometer for the current value. If CHIP is not specified it defaults to "adxl345". If RATE is not specified, the default value is used. This command is useful to test the connection to the ADXL345 accelerometer: one of the returned values should be a free-fall acceleration (+/- some noise of the chip).
uk: `ACCELEROMETER_QUERY [CHIP=<config_name>] [RATE=<value>]`: запитує акселерометр для поточного значення. Якщо CHIP не вказано, за замовчуванням буде "adxl345". Якщо RATE не вказано, використовується значення за замовчуванням. Ця команда корисна для перевірки підключення до акселерометра ADXL345: одним із повернених значень має бути прискорення вільного падіння (+/- певний шум мікросхеми).
