Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/G-Codes.po
Languages: uk

source: `CALC_MEASURED_SKEW [AC=<ac_length>] [BD=<bd_length>] [AD=<ad_length>]`: Calculates and reports the skew (in radians and degrees) based on a measured print. This can be useful for determining the printer's current skew after correction has been applied. It may also be useful before correction is applied to determine if skew correction is necessary. See [Skew Correction](Skew_Correction.md) for details on skew calibration objects and measurements.
uk: `CALC_MEASURED_SKEW [AC=<ac_length>] [BD=<bd_length>] [AD=<ad_length>]`: обчислює та повідомляє перекіс (у радіанах і градусах) на основі виміряного відбитка. Це може бути корисним для визначення поточного перекосу принтера після застосування корекції. Це також може бути корисним перед застосуванням корекції, щоб визначити, чи потрібна корекція перекосу. Перегляньте [Корекція перекосу] (Skew_Correction.md) для отримання докладної інформації про об’єкти калібрування перекосу та вимірювання.

source: `BED_MESH_OUTPUT PGP=[<0:1>]`: This command outputs the current probed z values and current mesh values to the terminal. If PGP=1 is specified the X, Y coordinates generated by bed_mesh, along with their associated indices, will be output to the terminal.
uk: `BED_MESH_OUTPUT PGP=[<0:1>]`: ця команда виводить на термінал поточні досліджувані значення z і поточні значення сітки. Якщо вказано PGP=1, координати X, Y, згенеровані bed_mesh, разом із відповідними індексами будуть виведені на термінал.

source: Additional Commands
uk: Додаткові команди

source: The following commands are available when an [adxl345 config section](Config_Reference.md#adxl345) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації adxl345](Config_Reference.md#adxl345).

source: `ACCELEROMETER_DEBUG_READ [CHIP=<config_name>] REG=<register>`: queries ADXL345 register "register" (e.g. 44 or 0x2C). Can be useful for debugging purposes.
uk: `ACCELEROMETER_DEBUG_READ [CHIP=<config_name>] REG=<register>`: надсилає запит ADXL345 на реєстр "зареєструвати" (наприклад, 44 або 0x2C). Може бути корисним для налагодження.

source: `ACCELEROMETER_DEBUG_WRITE [CHIP=<config_name>] REG=<register> VAL=<value>`: Writes raw "value" into a register "register". Both "value" and "register" can be a decimal or a hexadecimal integer. Use with care, and refer to ADXL345 data sheet for the reference.
uk: `ACCELEROMETER_DEBUG_WRITE [CHIP=<config_name>] REG=<реєстр> VAL=<значення>`: записує необроблене «значення» в регістр «реєстр». І «значення», і «реєстр» можуть бути десятковим або шістнадцятковим цілим числом. Використовуйте обережно та зверніться до таблиці даних ADXL345 для довідки.

source: The following commands are available when the [bed_mesh config section](Config_Reference.md#bed_mesh) is enabled (also see the [bed mesh guide](Bed_Mesh.md)).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації bed_mesh](Config_Reference.md#bed_mesh) (також див. [довідник щодо сітки для ліжка](Bed_Mesh.md)).

source: `BED_MESH_PROFILE LOAD=<name> SAVE=<name> REMOVE=<name>`: This command provides profile management for mesh state. LOAD will restore the mesh state from the profile matching the supplied name. SAVE will save the current mesh state to a profile matching the supplied name. Remove will delete the profile matching the supplied name from persistent memory. Note that after SAVE or REMOVE operations have been run the SAVE_CONFIG gcode must be run to make the changes to persistent memory permanent.
uk: `BED_MESH_PROFILE LOAD=<name> SAVE=<name> REMOVE=<name>`: ця команда забезпечує керування профілем для стану сітки. LOAD відновить стан сітки з профілю, який відповідає наданій назві. SAVE збереже поточний стан сітки в профілі, що відповідає наданій назві. Видалити видалить профіль, який відповідає наданому імені, із постійної пам’яті. Зауважте, що після виконання операцій SAVE або REMOVE потрібно запустити gcode SAVE_CONFIG, щоб зробити зміни в постійній пам’яті постійними.

source: [bed_screws]
uk: [гвинти_ліжка]

source: The following commands are available when the [bed_screws config section](Config_Reference.md#bed_screws) is enabled (also see the [manual level guide](Manual_Level.md#adjusting-bed-leveling-screws)).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації bed_screws](Config_Reference.md#bed_screws) (також див. [посібник з ручного рівня](Manual_Level.md#adjusting-bed-leveling-screws)).

source: The following commands are available when the [bed_tilt config section](Config_Reference.md#bed_tilt) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації bed_tilt](Config_Reference.md#bed_tilt).

source: The following command is available when a [bltouch config section](Config_Reference.md#bltouch) is enabled (also see the [BL-Touch guide](BLTouch.md)).
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації bltouch](Config_Reference.md#bltouch) (також див. [посібник BL-Touch](BLTouch.md)).

source: `BLTOUCH_DEBUG COMMAND=<command>`: This sends a command to the BLTouch. It may be useful for debugging. Available commands are: `pin_down`, `touch_mode`, `pin_up`, `self_test`, `reset`. A BL-Touch V3.0 or V3.1 may also support `set_5V_output_mode`, `set_OD_output_mode`, `output_mode_store` commands.
uk: `BLTOUCH_DEBUG COMMAND=<команда>`: надсилає команду на BLTouch. Це може бути корисним для налагодження. Доступні команди: `pin_down`, `touch_mode`, `pin_up`, `self_test`, `reset`. BL-Touch V3.0 або V3.1 також може підтримувати команди `set_5V_output_mode`, `set_OD_output_mode`, `output_mode_store`.

source: [configfile]
uk: [файл конфігурації]

source: The configfile module is automatically loaded.
uk: Модуль configfile завантажується автоматично.

source: The following command is enabled if a [delayed_gcode config section](Config_Reference.md#delayed_gcode) has been enabled (also see the [template guide](Command_Templates.md#delayed-gcodes)).
uk: Наступну команду ввімкнено, якщо ввімкнено [розділ конфігурації delayed_gcode](Config_Reference.md#delayed_gcode) (також див. [посібник із шаблонів](Command_Templates.md#delayed-gcodes)).

source: The following commands are available when the [delta_calibrate config section](Config_Reference.md#linear-delta-kinematics) is enabled (also see the [delta calibrate guide](Delta_Calibrate.md)).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації delta_calibrate](Config_Reference.md#linear-delta-kinematics) (також див. [посібник із калібрування дельти](Delta_Calibrate.md)).

source: [display]
uk: [дисплей]

source: The following command is available when a [display config section](Config_Reference.md#gcode_macro) is enabled.
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації дисплея](Config_Reference.md#gcode_macro).

source: [display_status]
uk: [дисплей_статус]

source: The display_status module is automatically loaded if a [display config section](Config_Reference.md#display) is enabled. It provides the following standard G-Code commands:
uk: Модуль display_status завантажується автоматично, якщо ввімкнено [розділ конфігурації дисплея](Config_Reference.md#display). Він надає такі стандартні команди G-коду:

source: The following command is available when the [dual_carriage config section](Config_Reference.md#dual_carriage) is enabled.
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації dual_carriage](Config_Reference.md#dual_carriage).

source: [endstop_phase]
uk: [кінцева_фаза]

source: The following commands are available when an [endstop_phase config section](Config_Reference.md#endstop_phase) is enabled (also see the [endstop phase guide](Endstop_Phase.md)).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації endstop_phase](Config_Reference.md#endstop_phase) (також див. [посібник з фази endstop](Endstop_Phase.md)).

source: [extruder]
uk: [екструдер]

source: The following commands are available if an [extruder config section](Config_Reference.md#extruder) is enabled:
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації екструдера](Config_Reference.md#extruder):

source: The following command is available when a [fan_generic config section](Config_Reference.md#fan_generic) is enabled.
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації fan_generic](Config_Reference.md#fan_generic).

source: `SET_FAN_SPEED FAN=config_name SPEED=<speed>` This command sets the speed of a fan. "speed" must be between 0.0 and 1.0.
uk: `SET_FAN_SPEED FAN=config_name SPEED=<швидкість>` Ця команда встановлює швидкість вентилятора. "швидкість" має бути між 0,0 і 1,0.

source: The following standard G-Code commands are available when the [firmware_retraction config section](Config_Reference.md#firmware_retraction) is enabled. These commands allow you to utilize the firmware retraction feature available in many slicers, to reduce stringing during non-extrusion moves from one part of the print to another. Appropriately configuring pressure advance reduces the length of retraction required.
uk: Наступні стандартні команди G-Code доступні, якщо ввімкнено [розділ конфігурації firmware_retraction](Config_Reference.md#firmware_retraction). Ці команди дозволяють використовувати функцію ретракції вбудованого програмного забезпечення, доступну в багатьох слайсерах, щоб зменшити кількість рядків під час неекструзійних переміщень від однієї частини друку до іншої. Відповідне налаштування просування тиску зменшує необхідну довжину втягування.

source: The following additional commands are also available.
uk: Також доступні такі додаткові команди.

source: The following command is available when a [filament_switch_sensor](Config_Reference.md#filament_switch_sensor) or [filament_motion_sensor](Config_Reference.md#filament_motion_sensor) config section is enabled.
uk: Наступна команда доступна, якщо ввімкнено розділ конфігурації [filament_switch_sensor](Config_Reference.md#filament_switch_sensor) або [filament_motion_sensor](Config_Reference.md#filament_motion_sensor).

source: `QUERY_FILAMENT_SENSOR SENSOR=<sensor_name>`: Queries the current status of the filament sensor. The data displayed on the terminal will depend on the sensor type defined in the configuration.
uk: `QUERY_FILAMENT_SENSOR SENSOR=<назва_сенсора>`: запитує поточний статус датчика нитки. Дані, що відображаються на терміналі, залежатимуть від типу датчика, визначеного в конфігурації.

source: The gcode module is automatically loaded.
uk: Модуль gcode завантажується автоматично.

source: RESTART
uk: ПЕРЕЗАПУСК

source: STATUS
uk: СТАТУС

source: HELP
uk: ДОПОМОГА

source: The following command is available when a [gcode_macro config section](Config_Reference.md#gcode_macro) is enabled (also see the [command templates guide](Command_Templates.md)).
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації gcode_macro](Config_Reference.md#gcode_macro) (також див. [посібник із шаблонів команд](Command_Templates.md)).

source: The gcode_move module is automatically loaded.
uk: Модуль gcode_move завантажується автоматично.

source: [hall_filament_width_sensor]
uk: [сенсор_ширини_нитки_холу]

source: The following commands are available when the [tsl1401cl filament width sensor config section](Config_Reference.md#tsl1401cl_filament_width_sensor) or [hall filament width sensor config section](Config_Reference.md#hall_filament_width_sensor) is enabled (also see [TSLl401CL Filament Width Sensor](TSL1401CL_Filament_Width_Sensor.md) and [Hall Filament Width Sensor](Hall_Filament_Width_Sensor.md)):
uk: Наступні команди доступні, коли ввімкнено [розділ конфігурації датчика ширини нитки tsl1401cl](Config_Reference.md#tsl1401cl_filament_width_sensor) або [розділ конфігурації датчика ширини нитки Холла](Config_Reference.md#hall_filament_width_sensor) (також див. [Датчик ширини нитки TSLl401CL]( TSL1401CL_Filament_Width_Sensor.md) і [Датчик ширини нитки Холла](Hall_Filament_Width_Sensor.md)):

source: `QUERY_FILAMENT_WIDTH`: Return the current measured filament width.
uk: `QUERY_FILAMENT_WIDTH`: повертає поточну виміряну ширину нитки.

source: `RESET_FILAMENT_WIDTH_SENSOR`: Clear all sensor readings. Helpful after filament change.
uk: `RESET_FILAMENT_WIDTH_SENSOR`: Очистити всі показання датчика. Допомагає після заміни нитки.

source: `DISABLE_FILAMENT_WIDTH_SENSOR`: Turn off the filament width sensor and stop using it for flow control.
uk: `DISABLE_FILAMENT_WIDTH_SENSOR`: Вимкніть датчик ширини нитки та припиніть використовувати його для контролю потоку.

source: `ENABLE_FILAMENT_WIDTH_SENSOR`: Turn on the filament width sensor and start using it for flow control.
uk: `ENABLE_FILAMENT_WIDTH_SENSOR`: увімкніть датчик ширини нитки та почніть використовувати його для керування потоком.

source: `QUERY_RAW_FILAMENT_WIDTH`: Return the current ADC channel readings and RAW sensor value for calibration points.
uk: `QUERY_RAW_FILAMENT_WIDTH`: повертає поточні показники каналу АЦП і значення датчика RAW для точок калібрування.

source: `ENABLE_FILAMENT_WIDTH_LOG`: Turn on diameter logging.
uk: `ENABLE_FILAMENT_WIDTH_LOG`: увімкнути реєстрацію діаметра.

source: `DISABLE_FILAMENT_WIDTH_LOG`: Turn off diameter logging.
uk: `DISABLE_FILAMENT_WIDTH_LOG`: Вимкнути реєстрацію діаметра.

source: [heaters]
uk: [нагрівачі]

source: The heaters module is automatically loaded if a heater is defined in the config file.
uk: Модуль нагрівачів завантажується автоматично, якщо нагрівач визначено у файлі конфігурації.

source: The idle_timeout module is automatically loaded.
uk: Модуль idle_timeout завантажується автоматично.

source: The following command is enabled if an [input_shaper config section](Config_Reference.md#input_shaper) has been enabled (also see the [resonance compensation guide](Resonance_Compensation.md)).
uk: Наступну команду ввімкнено, якщо ввімкнено [розділ конфігурації input_shaper](Config_Reference.md#input_shaper) (також див. [посібник із компенсації резонансу](Resonance_Compensation.md)).

source: [manual_probe]
uk: [ручний_зонд]

source: The manual_probe module is automatically loaded.
uk: Модуль manual_probe завантажується автоматично.

source: [manual_stepper]
uk: [ручний_степпер]

source: The following command is available when a [manual_stepper config section](Config_Reference.md#manual_stepper) is enabled.
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації manual_stepper](Config_Reference.md#manual_stepper).

source: [output_pin]
uk: [вихідний_контакт]

source: The following command is available when an [output_pin config section](Config_Reference.md#output_pin) is enabled.
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації output_pin](Config_Reference.md#output_pin).

source: [palette2]
uk: [палітра2]

source: The following commands are available when the [palette2 config section](Config_Reference.md#palette2) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації palete2](Config_Reference.md#palette2).

source: The pid_calibrate module is automatically loaded if a heater is defined in the config file.
uk: Модуль pid_calibrate завантажується автоматично, якщо нагрівач визначено у конфігураційному файлі.

source: PAUSE
uk: ПАУЗА

source: RESUME
uk: РЕЗЮМЕ

source: [probe]
uk: [зонд]

source: The following commands are available when a [probe config section](Config_Reference.md#probe) or [bltouch config section](Config_Reference.md#bltouch) is enabled (also see the [probe calibrate guide](Probe_Calibrate.md)).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації зонда](Config_Reference.md#probe) або [розділ конфігурації bltouch](Config_Reference.md#bltouch) (також див. [посібник з калібрування зонда](Probe_Calibrate.md)).

source: PROBE
uk: ЗОНД

source: The query_endstops module is automatically loaded. The following standard G-Code commands are currently available, but using them is not recommended:
uk: Модуль query_endstops завантажується автоматично. Наразі доступні наступні стандартні команди G-коду, але використовувати їх не рекомендується:

source: The following commands are available when a [resonance_tester config section](Config_Reference.md#resonance_tester) is enabled (also see the [measuring resonances guide](Measuring_Resonances.md)).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації resonance_tester](Config_Reference.md#resonance_tester) (також див. [посібник із вимірювання резонансів](Measuring_Resonances.md)).

source: [respond]
uk: [відповісти]

source: The following standard G-Code commands are available when the [respond config section](Config_Reference.md#respond) is enabled:
uk: Наступні стандартні команди G-Code доступні, якщо ввімкнено [розділ конфігурації відповідей](Config_Reference.md#respond):

source: RESPOND
uk: ВІДПОВІСТИ

source: `RESPOND TYPE=command MSG="<message>"`: echo the message prepended with `// `. OctoPrint can be configured to respond to these messages (e.g. `RESPOND TYPE=command MSG=action:pause`).
uk: `RESPOND TYPE=команда MSG="<message>"`: повторити повідомлення, перед яким стоїть `// `. OctoPrint можна налаштувати для відповіді на ці повідомлення (наприклад, `RESPOND TYPE=command MSG=action:pause`).

source: [save_variables]
uk: [зберегти_змінні]

source: The following command is enabled if a [save_variables config section](Config_Reference.md#save_variables) has been enabled.
uk: Наступну команду ввімкнено, якщо ввімкнено [розділ конфігурації save_variables](Config_Reference.md#save_variables).

source: The following commands are available when the [screws_tilt_adjust config section](Config_Reference.md#screws_tilt_adjust) is enabled (also see the [manual level guide](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe)).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації screws_tilt_adjust](Config_Reference.md#screws_tilt_adjust) (також див. [посібник з ручного рівня](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe))).

source: When the [sdcard_loop config section](Config_Reference.md#sdcard_loop) is enabled, the following extended commands are available.
uk: Коли [розділ конфігурації sdcard_loop](Config_Reference.md#sdcard_loop) увімкнено, доступні такі розширені команди.

source: `SDCARD_LOOP_BEGIN COUNT=<count>`: Begin a looped section in the SD print. A count of 0 indicates that the section should be looped indefinitely.
uk: `SDCARD_LOOP_BEGIN COUNT=<count>`: початок зацикленого розділу в SD-друкі. Лічильник, рівний 0, вказує на те, що розділ має бути зациклений на невизначений термін.

source: [servo]
uk: [серво]

source: The following commands are available when a [servo config section](Config_Reference.md#servo) is enabled.
uk: Наступні команди доступні, коли ввімкнено [розділ конфігурації сервосистеми](Config_Reference.md#servo).

source: [skew_correction]
uk: [виправлення перекосу]

source: The following commands are available when the [skew_correction config section](Config_Reference.md#skew_correction) is enabled (also see the [Skew Correction](Skew_Correction.md) guide).
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації skew_correction](Config_Reference.md#skew_correction) (також див. посібник [Skew Correction](Skew_Correction.md).

source: `SKEW_PROFILE [LOAD=<name>] [SAVE=<name>] [REMOVE=<name>]`: Profile management for skew_correction. LOAD will restore skew state from the profile matching the supplied name. SAVE will save the current skew state to a profile matching the supplied name. Remove will delete the profile matching the supplied name from persistent memory. Note that after SAVE or REMOVE operations have been run the SAVE_CONFIG gcode must be run to make the changes to persistent memory permanent.
uk: `SKEW_PROFILE [LOAD=<name>] [SAVE=<name>] [REMOVE=<name>]`: Керування профілем для skew_correction. LOAD відновить спотворений стан із профілю, що відповідає наданій назві. SAVE збереже поточний стан перекосу в профілі, що відповідає наданій назві. Видалити видалить профіль, який відповідає наданому імені, із постійної пам’яті. Зауважте, що після виконання операцій SAVE або REMOVE потрібно запустити gcode SAVE_CONFIG, щоб зробити зміни в постійній пам’яті постійними.

source: The stepper_enable module is automatically loaded.
uk: Модуль stepper_enable завантажується автоматично.

source: The following command is available when a [temperature_fan config section](Config_Reference.md#temperature_fan) is enabled.
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації temperatur_fan](Config_Reference.md#temperature_fan).

source: `SET_TEMPERATURE_FAN_TARGET temperature_fan=<temperature_fan_name> [target=<target_temperature>] [min_speed=<min_speed>] [max_speed=<max_speed>]`: Sets the target temperature for a temperature_fan. If a target is not supplied, it is set to the specified temperature in the config file. If speeds are not supplied, no change is applied.
uk: `SET_TEMPERATURE_FAN_TARGET temperature_fan=<temperature_fan_name> [target=<target_temperature>] [min_speed=<min_speed>] [max_speed=<max_speed>]`: встановлює цільову температуру для temperature_fan. Якщо ціль не вказано, для нього встановлюється температура, указана у файлі конфігурації. Якщо швидкості не вказано, зміни не застосовуються.

source: The following commands are available when any of the [tmcXXXX config sections](Config_Reference.md#tmc-stepper-driver-configuration) are enabled.
uk: Наступні команди доступні, якщо ввімкнено будь-який із [розділів конфігурації tmcXXXX](Config_Reference.md#tmc-stepper-driver-configuration).

source: `INIT_TMC STEPPER=<name>`: This command will initialize the TMC registers. Needed to re-enable the driver if power to the chip is turned off then back on.
uk: `INIT_TMC STEPPER=<name>`: ця команда ініціалізує регістри TMC. Необхідно повторно ввімкнути драйвер, якщо живлення чіпа вимкнуто, а потім знову ввімкніть.

source: [toolhead]
uk: [насадка]

source: The toolhead module is automatically loaded.
uk: Модуль інструментальної головки завантажується автоматично.

source: The tuning_tower module is automatically loaded.
uk: Модуль tuning_tower завантажується автоматично.

source: `FACTOR`: The value changes at a rate of `factor` per millimeter. The formula used is: `value = start + factor * z_height`. You can plug the optimum Z height directly into the formula to determine the optimum parameter value.
uk: `FACTOR`: значення змінюється зі швидкістю `factor` на міліметр. Використовується така формула: «значення = початок + коефіцієнт * z_висота». Ви можете включити оптимальну висоту Z безпосередньо у формулу, щоб визначити оптимальне значення параметра.

source: `FACTOR` and `BAND`: The value changes at an average rate of `factor` per millimeter, but in discrete bands where the adjustment will only be made every `BAND` millimeters of Z height. The formula used is: `value = start + factor * ((floor(z_height / band) + .5) * band)`.
uk: `FACTOR` і `BAND`: значення змінюється із середньою швидкістю `factor` на міліметр, але в окремих діапазонах, де коригування здійснюватиметься лише через кожні `BAND` міліметри висоти Z. Використовується така формула: «значення = початок + коефіцієнт * ((поверх(z_висота / діапазон) + .5) * діапазон)».

source: `STEP_DELTA` and `STEP_HEIGHT`: The value changes by `STEP_DELTA` every `STEP_HEIGHT` millimeters. The formula used is: `value = start + step_delta * floor(z_height / step_height)`. You can simply count bands or read tuning tower labels to determine the optimum value.
uk: `STEP_DELTA` і `STEP_HEIGHT`: значення змінюється на `STEP_DELTA` кожні `STEP_HEIGHT` міліметрів. Використовується така формула: `value = start + step_delta * floor(z_height / step_height)`. Щоб визначити оптимальне значення, ви можете просто порахувати діапазони або прочитати етикетки настроювальних веж.
