Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/G-Codes.po
Languages: uk

source: `BED_MESH_CALIBRATE [PROFILE=<name>] [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=1] [ADAPTIVE_MARGIN=<value>]`: This command probes the bed using generated points specified by the parameters in the config. After probing, a mesh is generated and z-movement is adjusted according to the mesh. The mesh will be saved into a profile specified by the `PROFILE` parameter, or `default` if unspecified. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file. If ADAPTIVE=1 is specified then the objects defined by the Gcode file being printed will be used to define the probed area. The optional `ADAPTIVE_MARGIN` value overrides the `adaptive_margin` option specified in the config file.
uk: `BED_MESH_CALIBRATE [PROFILE=<name>] [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=1] [ADAPTIVE_MARGIN=<value> ]`: ця команда досліджує ліжко, використовуючи згенеровані точки, визначені параметрами в конфігурації. Після зондування генерується сітка, а z-рух регулюється відповідно до сітки. Сітка буде збережена в профілі, визначеному параметром `PROFILE`, або `default`, якщо не вказано. Дивіться команду PROBE, щоб дізнатися про додаткові параметри зонду. Якщо вказано METHOD=manual, інструмент ручного тестування активовано - дивіться команду MANUAL_PROBE вище, щоб дізнатися більше про додаткові команди, доступні, коли цей інструмент активний. Додаткове значення `HORIZONTAL_MOVE_Z` замінює параметр `horizontal_move_z`, указаний у файлі конфігурації. Якщо вказано ADAPTIVE=1, тоді об’єкти, визначені файлом Gcode, який друкується, використовуватимуться для визначення досліджуваної області. Додаткове значення `ADAPTIVE_MARGIN` замінює параметр `adaptive_margin`, указаний у файлі конфігурації.

source: `BED_MESH_OFFSET [X=<value>] [Y=<value>] [ZFADE=<value]`: Applies X, Y, and/or ZFADE offsets to the mesh lookup. This is useful for printers with independent extruders, as an offset is necessary to produce correct Z adjustment after a tool change. Note that a ZFADE offset does not apply additional z-adjustment directly, it is used to correct the `fade` calculation when a `gcode offset` has been applied to the Z axis.
uk: `BED_MESH_OFFSET [X=<значення>] [Y=<значення>] [ZFADE=<значення]`: застосовує зміщення X, Y та/або ZFADE до пошуку сітки. Це корисно для принтерів із незалежними екструдерами, оскільки зсув необхідний для правильного налаштування Z після зміни інструменту. Зауважте, що зміщення ZFADE не застосовує додаткове коригування z напряму, воно використовується для виправлення обчислення «згасання», коли до осі Z застосовано «зміщення gcode».

source: `SET_PIN PIN=config_name VALUE=<value>`: Set the pin to the given output `VALUE`. VALUE should be 0 or 1 for "digital" output pins. For PWM pins, set to a value between 0.0 and 1.0, or between 0.0 and `scale` if a scale is configured in the output_pin config section.
uk: `SET_PIN PIN=config_name VALUE=<value>`: установіть PIN-код на заданий вихід `VALUE`. VALUE має бути 0 або 1 для «цифрових» вихідних контактів. Для контактів ШІМ встановіть значення від 0,0 до 1,0 або від 0,0 до `scale`, якщо масштаб налаштовано в розділі конфігурації output_pin.

source: The following command is available when a [pwm_cycle_time config section](Config_Reference.md#pwm_cycle_time) is enabled.
uk: Наступна команда доступна, коли ввімкнено [розділ конфігурації pwm_cycle_time](Config_Reference.md#pwm_cycle_time).

source: `SET_PIN PIN=config_name VALUE=<value> [CYCLE_TIME=<cycle_time>]`: This command works similarly to [output_pin](#output_pin) SET_PIN commands. The command here supports setting an explicit cycle time using the CYCLE_TIME parameter (specified in seconds). Note that the CYCLE_TIME parameter is not stored between SET_PIN commands (any SET_PIN command without an explicit CYCLE_TIME parameter will use the `cycle_time` specified in the pwm_cycle_time config section).
uk: `SET_PIN PIN=config_name VALUE=<value> [CYCLE_TIME=<cycle_time>]`: ця команда працює подібно до команд [output_pin](#output_pin) SET_PIN. Ця команда підтримує встановлення явного часу циклу за допомогою параметра CYCLE_TIME (вказаного в секундах). Зверніть увагу, що параметр CYCLE_TIME не зберігається між командами SET_PIN (будь-яка команда SET_PIN без явного параметра CYCLE_TIME використовуватиме `cycle_time', указаний у розділі конфігурації pwm_cycle_time).

source: `SET_VELOCITY_LIMIT [VELOCITY=<value>] [ACCEL=<value>] [MINIMUM_CRUISE_RATIO=<value>] [SQUARE_CORNER_VELOCITY=<value>]`: This command can alter the velocity limits that were specified in the printer config file. See the [printer config section](Config_Reference.md#printer) for a description of each parameter.
uk: `SET_VELOCITY_LIMIT [VELOCITY=<значення>] [ACCEL=<значення>] [MINIMUM_CRUISE_RATIO=<значення>] [SQUARE_CORNER_VELOCITY=<значення>]`: ця команда може змінити обмеження швидкості, указані у файлі конфігурації принтера. Опис кожного параметра див. у [розділі конфігурації принтера](Config_Reference.md#printer).

source: The following commands are available when a [probe_eddy_current config section](Config_Reference.md#probe_eddy_current) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації probe_eddy_current](Config_Reference.md#probe_eddy_current).

source: `PROBE_EDDY_CURRENT_CALIBRATE CHIP=<config_name>`: This starts a tool that calibrates the sensor resonance frequencies to corresponding Z heights. The tool will take a couple of minutes to complete. After completion, use the SAVE_CONFIG command to store the results in the printer.cfg file.
uk: `PROBE_EDDY_CURRENT_CALIBRATE CHIP=<config_name>`: це запускає інструмент, який калібрує резонансні частоти датчика відповідно до висот Z. Інструменту знадобиться кілька хвилин, щоб завершити роботу. Після завершення скористайтеся командою SAVE_CONFIG, щоб зберегти результати у файлі printer.cfg.

source: `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<config_name>` This tool will calibrate the ldc1612 DRIVE_CURRENT0 register. Prior to using this tool, move the sensor so that it is near the center of the bed and about 20mm above the bed surface. Run this command to determine an appropriate DRIVE_CURRENT for the sensor. After running this command use the SAVE_CONFIG command to store that new setting in the printer.cfg config file.
uk: `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<config_name>` Цей інструмент відкалібрує регістр ldc1612 DRIVE_CURRENT0. Перед використанням цього інструменту перемістіть датчик так, щоб він знаходився біля центру ліжка та приблизно на 20 мм над поверхнею ліжка. Виконайте цю команду, щоб визначити відповідний DRIVE_CURRENT для датчика. Після виконання цієї команди використовуйте команду SAVE_CONFIG, щоб зберегти цей новий параметр у файлі конфігурації printer.cfg.

source: The following commands are available when a [temperature_probe config section](Config_Reference.md#temperature_probe) is enabled.
uk: Наступні команди доступні, коли ввімкнено [розділ конфігурації temperature_probe](Config_Reference.md#temperature_probe).

source: `TEMPERATURE_PROBE_CALIBRATE [PROBE=<probe name>] [TARGET=<value>] [STEP=<value>]`: Initiates probe drift calibration for eddy current based probes. The `TARGET` is a target temperature for the last sample. When the temperature recorded during a sample exceeds the `TARGET` calibration will complete. The `STEP` parameter sets temperature delta (in C) between samples. After a sample has been taken, this delta is used to schedule a call to `TEMPERATURE_PROBE_NEXT`. The default `STEP` is 2.
uk: `TEMPERATURE_PROBE_CALIBRATE [PROBE=<назва зонда>] [TARGET=<значення>] [STEP=<значення>]`: ініціює калібрування дрейфу зонда для датчиків на основі вихрових струмів. `TARGET` — цільова температура для останнього зразка. Коли температура, зареєстрована під час зразка, перевищить калібрування «ЦІЛЬ» буде завершено. Параметр `STEP` встановлює дельту температури (у С) між зразками. Після взяття проби ця дельта використовується для планування виклику `TEMPERATURE_PROBE_NEXT`. За умовчанням `STEP` дорівнює 2.

source: `TEMPERATURE_PROBE_NEXT`: After calibration has started this command is run to take the next sample. It is automatically scheduled to run when the delta specified by `STEP` has been reached, however its also possible to manually run this command to force a new sample. This command is only available during calibration.
uk: `TEMPERATURE_PROBE_NEXT`: після початку калібрування виконується ця команда для взяття наступного зразка. Його запуск автоматично заплановано, коли досягнуто дельта, визначену `STEP`, однак цю команду також можна запустити вручну, щоб примусово створити новий зразок. Ця команда доступна лише під час калібрування.

source: `TEMPERATURE_PROBE_COMPLETE`: Can be used to end calibration and save the current result before the `TARGET` temperature is reached. This command is only available during calibration.
uk: `TEMPERATURE_PROBE_COMPLETE`: можна використовувати для завершення калібрування та збереження поточного результату до досягнення температури `TARGET`. Ця команда доступна лише під час калібрування.

source: ABORT
uk: ПЕРЕРАТИ

source: `ABORT`: Aborts the calibration process, discarding the current results. This command is only available during drift calibration.
uk: `ABORT`: перериває процес калібрування, відкидаючи поточні результати. Ця команда доступна лише під час калібрування дрейфу.

source: `TEMPERATURE_PROBE_ENABLE ENABLE=[0|1]`: Sets temperature drift compensation on or off. If ENABLE is set to 0, drift compensation will be disabled, if set to 1 it is enabled.
uk: `TEMPERATURE_PROBE_ENABLE ENABLE=[0|1]`: вмикає або вимикає компенсацію дрейфу температури. Якщо ENABLE встановлено на 0, компенсація дрейфу буде вимкнена, якщо встановлено на 1, вона ввімкнена.
