Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/G-Codes.po
Languages: uk

source: Klipper supports the following standard G-Code commands if the [virtual_sdcard config section](Config_Reference.md#virtual_sdcard) is enabled:
uk: Klipper підтримує такі стандартні команди G-Code, якщо ввімкнено [розділ конфігурації virtual_sdcard](Config_Reference.md#virtual_sdcard):

source: In addition, the following extended commands are available when the "virtual_sdcard" config section is enabled.
uk: Крім того, наведені нижче розширені команди доступні, якщо ввімкнено розділ конфігурації "virtual_sdcard".

source: `SDCARD_PRINT_FILE FILENAME=<filename>`: Load a file and start SD print.
uk: `SDCARD_PRINT_FILE FILENAME=<ім'я файлу>`: завантажте файл і почніть друк SD.

source: `SDCARD_RESET_FILE`: Unload file and clear SD state.
uk: `SDCARD_RESET_FILE`: вивантажити файл і очистити стан SD.

source: The following commands are available when the [z_tilt config section](Config_Reference.md#z_tilt) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації z_tilt](Config_Reference.md#z_tilt).

source: Klipper's goal is to support the G-Code commands produced by common 3rd party software (eg, OctoPrint, Printrun, Slic3r, Cura, etc.) in their standard configurations. It is not a goal to support every possible G-Code command. Instead, Klipper prefers human readable ["extended G-Code commands"](#additional-commands). Similarly, the G-Code terminal output is only intended to be human readable - see the [API Server document](API_Server.md) if controlling Klipper from external software.
uk: Метою Klipper є підтримка команд G-Code, створених звичайним стороннім програмним забезпеченням (наприклад, OctoPrint, Printrun, Slic3r, Cura тощо) у їхніх стандартних конфігураціях. Це не мета підтримувати всі можливі команди G-коду. Натомість Klipper віддає перевагу зрозумілим для людини ["розширеним командам G-коду"](#additional-commands). Подібним чином вихід терміналу G-Code призначений лише для читання людиною - див. [документ сервера API] (API_Server.md), якщо керувати Klipper із зовнішнього програмного забезпечення.

source: `GET_POSITION`: Return information on the current location of the toolhead. See the developer documentation of [GET_POSITION output](Code_Overview.md#coordinate-systems) for more information.
uk: `GET_POSITION`: повертає інформацію про поточне розташування інструментальної головки. Додаткову інформацію див. у документації для розробників [виходу GET_POSITION](Code_Overview.md#coordinate-systems).

source: `ACTIVATE_EXTRUDER EXTRUDER=<config_name>`: In a printer with multiple [extruder](Config_Reference.md#extruder) config sections, this command changes the active hotend.
uk: `ACTIVATE_EXTRUDER EXTRUDER=<config_name>`: у принтері з кількома розділами конфігурації [extruder](Config_Reference.md#extruder) ця команда змінює активний hotend.

source: [angle]
uk: [кут]

source: The following commands are available when an [angle config section](Config_Reference.md#angle) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації кута](Config_Reference.md#angle).

source: `ANGLE_CALIBRATE CHIP=<chip_name>`: Perform angle calibration on the given sensor (there must be an `[angle chip_name]` config section that has specified a `stepper` parameter). IMPORTANT - this tool will command the stepper motor to move without checking the normal kinematic boundary limits. Ideally the motor should be disconnected from any printer carriage before performing calibration. If the stepper can not be disconnected from the printer, make sure the carriage is near the center of its rail before starting calibration. (The stepper motor may move forwards or backwards two full rotations during this test.) After completing this test use the `SAVE_CONFIG` command to save the calibration data to the config file. In order to use this tool the Python "numpy" package must be installed (see the [measuring resonance document](Measuring_Resonances.md#software-installation) for more information).
uk: `ANGLE_CALIBRATE CHIP=<chip_name>`: Виконайте калібрування кута на даному датчику (має бути розділ конфігурації `[angle chip_name]`, який вказав параметр `stepper`). ВАЖЛИВО: цей інструмент надає команду кроковому двигуну рухатися без перевірки нормальних кінематичних меж. В ідеалі двигун слід від’єднати від будь-якої каретки принтера перед виконанням калібрування. Якщо кроковий кроковий пристрій не можна від’єднати від принтера, перед початком калібрування переконайтеся, що каретка знаходиться біля центру напрямної. (Під час цього тесту кроковий двигун може рухатися вперед або назад на два повних оберти.) Після завершення цього тесту скористайтеся командою `SAVE_CONFIG`, щоб зберегти дані калібрування у файлі конфігурації. Щоб використовувати цей інструмент, потрібно встановити пакет Python "numpy" (додаткову інформацію див. у [документі про вимірювання резонансу](Measuring_Resonances.md#software-installation).

source: `ANGLE_DEBUG_READ CHIP=<config_name> REG=<register>`: Queries sensor register "register" (e.g. 44 or 0x2C). Can be useful for debugging purposes. This is only available for tle5012b chips.
uk: `ANGLE_DEBUG_READ CHIP=<config_name> REG=<register>`: запитує "реєстр" регістра датчика (наприклад, 44 або 0x2C). Може бути корисним для налагодження. Це доступно лише для мікросхем tle5012b.

source: `ANGLE_DEBUG_WRITE CHIP=<config_name> REG=<register> VAL=<value>`: Writes raw "value" into register "register". Both "value" and "register" can be a decimal or a hexadecimal integer. Use with care, and refer to sensor data sheet for the reference. This is only available for tle5012b chips.
uk: `ANGLE_DEBUG_WRITE CHIP=<config_name> REG=<register> VAL=<value>`: записує необроблене «значення» в регістр «register». І «значення», і «реєстр» можуть бути десятковим або шістнадцятковим цілим числом. Використовуйте обережно та зверніться до таблиці даних датчика для довідки. Це доступно лише для мікросхем tle5012b.

source: [led]
uk: [під керівництвом]

source: The following command is available when any of the [led config sections](Config_Reference.md#leds) are enabled.
uk: Наступна команда доступна, коли ввімкнено будь-який із [розділів конфігурації світлодіодів](Config_Reference.md#leds).

source: `SET_LED LED=<config_name> RED=<value> GREEN=<value> BLUE=<value> WHITE=<value> [INDEX=<index>] [TRANSMIT=0] [SYNC=1]`: This sets the LED output. Each color `<value>` must be between 0.0 and 1.0. The WHITE option is only valid on RGBW LEDs. If the LED supports multiple chips in a daisy-chain then one may specify INDEX to alter the color of just the given chip (1 for the first chip, 2 for the second, etc.). If INDEX is not provided then all LEDs in the daisy-chain will be set to the provided color. If TRANSMIT=0 is specified then the color change will only be made on the next SET_LED command that does not specify TRANSMIT=0; this may be useful in combination with the INDEX parameter to batch multiple updates in a daisy-chain. By default, the SET_LED command will sync it's changes with other ongoing gcode commands. This can lead to undesirable behavior if LEDs are being set while the printer is not printing as it will reset the idle timeout. If careful timing is not needed, the optional SYNC=0 parameter can be specified to apply the changes without resetting the idle timeout.
uk: `SET_LED LED=<config_name> RED=<value> GREEN=<value> BLUE=<value> WHITE=<value> [INDEX=<index>] [TRANSMIT=0] [SYNC=1]`: це встановлює світлодіод вихід. Кожен колір "<value>" має бути від 0,0 до 1,0. Опція WHITE дійсна лише для світлодіодів RGBW. Якщо світлодіод підтримує кілька чіпів у послідовному з’єднанні, тоді можна вказати INDEX, щоб змінити колір лише даного чіпа (1 для першого чіпа, 2 для другого тощо). Якщо INDEX не надано, тоді всі світлодіоди в ланцюжку буде встановлено на наданий колір. Якщо вказано TRANSMIT=0, зміна кольору буде здійснена лише для наступної команди SET_LED, яка не вказує TRANSMIT=0; це може бути корисним у поєднанні з параметром INDEX для групування кількох оновлень у послідовному ланцюжку. За замовчуванням команда SET_LED синхронізує свої зміни з іншими поточними командами gcode. Це може призвести до небажаної поведінки, якщо світлодіоди встановлюються, коли принтер не друкує, оскільки це призведе до скидання часу простою. Якщо ретельний час не потрібен, можна вказати додатковий параметр SYNC=0, щоб застосувати зміни без скидання тайм-ауту простою.

source: `SET_LED_TEMPLATE LED=<led_name> TEMPLATE=<template_name> [<param_x>=<literal>] [INDEX=<index>]`: Assign a [display_template](Config_Reference.md#display_template) to a given [LED](Config_Reference.md#leds). For example, if one defined a `[display_template my_led_template]` config section then one could assign `TEMPLATE=my_led_template` here. The display_template should produce a comma separated string containing four floating point numbers corresponding to red, green, blue, and white color settings. The template will be continuously evaluated and the LED will be automatically set to the resulting colors. One may set display_template parameters to use during template evaluation (parameters will be parsed as Python literals). If INDEX is not specified then all chips in the LED's daisy-chain will be set to the template, otherwise only the chip with the given index will be updated. If TEMPLATE is an empty string then this command will clear any previous template assigned to the LED (one can then use `SET_LED` commands to manage the LED's color settings).
uk: `SET_LED_TEMPLATE LED=<назва_індикатора> TEMPLATE=<назва_шаблону> [<параметр_x>=<літерал>] [INDEX=<індекс>]`: призначити [шаблон_дисплея](Config_Reference.md#шаблон_дисплея) заданому [світлодіодному](Config_Reference) .md#світлодіоди). Наприклад, якщо визначити розділ конфігурації`[display_template my_led_template]`, то тут можна призначити `TEMPLATE=my_led_template`. Display_template має створювати розділений комами рядок, що містить чотири числа з плаваючою комою, що відповідають параметрам червоного, зеленого, синього та білого кольорів. Шаблон буде постійно оцінюватися, і світлодіод автоматично встановлюватиметься на отримані кольори. Можна встановити параметри display_template для використання під час оцінки шаблону (параметри аналізуватимуться як літерали Python). Якщо INDEX не вказано, тоді всі мікросхеми в послідовному ланцюжку світлодіода будуть встановлені на шаблон, інакше буде оновлено лише мікросхему з заданим індексом. Якщо TEMPLATE є порожнім рядком, тоді ця команда очистить будь-який попередній шаблон, призначений світлодіодному індикатору (тоді можна використовувати команди `SET_LED` для керування параметрами кольору світлодіода).

source: The query_adc module is automatically loaded.
uk: Модуль query_adc завантажується автоматично.

source: Several commands are available when a [smart_effector config section](Config_Reference.md#smart_effector) is enabled. Be sure to check the official documentation for the Smart Effector on the [Duet3D Wiki](https://duet3d.dozuki.com/Wiki/Smart_effector_and_carriage_adapters_for_delta_printer) before changing the Smart Effector parameters. Also check the [probe calibration guide](Probe_Calibrate.md).
uk: Кілька команд доступні, якщо ввімкнено [розділ конфігурації smart_effector](Config_Reference.md#smart_effector). Обов’язково перевірте офіційну документацію для Smart Effector на [Duet3D Wiki](https://duet3d.dozuki.com/Wiki/Smart_effector_and_carriage_adapters_for_delta_printer), перш ніж змінювати параметри Smart Effector. Також перегляньте [посібник з калібрування зонда](Probe_Calibrate.md).

source: `SET_SMART_EFFECTOR [SENSITIVITY=<sensitivity>] [ACCEL=<accel>] [RECOVERY_TIME=<time>]`: Set the Smart Effector parameters. When `SENSITIVITY` is specified, the respective value is written to the SmartEffector EEPROM (requires `control_pin` to be provided). Acceptable `<sensitivity>` values are 0..255, the default is 50. Lower values require less nozzle contact force to trigger (but there is a higher risk of false triggering due to vibrations during probing), and higher values reduce false triggering (but require larger contact force to trigger). Since the sensitivity is written to EEPROM, it is preserved after the shutdown, and so it does not need to be configured on every printer startup. `ACCEL` and `RECOVERY_TIME` allow to override the corresponding parameters at run-time, see the [config section](Config_Reference.md#smart_effector) of Smart Effector for more info on those parameters.
uk: `SET_SMART_EFFECTOR [SENSITIVITY=<чутливість>] [ACCEL=<прискорення>] [RECOVERY_TIME=<час>]`: установіть параметри Smart Effector. Якщо вказано `SENSITIVITY`, відповідне значення записується в SmartEffector EEPROM (потрібно вказати `control_pin`). Прийнятні значення `<чутливості>`: 0..255, за замовчуванням 50. Нижчі значення вимагають меншої сили контакту сопла для спрацьовування (але існує більший ризик помилкового спрацьовування через вібрацію під час зондування), а вищі значення зменшують помилкове спрацьовування (але потрібна більша контактна сила для спрацьовування). Оскільки чутливість записується в EEPROM, вона зберігається після вимкнення, тому її не потрібно налаштовувати під час кожного запуску принтера. `ACCEL` і `RECOVERY_TIME` дозволяють замінити відповідні параметри під час виконання; див. [розділ конфігурації](Config_Reference.md#smart_effector) Smart Effector, щоб отримати додаткові відомості про ці параметри.

source: `RESET_SMART_EFFECTOR`: Resets Smart Effector sensitivity to its factory settings. Requires `control_pin` to be provided in the config section.
uk: `RESET_SMART_EFFECTOR`: скидає чутливість Smart Effector до заводських налаштувань. У розділі конфігурації потрібно вказати `control_pin`.

source: This section is organized by Klipper module name, which generally follows the section names specified in the [printer configuration file](Config_Reference.md). Note that some modules are automatically loaded.
uk: Цей розділ упорядковано за назвою модуля Klipper, яка зазвичай слідує за назвами розділів, указаними у [файлі конфігурації принтера] (Config_Reference.md). Зауважте, що деякі модулі завантажуються автоматично.

source: The following commands are available when an [exclude_object config section](Config_Reference.md#exclude_object) is enabled (also see the [exclude object guide](Exclude_Object.md)):
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації exclude_object](Config_Reference.md#exclude_object) (також див. [посібник з виключення об’єктів](Exclude_Object.md)):

source: `EXCLUDE_OBJECT [NAME=object_name] [CURRENT=1] [RESET=1]`: With no parameters, this will return a list of all currently excluded objects.
uk: `EXCLUDE_OBJECT [NAME=назва_об’єкта] [CURRENT=1] [RESET=1]`: без параметрів буде повернуто список усіх наразі виключених об’єктів.

source: When the `NAME` parameter is given, the named object will be excluded from printing.
uk: Якщо вказано параметр `NAME`, названий об'єкт буде виключено з друку.

source: When the `CURRENT` parameter is given, the current object will be excluded from printing.
uk: Якщо вказано параметр `CURRENT`, поточний об'єкт буде виключено з друку.

source: When the `RESET` parameter is given, the list of excluded objects will be cleared. Additionally including `NAME` will only reset the named object. This **can** cause print failures, if layers were already skipped.
uk: Якщо задано параметр `RESET`, список виключених об'єктів буде очищено. Крім того, включення `NAME` призведе до скидання лише названого об’єкта. Це **може** спричинити помилки друку, якщо шари вже були пропущені.

source: `EXCLUDE_OBJECT_DEFINE [NAME=object_name [CENTER=X,Y] [POLYGON=[[x,y],...]] [RESET=1] [JSON=1]`: Provides a summary of an object in the file.
uk: `EXCLUDE_OBJECT_DEFINE [NAME=назва_об’єкта [CENTER=X,Y] [POLYGON=[[x,y],...]] [RESET=1] [JSON=1]`: надає короткий опис об’єкта у файлі.

source: With no parameters provided, this will list the defined objects known to Klipper. Returns a list of strings, unless the `JSON` parameter is given, when it will return object details in json format.
uk: За відсутності параметрів буде показано список визначених об’єктів, відомих Klipper. Повертає список рядків, якщо не вказано параметр `JSON`, коли він повертає деталі об’єкта у форматі json.

source: When the `NAME` parameter is included, this defines an object to be excluded.
uk: Якщо включено параметр `NAME`, це визначає об’єкт, який потрібно виключити.

source: `NAME`: This parameter is required. It is the identifier used by other commands in this module.
uk: `NAME`: цей параметр обов'язковий. Це ідентифікатор, який використовується іншими командами в цьому модулі.

source: `CENTER`: An X,Y coordinate for the object.
uk: `CENTER`: координати X, Y для об’єкта.

source: `POLYGON`: An array of X,Y coordinates that provide an outline for the object.
uk: `ПОЛІГОН`: масив координат X, Y, які забезпечують контур об’єкта.

source: When the `RESET` parameter is provided, all defined objects will be cleared, and the `[exclude_object]` module will be reset.
uk: Коли вказано параметр `RESET`, усі визначені об’єкти буде очищено, а модуль `[exclude_object]` буде скинуто.

source: `EXCLUDE_OBJECT_START NAME=object_name`: This command takes a `NAME` parameter and denotes the start of the gcode for an object on the current layer.
uk: `EXCLUDE_OBJECT_START NAME=назва_об’єкта`: ця команда приймає параметр `NAME` і позначає початок gcode для об’єкта на поточному рівні.

source: `EXCLUDE_OBJECT_END [NAME=object_name]`: Denotes the end of the object's gcode for the layer. It is paired with `EXCLUDE_OBJECT_START`. A `NAME` parameter is optional, and will only warn when the provided name does not match the current object.
uk: `EXCLUDE_OBJECT_END [NAME=object_name]`: позначає кінець gcode об’єкта для шару. Він поєднується з `EXCLUDE_OBJECT_START`. Параметр `NAME` необов'язковий і попереджатиме, лише якщо надане ім'я не збігається з поточним об'єктом.

source: `SET_PRESSURE_ADVANCE [EXTRUDER=<config_name>] [ADVANCE=<pressure_advance>] [SMOOTH_TIME=<pressure_advance_smooth_time>]`: Set pressure advance parameters of an extruder stepper (as defined in an [extruder](Config_Reference.md#extruder) or [extruder_stepper](Config_Reference.md#extruder_stepper) config section). If EXTRUDER is not specified, it defaults to the stepper defined in the active hotend.
uk: `SET_PRESSURE_ADVANCE [EXTRUDER=<config_name>] [ADVANCE=<pressure_advance>] [SMOOTH_TIME=<pressure_advance_smooth_time>]`: установіть параметри підвищення тиску крокового екструдера (як визначено в [extruder](Config_Reference.md#extruder) або [ extruder_stepper](Config_Reference.md#extruder_stepper) розділ конфігурації). Якщо ЕКСТРУДЕР не вказано, за замовчуванням використовується степер, визначений у активному хотенді.

source: `SET_EXTRUDER_ROTATION_DISTANCE EXTRUDER=<config_name> [DISTANCE=<distance>]`: Set a new value for the provided extruder stepper's "rotation distance" (as defined in an [extruder](Config_Reference.md#extruder) or [extruder_stepper](Config_Reference.md#extruder_stepper) config section). If the rotation distance is a negative number then the stepper motion will be inverted (relative to the stepper direction specified in the config file). Changed settings are not retained on Klipper reset. Use with caution as small changes can result in excessive pressure between extruder and hotend. Do proper calibration with filament before use. If 'DISTANCE' value is not provided then this command will return the current rotation distance.
uk: `SET_EXTRUDER_ROTATION_DISTANCE EXTRUDER=<config_name> [DISTANCE=<distance>]`: установіть нове значення для «відстані обертання» наданого крокового екструдера (як визначено в [extruder](Config_Reference.md#extruder) або [extruder_stepper](Config_Reference) .md#extruder_stepper) розділ конфігурації). Якщо відстань обертання є від’ємним числом, кроковий рух буде інвертованим (відносно напрямку крокового кроку, указаного у файлі конфігурації). Змінені налаштування не зберігаються під час скидання Klipper. Використовуйте з обережністю, оскільки невеликі зміни можуть призвести до надмірного тиску між екструдером і гарячою частиною. Виконайте належне калібрування нитки перед використанням. Якщо значення «DISTANCE» не вказано, ця команда поверне поточну відстань обертання.

source: `SYNC_EXTRUDER_MOTION EXTRUDER=<name> MOTION_QUEUE=<name>`: This command will cause the stepper specified by EXTRUDER (as defined in an [extruder](Config_Reference.md#extruder) or [extruder_stepper](Config_Reference.md#extruder_stepper) config section) to become synchronized to the movement of an extruder specified by MOTION_QUEUE (as defined in an [extruder](Config_Reference.md#extruder) config section). If MOTION_QUEUE is an empty string then the stepper will be desynchronized from all extruder movement.
uk: `SYNC_EXTRUDER_MOTION EXTRUDER=<ім'я> MOTION_QUEUE=<ім'я>': ця команда викличе крок, указаний EXTRUDER (як визначено в конфігурації [extruder](Config_Reference.md#extruder) або [extruder_stepper](Config_Reference.md#extruder_stepper) розділ), щоб стати синхронізованим із рухом екструдера, визначеного MOTION_QUEUE (як визначено в розділі конфігурації [extruder](Config_Reference.md#extruder). Якщо MOTION_QUEUE є порожнім рядком, тоді кроковий механізм буде десинхронізовано від усіх рухів екструдера.

source: The force_move module is automatically loaded, however some commands require setting `enable_force_move` in the [printer config](Config_Reference.md#force_move).
uk: Модуль force_move завантажується автоматично, однак деякі команди вимагають налаштування `enable_force_move` у [конфігурації принтера](Config_Reference.md#force_move).
