Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/G-Codes.po
Languages: uk

source: `TEST_RESONANCES AXIS=<axis> OUTPUT=<resonances,raw_data> [NAME=<name>] [FREQ_START=<min_freq>] [FREQ_END=<max_freq>] [HZ_PER_SEC=<hz_per_sec>] [CHIPS=<adxl345_chip_name>] [POINT=x,y,z] [INPUT_SHAPING=[<0:1>]]`: Runs the resonance test in all configured probe points for the requested "axis" and measures the acceleration using the accelerometer chips configured for the respective axis. "axis" can either be X or Y, or specify an arbitrary direction as `AXIS=dx,dy`, where dx and dy are floating point numbers defining a direction vector (e.g. `AXIS=X`, `AXIS=Y`, or `AXIS=1,-1` to define a diagonal direction). Note that `AXIS=dx,dy` and `AXIS=-dx,-dy` is equivalent. `adxl345_chip_name` can be one or more configured adxl345 chip,delimited with comma, for example `CHIPS="adxl345, adxl345 rpi"`. Note that `adxl345` can be omitted from named adxl345 chips. If POINT is specified it will override the point(s) configured in `[resonance_tester]`. If `INPUT_SHAPING=0` or not set(default), disables input shaping for the resonance testing, because it is not valid to run the resonance testing with the input shaper enabled. `OUTPUT` parameter is a comma-separated list of which outputs will be written. If `raw_data` is requested, then the raw accelerometer data is written into a file or a series of files `/tmp/raw_data_<axis>_[<chip_name>_][<point>_]<name>.csv` with (`<point>_` part of the name generated only if more than 1 probe point is configured or POINT is specified). If `resonances` is specified, the frequency response is calculated (across all probe points) and written into `/tmp/resonances_<axis>_<name>.csv` file. If unset, OUTPUT defaults to `resonances`, and NAME defaults to the current time in "YYYYMMDD_HHMMSS" format.
uk: `TEST_RESONANCES AXIS=<axis> OUTPUT=<resonances,raw_data> [NAME=<name>] [FREQ_START=<min_freq>] [FREQ_END=<max_freq>] [HZ_PER_SEC=<hz_per_sec>] [CHIPS=<adxl345_chip_name>] [ POINT=x,y,z] [INPUT_SHAPING=[<0:1>]]`: запускає резонансний тест у всіх налаштованих точках зонда для запитуваної "осі" та вимірює прискорення за допомогою мікросхем акселерометра, налаштованих для відповідної осі. «вісь» може бути або X або Y, або вказати довільний напрямок як `AXIS=dx,dy`, де dx і dy — числа з плаваючою комою, що визначають вектор напрямку (наприклад, `AXIS=X`, `AXIS=Y`, або `AXIS=1,-1`, щоб визначити діагональний напрямок). Зауважте, що `AXIS=dx,dy` і `AXIS=-dx,-dy` еквівалентні. `adxl345_chip_name` може бути одним або кількома налаштованими чіпами adxl345, розділеними комами, наприклад `CHIPS="adxl345, adxl345 rpi"`. Зауважте, що `adxl345` можна опустити в іменованих мікросхемах adxl345. Якщо вказано ТОЧКУ, це замінить точку(и), налаштовану в `[resonance_tester]`. Якщо `INPUT_SHAPING=0` або не встановлено (за замовчуванням), вимикає формування вхідних даних для тестування резонансу, оскільки не можна запускати тестування резонансу з увімкненим формувальником вхідних даних. Параметр `OUTPUT` — це розділений комами список виходів, які будуть записані. Якщо запитується `raw_data`, тоді необроблені дані акселерометра записуються у файл або серію файлів `/tmp/raw_data_<axis>_[<chip_name>_][<point>_]<name>.csv` з (`<точка>_` частина назви генерується, лише якщо налаштовано більше ніж 1 точку тестування або вказано ТОЧКУ). Якщо вказано `resonances`, частотна характеристика обчислюється (по всіх точках зонду) і записується у файл `/tmp/resonances_<axis>_<name>.csv`. Якщо не встановлено, OUTPUT за замовчуванням має значення `resonances`, а NAME — поточний час у форматі "YYYYMMDD_HHMMSS".

source: Also provided is the following extended G-Code command:
uk: Також надається така розширена команда G-коду:

source: `SET_DISPLAY_TEXT MSG=<message>`: Performs the equivalent of M117, setting the supplied `MSG` as the current display message. If `MSG` is omitted the display will be cleared.
uk: `SET_DISPLAY_TEXT MSG=<message>`: Виконує еквівалент M117, встановлюючи наданий `MSG` як поточне повідомлення на дисплеї. Якщо `MSG` пропущено, дисплей буде очищено.

source: `RESPOND TYPE=echo_no_space MSG="<message>"`: echo the message prepended with `echo:` without a space between prefix and message, helpful for compatibility with some octoprint plugins that expect very specific formatting.
uk: `RESPOND TYPE=echo_no_space MSG="<message>"`: повторити повідомлення, до якого додано `echo:` без пробілу між префіксом і повідомленням, корисно для сумісності з деякими плагінами octoprint, які очікують дуже специфічного форматування.

source: The following command is available when a [mcp4018 config section](Config_Reference.md#mcp4018) is enabled.
uk: Наступна команда доступна, якщо ввімкнено [розділ конфігурації mcp4018](Config_Reference.md#mcp4018).

source: `SET_DIGIPOT DIGIPOT=config_name WIPER=<value>`: This command will change the current value of the digipot. This value should typically be between 0.0 and 1.0, unless a 'scale' is defined in the config. When 'scale' is defined, then this value should be between 0.0 and 'scale'.
uk: `SET_DIGIPOT DIGIPOT=config_name WIPER=<value>`: ця команда змінить поточне значення digipot. Зазвичай це значення має бути між 0,0 і 1,0, якщо в конфігурації не визначено «масштаб». Якщо визначено «масштаб», це значення має бути між 0,0 і «масштабом».

source: The print_stats module is automatically loaded.
uk: Модуль print_stats завантажується автоматично.

source: `SET_PRINT_STATS_INFO [TOTAL_LAYER=<total_layer_count>] [CURRENT_LAYER= <current_layer>]`: Pass slicer info like layer act and total to Klipper. Add `SET_PRINT_STATS_INFO [TOTAL_LAYER=<total_layer_count>]` to your slicer start gcode section and `SET_PRINT_STATS_INFO [CURRENT_LAYER= <current_layer>]` at the layer change gcode section to pass layer information from your slicer to Klipper.
uk: `SET_PRINT_STATS_INFO [TOTAL_LAYER=<total_layer_count>] [CURRENT_LAYER= <current_layer>]`: передавати інформацію про зріз, як-от дію шару та підсумок, до Klipper. Додайте `SET_PRINT_STATS_INFO [TOTAL_LAYER=<total_layer_count>]` до розділу gcode початку слайсера та `SET_PRINT_STATS_INFO [CURRENT_LAYER= <current_layer>]` до розділу gcode зміни шару, щоб передати інформацію про шар із вашого слайсера до Klipper.

source: The following commands are available when the [z_thermal_adjust config section](Config_Reference.md#z_thermal_adjust) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації z_thermal_adjust](Config_Reference.md#z_thermal_adjust).

source: `SET_Z_THERMAL_ADJUST [ENABLE=<0:1>] [TEMP_COEFF=<value>] [REF_TEMP=<value>]`: Enable or disable the Z thermal adjustment with `ENABLE`. Disabling does not remove any adjustment already applied, but will freeze the current adjustment value - this prevents potentially unsafe downward Z movement. Re-enabling can potentially cause upward tool movement as the adjustment is updated and applied. `TEMP_COEFF` allows run-time tuning of the adjustment temperature coefficient (i.e. the `TEMP_COEFF` config parameter). `TEMP_COEFF` values are not saved to the config. `REF_TEMP` manually overrides the reference temperature typically set during homing (for use in e.g. non-standard homing routines) - will be reset automatically upon homing.
uk: `SET_Z_THERMAL_ADJUST [ENABLE=<0:1>] [TEMP_COEFF=<значення>] [REF_TEMP=<значення>]`: увімкнути або вимкнути температурне регулювання Z за допомогою `ENABLE`. Вимкнення не видаляє будь-які вже застосовані коригування, але призведе до заморожування поточного значення коригування - це запобігає потенційно небезпечному руху вниз по Z. Повторне ввімкнення потенційно може призвести до переміщення інструмента вгору під час оновлення та застосування коригування. `TEMP_COEFF` дозволяє налаштовувати температурний коефіцієнт налаштування під час виконання (тобто параметр конфігурації `TEMP_COEFF`). Значення `TEMP_COEFF` не зберігаються в конфігурації. `REF_TEMP` вручну змінює еталонну температуру, яка зазвичай встановлюється під час повернення до початкової точки (для використання, наприклад, у нестандартних процедурах повернення до початкової точки) – буде скинуто автоматично після повернення до початкової точки.

source: Arc Move Clockwise (G2), Arc Move Counter-clockwise (G3): `G2|G3 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<speed>] I<value> J<value>|I<value> K<value>|J<value> K<value>`
uk: Переміщення дуги за годинниковою стрілкою (G2), переміщення дуги проти годинникової стрілки (G3): `G2|G3 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<швидкість>] I<значення> J<значення>|I<значення> K<значення>|J<значення> K<значення>`

source: Arc Plane Select: G17 (XY plane), G18 (XZ plane), G19 (YZ plane)
uk: Вибір площини дуги: G17 (площина XY), G18 (площина XZ), G19 (площина YZ)

source: `BED_TILT_CALIBRATE [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will probe the points specified in the config and then recommend updated x and y tilt adjustments. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
uk: `BED_TILT_CALIBRATE [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: ця команда перевірить точки, указані в конфігурації, а потім порекомендує оновлені налаштування нахилу x і y. Дивіться команду PROBE, щоб дізнатися про додаткові параметри зонду. Якщо вказано METHOD=manual, інструмент ручного тестування активовано - дивіться команду MANUAL_PROBE вище, щоб дізнатися більше про додаткові команди, доступні, коли цей інструмент активний. Додаткове значення `HORIZONTAL_MOVE_Z` замінює параметр `horizontal_move_z`, указаний у файлі конфігурації.

source: `DELTA_CALIBRATE [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will probe seven points on the bed and recommend updated endstop positions, tower angles, and radius. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
uk: `DELTA_CALIBRATE [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: ця команда перевірить сім точок на станині та рекомендує оновлені положення кінцевих упорів, кути башти та радіус. Дивіться команду PROBE, щоб дізнатися про додаткові параметри зонду. Якщо вказано METHOD=manual, інструмент ручного тестування активовано - дивіться команду MANUAL_PROBE вище, щоб дізнатися більше про додаткові команди, доступні, коли цей інструмент активний. Додаткове значення `HORIZONTAL_MOVE_Z` замінює параметр `horizontal_move_z`, указаний у файлі конфігурації.

source: `SCREWS_TILT_CALCULATE [DIRECTION=CW|CCW] [MAX_DEVIATION=<value>] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will invoke the bed screws adjustment tool. It will command the nozzle to different locations (as defined in the config file) probing the z height and calculate the number of knob turns to adjust the bed level. If DIRECTION is specified, the knob turns will all be in the same direction, clockwise (CW) or counterclockwise (CCW). See the PROBE command for details on the optional probe parameters. IMPORTANT: You MUST always do a G28 before using this command. If MAX_DEVIATION is specified, the command will raise a gcode error if any difference in the screw height relative to the base screw height is greater than the value provided. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
uk: `SCREWS_TILT_CALCULATE [DIRECTION=CW|CCW] [MAX_DEVIATION=<value>] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: Ця команда викличе інструмент регулювання кріпильних гвинтів. Він надсилатиме команди насадці в різні місця (як визначено у конфігураційному файлі), досліджуючи висоту z і обчислюючи кількість обертів ручки для регулювання рівня ліжка. Якщо вказано DIRECTION, обертання ручки відбуватиметься в одному напрямку, за годинниковою стрілкою (CW) або проти годинникової стрілки (CCW). Дивіться команду PROBE, щоб дізнатися про додаткові параметри зонду. ВАЖЛИВО: Ви ПОВИННІ завжди виконувати G28 перед використанням цієї команди. Якщо вказано MAX_DEVIATION, команда викличе помилку gcode, якщо будь-яка різниця у висоті гвинта відносно висоти базового гвинта перевищує вказане значення. Додаткове значення `HORIZONTAL_MOVE_Z` замінює параметр `horizontal_move_z`, указаний у файлі конфігурації.

source: `DUMP_TMC STEPPER=<name> [REGISTER=<name>]`: This command will read all TMC driver registers and report their values. If a REGISTER is provided, only the specified register will be dumped.
uk: `DUMP_TMC STEPPER=<ім'я> [REGISTER=<ім'я>]`: ця команда читатиме всі регістри драйверів TMC і повідомлятиме їхні значення. Якщо надано REGISTER, буде створено лише вказаний реєстр.

source: `SET_TMC_CURRENT STEPPER=<name> CURRENT=<amps> HOLDCURRENT=<amps>`: This will adjust the run and hold currents of the TMC driver. `HOLDCURRENT` is not applicable to tmc2660 drivers. When used on a driver which has the `globalscaler` field (tmc5160 and tmc2240), if StealthChop2 is used, the stepper must be held at standstill for >130ms so that the driver executes the AT#1 calibration.
uk: `SET_TMC_CURRENT STEPPER=<name> CURRENT=<amps> HOLDCURRENT=<amps>`: це регулює струми запуску та утримання драйвера TMC. `HOLDCURRENT` не застосовується до драйверів tmc2660. Якщо використовується на драйвері, який має поле `globalscaler` (tmc5160 і tmc2240), якщо використовується StealthChop2, кроковий кроковий механізм потрібно утримувати в стані зупинки понад 130 мс, щоб драйвер виконав калібрування AT#1.

source: `SET_TMC_FIELD STEPPER=<name> FIELD=<field> VALUE=<value> VELOCITY=<value>`: This will alter the value of the specified register field of the TMC driver. This command is intended for low-level diagnostics and debugging only because changing the fields during run-time can lead to undesired and potentially dangerous behavior of your printer. Permanent changes should be made using the printer configuration file instead. No sanity checks are performed for the given values. A VELOCITY can also be specified instead of a VALUE. This velocity is converted to the 20bit TSTEP based value representation. Only use the VELOCITY argument for fields that represent velocities.
uk: `SET_TMC_FIELD STEPPER=<ім'я> FIELD=<поле> VALUE=<значення> VELOCITY=<значення>`: це змінить значення вказаного поля реєстру драйвера TMC. Ця команда призначена лише для низькорівневої діагностики та налагодження, оскільки зміна полів під час виконання може призвести до небажаної та потенційно небезпечної поведінки вашого принтера. Натомість постійні зміни слід вносити за допомогою файлу конфігурації принтера. Для наведених значень перевірки на працездатність не виконуються. Замість VALUE також можна вказати VELOCITY. Ця швидкість перетворюється на 20-бітне представлення значення на основі TSTEP. Використовуйте аргумент ШВИДКІСТЬ лише для полів, які представляють швидкості.

source: `Z_TILT_ADJUST [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will probe the points specified in the config and then make independent adjustments to each Z stepper to compensate for tilt. See the PROBE command for details on the optional probe parameters. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
uk: `Z_TILT_ADJUST [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: ця команда перевірить точки, зазначені в конфігурації, а потім здійснить незалежне коригування кожного кроку Z для компенсації нахилу. Дивіться команду PROBE, щоб дізнатися про додаткові параметри зонду. Додаткове значення `HORIZONTAL_MOVE_Z` замінює параметр `horizontal_move_z`, указаний у файлі конфігурації.

source: `SET_DUAL_CARRIAGE CARRIAGE=[0|1] [MODE=[PRIMARY|COPY|MIRROR]]`: This command will change the mode of the specified carriage. If no `MODE` is provided it defaults to `PRIMARY`. Setting the mode to `PRIMARY` deactivates the other carriage and makes the specified carriage execute subsequent G-Code commands as-is. `COPY` and `MIRROR` modes are supported only for `CARRIAGE=1`. When set to either of these modes, carriage 1 will then track the subsequent moves of the carriage 0 and either copy relative movements of it (in `COPY` mode) or execute them in the opposite (mirror) direction (in `MIRROR` mode).
uk: `SET_DUAL_CARRIAGE CARRIAGE=[0|1] [MODE=[PRIMARY|COPY|MIRROR]]`: Ця команда змінить режим вказаної каретки. Якщо `РЕЖИМ` не вказано, за замовчуванням буде `ПЕРВИННИЙ`. Встановлення режиму на `PRIMARY` дезактивує іншу каретку та змушує вказану каретку виконувати наступні команди G-коду як є. Режими `COPY` і `MIRROR` підтримуються лише для `CARRIAGE=1`. Якщо встановлено будь-який із цих режимів, каретка 1 відстежуватиме подальші переміщення каретки 0 і або копіюватиме її відносні рухи (у режимі `COPY`), або виконуватиме їх у протилежному (дзеркальному) напрямку (у режимі `MIRROR`). ).

source: `SAVE_DUAL_CARRIAGE_STATE [NAME=<state_name>]`: Save the current positions of the dual carriages and their modes. Saving and restoring DUAL_CARRIAGE state can be useful in scripts and macros, as well as in homing routine overrides. If NAME is provided it allows one to name the saved state to the given string. If NAME is not provided it defaults to "default".
uk: `SAVE_DUAL_CARRIAGE_STATE [NAME=<state_name>]`: Збереження поточних позицій подвійних кареток і їх режимів. Збереження та відновлення стану DUAL_CARRIAGE може бути корисним у сценаріях і макросах, а також у перевизначеннях процедур повернення до початкового місця. Якщо вказано NAME, це дозволяє назвати збережений стан у заданому рядку. Якщо NAME не вказано, за замовчуванням використовується значення "default".

source: `RESTORE_DUAL_CARRIAGE_STATE [NAME=<state_name>] [MOVE=[0|1] [MOVE_SPEED=<speed>]]`: Restore the previously saved positions of the dual carriages and their modes, unless "MOVE=0" is specified, in which case only the saved modes will be restored, but not the positions of the carriages. If positions are being restored and "MOVE_SPEED" is specified, then the toolhead moves will be performed with the given speed (in mm/s); otherwise the toolhead move will use the rail homing speed. Note that the carriages restore their positions only over their own axis, which may be necessary to correctly restore COPY and MIRROR mode of the dual carraige.
uk: `RESTORE_DUAL_CARRIAGE_STATE [NAME=<state_name>] [MOVE=[0|1] [MOVE_SPEED=<speed>]]`: відновити попередньо збережені позиції подвійних кареток та їхні режими, якщо не вказано «MOVE=0» у цьому випадку будуть відновлені лише збережені режими, але не положення кареток. Якщо позиції відновлюються і вказано "MOVE_SPEED", то переміщення інструментальної головки виконуватимуться із заданою швидкістю (у мм/с); інакше переміщення інструментальної головки використовуватиме швидкість наведення рейки. Зауважте, що каретки відновлюють свої позиції лише над власною віссю, що може знадобитися для правильного відновлення режимів КОПІЮВАННЯ та ДЗЕРКАЛЬНОГО відображення подвійної каретки.

source: `SHAPER_CALIBRATE [AXIS=<axis>] [NAME=<name>] [FREQ_START=<min_freq>] [FREQ_END=<max_freq>] [HZ_PER_SEC=<hz_per_sec>] [CHIPS=<adxl345_chip_name>] [MAX_SMOOTHING=<max_smoothing>]`: Similarly to `TEST_RESONANCES`, runs the resonance test as configured, and tries to find the optimal parameters for the input shaper for the requested axis (or both X and Y axes if `AXIS` parameter is unset). If `MAX_SMOOTHING` is unset, its value is taken from `[resonance_tester]` section, with the default being unset. See the [Max smoothing](Measuring_Resonances.md#max-smoothing) of the measuring resonances guide for more information on the use of this feature. The results of the tuning are printed to the console, and the frequency responses and the different input shapers values are written to a CSV file(s) `/tmp/calibration_data_<axis>_<name>.csv`. Unless specified, NAME defaults to the current time in "YYYYMMDD_HHMMSS" format. Note that the suggested input shaper parameters can be persisted in the config by issuing `SAVE_CONFIG` command, and if `[input_shaper]` was already enabled previously, these parameters take effect immediately.
uk: `SHAPER_CALIBRATE [AXIS=<axis>] [NAME=<name>] [FREQ_START=<min_freq>] [FREQ_END=<max_freq>] [HZ_PER_SEC=<hz_per_sec>] [CHIPS=<adxl345_chip_name>] [MAX_SMOOTHING=<max_smoothing> ]`: подібно до `TEST_RESONANCES`, запускає перевірку резонансу, як налаштовано, і намагається знайти оптимальні параметри для формувача вхідних даних для запитуваної осі (або обох осей X і Y, якщо параметр `AXIS` не встановлено). Якщо `MAX_SMOOTHING` не встановлено, його значення береться з розділу `[resonance_tester]`, а значення за замовчуванням не встановлено. Див. [Максимальне згладжування](Measuring_Resonances.md#max-smoothing) посібника з вимірювання резонансів, щоб дізнатися більше про використання цієї функції. Результати налаштування друкуються на консолі, а частотні характеристики та різні значення формувачів вхідних даних записуються у файл(и) CSV `/tmp/calibration_data_<axis>_<name>.csv`. Якщо не вказано, NAME за умовчанням використовує поточний час у форматі "РРРРММДД_ГГММСС". Зверніть увагу, що запропоновані параметри формувача вводу можна зберегти в конфігурації, виконавши команду`SAVE_CONFIG`, і якщо `[input_shaper]` було вже ввімкнено раніше, ці параметри набувають чинності негайно.

source: The following commands are available when the [axis_twist_compensation config section](Config_Reference.md#axis_twist_compensation) is enabled.
uk: Наступні команди доступні, якщо ввімкнено [розділ конфігурації axis_twist_compensation](Config_Reference.md#axis_twist_compensation).

source: `AXIS_TWIST_COMPENSATION_CALIBRATE [SAMPLE_COUNT=<value>]`: Initiates the X twist calibration wizard. `SAMPLE_COUNT` specifies the number of points along the X axis to calibrate at and defaults to 3.
uk: `AXIS_TWIST_COMPENSATION_CALIBRATE [SAMPLE_COUNT=<value>]`: запускає майстер калібрування повороту X. `SAMPLE_COUNT' визначає кількість точок уздовж осі X для калібрування та за умовчанням дорівнює 3.
