Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/G-Codes.po
Languages: uk

source: This document describes the commands that Klipper supports. These are commands that one may enter into the OctoPrint terminal tab.
uk: Цей документ описує команди які підтримує Klipper. Це команди які ви можете ввести у вікні терміналу OctoPrint.

source: G-Code commands
uk: Команди G-коду

source: Klipper supports the following standard G-Code commands:
uk: Klipper підтримує такі стандартні команди G-коду:

source: Move (G0 or G1): `G1 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<speed>]`
uk: Переміщення (G0 або G1): `G1 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<швидкість>]`

source: Dwell: `G4 P<milliseconds>`
uk: Затримка: `G4 P<мілісекунди>`

source: Move to origin: `G28 [X] [Y] [Z]`
uk: Перейти до початку: `G28 [X] [Y] [Z]`

source: Turn off motors: `M18` or `M84`
uk: Вимкніть двигуни: `M18` або `M84`

source: Wait for current moves to finish: `M400`
uk: Зачекайте, поки завершаться поточні ходи: `M400`

source: Use absolute/relative distances for extrusion: `M82`, `M83`
uk: Використовуйте абсолютні/відносні відстані для екструзії: `M82`, `M83`

source: Use absolute/relative coordinates: `G90`, `G91`
uk: Використовуйте абсолютні/відносні координати: `G90`, `G91`

source: Set position: `G92 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>]`
uk: Установити позицію: `G92 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>]`

source: Set speed factor override percentage: `M220 S<percent>`
uk: Установіть відсоток перевизначення коефіцієнта швидкості: `M220 S<percent>`

source: Set extrude factor override percentage: `M221 S<percent>`
uk: Установіть відсоток перевизначення коефіцієнта екструдування: `M221 S<percent>`

source: Set acceleration: `M204 S<value>` OR `M204 P<value> T<value>`
uk: Установити прискорення: `M204 S<value>` АБО `M204 P<value> T<value>`

source: Note: If S is not specified and both P and T are specified, then the acceleration is set to the minimum of P and T. If only one of P or T is specified, the command has no effect.
uk: Примітка: якщо S не вказано, а вказано як P, так і T, тоді для прискорення встановлюється мінімальне значення P і T. Якщо вказано лише одне з P або T, команда не має ефекту.

source: Get extruder temperature: `M105`
uk: Отримайте температуру екструдера: "M105".

source: Set extruder temperature: `M104 [T<index>] [S<temperature>]`
uk: Встановіть температуру екструдера: `M104 [T<index>] [S<temperature>]`

source: Set extruder temperature and wait: `M109 [T<index>] S<temperature>`
uk: Встановіть температуру екструдера та зачекайте: `M109 [T<index>] S<temperature>`

source: Note: M109 always waits for temperature to settle at requested value
uk: Примітка: M109 завжди чекає, поки температура досягне заданого значення

source: Set bed temperature: `M140 [S<temperature>]`
uk: Встановлена температура шару: `M140 [S<temperature>]`

source: Set bed temperature and wait: `M190 S<temperature>`
uk: Встановіть температуру ліжка та зачекайте: `M190 S<температура>`

source: Note: M190 always waits for temperature to settle at requested value
uk: Примітка: M190 завжди чекає, поки температура досягне потрібного значення

source: Set fan speed: `M106 S<value>`
uk: Встановіть швидкість вентилятора: `M106 S<value>`

source: Turn fan off: `M107`
uk: Вимкніть вентилятор: `M107`

source: Emergency stop: `M112`
uk: Аварійна зупинка: `М112`

source: Get current position: `M114`
uk: Отримати поточну позицію: `M114`

source: Get firmware version: `M115`
uk: Отримати версію мікропрограми: `M115`

source: For further details on the above commands see the [RepRap G-Code documentation](http://reprap.org/wiki/G-code).
uk: Щоб отримати додаткові відомості про команди вище, перегляньте [документацію G-коду RepRap](http://reprap.org/wiki/G-code).

source: If one requires a less common G-Code command then it may be possible to implement it with a custom [gcode_macro config section](Config_Reference.md#gcode_macro). For example, one might use this to implement: `G12`, `G29`, `G30`, `G31`, `M42`, `M80`, `M81`, `T1`, etc.
uk: Якщо вам потрібна менш поширена команда G-Code, її можна реалізувати за допомогою спеціального [gcode_macro конфігураційного розділу](Config_Reference.md#gcode_macro). Наприклад, це можна використовувати для реалізації: `G12`, `G29`, `G30`, `G31`, `M42`, `M80`, `M81`, `T1` тощо.

source: List SD card: `M20`
uk: Список SD-карт: `M20`

source: Initialize SD card: `M21`
uk: Ініціалізація SD-карти: `M21`

source: Select SD file: `M23 <filename>`
uk: Виберіть файл SD: `M23 <filename>`

source: Start/resume SD print: `M24`
uk: Початок/відновлення друку SD: `M24`

source: Pause SD print: `M25`
uk: Призупинити друк SD: `M25`

source: Set SD position: `M26 S<offset>`
uk: Установіть позицію SD: `M26 S<offset>`

source: Report SD print status: `M27`
uk: Повідомити про стан друку SD: `M27`

source: The following standard G-Code commands are available if a [gcode_arcs config section](Config_Reference.md#gcode_arcs) is enabled:
uk: Наступні стандартні команди G-Code доступні, якщо ввімкнено [розділ конфігурації gcode_arcs](Config_Reference.md#gcode_arcs):

source: Display Message: `M117 <message>`
uk: Відображення повідомлення: `M117 <повідомлення>`

source: Set build percentage: `M73 P<percent>`
uk: Встановити відсоток збірки: `M73 P<percent>`

source: Get Endstop Status: `M119` (Use QUERY_ENDSTOPS instead.)
uk: Отримати статус кінцевої зупинки: `M119` (використовуйте замість цього QUERY_ENDSTOPS.)

source: Klipper uses "extended" G-Code commands for general configuration and status. These extended commands all follow a similar format - they start with a command name and may be followed by one or more parameters. For example: `SET_SERVO SERVO=myservo ANGLE=5.3`. In this document, the commands and parameters are shown in uppercase, however they are not case sensitive. (So, "SET_SERVO" and "set_servo" both run the same command.)
uk: Klipper використовує "розширені" команди G-коду для загальної конфігурації та стану. Усі ці розширені команди мають схожий формат — вони починаються з назви команди та можуть супроводжуватися одним або кількома параметрами. Наприклад: `SET_SERVO SERVO=myservo ANGLE=5.3`. У цьому документі команди та параметри наведено великими літерами, однак вони не чутливі до регістру. (Отже, "SET_SERVO" і "set_servo" запускають ту саму команду.)

source: `QUERY_ENDSTOPS`: Probe the axis endstops and report if they are "triggered" or in an "open" state. This command is typically used to verify that an endstop is working correctly.
uk: `QUERY_ENDSTOPS`: перевірте кінцеві упори осі та повідомте, чи вони "спрацьовані" чи перебувають у "відкритому" стані. Ця команда зазвичай використовується для перевірки правильності роботи кінцевого упору.

source: `QUERY_ADC [NAME=<config_name>] [PULLUP=<value>]`: Report the last analog value received for a configured analog pin. If NAME is not provided, the list of available adc names are reported. If PULLUP is provided (as a value in Ohms), the raw analog value along with the equivalent resistance given that pullup is reported.
uk: `QUERY_ADC [NAME=<config_name>] [PULLUP=<value>]`: звіт про останнє отримане аналогове значення для налаштованого аналогового контакту. Якщо NAME не вказано, повідомляється список доступних імен adc. Якщо надається PULLUP (як значення в Омах), повідомляється необроблене аналогове значення разом із еквівалентним опором, враховуючи, що підтягування.

source: `SET_GCODE_OFFSET [X=<pos>|X_ADJUST=<adjust>] [Y=<pos>|Y_ADJUST=<adjust>] [Z=<pos>|Z_ADJUST=<adjust>] [MOVE=1 [MOVE_SPEED=<speed>]]`: Set a positional offset to apply to future G-Code commands. This is commonly used to virtually change the Z bed offset or to set nozzle XY offsets when switching extruders. For example, if "SET_GCODE_OFFSET Z=0.2" is sent, then future G-Code moves will have 0.2mm added to their Z height. If the X_ADJUST style parameters are used, then the adjustment will be added to any existing offset (eg, "SET_GCODE_OFFSET Z=-0.2" followed by "SET_GCODE_OFFSET Z_ADJUST=0.3" would result in a total Z offset of 0.1). If "MOVE=1" is specified then a toolhead move will be issued to apply the given offset (otherwise the offset will take effect on the next absolute G-Code move that specifies the given axis). If "MOVE_SPEED" is specified then the toolhead move will be performed with the given speed (in mm/s); otherwise the toolhead move will use the last specified G-Code speed.
uk: `SET_GCODE_OFFSET [X=<pos>|X_ADJUST=<adjust>] [Y=<pos>|Y_ADJUST=<adjust>] [Z=<pos>|Z_ADJUST=<adjust>] [MOVE=1 [MOVE_SPEED=<speed >]]`: установіть позиційне зміщення для застосування до майбутніх команд G-коду. Це зазвичай використовується для віртуальної зміни зміщення шару Z або для встановлення зсуву сопла XY під час перемикання екструдерів. Наприклад, якщо надіслано "SET_GCODE_OFFSET Z=0,2", то майбутні переміщення G-коду матимуть 0,2 мм до їх висоти Z. Якщо використовуються параметри стилю X_ADJUST, тоді коригування буде додано до будь-якого існуючого зміщення (наприклад, «SET_GCODE_OFFSET Z=-0,2», а потім «SET_GCODE_OFFSET Z_ADJUST=0,3» призведе до загального зміщення Z, що дорівнює 0,1). Якщо вказано «MOVE=1», буде виконано переміщення інструментальної головки для застосування заданого зміщення (інакше зміщення набуде чинності під час наступного абсолютного переміщення G-коду, що визначає дану вісь). Якщо вказано "MOVE_SPEED", то переміщення інструментальної головки виконуватиметься із заданою швидкістю (у мм/с); інакше для переміщення інструментальної головки використовуватиметься остання задана швидкість G-коду.

source: `SAVE_GCODE_STATE [NAME=<state_name>]`: Save the current g-code coordinate parsing state. Saving and restoring the g-code state is useful in scripts and macros. This command saves the current g-code absolute coordinate mode (G90/G91), absolute extrude mode (M82/M83), origin (G92), offset (SET_GCODE_OFFSET), speed override (M220), extruder override (M221), move speed, current XYZ position, and relative extruder "E" position. If NAME is provided it allows one to name the saved state to the given string. If NAME is not provided it defaults to "default".
uk: `SAVE_GCODE_STATE [NAME=<state_name>]`: зберегти поточний стан аналізу координат g-коду. Збереження та відновлення стану g-коду корисно в сценаріях і макросах. Ця команда зберігає поточний режим абсолютних координат g-коду (G90/G91), абсолютний режим екструдування (M82/M83), початок (G92), зміщення (SET_GCODE_OFFSET), перевизначення швидкості (M220), перевизначення екструдера (M221), швидкість переміщення , поточне положення XYZ і відносне положення екструдера "E". Якщо вказано NAME, це дозволяє назвати збережений стан у заданому рядку. Якщо NAME не вказано, за замовчуванням використовується значення "default".

source: `RESTORE_GCODE_STATE [NAME=<state_name>] [MOVE=1 [MOVE_SPEED=<speed>]]`: Restore a state previously saved via SAVE_GCODE_STATE. If "MOVE=1" is specified then a toolhead move will be issued to move back to the previous XYZ position. If "MOVE_SPEED" is specified then the toolhead move will be performed with the given speed (in mm/s); otherwise the toolhead move will use the restored g-code speed.
uk: `RESTORE_GCODE_STATE [NAME=<ім'я_стану>] [MOVE=1 [MOVE_SPEED=<швидкість>]]`: відновити стан, попередньо збережений за допомогою SAVE_GCODE_STATE. Якщо вказано "MOVE=1", буде виконано переміщення інструментальної головки для повернення до попередньої позиції XYZ. Якщо вказано "MOVE_SPEED", то переміщення інструментальної головки виконуватиметься із заданою швидкістю (у мм/с); інакше переміщення інструментальної головки використовуватиме відновлену швидкість g-коду.

source: `PID_CALIBRATE HEATER=<config_name> TARGET=<temperature> [WRITE_FILE=1]`: Perform a PID calibration test. The specified heater will be enabled until the specified target temperature is reached, and then the heater will be turned off and on for several cycles. If the WRITE_FILE parameter is enabled, then the file /tmp/heattest.txt will be created with a log of all temperature samples taken during the test.
uk: `PID_CALIBRATE HEATER=<config_name> TARGET=<temperature> [WRITE_FILE=1]`: Виконайте тест калібрування PID. Зазначений нагрівач буде ввімкнено, доки не буде досягнуто вказану цільову температуру, а потім нагрівач вимкнеться та ввімкнеться на кілька циклів. Якщо ввімкнути параметр WRITE_FILE, буде створено файл /tmp/heattest.txt із журналом усіх зразків температури, взятих під час тесту.

source: `TURN_OFF_HEATERS`: Turn off all heaters.
uk: `TURN_OFF_HEATERS`: Вимкнути всі обігрівачі.

source: `TEMPERATURE_WAIT SENSOR=<config_name> [MINIMUM=<target>] [MAXIMUM=<target>]`: Wait until the given temperature sensor is at or above the supplied MINIMUM and/or at or below the supplied MAXIMUM.
uk: `TEMPERATURE_WAIT SENSOR=<config_name> [MINIMUM=<target>] [MAXIMUM=<target>]`: зачекайте, доки даний датчик температури не досягне або перевищить вказане МІНІМАЛЬНЕ значення та/або досягне або буде нижче заданого МАКСИМУМУ.

source: `SET_HEATER_TEMPERATURE HEATER=<heater_name> [TARGET=<target_temperature>]`: Sets the target temperature for a heater. If a target temperature is not supplied, the target is 0.
uk: `SET_HEATER_TEMPERATURE HEATER=<heater_name> [TARGET=<target_temperature>]`: встановлює цільову температуру для обігрівача. Якщо цільова температура не вказана, цільове значення дорівнює 0.

source: `SET_STEPPER_ENABLE STEPPER=<config_name> ENABLE=[0|1]`: Enable or disable only the given stepper. This is a diagnostic and debugging tool and must be used with care. Disabling an axis motor does not reset the homing information. Manually moving a disabled stepper may cause the machine to operate the motor outside of safe limits. This can lead to damage to axis components, hot ends, and print surface.
uk: `SET_STEPPER_ENABLE STEPPER=<config_name> ENABLE=[0|1]`: увімкнути або вимкнути лише вказаний степер. Це інструмент діагностики та налагодження, яким слід користуватися обережно. Вимкнення двигуна осі не скидає інформацію про вихід. Ручне переміщення вимкненого степера може призвести до того, що машина працюватиме двигуном поза безпечними межами. Це може призвести до пошкодження компонентів осі, гарячих кінців і поверхні друку.

source: `STEPPER_BUZZ STEPPER=<config_name>`: Move the given stepper forward one mm and then backward one mm, repeated 10 times. This is a diagnostic tool to help verify stepper connectivity.
uk: `STEPPER_BUZZ STEPPER=<config_name>`: перемістіть заданий степпер на один мм вперед, а потім на один мм назад, повторюючи 10 разів. Це діагностичний інструмент, який допомагає перевірити підключення крокового кроку.

source: `MANUAL_PROBE [SPEED=<speed>]`: Run a helper script useful for measuring the height of the nozzle at a given location. If SPEED is specified, it sets the speed of TESTZ commands (the default is 5mm/s). During a manual probe, the following additional commands are available:
uk: `MANUAL_PROBE [SPEED=<швидкість>]`: запустіть допоміжний сценарій, корисний для вимірювання висоти сопла в заданому місці. Якщо вказано SPEED, він встановлює швидкість команд TESTZ (за замовчуванням 5 мм/с). Під час ручного тестування доступні такі додаткові команди:

source: `ACCEPT`: This command accepts the current Z position and concludes the manual probing tool.
uk: `ACCEPT`: Ця команда приймає поточну позицію Z і завершує ручний інструмент зондування.

source: `ABORT`: This command terminates the manual probing tool.
uk: `ABORT`: ця команда завершує роботу інструменту ручного зондування.

source: `TESTZ Z=<value>`: This command moves the nozzle up or down by the amount specified in "value". For example, `TESTZ Z=-.1` would move the nozzle down .1mm while `TESTZ Z=.1` would move the nozzle up .1mm. The value may also be `+`, `-`, `++`, or `--` to move the nozzle up or down an amount relative to previous attempts.
uk: `TESTZ Z=<value>`: ця команда переміщує сопло вгору або вниз на величину, указану в «value». Наприклад, `TESTZ Z=-,1` перемістить сопло вниз на 0,1 мм, тоді як `TESTZ Z=,1` перемістить сопло вгору на 0,1 мм. Значення також може бути `+`, `-`, `++` або `--`, щоб перемістити сопло вгору або вниз на величину відносно попередніх спроб.

source: `Z_ENDSTOP_CALIBRATE [SPEED=<speed>]`: Run a helper script useful for calibrating a Z position_endstop config setting. See the MANUAL_PROBE command for details on the parameters and the additional commands available while the tool is active.
uk: `Z_ENDSTOP_CALIBRATE [SPEED=<швидкість>]`: запустіть допоміжний сценарій, корисний для калібрування параметра конфігурації Z position_endstop. Перегляньте команду MANUAL_PROBE, щоб дізнатися більше про параметри та додаткові команди, доступні, коли інструмент активний.

source: `SET_DISPLAY_GROUP [DISPLAY=<display>] GROUP=<group>`: Set the active display group of an lcd display. This allows to define multiple display data groups in the config, e.g. `[display_data <group> <elementname>]` and switch between them using this extended gcode command. If DISPLAY is not specified it defaults to "display" (the primary display).
uk: `SET_DISPLAY_GROUP [DISPLAY=<дисплей>] GROUP=<група>`: установіть активну групу відображення РК-дисплея. Це дозволяє визначити декілька груп відображення даних у конфігурації, напр. `[display_data <group> <elementname>]` і перемикатися між ними за допомогою цієї розширеної команди gcode. Якщо DISPLAY не вказано, за замовчуванням буде «display» (основний дисплей).

source: `SET_IDLE_TIMEOUT [TIMEOUT=<timeout>]`: Allows the user to set the idle timeout (in seconds).
uk: `SET_IDLE_TIMEOUT [TIMEOUT=<timeout>]`: дозволяє користувачеві встановлювати час простою (у секундах).

source: `RESTART`: This will cause the host software to reload its config and perform an internal reset. This command will not clear error state from the micro-controller (see FIRMWARE_RESTART) nor will it load new software (see [the FAQ](FAQ.md#how-do-i-upgrade-to-the-latest-software)).
uk: `ПЕРЕЗАПУСК`: це змусить програмне забезпечення хоста перезавантажити свою конфігурацію та виконати внутрішнє скидання. Ця команда не видалить стан помилки з мікроконтролера (див. FIRMWARE_RESTART), а також не завантажить нове програмне забезпечення (див. [FAQ](FAQ.md#how-do-i-upgrade-to-the-latest-software)).

source: `FIRMWARE_RESTART`: This is similar to a RESTART command, but it also clears any error state from the micro-controller.
uk: `FIRMWARE_RESTART`: це схоже на команду RESTART, але також очищає будь-який стан помилки мікроконтролера.

source: `SAVE_CONFIG`: This command will overwrite the main printer config file and restart the host software. This command is used in conjunction with other calibration commands to store the results of calibration tests.
uk: `SAVE_CONFIG`: ця команда перезапише основний файл конфігурації принтера та перезапустить програмне забезпечення хоста. Ця команда використовується в поєднанні з іншими командами калібрування для збереження результатів калібрувальних тестів.

source: `STATUS`: Report the Klipper host software status.
uk: `СТАТУС`: звіт про статус програмного забезпечення хоста Klipper.

source: `HELP`: Report the list of available extended G-Code commands.
uk: `HELP`: звіт про список доступних розширених команд G-коду.

source: `SET_GCODE_VARIABLE MACRO=<macro_name> VARIABLE=<name> VALUE=<value>`: This command allows one to change the value of a gcode_macro variable at run-time. The provided VALUE is parsed as a Python literal.
uk: `SET_GCODE_VARIABLE MACRO=<назва_макросу> VARIABLE=<назва> VALUE=<значення>`: ця команда дозволяє змінювати значення змінної gcode_macro під час виконання. Надане VALUE аналізується як літерал Python.

source: `SET_SERVO SERVO=config_name [ANGLE=<degrees> | WIDTH=<seconds>]`: Set the servo position to the given angle (in degrees) or pulse width (in seconds). Use `WIDTH=0` to disable the servo output.
uk: `SET_SERVO SERVO=config_name [ANGLE=<градуси> | WIDTH=<seconds>]`: установіть позицію сервоприводу відповідно до заданого кута (у градусах) або ширини імпульсу (у секундах). Використовуйте `WIDTH=0`, щоб вимкнути вихід сервоприводу.

source: `MANUAL_STEPPER STEPPER=config_name [ENABLE=[0|1]] [SET_POSITION=<pos>] [SPEED=<speed>] [ACCEL=<accel>] [MOVE=<pos> [STOP_ON_ENDSTOP=[1|2|-1|-2]] [SYNC=0]]`: This command will alter the state of the stepper. Use the ENABLE parameter to enable/disable the stepper. Use the SET_POSITION parameter to force the stepper to think it is at the given position. Use the MOVE parameter to request a movement to the given position. If SPEED and/or ACCEL is specified then the given values will be used instead of the defaults specified in the config file. If an ACCEL of zero is specified then no acceleration will be performed. If STOP_ON_ENDSTOP=1 is specified then the move will end early should the endstop report as triggered (use STOP_ON_ENDSTOP=2 to complete the move without error even if the endstop does not trigger, use -1 or -2 to stop when the endstop reports not triggered). Normally future G-Code commands will be scheduled to run after the stepper move completes, however if a manual stepper move uses SYNC=0 then future G-Code movement commands may run in parallel with the stepper movement.
uk: `MANUAL_STEPPER STEPPER=назва_конфігурації [ENABLE=[0|1]] [SET_POSITION=<pos>] [SPEED=<швидкість>] [ACCEL=<accel>] [MOVE=<pos> [STOP_ON_ENDSTOP=[1|2|- 1|-2]] [SYNC=0]]`: ця команда змінить стан степера. Використовуйте параметр ENABLE, щоб увімкнути/вимкнути степпер. Використовуйте параметр SET_POSITION, щоб змусити степер вважати, що він знаходиться в заданій позиції. Використовуйте параметр MOVE, щоб запросити переміщення до заданої позиції. Якщо вказано SPEED та/або ACCEL, наведені значення використовуватимуться замість стандартних значень, указаних у файлі конфігурації. Якщо вказано нульове значення ACCEL, прискорення не виконуватиметься. Якщо вказано STOP_ON_ENDSTOP=1, переміщення завершиться раніше, якщо кінцева зупинка повідомить про спрацьовування (використовуйте STOP_ON_ENDSTOP=2, щоб завершити переміщення без помилок, навіть якщо кінцева зупинка не запускається, використовуйте -1 або -2, щоб зупинитися, коли кінцева зупинка не повідомляє спрацьовує). Зазвичай майбутні команди G-коду будуть заплановані для виконання після завершення крокового руху, однак якщо рух крокового кроку вручну використовує SYNC=0, майбутні команди руху G-коду можуть виконуватися паралельно з рухом крокового кроку.

source: `PROBE [PROBE_SPEED=<mm/s>] [LIFT_SPEED=<mm/s>] [SAMPLES=<count>] [SAMPLE_RETRACT_DIST=<mm>] [SAMPLES_TOLERANCE=<mm>] [SAMPLES_TOLERANCE_RETRIES=<count>] [SAMPLES_RESULT=median|average]`: Move the nozzle downwards until the probe triggers. If any of the optional parameters are provided they override their equivalent setting in the [probe config section](Config_Reference.md#probe).
uk: `PROBE [PROBE_SPEED=<мм/с>] [LIFT_SPEED=<мм/с>] [SAMPLES=<кількість>] [SAMPLE_RETRACT_DIST=<мм>] [SAMPLES_TOLERANCE=<мм>] [SAMPLES_TOLERANCE_RETRIES=<кількість>] [SAMPLES_RESULT=медіана|середнє]`: перемістіть сопло вниз, доки не спрацює датчик. Якщо надається будь-який із додаткових параметрів, вони замінюють еквівалентне налаштування в [розділі конфігурації зонда](Config_Reference.md#probe).

source: `QUERY_PROBE`: Report the current status of the probe ("triggered" or "open").
uk: `QUERY_PROBE`: Повідомити про поточний статус зонду ("запущений" або "відкритий").
