Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Kinematics.po
Languages: uk

source: Specifically, the code calculates what the velocity of each move would be if it were limited to this virtual "acceleration to deceleration" rate. In the above picture the dashed gray lines represent this virtual acceleration rate for the first move. If a move can not reach its full cruising speed using this virtual acceleration rate then its top speed is reduced to the maximum speed it could obtain at this virtual acceleration rate.
uk: Зокрема, код розраховує, що швидкість кожного руху буде обмежена цим віртуальним «прискоренням до декларації» швидкістю. У вищезгаданому малюнку сірі лінії відображають цей віртуальний рівень прискорення для першого ходу. Якщо переїзд не може досягти повної швидкості за допомогою цієї швидкості віртуального прискорення, то його швидкість зводиться до максимальної швидкості, вона може отримати при цьому швидкість віртуального прискорення.

source: For most moves the limit will be at or above the move's existing limits and no change in behavior is induced. For short zigzag moves, however, this limit reduces the top speed. Note that it does not change the actual acceleration within the move - the move continues to use the normal acceleration scheme up to its adjusted top-speed.
uk: Для більшості переміщення ліміту буде або над існуючими лімітами руху, а не зміною поведінки індукується. Для коротких зигзаг рухається, однак, цей ліміт зменшує швидкість вершини. Зауважте, що не змінює фактичний прискорення в ході руху - переміщення продовжує використовувати нормальну схему прискорення до її регулювання швидкості.
