Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: ru

source: The data can be processed later by the following scripts: `scripts/graph_accelerometer.py` and `scripts/calibrate_shaper.py`. Both of them accept one or several raw csv files as the input depending on the mode. The graph_accelerometer.py script supports several modes of operation:
ru: Полученные данные могут быть обработаны следующими скриптами: `scripts/graph_accelerometer.py` и `scripts/calibrate_shaper.py`. Оба они принимают на вход один или несколько необработанных csv-файлов в зависимости от режима. Скрипт graph_accelerometer.py поддерживает несколько режимов работы:

source: plotting raw accelerometer data (use `-r` parameter), only 1 input is supported;
ru: При построении графика необработанных данных акселерометра (используйте параметр `-r`), поддерживается только 1 вход;

source: plotting a frequency response (no extra parameters required), if multiple inputs are specified, the average frequency response is computed;
ru: построение частотной характеристики (дополнительные параметры не требуются), если задано несколько входов, вычисляется средняя частотная характеристика;

source: comparison of the frequency response between several inputs (use `-c` parameter); you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used);
ru: сравнение частотных характеристик между несколькими входами (используется параметр `-c`); вы можете дополнительно указать, какую ось акселерометра учитывать через параметр `-a x`, `-a y` или `-a z` (если он не указан, используется сумма колебаний по всем осям);

source: plotting the spectrogram (use `-s` parameter), only 1 input is supported; you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used).
ru: При построении спектрограммы (используется параметр `-s`) поддерживается только 1 вход; дополнительно можно указать, какую ось акселерометра учитывать через параметр `-a x`, `-a y` или `-a z` (если он не указан, используется сумма колебаний по всем осям).

source: Note that graph_accelerometer.py script supports only the raw_data\*.csv files and not resonances\*.csv or calibration_data\*.csv files.
ru: Обратите внимание, что скрипт graph_accelerometer.py поддерживает только файлы raw_data\*.csv, но не файлы resonances\*.csv или calibration_data\*.csv.

source: For example,
ru: Например,

source: will plot the comparison of several `/tmp/raw_data_x_*.csv` files for Z axis to `/tmp/resonances_x.png` file.
ru: построит график сравнения нескольких файлов `/tmp/raw_data_x_*.csv` для оси Z с файлом `/tmp/resonances_x.png`.

source: The shaper_calibrate.py script accepts 1 or several inputs and can run automatic tuning of the input shaper and suggest the best parameters that work well for all provided inputs. It prints the suggested parameters to the console, and can additionally generate the chart if `-o output.png` parameter is provided, or the CSV file if `-c output.csv` parameter is specified.
ru: Скрипт shaper_calibrate.py принимает 1 или несколько входных данных и может выполнить автоматическую настройку входного формирователя и предложить наилучшие параметры, которые хорошо работают для всех предоставленных входных данных. Он выводит предложенные параметры на консоль, а также может дополнительно сгенерировать график, если указан параметр `-o output.png`, или CSV-файл, если указан параметр `-c output.csv`.

source: Providing several inputs to shaper_calibrate.py script can be useful if running some advanced tuning of the input shapers, for example:
ru: Предоставление нескольких входов скрипту shaper_calibrate.py может быть полезно, например, при выполнении расширенной настройки входных шейперов:

source: Running `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (and `Y` axis) for a single axis twice on a bed slinger printer with the accelerometer attached to the toolhead the first time, and the accelerometer attached to the bed the second time in order to detect axes cross-resonances and attempt to cancel them with input shapers.
ru: Запуск `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (и оси `Y`) для одной оси дважды на принтере со станиной с акселерометром, прикрепленным к головке инструмента в первый раз, и акселерометром, прикрепленным к станине во второй раз, чтобы обнаружить кросс-резонансы осей и попытаться устранить их с помощью входных формирователей.

source: Running `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` twice on a bed slinger with a glass bed and a magnetic surfaces (which is lighter) to find the input shaper parameters that work well for any print surface configuration.
ru: Запустите `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` дважды на стропальщике со стеклянной и магнитной поверхностями (которая легче), чтобы найти входные параметры формирователя, которые хорошо работают для любой конфигурации поверхности печати.

source: Combining the resonance data from multiple test points.
ru: Объединение резонансных данных из нескольких точек тестирования.

source: Combining the resonance data from 2 axis (e.g. on a bed slinger printer to configure X-axis input_shaper from both X and Y axes resonances to cancel vibrations of the *bed* in case the nozzle 'catches' a print when moving in X axis direction).
ru: Комбинирование данных резонанса по двум осям (например, в принтере с продольным механизмом печати для настройки X-axis input_shaper на основе резонансов по осям X и Y для устранения вибраций *кровати* в случае, если сопло "ловит" печать при движении в направлении оси X).

source: Testing custom axes
ru: Тестирование пользовательских осей

source: `TEST_RESONANCES` command supports custom axes. While this is not really useful for input shaper calibration, it can be used to study printer resonances in-depth and to check, for example, belt tension.
ru: Команда `TEST_RESONANCES` поддерживает пользовательские оси. Хотя это не очень полезно для калибровки входного формирователя, ее можно использовать для углубленного изучения резонансов принтера и, например, для проверки натяжения ремня.

source: To check the belt tension on CoreXY printers, execute
ru: Чтобы проверить натяжение ремня на принтерах CoreXY, выполните команду

source: and use `graph_accelerometer.py` to process the generated files, e.g.
ru: и используйте `graph_accelerometer.py` для обработки сгенерированных файлов, например

source: which will generate `/tmp/resonances.png` comparing the resonances.
ru: который создаст файл `/tmp/resonances.png`, сравнивающий резонансы.

source: For Delta printers with the default tower placement (tower A ~= 210 degrees, B ~= 330 degrees, and C ~= 90 degrees), execute
ru: Для принтеров Delta с размещением башни по умолчанию (башня A ~= 210 градусов, B ~= 330 градусов и C ~= 90 градусов) выполните команду

source: and then use the same command
ru: а затем выполните ту же команду

source: to generate `/tmp/resonances.png` comparing the resonances.
ru: чтобы создать файл `/tmp/resonances.png`, сравнивающий резонансы.

source: The raw data can also be obtained by running the command `ACCELEROMETER_MEASURE` command twice during some normal printer activity - first to start the measurements, and then to stop them and write the output file. Refer to [G-Codes](G-Codes.md#adxl345) for more details.
ru: Необработанные данные можно также получить, выполнив команду `ACCELEROMETER_MEASURE` дважды во время обычной работы принтера - сначала для запуска измерений, а затем для их остановки и записи выходного файла. Более подробную информацию см. в [G-Codes](G-Codes.md#adxl345).

source: Note that resonance measurements and shaper auto-calibration require additional software dependencies not installed by default. First, run on your Raspberry Pi the following commands:
ru: Обратите внимание, что для измерения резонанса и автоматической калибровки шейпера требуются дополнительные программные зависимости, не установленные по умолчанию. Сначала выполните на вашем Raspberry Pi следующие команды:

source: Next, in order to install NumPy in the Klipper environment, run the command:
ru: Далее, чтобы установить NumPy в среду Klipper, выполните команду:

source: ***Double-check your wiring before powering up to prevent damaging your MCU/Raspberry Pi or the accelerometer.***
ru: ***Двойная проверка проводов перед включением питания, чтобы не повредить MCU/Raspberry Pi или акселерометр.***

source: SPI Accelerometers
ru: Акселерометры SPI

source: I2C Accelerometers
ru: Акселерометры I2C

source: Recommended connection scheme for I2C on the Raspberry Pi:
ru: Рекомендуемая схема подключения I2C на Raspberry Pi:

source: Configure ADXL345 With RPi
ru: Настройка ADXL345 с помощью RPi

source: Add the following to the printer.cfg file:
ru: Добавьте следующее в файл printer.cfg:

source: Configure MPU-6000/9000 series With RPi
ru: Настройка MPU-6000/9000 серии с помощью RPi

source: Make sure the Linux I2C driver is enabled and the baud rate is set to 400000 (see [Enabling I2C](RPi_microcontroller.md#optional-enabling-i2c) section for more details). Then, add the following to the printer.cfg:
ru: Убедитесь, что драйвер Linux I2C включен, а скорость передачи данных установлена на 400000 (подробнее см. в разделе [Enabling I2C](RPi_microcontroller.md#optional-enabling-i2c)). Затем добавьте следующее в файл printer.cfg:

source: Direct to Raspberry Pi
ru: Прямое подключение к Raspberry Pi

source: 3.3V DC power
ru: Питание 3,3 В постоянного тока

source: Using Raspberry Pi Pico
ru: Использование Raspberry Pi Pico

source: You may connect the ADXL345 to your Raspberry Pi Pico and then connect the Pico to your Raspberry Pi via USB. This makes it easy to reuse the accelerometer on other Klipper devices, as you can connect via USB instead of GPIO. The Pico does not have much processing power, so make sure it is only running the accelerometer and not performing any other duties.
ru: Вы можете подключить ADXL345 к Raspberry Pi Pico, а затем подключить Pico к Raspberry Pi через USB. Это упрощает повторное использование акселерометра в других устройствах Klipper, так как вы можете подключить его через USB, а не через GPIO. Pico не обладает большой вычислительной мощностью, поэтому убедитесь, что он работает только с акселерометром и не выполняет никаких других функций.

source: In order to avoid damage to your RPi make sure to connect the ADXL345 to 3.3V only. Depending on the board's layout, a level shifter may be present, which makes 5V dangerous for your RPi.
ru: Во избежание повреждения RPi убедитесь, что ADXL345 подключен только к 3,3 В. В зависимости от разводки платы может присутствовать переключатель уровней, что сделает 5 В опасным для вашей RPi.

source: Pico pin name
ru: Название вывода Pico

source: Wiring diagrams for some of the ADXL345 boards:
ru: Схемы подключения некоторых плат ADXL345:

source: Configure ADXL345 With Pi Pico
ru: Настройка ADXL345 с Pi Pico

source: Flash the Pico Firmware
ru: Прошивка микропрограммы Pico

source: On your Raspberry Pi, compile the firmware for the Pico.
ru: На вашем Raspberry Pi скомпилируйте прошивку для Pico.

source: Now, while holding down the `BOOTSEL` button on the Pico, connect the Pico to the Raspberry Pi via USB. Compile and flash the firmware.
ru: Теперь, удерживая кнопку `BOOTSEL` на Pico, подключите Pico к Raspberry Pi через USB. Скомпилируйте и прошейте прошивку.

source: If that fails, you will be told which `FLASH_DEVICE` to use. In this example, that's `make flash FLASH_DEVICE=2e8a:0003`. ![Determine flash device](img/flash_rp2040_FLASH_DEVICE.png)
ru: Если это не удастся, вам будет указано, какой `FLASH_DEVICE` следует использовать. В данном примере это `make flash FLASH_DEVICE=2e8a:0003`. ![Определить флеш-устройство](img/flash_rp2040_FLASH_DEVICE.png)

source: Configure the Connection
ru: Настройка соединения

source: The Pico will now reboot with the new firmware and should show up as a serial device. Find the pico serial device with `ls /dev/serial/by-id/*`. You can now add an `adxl.cfg` file with the following settings:
ru: Теперь Pico перезагрузится с новой прошивкой и будет отображаться как последовательное устройство. Найдите последовательное устройство pico с помощью `ls /dev/serial/by-id/*`. Теперь вы можете добавить файл `adxl.cfg` со следующими настройками:

source: If setting up the ADXL345 configuration in a separate file, as shown above, you'll also want to modify your `printer.cfg` file to include this:
ru: Если конфигурация ADXL345 задается в отдельном файле, как показано выше, вам также потребуется изменить файл `printer.cfg`, чтобы включить его:

source: If you get an error like `Invalid adxl345 id (got xx vs e5)`, where `xx` is some other ID, immediately try again. There's an issue with SPI initialization. If you still get an error, it is indicative of the connection problem with ADXL345, or the faulty sensor. Double-check the power, the wiring (that it matches the schematics, no wire is broken or loose, etc.), and soldering quality.
ru: Если вы получите ошибку типа `Invalid adxl345 id (got xx vs e5)`, где `xx` - это какой-то другой ID, немедленно повторите попытку. Это проблема с инициализацией SPI. Если вы по-прежнему получаете ошибку, это говорит о проблеме с подключением ADXL345 или неисправном датчике. Дважды проверьте питание, проводку (соответствует ли она схеме, нет ли оборванных или ослабленных проводов и т.д.) и качество пайки.

source: Note that alternatively you can run the input shaper auto-calibration from Klipper [directly](#input-shaper-auto-calibration), which can be convenient, for example, for the input shaper [re-calibration](#input-shaper-re-calibration).
ru: Обратите внимание, что в качестве альтернативы вы можете запустить автокалибровку входного формирователя из Klipper [напрямую](#input-shaper-auto-calibration), что может быть удобно, например, для повторной калибровки входного формирователя [re-calibration](#input-shaper-re-calibration).

source: **Warning!** It is not advisable to run the shaper auto-calibration very frequently (e.g. before every print, or every day). In order to determine resonance frequencies, auto-calibration creates intensive vibrations on each of the axes. Generally, 3D printers are not designed to withstand a prolonged exposure to vibrations near the resonance frequencies. Doing so may increase wear of the printer components and reduce their lifespan. There is also an increased risk of some parts unscrewing or becoming loose. Always check that all parts of the printer (including the ones that may normally not move) are securely fixed in place after each auto-tuning.
ru: **Предупреждение!** Не рекомендуется выполнять автокалибровку шейпера очень часто (например, перед каждой печатью или каждый день). Для определения резонансных частот автокалибровка создает интенсивные вибрации по каждой из осей. Как правило, 3D-принтеры не рассчитаны на длительное воздействие вибраций, близких к резонансным частотам. Это может увеличить износ компонентов принтера и сократить срок их службы. Также повышается риск откручивания или ослабления некоторых деталей. Всегда проверяйте, чтобы все детали принтера (включая те, которые обычно не двигаются) были надежно закреплены на месте после каждой автонастройки.

source: When sourcing accelerometers, be aware that there are a variety of different PCB board designs and different clones of them. If it is going to be connected to a 5V printer MCU ensure it has a voltage regulator and level shifters.
ru: При поиске акселерометров имейте в виду, что существует множество различных конструкций печатных плат и их клонов. Если акселерометр будет подключен к MCU принтера с напряжением 5 В, убедитесь, что он оснащен стабилизатором напряжения и переключателями уровней.

source: MCUs with Klipper I2C *fast-mode* Support
ru: MCU с поддержкой *быстрого режима* I2C от Klipper

source: MCU Family
ru: Семейство MCU

source: MCU(s) Tested
ru: Тестируемый микроконтроллер(ы)

source: MCU(s) with Support
ru: MCU с поддержкой

source: An ethernet cable with shielded twisted pairs (cat5e or better) is recommended for signal integrity over a long distance. If you still experience signal integrity issues (SPI/I2C errors):
ru: Для обеспечения целостности сигнала на большом расстоянии рекомендуется использовать кабель ethernet с экранированными витыми парами (cat5e или лучше). Если вы по-прежнему испытываете проблемы с целостностью сигнала (ошибки SPI/I2C):

source: Double check the wiring with a digital multimeter for:
ru: Дважды проверьте проводку с помощью цифрового мультиметра:

source: Correct connections when turned off (continuity)
ru: Правильные соединения в выключенном состоянии (целостность)

source: Correct power and ground voltages
ru: Правильное напряжение питания и заземления

source: I2C only:
ru: Только I2C:

source: Check the SCL and SDA lines' resistances to 3.3V are in the range of 900 ohms to 1.8K
ru: Проверьте, что сопротивление линий SCL и SDA по отношению к 3,3 В находится в диапазоне от 900 Ом до 1,8K

source: For full technical details consult [chapter 7 of the I2C-bus specification and user manual UM10204](https://www.pololu.com/file/0J435/UM10204.pdf) for *fast-mode*
ru: Для получения полной технической информации обратитесь к [главе 7 спецификации шины I2C и руководству пользователя UM10204](https://www.pololu.com/file/0J435/UM10204.pdf) для *быстрого режима*

source: Shorten the cable
ru: Укоротить кабель

source: Connect ethernet cable shielding only to the MCU board/Pi ground.
ru: Подключите экран кабеля Ethernet только к заземлению платы MCU/Pi.

source: Suggested twisted pair order for three twisted pairs:
ru: Предлагаемый порядок витой пары для трех витых пар:

source: Note that unlike a cable shield, GND must be connected at both ends.
ru: Обратите внимание, что в отличие от экрана кабеля, GND должен быть подключен с обоих концов.

source: **Note: Many MCUs will work with an ADXL345 in SPI mode (e.g. Pi Pico), wiring and configuration will vary according to your specific board and available pins.**
ru: **Примечание: Многие MCU будут работать с ADXL345 в режиме SPI (например, Pi Pico), подключение и конфигурация зависят от конкретной платы и доступных выводов**

source: Suggested twisted pair order for three pairs (preferred):
ru: Предлагаемый порядок витой пары - три пары (предпочтительно):

source: or for two pairs:
ru: или для двух пар:

source: Note that unlike a cable shield, any GND(s) should be connected at both ends.
ru: Обратите внимание, что в отличие от экрана кабеля, любые GND(ы) должны быть подключены с обоих концов.

source: These accelerometers have been tested to work over I2C on the RPi, RP2040 (Pico) and AVR at 400kbit/s (*fast mode*). Some MPU accelerometer modules include pull-ups, but some are too large at 10K and must be changed or supplemented by smaller parallel resistors.
ru: Эти акселерометры протестированы на работу по протоколу I2C на RPi, RP2040 (Pico) и AVR со скоростью 400 кбит/с (*быстрый режим*). Некоторые модули акселерометров MPU включают подтягивающие резисторы, но некоторые из них слишком велики - 10K, и их необходимо заменить или дополнить меньшими параллельными резисторами.

source: The RPi has buit-in 1.8K pull-ups on both SCL and SDA.
ru: RPi имеет встроенные подтяжки 1,8K на SCL и SDA.

source: ![MPU-9250 connected to Pi](img/mpu9250-PI-fritzing.png)
ru: ![MPU-9250 подключен к Pi](img/mpu9250-PI-fritzing.png)

source: Recommended connection scheme for I2C (i2c0a) on the RP2040:
ru: Рекомендуемая схема подключения I2C (i2c0a) на RP2040:

source: RP2040 pin name
ru: Название выводов RP2040

source: The Pico does not include any built-in I2C pull-up resistors.
ru: В Pico нет встроенных подтягивающих резисторов I2C.

source: ![MPU-9250 connected to Pico](img/mpu9250-PICO-fritzing.png)
ru: ![MPU-9250 подключен к Pico](img/mpu9250-PICO-fritzing.png)

source: Recommended connection scheme for I2C(TWI) on the AVR ATmega328P Arduino Nano:
ru: Рекомендуемая схема подключения I2C(TWI) на AVR ATmega328P Arduino Nano:

source: Atmega328P pin name
ru: Название выводов Atmega328P

source: The Arduino Nano does not include any built-in pull-up resistors nor a 3.3V power pin.
ru: В Arduino Nano нет ни встроенных подтягивающих резисторов, ни вывода питания 3,3 В.

source: First, check and follow the instructions in the [RPi Microcontroller document](RPi_microcontroller.md) to setup the "linux mcu" on the Raspberry Pi. This will configure a second Klipper instance that runs on your Pi.
ru: Сначала проверьте и следуйте инструкциям в документе [RPi Microcontroller](RPi_microcontroller.md), чтобы настроить "linux mcu" на Raspberry Pi. Это позволит настроить второй экземпляр Klipper, который будет работать на вашем Pi.

source: Configure MPU-9520 Compatibles With Pico
ru: Настройка совместимости MPU-9520 с Pico

source: Pico I2C is set to 400000 on default. Simply add the following to the printer.cfg:
ru: По умолчанию для Pico I2C установлено значение 400000. Просто добавьте следующее в файл printer.cfg:

source: Configure MPU-9520 Compatibles with AVR
ru: Настройка совместимости MPU-9520 с AVR

source: AVR I2C will be set to 400000 by the mpu9250 option. Simply add the following to the printer.cfg:
ru: Для AVR I2C будет установлено значение 400000 с помощью опции mpu9250. Просто добавьте следующее в файл printer.cfg:

source: **If you are using a MPU-9250 compatible accelerometer and it shows up as `mpu-unknown`, use with caution! They are probably refurbished chips!**
ru: **Если вы используете акселерометр, совместимый с MPU-9250, и он отображается как `mpu-unknown`, используйте его с осторожностью! Скорее всего, это восстановленные микросхемы!**

source: However, you can also connect two accelerometers simultaneously, though the ADXL345 must be connected to different boards (say, to an RPi and printer MCU board), or to two different physical SPI interfaces on the same board (rarely available). Then they can be configured in the following manner:
ru: Однако можно подключить и два акселерометра одновременно, правда, ADXL345 должны быть подключены к разным платам (например, к плате RPi и плате MCU принтера) или к двум разным физическим SPI-интерфейсам на одной плате (что бывает редко). Затем их можно сконфигурировать следующим образом:

source: Two MPUs can share one I2C bus, but they **cannot** measure simultaneously as the 400kbit/s I2C bus is not fast enough. One must have its AD0 pin pulled-down to 0V (address 104) and the other its AD0 pin pulled-up to 3.3V (address 105):
ru: Два MPU могут использовать одну шину I2C, но они **не могут** проводить измерения одновременно, поскольку скорость шины I2C 400 кбит/с недостаточна. Один из них должен иметь вывод AD0, подтянутый к 0 В (адрес 104), а другой - вывод AD0, подтянутый к 3,3 В (адрес 105):

source: [Test with each MPU individually before connecting both to the bus for easy debugging.]
ru: [Протестируйте каждый MPU по отдельности, прежде чем подключать оба к шине, чтобы облегчить отладку]

source: Keep in mind that the maximum acceleration without too much smoothing depends on the `square_corner_velocity`. The general recommendation is not to change it from its default value 5.0, and this is the value used by default by the `calibrate_shaper.py` script. If you did change it though, you should inform the script about it by passing `--square_corner_velocity=...` parameter, e.g.
ru: Помните, что максимальное ускорение без слишком сильного сглаживания зависит от значения `square_corner_velocity`. Общая рекомендация - не изменять его от значения по умолчанию 5.0, и именно это значение используется по умолчанию скриптом `calibrate_shaper.py`. Если вы все же изменили его, то сообщите об этом скрипту, передав параметр `--square_corner_velocity=...`, например.
