Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: ru

source: so that it can calculate the maximum acceleration recommendations correctly. Note that the `SHAPER_CALIBRATE` command already takes the configured `square_corner_velocity` parameter into account, and there is no need to specify it explicitly.
ru: чтобы правильно рассчитать рекомендации по максимальному ускорению. Обратите внимание, что команда `SHAPER_CALIBRATE` уже учитывает настроенный параметр `square_corner_velocity`, и нет необходимости указывать его явно.

source: This will generate 2 CSV files (`/tmp/resonances_x_*.csv` and `/tmp/resonances_y_*.csv`). These files can be processed with the stand-alone script on a Raspberry Pi. This script is intended to be run with a single CSV file for each axis measured, although it can be used with multiple CSV files if you desire to average the results. Averaging results can be useful, for example, if resonance tests were done at multiple test points. Delete the extra CSV files if you do not desire to average them.
ru: В результате будут сгенерированы 2 файла CSV (`/tmp/resonances_x_*.csv` и `/tmp/resonances_y_*.csv`). Эти файлы можно обработать с помощью автономного скрипта на Raspberry Pi. Этот скрипт предназначен для запуска с одним CSV-файлом для каждой измеряемой оси, хотя его можно использовать с несколькими CSV-файлами, если вы хотите усреднить результаты. Усреднение результатов может быть полезным, например, если резонансные испытания проводились в нескольких точках. Удалите дополнительные CSV-файлы, если вы не хотите усреднять их.
