Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: ru

source: Measuring Resonances
ru: Изменения Резонансов

source: Installation instructions
ru: Инструкции по установке

source: Wiring
ru: Электропроводка

source: You need to connect ADXL345 to your Raspberry Pi via SPI. Note that the I2C connection, which is suggested by ADXL345 documentation, has too low throughput and **will not work**. The recommended connection scheme:
ru: Вам необходимо подключить ADXL345 к вашему Raspberry Pi через SPI. Обратите внимание, что соединение I2C, которое предлагается в документации ADXL345, имеет слишком низкую пропускную способность и ** не будет работать **. Рекомендуемая схема подключения:

source: RPi pin
ru: Контакт RPi

source: RPi pin name
ru: Название выводов RPi

source: 3V3 (or VCC)
ru: 3V3 (или VCC)

source: 3.3v DC power
ru: Питание 3,3 В постоянного тока

source: Ground
ru: Земля

source: Fritzing wiring diagrams for some of the ADXL345 boards:
ru: Схемы подключения некоторых плат ADXL345:

source: Mounting the accelerometer
ru: Монтаж акселерометра

source: The accelerometer must be attached to the toolhead. One needs to design a proper mount that fits their own 3D printer. It is better to align the axes of the accelerometer with the printer's axes (but if it makes it more convenient, axes can be swapped - i.e. no need to align X axis with X and so forth - it should be fine even if Z axis of accelerometer is X axis of the printer, etc.).
ru: Акселерометр должен быть прикреплен к инструментальной головке. Необходимо разработать соответствующее крепление, которое подойдет для вашего 3D-принтера. Оси акселерометра лучше совместить с осями принтера (но если так будет удобнее, оси можно поменять местами - то есть не нужно совмещать ось X с X и так далее - все будет хорошо, даже если ось Z акселерометра будет совпадать с осью X принтера и т. д.).

source: An example of mounting ADXL345 on the SmartEffector:
ru: Пример установки ADXL345 на SmartEffector:

source: Note that on a bed slinger printer one must design 2 mounts: one for the toolhead and one for the bed, and run the measurements twice. See the corresponding [section](#bed-slinger-printers) for more details.
ru: Обратите внимание, что для принтера со станиной необходимо разработать два крепления: одно для инструментальной головки и одно для станины, и выполнить измерения дважды. Более подробную информацию смотрите в соответствующем [разделе](#bed-slinger-printers).

source: **Attention:** make sure the accelerometer and any screws that hold it in place do not touch any metal parts of the printer. Basically, the mount must be designed such as to ensure the electrical isolation of the accelerometer from the printer frame. Failing to ensure that can create a ground loop in the system that may damage the electronics.
ru: **Внимание:** убедитесь, что акселерометр и винты, удерживающие его на месте, не касаются металлических частей принтера. В принципе, крепление должно быть спроектировано таким образом, чтобы обеспечить электрическую изоляцию акселерометра от рамы принтера. Если этого не сделать, в системе может возникнуть контур заземления, который может повредить электронику.

source: Software installation
ru: Установка программного обеспечения

source: Make sure the Linux SPI driver is enabled by running `sudo raspi-config` and enabling SPI under the "Interfacing options" menu.
ru: Убедитесь, что драйвер Linux SPI включен, запустив `sudo raspi-config` и включив SPI в меню "Параметры взаимодействия".

source: It is advised to start with 1 probe point, in the middle of the print bed, slightly above it.
ru: Рекомендуется начать с 1 точки зондирования, расположенной в середине печатного слоя и немного выше него.

source: Restart Klipper via the `RESTART` command.
ru: Перезапустите Klipper с помощью команды `RESTART`.

source: Measuring the resonances
ru: Измерение резонанса

source: Checking the setup
ru: Проверка установки

source: Now you can test a connection.
ru: Теперь вы можете проверить соединение.

source: For "non bed-slingers" (e.g. one accelerometer), in Octoprint, enter `ACCELEROMETER_QUERY`
ru: Для "не-акселерометров" (например, с одним акселерометром), в Octoprint введите `ACCELEROMETER_QUERY`

source: For "bed-slingers" (e.g. more than one accelerometer), enter `ACCELEROMETER_QUERY CHIP=<chip>` where `<chip>` is the name of the chip as-entered, e.g. `CHIP=bed` (see: [bed-slinger](#bed-slinger-printers)) for all installed accelerometer chips.
ru: Для "кроватных слингов" (например, более одного акселерометра) введите `ACCELEROMETER_QUERY CHIP=<chip>`, где `<chip>` - имя введенного чипа, например, `CHIP=bed` ( смотрите: [bed-slinger](#bed-slinger-printers)) для всех установленных чипов акселерометров.

source: You should see the current measurements from the accelerometer, including the free-fall acceleration, e.g.
ru: Вы должны увидеть текущие измерения акселерометра, включая ускорение свободного падения, например.

source: Next, try running `MEASURE_AXES_NOISE` in Octoprint, you should get some baseline numbers for the noise of accelerometer on the axes (should be somewhere in the range of ~1-100). Too high axes noise (e.g. 1000 and more) can be indicative of the sensor issues, problems with its power, or too noisy imbalanced fans on a 3D printer.
ru: Далее попробуйте запустить `MEASURE_AXES_NOISE` в Octoprint, вы должны получить некоторые базовые цифры для шума акселерометра по осям (должны быть где-то в диапазоне ~1-100). Слишком высокий шум по осям (например, 1000 и более) может свидетельствовать о проблемах с датчиком, проблемах с его питанием или слишком шумных несбалансированных вентиляторах на 3D-принтере.

source: Now you can run some real-life tests. Run the following command:
ru: Теперь вы можете провести несколько реальных тестов. Выполните следующую команду:

source: Note that it will create vibrations on X axis. It will also disable input shaping if it was enabled previously, as it is not valid to run the resonance testing with the input shaper enabled.
ru: Обратите внимание, что это создаст вибрации по оси X. Это также отключит формирование входного сигнала, если оно было включено ранее, так как проведение резонансного тестирования с включенным формирователем входного сигнала недопустимо.

source: **Attention!** Be sure to observe the printer for the first time, to make sure the vibrations do not become too violent (`M112` command can be used to abort the test in case of emergency; hopefully it will not come to this though). If the vibrations do get too strong, you can attempt to specify a lower than the default value for `accel_per_hz` parameter in `[resonance_tester]` section, e.g.
ru: **Внимание! ** Обязательно понаблюдайте за принтером в первый раз, чтобы убедиться, что вибрации не станут слишком сильными (команда `M112` может быть использована для прерывания теста в случае крайней необходимости; надеемся, что до этого не дойдет). Если вибрации все же становятся слишком сильными, можно попытаться задать меньшее, чем по умолчанию, значение параметра `accel_per_hz` в разделе `[resonance_tester]`, например.

source: If it works for X axis, run for Y axis as well:
ru: Если это работает для оси X, запустите и для оси Y:

source: This script will generate the charts `/tmp/shaper_calibrate_x.png` and `/tmp/shaper_calibrate_y.png` with frequency responses. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup. For example:
ru: Этот скрипт сгенерирует графики `/tmp/shaper_calibrate_x.png` и `/tmp/shaper_calibrate_y.png` с частотными характеристиками. Вы также получите предлагаемые частоты для каждого входного формирователя, а также то, какой входной формирователь рекомендуется для вашей установки. Например:

source: The suggested configuration can be added to `[input_shaper]` section of `printer.cfg`, e.g.:
ru: Предлагаемую конфигурацию можно добавить в раздел `[input_shaper]` файла `printer.cfg`, например:

source: or you can choose some other configuration yourself based on the generated charts: peaks in the power spectral density on the charts correspond to the resonance frequencies of the printer.
ru: или вы можете самостоятельно выбрать другую конфигурацию, основываясь на сгенерированных графиках: пики спектральной плотности мощности на графиках соответствуют резонансным частотам принтера.

source: Bed-slinger printers
ru: Печатающие устройства для постельных принадлежностей

source: If your printer is a bed slinger printer, you will need to change the location of the accelerometer between the measurements for X and Y axes: measure the resonances of X axis with the accelerometer attached to the toolhead and the resonances of Y axis - to the bed (the usual bed slinger setup).
ru: Если ваш принтер является принтером со станиной, вам нужно будет изменить расположение акселерометра между измерениями по осям X и Y: измерять резонансы по оси X с акселерометром, прикрепленным к инструментальной головке, а резонансы по оси Y - к станине (обычная установка станины).

source: Then the commands `TEST_RESONANCES AXIS=X` and `TEST_RESONANCES AXIS=Y` will use the correct accelerometer for each axis.
ru: Тогда команды `TEST_RESONANCES AXIS=X` и `TEST_RESONANCES AXIS=Y` будут использовать правильный акселерометр для каждой оси.

source: Max smoothing
ru: Максимальное сглаживание

source: Keep in mind that the input shaper can create some smoothing in parts. Automatic tuning of the input shaper performed by `calibrate_shaper.py` script or `SHAPER_CALIBRATE` command tries not to exacerbate the smoothing, but at the same time they try to minimize the resulting vibrations. Sometimes they can make a sub-optimal choice of the shaper frequency, or maybe you simply prefer to have less smoothing in parts at the expense of a larger remaining vibrations. In these cases, you can request to limit the maximum smoothing from the input shaper.
ru: Помните, что входной формирователь может создавать некоторое сглаживание в отдельных частях. Автоматическая настройка входного формирователя, выполняемая скриптом `calibrate_shaper.py` или командой `SHAPER_CALIBRATE`, старается не усугублять сглаживание, но в то же время пытается минимизировать возникающие вибрации. Иногда они могут сделать неоптимальный выбор частоты шейпера, или, возможно, вы просто предпочитаете меньшее сглаживание в частях за счет больших остаточных вибраций. В таких случаях можно попросить ограничить максимальное сглаживание от входного формирователя.

source: Let's consider the following results from the automatic tuning:
ru: Рассмотрим следующие результаты автоматической настройки:

source: Note that the reported `smoothing` values are some abstract projected values. These values can be used to compare different configurations: the higher the value, the more smoothing a shaper will create. However, these smoothing scores do not represent any real measure of smoothing, because the actual smoothing depends on [`max_accel`](#selecting-max-accel) and `square_corner_velocity` parameters. Therefore, you should print some test prints to see how much smoothing exactly a chosen configuration creates.
ru: Обратите внимание, что указанные значения `сглаживания` - это некие абстрактные прогнозируемые значения. Эти значения можно использовать для сравнения различных конфигураций: чем выше значение, тем больше сглаживания создаст шейпер. Однако эти показатели сглаживания не являются реальной мерой сглаживания, поскольку фактическое сглаживание зависит от параметров [`max_accel`](#selecting-max-accel) и `square_corner_velocity`. Поэтому вам следует напечатать несколько тестовых отпечатков, чтобы узнать, сколько сглаживания создает выбранная конфигурация.

source: In the example above the suggested shaper parameters are not bad, but what if you want to get less smoothing on the X axis? You can try to limit the maximum shaper smoothing using the following command:
ru: В приведенном примере предложенные параметры шейпера неплохи, но что, если вы хотите получить меньшее сглаживание по оси X? Вы можете попробовать ограничить максимальное сглаживание шейпера с помощью следующей команды:

source: which limits the smoothing to 0.2 score. Now you can get the following result:
ru: что ограничивает сглаживание до 0,2 балла. Теперь вы можете получить следующий результат:

source: If you compare to the previously suggested parameters, the vibrations are a bit larger, but the smoothing is significantly smaller than previously, allowing larger maximum acceleration.
ru: Если сравнивать с ранее предложенными параметрами, то вибрации немного больше, но сглаживание значительно меньше, чем раньше, что позволяет увеличить максимальное ускорение.

source: When deciding which `max_smoothing` parameter to choose, you can use a trial-and-error approach. Try a few different values and see which results you get. Note that the actual smoothing produced by the input shaper depends, primarily, on the lowest resonance frequency of the printer: the higher the frequency of the lowest resonance - the smaller the smoothing. Therefore, if you request the script to find a configuration of the input shaper with the unrealistically small smoothing, it will be at the expense of increased ringing at the lowest resonance frequencies (which are, typically, also more prominently visible in prints). So, always double-check the projected remaining vibrations reported by the script and make sure they are not too high.
ru: При выборе параметра `max_smoothing` вы можете использовать метод проб и ошибок. Попробуйте несколько различных значений и посмотрите, какие результаты вы получите. Обратите внимание, что фактическое сглаживание, производимое входным формирователем, зависит, прежде всего, от самой низкой резонансной частоты принтера: чем выше частота самого низкого резонанса - тем меньше сглаживание. Поэтому, если вы попросите скрипт найти конфигурацию входного формирователя с нереально малым сглаживанием, это произойдет за счет увеличения звона на самых низких резонансных частотах (которые, как правило, также более заметны на отпечатках). Поэтому всегда перепроверяйте прогнозируемые остаточные колебания, сообщаемые скриптом, и убедитесь, что они не слишком высоки.

source: Note that if you chose a good `max_smoothing` value for both of your axes, you can store it in the `printer.cfg` as
ru: Обратите внимание, что если вы выбрали хорошее значение `max_smoothing` для обеих осей, вы можете сохранить его в файле `printer.cfg` как

source: Then, if you [rerun](#input-shaper-re-calibration) the input shaper auto-tuning using `SHAPER_CALIBRATE` Klipper command in the future, it will use the stored `max_smoothing` value as a reference.
ru: Тогда, если в будущем вы [повторно](#input-shaper-re-calibration) запустите автонастройку входного шейпера с помощью команды `SHAPER_CALIBRATE` Klipper, он будет использовать сохраненное значение `max_smoothing` в качестве эталона.

source: Since the input shaper can create some smoothing in parts, especially at high accelerations, you will still need to choose the `max_accel` value that does not create too much smoothing in the printed parts. A calibration script provides an estimate for `max_accel` parameter that should not create too much smoothing. Note that the `max_accel` as displayed by the calibration script is only a theoretical maximum at which the respective shaper is still able to work without producing too much smoothing. It is by no means a recommendation to set this acceleration for printing. The maximum acceleration your printer is able to sustain depends on its mechanical properties and the maximum torque of the used stepper motors. Therefore, it is suggested to set `max_accel` in `[printer]` section that does not exceed the estimated values for X and Y axes, likely with some conservative safety margin.
ru: Поскольку входной формирователь может создавать некоторое сглаживание деталей, особенно при высоких ускорениях, вам все равно придется выбрать значение `max_accel`, которое не будет создавать слишком сильного сглаживания на отпечатанных деталях. Сценарий калибровки предоставляет оценку параметра `max_accel`, который не должен создавать слишком сильного сглаживания. Обратите внимание, что значение `max_accel`, отображаемое калибровочным скриптом, является лишь теоретическим максимумом, при котором соответствующий формирователь еще способен работать, не создавая слишком сильного сглаживания. Ни в коем случае не рекомендуется устанавливать это ускорение для печати. Максимальное ускорение, которое способен выдержать ваш принтер, зависит от его механических свойств и максимального крутящего момента используемых шаговых двигателей. Поэтому рекомендуется установить `max_accel` в секции `[принтер]`, не превышающее расчетных значений для осей X и Y, скорее всего, с некоторым консервативным запасом прочности.

source: Alternatively, follow [this](Resonance_Compensation.md#selecting-max_accel) part of the input shaper tuning guide and print the test model to choose `max_accel` parameter experimentally.
ru: В качестве альтернативы, следуйте [this](Resonance_Compensation.md#selecting-max_accel) части руководства по настройке входного формирователя и распечатайте тестовую модель для экспериментального выбора параметра `max_accel`.

source: The same notice applies to the input shaper [auto-calibration](#input-shaper-auto-calibration) with `SHAPER_CALIBRATE` command: it is still necessary to choose the right `max_accel` value after the auto-calibration, and the suggested acceleration limits will not be applied automatically.
ru: Это же замечание относится и к входному шейперу [автокалибровка](#input-shaper-auto-calibration) с командой `SHAPER_CALIBRATE`: после автокалибровки по-прежнему необходимо выбрать правильное значение `max_accel`, и предложенные ограничения ускорения не будут применяться автоматически.

source: If you are doing a shaper re-calibration and the reported smoothing for the suggested shaper configuration is almost the same as what you got during the previous calibration, this step can be skipped.
ru: Если вы выполняете повторную калибровку формирователя и полученное значение сглаживания для предложенной конфигурации формирователя почти такое же, как и при предыдущей калибровке, этот шаг можно пропустить.

source: Input Shaper auto-calibration
ru: Автоматическая калибровка входного формирователя

source: Besides manually choosing the appropriate parameters for the input shaper feature, it is also possible to run the auto-tuning for the input shaper directly from Klipper. Run the following command via Octoprint terminal:
ru: Помимо ручного выбора подходящих параметров для функции входного формирователя, можно также запустить автонастройку входного формирователя непосредственно из Klipper. Выполните следующую команду через терминал Octoprint:

source: This will run the full test for both axes and generate the csv output (`/tmp/calibration_data_*.csv` by default) for the frequency response and the suggested input shapers. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup, on Octoprint console. For example:
ru: Это запустит полный тест для обеих осей и сгенерирует выходной файл csv (по умолчанию `/tmp/calibration_data_*.csv`) для частотной характеристики и предлагаемых входных формирователей. Вы также получите предлагаемые частоты для каждого входного формирователя, а также информацию о том, какой входной формирователь рекомендуется для вашей установки, на консоли Octoprint. Например:

source: If you agree with the suggested parameters, you can execute `SAVE_CONFIG` now to save them and restart the Klipper. Note that this will not update `max_accel` value in `[printer]` section. You should update it manually following the considerations in [Selecting max_accel](#selecting-max_accel) section.
ru: Если вы согласны с предложенными параметрами, вы можете выполнить команду `SAVE_CONFIG`, чтобы сохранить их и перезапустить Klipper. Обратите внимание, что это не приведет к обновлению значения `max_accel` в разделе `[принтер]`. Вы должны обновить его вручную, следуя указаниям в разделе [Выбор max_accel](#selecting-max_accel).

source: If your printer is a bed slinger printer, you can specify which axis to test, so that you can change the accelerometer mounting point between the tests (by default the test is performed for both axes):
ru: Если ваш принтер является принтером со станиной, вы можете указать, какую ось тестировать, чтобы между тестами можно было менять точку установки акселерометра (по умолчанию тест выполняется для обеих осей):

source: You can execute `SAVE_CONFIG` twice - after calibrating each axis.
ru: Вы можете выполнить `SAVE_CONFIG` дважды - после калибровки каждой оси.

source: However, if you connected two accelerometers simultaneously, you simply run `SHAPER_CALIBRATE` without specifying an axis to calibrate the input shaper for both axes in one go.
ru: Однако если вы подключили два акселерометра одновременно, достаточно запустить `SHAPER_CALIBRATE` без указания оси, чтобы откалибровать входной формирователь для обеих осей за один раз.

source: Input Shaper re-calibration
ru: Повторная калибровка входного формирователя

source: `SHAPER_CALIBRATE` command can be also used to re-calibrate the input shaper in the future, especially if some changes to the printer that can affect its kinematics are made. One can either re-run the full calibration using `SHAPER_CALIBRATE` command, or restrict the auto-calibration to a single axis by supplying `AXIS=` parameter, like
ru: Команда `SHAPER_CALIBRATE` может также использоваться для повторной калибровки входного формирователя в будущем, особенно если в принтер были внесены некоторые изменения, которые могут повлиять на его кинематику. Можно либо повторно выполнить полную калибровку с помощью команды `SHAPER_CALIBRATE`, либо ограничить автокалибровку одной осью, указав параметр `AXIS=`, например

source: Also, due to some noise in measurements, it is possible that the tuning results will be slightly different from one calibration run to another one. Still, it is not expected that the noise will affect the print quality too much. However, it is still advised to double-check the suggested parameters, and print some test prints before using them to confirm they are good.
ru: Кроме того, из-за некоторого шума при измерениях возможно, что результаты настройки будут немного отличаться от одного прогона калибровки к другому. Тем не менее, не ожидается, что шум сильно повлияет на качество печати. Тем не менее, рекомендуется перепроверить предложенные параметры и напечатать несколько пробных отпечатков перед использованием, чтобы убедиться в их правильности.

source: Offline processing of the accelerometer data
ru: Обработка данных акселерометра в автономном режиме

source: It is possible to generate the raw accelerometer data and process it offline (e.g. on a host machine), for example to find resonances. In order to do so, run the following commands via Octoprint terminal:
ru: Можно сгенерировать необработанные данные акселерометра и обработать их в автономном режиме (например, на хост-машине), например, для поиска резонансов. Для этого выполните следующие команды через терминал Octoprint:

source: ignoring any errors for `SET_INPUT_SHAPER` command. For `TEST_RESONANCES` command, specify the desired test axis. The raw data will be written into `/tmp` directory on the RPi.
ru: игнорируя любые ошибки для команды `SET_INPUT_SHAPER`. Для команды `TEST_RESONANCES` укажите желаемую тестовую ось. Необработанные данные будут записаны в каталог `/tmp` на RPi.
