Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Packaging.po
Languages: ta

source: Klipper is somewhat of a packaging anomaly among python programs, as it doesn't use setuptools to build and install. Some notes regarding how best to package it are as follows:
ta: பைதான் நிரல்களிடையே கிளிப்பர் ஒரு பேக்கேசிங் ஒழுங்கின்மையாகும், ஏனெனில் இது கட்டமைக்க மற்றும் நிறுவ செட்டுப்டூல்களைப் பயன்படுத்தாது. பின்வருமாறு அதை எவ்வாறு தொகுப்பது என்பது தொடர்பான சில குறிப்புகள்:

source: C modules
ta: சி தொகுதிகள்

source: Klipper uses a C module to handle some kinematics calculations more quickly. This module needs to be compiled at packaging time to avoid introducing a runtime dependency on a compiler. To compile the C module, run `python2 klippy/chelper/__init__.py`.
ta: சில இயக்கவியல் கணக்கீடுகளை விரைவாகக் கையாள கிளிப்பர் சி தொகுதியைப் பயன்படுத்துகிறார். ஒரு கம்பைலரை இயக்க நேர சார்புநிலையை அறிமுகப்படுத்துவதைத் தவிர்க்க இந்த தொகுதி பேக்கேசிங் நேரத்தில் தொகுக்கப்பட வேண்டும். சி தொகுதியைத் தொகுக்க, `பைதான் 2 கிளிப்பி/செல்பர்/__ init __. Py` ஐ இயக்கவும்.

source: Compiling python code
ta: பைதான் குறியீட்டை தொகுத்தல்

source: Many distributions have a policy of compiling all python code before packaging to improve startup time. You can do this by running `python2 -m compileall klippy`.
ta: தொடக்க நேரத்தை மேம்படுத்த பேக்கேசிங் செய்வதற்கு முன் அனைத்து பைதான் குறியீட்டையும் தொகுக்கும் கொள்கையை பல விநியோகங்கள் கொண்டுள்ளன. `பைதான் 2 -எம் கம்ப்யிலல் கிளிப்பி` ஐ இயக்குவதன் மூலம் இதைச் செய்யலாம்.

source: Versioning
ta: பதிப்பு

source: If you are building a package of Klipper from git, it is usual practice not to ship a .git directory, so the versioning must be handled without git. To do this, use the script shipped in `scripts/make_version.py` which should be run as follows: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.
ta: நீங்கள் git இலிருந்து கிளிப்பரின் ஒரு தொகுப்பை உருவாக்குகிறீர்கள் என்றால், ஒரு .git கோப்பகத்தை அனுப்பாதது வழக்கமான பயிற்சி, எனவே பதிப்பானது அறிவிலி இல்லாமல் கையாளப்பட வேண்டும். இதைச் செய்ய, `ச்கிரிப்ட்கள்/make_version.py` இல் அனுப்பப்பட்ட ச்கிரிப்டைப் பயன்படுத்தவும், அவை பின்வருமாறு இயக்கப்பட வேண்டும்:` பைதான் 2 ச்கிரிப்ட்கள்/மேக்_்வெர்சன்.

source: Sample packaging script
ta: மாதிரி பேக்கேசிங் ச்கிரிப்ட்

source: Packaging Klipper
ta: பேக்கேசிங் பாறைகள்

source: klipper-git is packaged for Arch Linux, and has a PKGBUILD (package build script) available at [Arch User Repository](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
ta: கிளிப்பர்-கிட் ஆர்ச் லினக்சிற்காக தொகுக்கப்பட்டுள்ளது, மேலும் [ஆர்ச் பயனர் களஞ்சியத்தில்] (https://aur.archlinux.org/cgit/aur.git/tree/pkgbuild?h=klipper- கிட்).
