Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: ta, uk

source: Recv: // probe accuracy: at X:0.000 Y:0.000 Z:10.000 Recv: // and read 10 times with speed of 5 mm/s Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe accuracy results: maximum 2.519448, minimum 2.506948, range 0.012500, average 2.513198, median 2.513198, standard deviation 0.006250
uk: Recv: // Точність зонда: в X:0.000 Y:0.000 Z:10.000 Recv: // і читати 10 разів зі швидкістю 5 мм / с Редюме: // Пробе в -0.003,0.005 z=2.506948 Редюме: // Пробе в -0.003,0.005 z=2.519448 Редюме: // Пробе в -0.003,0.005 z=2.519448 Редюме: // Пробе в -0.003,0.005 z=2.506948 Редюме: // Пробе в -0.003,0.005 z=2.519448 Редюме: // Пробе в -0.003,0.005 z=2.519448 Редюме: // Пробе в -0.003,0.005 z=2.506948 Редюме: // Пробе в -0.003,0.005 z=2.506948 Редюме: // Пробе в -0.003,0.005 z=2.519448 Редюме: // Пробе в -0.003,0.005 z=2.506948 Recv: // результати точності зонда: максимум 2.519448, мінімум 2.506948, діапазон 0.012500, середній 2,513198, медіан 2.513198, стандартне відхилення 0.006250

source: Probe calibration
ta: ஆய்வு அளவுத்திருத்தம்
uk: Пробе калібрування

source: This document describes the method for calibrating the X, Y, and Z offsets of an "automatic z probe" in Klipper. This is useful for users that have a `[probe]` or `[bltouch]` section in their config file.
ta: கிளிப்பரில் "தானியங்கி சட் ஆய்வின்" ஃச், ஒய் மற்றும் சட் ஆஃப்செட்களை அளவீடு செய்வதற்கான முறையை இந்த ஆவணம் விவரிக்கிறது. `[ஆய்வு]` அல்லது `[bltouch]` அவர்களின் கட்டமைப்பு கோப்பில் உள்ள பயனர்களுக்கு இது பயனுள்ளதாக இருக்கும்.
uk: Цей документ описує метод калібрування X, Y та Z offsets of "автоматичний зонд" в Klipper. Це корисно для користувачів, які мають `[probe]` або `[bltouch]` розділ в їх файлі налаштування.

source: If the results of the test show a range value that is greater than 25 microns (.025mm) then the probe does not have sufficient accuracy for typical bed leveling procedures. It may be possible to tune the probe speed and/or probe start height to improve the repeatability of the probe. The `PROBE_ACCURACY` command allows one to run tests with different parameters to see their impact - see the [G-Codes document](G-Codes.md#probe_accuracy) for further details. If the probe generally obtains repeatable results but has an occasional outlier, then it may be possible to account for that by using multiple samples on each probe - read the description of the probe `samples` config parameters in the [config reference](Config_Reference.md#probe) for more details.
ta: சோதனையின் முடிவுகள் 25 மைக்ரான் (.025 மிமீ) க்கும் அதிகமான வரம்பு மதிப்பைக் காட்டினால், வழக்கமான படுக்கை சமன் செய்யும் நடைமுறைகளுக்கு ஆய்வுக்கு போதுமான துல்லியம் இல்லை. ஆய்வின் மறுபயன்பாட்டை மேம்படுத்த ஆய்வு விரைவு மற்றும்/அல்லது ஆய்வு தொடக்க உயரத்தை மாற்றலாம். மேலும் விவரங்களுக்கு [சி-கோட்ச் ஆவணம்] (சி-கோட்ச். எம்.டி#Probe_accuracy) ஐப் பார்க்கவும் `probe_accuracy` கட்டளை வெவ்வேறு அளவுருக்களைக் கொண்ட சோதனைகளை இயக்க அனுமதிக்கிறது. ஆய்வு பொதுவாக மீண்டும் மீண்டும் செய்யக்கூடிய முடிவுகளைப் பெறுகிறது, ஆனால் அவ்வப்போது வெளிநாட்டவர் இருந்தால், ஒவ்வொரு ஆய்விலும் பல மாதிரிகளைப் பயன்படுத்துவதன் மூலம் அதைக் கணக்கிட முடியும் - [கட்டமைப்பு குறிப்பு] (config_reference இல் உள்ள கட்டமைப்பு அளவுருக்களின் ஆய்வின் விளக்கத்தைப் படியுங்கள். md#ஆய்வு) மேலும் விவரங்களுக்கு.
uk: Якщо результати тесту показують значення діапазону, що перевищує 25 мікрон (.025мм) то зонд не має достатньої точності для типових процедур вирівнювання ліжко. Можна налаштувати швидкість зонду та/або висоту зонду, щоб поліпшити повторюваність зонду. Команда `PROBE_ACCURACY` дозволяє запустити тести з різними параметрами, щоб побачити їх вплив - див. [G-Codes документ](G-Codes.md#probe_accuracy) для подальших деталей. Якщо зонд, як правило, отримує повторювані результати, але має випадковий зовнішній вигляд, то це може бути можливо для того, щоб за допомогою декількох зразків на кожному зонду - прочитайте опис зонда `samples` параметри налаштування в [посилання на налаштування](Config_Reference.md#probe) для більш докладної інформації.

source: Once the manual probe tool starts, follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position and save the results to the config file with:
ta: கையேடு ஆய்வு கருவி தொடங்கியதும், கொடுக்கப்பட்ட இடத்தில் முனை மற்றும் படுக்கைக்கு இடையிலான உண்மையான தூரத்தை தீர்மானிக்க ["காகித சோதனை"] (Bed_level.md#the-paper-test) இல் விவரிக்கப்பட்டுள்ள படிகளைப் பின்பற்றவும். அந்த படிகள் முடிந்ததும், நிலையை `ஏற்றுக்கொள்ளலாம் 'மற்றும் முடிவுகளை கட்டமைப்பு கோப்பில் சேமிக்க முடியும்:
uk: Після запуску ручного датчика виконайте кроки, описані в ["тест паперу"](Bed_Level.md#the-paper-test), щоб визначити фактичну відстань між соплом і ложем у заданому місці. Після завершення цих кроків можна `ПРИЙНЯТИ` позицію та зберегти результати у файлі конфігурації за допомогою:
