Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: ta, uk

source: Calibrating probe X and Y offsets
ta: ஆய்வு ஃச் மற்றும் ஒய் ஆஃப்செட்களை அளவீடு செய்தல்
uk: Калібруючий зонда X і Y офсети

source: To calibrate the X and Y offset, navigate to the OctoPrint "Control" tab, home the printer, and then use the OctoPrint jogging buttons to move the head to a position near the center of the bed.
ta: ஃச் மற்றும் ஒய் ஆஃப்செட்டை அளவீடு செய்ய, ஆக்டோப்ரண்ட் "கட்டுப்பாடு" தாவலுக்கு செல்லவும், அச்சுப்பொறியை வீட்டிற்கு அழைத்துச் செல்லவும், பின்னர் ஆக்டோப்ரண்ட் சாகிங் பொத்தான்களைப் பயன்படுத்தி படுக்கையின் மையத்திற்கு அருகிலுள்ள ஒரு நிலைக்கு தலையை நகர்த்தவும்.
uk: Щоб калібрувати X і Y offset, навігувати на вкладку OctoPrint "Control", в домашніх умовах принтер, а потім використовувати кнопки стрибок OctoPrint для переміщення голови в позицію біля центру ліжка.

source: Place a piece of blue painters tape (or similar) on the bed underneath the probe. Navigate to the OctoPrint "Terminal" tab and issue a PROBE command:
ta: ஆய்வின் அடியில் படுக்கையில் நீல ஓவியர்கள் டேப்பின் (அல்லது ஒத்த) ஒரு பகுதியை வைக்கவும். ஆக்டோபிரிண்ட் "டெர்மினல்" தாவலுக்குச் சென்று ஆய்வு கட்டளையை வழங்கவும்:
uk: Помістіть шматочок синього художника стрічки (або аналогічний) на клумбі під ним. Navigate to the OctoPrint "Terminal" tab і problem a PROBE команда:

source: Place a mark on the tape directly under where the probe is (or use a similar method to note the location on the bed).
ta: ஆய்வு இருக்கும் இடத்தின் கீழ் நேரடியாக டேப்பில் ஒரு அடையாளத்தை வைக்கவும் (அல்லது படுக்கையில் இருப்பிடத்தைக் கவனிக்க இதே போன்ற முறையைப் பயன்படுத்தவும்).
uk: Помістіть позначку на стрічці безпосередньо під час якого зонд (або скористайтесь схожим методом для замітки місця розташування на ліжку).

source: Issue a `GET_POSITION` command and record the toolhead XY location reported by that command. For example if one sees:
ta: ஒரு `get_position` கட்டளையை வெளியிட்டு, அந்த கட்டளையால் அறிவிக்கப்பட்ட கருவித்தொகை XY இருப்பிடத்தை பதிவு செய்யுங்கள். உதாரணமாக ஒருவர் பார்த்தால்:
uk: `GET_SETTING` командування та запис місцезнаходження Інструменту XY повідомили, що команда. Наприклад, якщо один бачить:

source: then one would record a probe X position of 46.5 and probe Y position of 27.
ta: பின்னர் ஒருவர் 46.5 என்ற ஆய்வு ஃச் நிலையை பதிவு செய்வார் மற்றும் 27 ஆம் ஆண்டின் ஆய்வு.
uk: потім записати пробе X позицію 46.5 і пробе Y позиції 27.

source: After recording the probe position, issue a series of G1 commands until the nozzle is directly above the mark on the bed. For example, one might issue:
ta: ஆய்வு நிலையை பதிவுசெய்த பிறகு, முனை நேரடியாக படுக்கையில் அடையாளத்திற்கு மேலே இருக்கும் வரை ஐயா 1 கட்டளைகளை வழங்கவும். எடுத்துக்காட்டாக, ஒருவர் வெளியிடலாம்:
uk: Після запису положення проби виписайте ряд команд G1 до моменту, поки насадка безпосередньо над позначкою на ліжку. Наприклад, можливо, питання:

source: to move the nozzle to an X position of 57 and Y of 30. Once one finds the position directly above the mark, use the `GET_POSITION` command to report that position. This is the nozzle position.
ta: முனை 57 மற்றும் 30 இன் ஃச் நிலைக்கு நகர்த்துவதற்கு. ஒருவர் அந்த நிலையை நேரடியாக அடையாளத்திற்கு மேலே கண்டறிந்தவுடன், அந்த நிலையைப் புகாரளிக்க `get_position` கட்டளையைப் பயன்படுத்தவும். இது முனை நிலை.
uk: перемістити насадку до положення X 57 і Y від 30. Після того, як ви знайдете позицію безпосередньо над позначкою, скористайтеся `GET_SETTING`, щоб повідомити цю позицію. Це положення насадки.

source: The x_offset is then the `nozzle_x_position - probe_x_position` and y_offset is similarly the `nozzle_y_position - probe_y_position`. Update the printer.cfg file with the given values, remove the tape/marks from the bed, and then issue a `RESTART` command so that the new values take effect.
ta: X_offset பின்னர் `nozle_x_position - probe_x_position` மற்றும் y_offset இதேபோல்` முனை_ஒய்_போசிசன் - Probe_y_position` ஆகும். கொடுக்கப்பட்ட மதிப்புகளுடன் printur.cfg கோப்பைப் புதுப்பிக்கவும், படுக்கையில் இருந்து டேப்/மதிப்பெண்களை அகற்றி, பின்னர் `மறுதொடக்கம்` கட்டளையை வழங்கவும், இதனால் புதிய மதிப்புகள் நடைமுறைக்கு வரும்.
uk: Кс_оффсет потім `nozzle_x_положення - probe_x_положення` і y_offset аналогічно `nozzle_y_положення - probe_y_положення`. Оновіть файл принтера.cfg з заданими значеннями, видаліть стрічку/марки з ліжка, а потім випишіть команду `RESTART`, щоб нові значення впливають.

source: Calibrating probe Z offset
ta: அளவீடு செய்யும் ஆய்வு சட் ஆஃப்செட்
uk: Калібруючий зонда Z

source: Providing an accurate probe z_offset is critical to obtaining high quality prints. The z_offset is the distance between the nozzle and bed when the probe triggers. The Klipper `PROBE_CALIBRATE` tool can be used to obtain this value - it will run an automatic probe to measure the probe's Z trigger position and then start a manual probe to obtain the nozzle Z height. The probe z_offset will then be calculated from these measurements.
ta: உயர் தரமான அச்சிட்டுகளைப் பெறுவதற்கு Z_OFFSET ஐ துல்லியமான ஆய்வை வழங்குவது மிக முக்கியமானது. Z_Offset என்பது ஆய்வு தூண்டும்போது முனை மற்றும் படுக்கைக்கு இடையிலான தூரம். இந்த மதிப்பைப் பெற கிளிப்பர் `probe_calibrate` கருவி பயன்படுத்தப்படலாம் - இது ஆய்வின் சட் தூண்டுதல் நிலையை அளவிட ஒரு தானியங்கி ஆய்வை இயக்கும், பின்னர் முனை சட் உயரத்தைப் பெற ஒரு கையேடு ஆய்வைத் தொடங்கும். இந்த அளவீடுகளிலிருந்து Z_OFFSET கணக்கிடப்படும்.
uk: Надання точного зонда z_offset є критичним для отримання високоякісних друку. Z_offset - це відстань між насадкою і ліжком, коли запускається зонд. Кліппер ` PROBE_CALIBRATE` може використовуватися для отримання цього значення - він буде запустити автоматичний зонд, щоб виміряти позицію запобіжника зонда, а потім почати ручний зонд для отримання насадки Z висоти. Пробе z_offset буде обчислено з цих вимірювань.

source: Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_CALIBRATE` command to start the tool.
ta: அச்சுப்பொறியைத் தொடங்குவதன் மூலம் தொடங்கவும், பின்னர் படுக்கையின் மையத்திற்கு அருகிலுள்ள ஒரு நிலைக்கு தலையை நகர்த்தவும். ஆக்டோப்ரின்ட் டெர்மினல் தாவலுக்கு செல்லவும், கருவியைத் தொடங்க `ஆய்வு_கலிப்ரேட்` கட்டளையை இயக்கவும்.
uk: Починайте захоплення принтера і потім перемістіть голову в позицію біля центру ліжка. Навігація на вкладку OctoPrint та запустіть `PROBE_CALIBRATE`, щоб запустити інструмент.

source: This tool will perform an automatic probe, then lift the head, move the nozzle over the location of the probe point, and start the manual probe tool. If the nozzle does not move to a position above the automatic probe point, then `ABORT` the manual probe tool and perform the XY probe offset calibration described above.
ta: இந்த கருவி ஒரு தானியங்கி ஆய்வைச் செய்து, பின்னர் தலையைத் தூக்கி, ஆய்வு புள்ளியின் இருப்பிடத்தின் மீது முனை நகர்த்தி, கையேடு ஆய்வு கருவியைத் தொடங்கும். முனை தானியங்கி ஆய்வு புள்ளிக்கு மேலே ஒரு நிலைக்கு செல்லவில்லை என்றால், `கருக்கலைப்பு` கையேடு ஆய்வுக் கருவியை நிறுத்தி, மேலே விவரிக்கப்பட்ட XY ஆய்வு ஆஃப்செட் அளவுத்திருத்தத்தை செய்யுங்கள்.
uk: Цей інструмент буде виконувати автоматичний зонд, після чого піднімати голову, перемістити насадку над розташуванням точки зон проби, і почати ручний інструмент зонду. Якщо насадка не переходить на позицію над автоматичною точкою зонду, то `ABORT` ручний інструмент зонду і виконує калібрування XY, описане вище.

source: Note that if a change is made to the printer's motion system, hotend position, or probe location then it will invalidate the results of PROBE_CALIBRATE.
ta: அச்சுப்பொறி மோசன் சிச்டம்ச், ஒட்டென்ட் நிலை அல்லது ஆய்வு இருப்பிடத்தில் ஒரு மாற்றம் செய்யப்பட்டால், அது ஆய்வு அளவீடு செய்வதன் முடிவுகளை செல்லாது என்பதை நினைவில் கொள்க.
uk: Зверніть увагу, що якщо зміна виконана до системи руху принтера, положення про гарячий, або розташування зон, то вона буде недійсною результатів PROBE_CALIBRATE.

source: If the probe has an X or Y offset and the bed tilt is changed (eg, by adjusting bed screws, running DELTA_CALIBRATE, running Z_TILT_ADJUST, running QUAD_GANTRY_LEVEL, or similar) then it will invalidate the results of PROBE_CALIBRATE. After making any of the above adjustments it will be necessary to run PROBE_CALIBRATE again.
ta: ஆய்வில் ஒரு ஃச் அல்லது ஒய் ஆஃப்செட் இருந்தால் மற்றும் படுக்கை சாய்வு மாற்றப்பட்டால் (எ.கா., படுக்கை திருகுகளை சரிசெய்தல், டெல்டா_கலிபிரேட்டை இயக்குவதன் மூலம், z_tilt_adjust ஐ இயக்குவதன் மூலம், குவாட்_கான்ட்ரி_லெவல் இயங்குவதன் மூலம்) அல்லது அது ஆய்வு_காலிபிரேட்டின் முடிவுகளை செல்லாது. மேலே உள்ள ஏதேனும் மாற்றங்களைச் செய்த பிறகு, மீண்டும் ஆய்வு_ அளவீடு செய்ய வேண்டியது தேவை.
uk: Якщо зонд має X або Y зміщений і змінений нахил постільної білизни (наприклад, за допомогою регулювальних шурупів, що працюють DELTA_CALIBRATE, що працює Z_TILT_ADJUST, працює QUAD_GANTRY_LEVEL, або аналогічний), то він буде недійсним результатам PROBE_CALIBRATE. Після здійснення будь-якого з вищезазначених конфігурацій необхідно запустити PROBE_CALIBRATE знову.

source: If the results of PROBE_CALIBRATE are invalidated, then any previous [bed mesh](Bed_Mesh.md) results that were obtained using the probe are also invalidated - it will be necessary to rerun BED_MESH_CALIBRATE after recalibrating the probe.
ta: Probe_calibrate இன் முடிவுகள் செல்லாததாக இருந்தால், ஆய்வைப் பயன்படுத்தி பெறப்பட்ட முந்தைய [படுக்கை கண்ணி] (BED_MESH.MD) முடிவுகளும் செல்லாதவை - PED_MESH_CALIBRATE ஐ மீண்டும் கணக்கிட்ட பிறகு மீண்டும் உருவாக்க வேண்டியது தேவை.
uk: Якщо результати PROBE_CALIBRATE недійсні, то будь-які попередні [боротна сітка](Bed_Mesh.md) результати, які були отримані з використанням зонда, також недійсні - потрібно буде перезапустити BED_MESH_CALIBRATE після перерахунку на зонд.

source: Repeatability check
ta: மீண்டும் நிகழ்தகவு சோதனை
uk: Перевірка повторюваності

source: After calibrating the probe X, Y, and Z offsets it is a good idea to verify that the probe provides repeatable results. Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_ACCURACY` command.
ta: ஃச், ஒய் மற்றும் சட் ஈடுசெய்யப்பட்ட ஆய்வை அளவீடு செய்த பிறகு, ஆய்வு மீண்டும் மீண்டும் முடிவுகளை அளிக்கிறது என்பதை சரிபார்க்க நல்லது. அச்சுப்பொறியைத் தொடங்குவதன் மூலம் தொடங்கவும், பின்னர் படுக்கையின் மையத்திற்கு அருகிலுள்ள ஒரு நிலைக்கு தலையை நகர்த்தவும். ஆக்டோபிரிண்ட் முனைய தாவலுக்கு செல்லவும், `Probe_accuracy` கட்டளையை இயக்கவும்.
uk: Після калібрування зонду X, Y та Z offsets це гарна ідея, щоб переконатися, що зонд забезпечує повторювані результати. Починайте захоплення принтера і потім перемістіть голову в позицію біля центру ліжка. Навігація на вкладку OctoPrint та запустіть команду `PROBE_ACCURACY`.

source: This command will run the probe ten times and produce output similar to the following:
ta: இந்த கட்டளை ஆய்வை பத்து முறை இயக்கும் மற்றும் பின்வருவனவற்றைப் போன்ற வெளியீட்டை உருவாக்கும்:
uk: Ця команда буде запустити зонд десять разів і виробляти вихід, схожий на наступні:

source: Ideally the tool will report an identical maximum and minimum value. (That is, ideally the probe obtains an identical result on all ten probes.) However, it's normal for the minimum and maximum values to differ by one Z "step distance" or up to 5 microns (.005mm). A "step distance" is `rotation_distance/(full_steps_per_rotation*microsteps)`. The distance between the minimum and the maximum value is called the range. So, in the above example, since the printer uses a Z step distance of .0125, a range of 0.012500 would be considered normal.
ta: வெறுமனே கருவி ஒரே மாதிரியான அதிகபட்ச மற்றும் குறைந்தபட்ச மதிப்பைப் புகாரளிக்கும். . ஒரு "படி தூரம்" என்பது `சுழற்சி_டி/(full_steps_per_rotation*மைக்ரோச்டெப்ச்)`. குறைந்தபட்ச மற்றும் அதிகபட்ச மதிப்புக்கு இடையிலான தூரம் வரம்பு என்று அழைக்கப்படுகிறது. எனவே, மேலே உள்ள எடுத்துக்காட்டில், அச்சுப்பொறி .0125 இன் சட் படி தூரத்தைப் பயன்படுத்துவதால், 0.012500 வரம்பு பொதுவாக கருதப்படும்.
uk: В ідеалі інструмент буде звітувати ідентичне максимальне і мінімальне значення. (Це, ідеально, що зонд отримує ідентичний результат на всіх десяти зондах.) Тим не менш, це нормально для мінімальних і максимальних значень, щоб відрізнятись від однієї Z "ступінчастої відстані" або до 5 мкм (.005мм). `rotation_distance/(full_steps_per_rotation*microsteps)`. Відстань між мінімальним і максимальним значенням називається діапазон. Отже, в наведеному вище прикладі, оскільки принтер використовує Z покрокову відстань .0125, діапазон 0.012500 буде вважатися нормальним.

source: If new probe speed, samples count, or other settings are needed, then update the printer.cfg file and issue a `RESTART` command. If so, it is a good idea to [calibrate the z_offset](#calibrating-probe-z-offset) again. If repeatable results can not be obtained then don't use the probe for bed leveling. Klipper has several manual probing tools that can be used instead - see the [Bed Level document](Bed_Level.md) for further details.
ta: புதிய ஆய்வு விரைவு, மாதிரிகள் எண்ணிக்கை அல்லது பிற அமைப்புகள் தேவைப்பட்டால், அச்சுப்பொறி. CFG கோப்பைப் புதுப்பித்து `மறுதொடக்கம்` கட்டளையை வழங்கவும். அப்படியானால், மீண்டும் [Z_Offset ஐ அளவீடு செய்யுங்கள்] (#அளவீடு செய்தல்-ஆய்வு-Z-fofset) மீண்டும் ஒரு நல்ல சிந்தனை. மீண்டும் மீண்டும் செய்யக்கூடிய முடிவுகளைப் பெற முடியாவிட்டால், படுக்கை சமநிலைக்கு ஆய்வைப் பயன்படுத்த வேண்டாம். கிளிப்பரில் பல கையேடு ஆய்வு கருவிகள் உள்ளன, அதற்கு பதிலாக பயன்படுத்தப்படலாம் - மேலும் விவரங்களுக்கு [படுக்கை நிலை ஆவணம்] (BED_LEVEL.MD) ஐப் பார்க்கவும்.
uk: Якщо потрібна нова швидкість зонду, кількість зразків або інші налаштування, то оновити файл принтера.cfg і випустити команду `RESTART`. Якщо так, це хороша ідея, щоб [розрахувати z_offset](#calibrating-probe-z-offset) знову. Якщо повторювані результати не можна отримати, то не використовуйте пробе для вирівнювання ліжка. Klipper має кілька ручних інструментів, які можна використовувати замість - див. документ [Bed Level](Bed_Level.md) для подальших деталей.

source: Location Bias Check
ta: இருப்பிட சார்பு சோதனை
uk: Розташування Bias Check

source: Some probes can have a systemic bias that corrupts the results of the probe at certain toolhead locations. For example, if the probe mount tilts slightly when moving along the Y axis then it could result in the probe reporting biased results at different Y positions.
ta: சில ஆய்வுகள் ஒரு முறையான சார்புகளைக் கொண்டிருக்கலாம், இது சில கருவிஎட் இடங்களில் ஆய்வின் முடிவுகளை சிதைக்கிறது. எடுத்துக்காட்டாக, ஒய் அச்சுடன் நகரும் போது ஆய்வு மவுண்ட் சற்று சாய்வாக இருந்தால், அது வெவ்வேறு ஒய் நிலைகளில் சார்புடைய முடிவுகளை ஆய்வு செய்யக்கூடும்.
uk: Деякі зонди можуть мати системну упередженість, яка псує результати зонду на певних ділянках. Наприклад, якщо монтувати пальці зонду злегка при русі по осі Y, то це може призвести до звітності про те, що з'являються результати на різних позиціях Y.

source: This is a common issue with probes on delta printers, however it can occur on all printers.
ta: இது டெல்டா அச்சுப்பொறிகளில் ஆய்வுகளில் பொதுவான சிக்கல், இருப்பினும் இது அனைத்து அச்சுப்பொறிகளிலும் ஏற்படலாம்.
uk: Це загальна проблема з зонами на принтерах дельта, проте це може статися на всіх принтерах.

source: One can check for a location bias by using the `PROBE_CALIBRATE` command to measuring the probe z_offset at various X and Y locations. Ideally, the probe z_offset would be a constant value at every printer location.
ta: பல்வேறு ஃச் மற்றும் ஒய் இடங்களில் Z_OFFSET ஐ அளவிட `probe_calibrate` கட்டளையைப் பயன்படுத்தி இருப்பிட சார்புகளை சரிபார்க்கலாம். வெறுமனே, ஒவ்வொரு அச்சுப்பொறி இருப்பிடத்திலும் Z_OFFSET ஒரு நிலையான மதிப்பாக இருக்கும்.
uk: Один може перевірити місце розташування за допомогою `PROBE_CALIBRATE` команди для вимірювання зонда з_офсету в різних X і Y місцях. Ідеально підходить для кожного розташування принтера.

source: For delta printers, try measuring the z_offset at a position near the A tower, at a position near the B tower, and at a position near the C tower. For cartesian, corexy, and similar printers, try measuring the z_offset at positions near the four corners of the bed.
ta: டெல்டா அச்சுப்பொறிகளைப் பொறுத்தவரை, ஒரு கோபுரத்தின் அருகிலுள்ள நிலையில், பி கோபுரத்திற்கு அருகிலுள்ள நிலையில், சி கோபுரத்திற்கு அருகிலுள்ள நிலையில் Z_Offset ஐ அளவிட முயற்சிக்கவும். கார்ட்டீசியன், கோரெக்சி மற்றும் ஒத்த அச்சுப்பொறிகளுக்கு, படுக்கையின் நான்கு மூலைகளுக்கு அருகிலுள்ள நிலைகளில் Z_OFFSET ஐ அளவிட முயற்சிக்கவும்.
uk: Для дельта принтерів, намагайтеся вимірювати z_offset на позиції біля вежі A, на позиції біля вежі B, а в положенні біля вежі C. Для кошиків, сердечника та аналогічних принтерів намагатися вимірювати z_offset на посадах біля чотирьох кутів ліжка.

source: Before starting this test, first calibrate the probe X, Y, and Z offsets as described at the beginning of this document. Then home the printer and navigate to the first XY position. Follow the steps at [calibrating probe Z offset](#calibrating-probe-z-offset) to run the `PROBE_CALIBRATE` command, `TESTZ` commands, and `ACCEPT` command, but do not run `SAVE_CONFIG`. Note the reported z_offset found. Then navigate to the other XY positions, repeat these `PROBE_CALIBRATE` steps, and note the reported z_offset.
ta: இந்த சோதனையைத் தொடங்குவதற்கு முன், இந்த ஆவணத்தின் தொடக்கத்தில் விவரிக்கப்பட்டுள்ளபடி முதலில் ஃச், ஒய் மற்றும் சட் ஆஃப்செட்டுகளை அளவீடு செய்யுங்கள். பின்னர் அச்சுப்பொறியை வைத்து முதல் XY நிலைக்கு செல்லவும். `Probe_calibrate` கட்டளை,` டெச்ட்ச்` கட்டளைகள், மற்றும் `ஏற்றுக்கொள்` கட்டளையை இயக்க [அளவீடு ஆய்வு சட் ஆஃப்செட்] (#அளவீடு-புரோப்-இசட்-ஆஃப்செட்) படிகளைப் பின்பற்றவும், ஆனால்` Save_config` ஐ இயக்க வேண்டாம். அறிவிக்கப்பட்ட Z_OFFSET ஐக் கவனியுங்கள். பின்னர் மற்ற XY நிலைகளுக்கு செல்லவும், இந்த `ஆய்வு_ அளவுகோல்` படிகளை மீண்டும் செய்யவும், அறிக்கையிடப்பட்ட Z_OFFSET ஐக் கவனியுங்கள்.
uk: Перед початком цього тесту спочатку відкалібруйте зміщення датчика X, Y і Z, як описано на початку цього документа. Потім увімкніть принтер і перейдіть до першої позиції XY. Виконайте дії, описані в розділі [калібрування зонда Z offset](#calibrating-probe-z-offset), щоб запустити команду `PROBE_CALIBRATE`, команди `TESTZ` і команду `ACCEPT`, але не запускайте `SAVE_CONFIG`. Зверніть увагу на знайдений z_offset. Потім перейдіть до інших позицій XY, повторіть ці кроки `PROBE_CALIBRATE` і зверніть увагу на зареєстрований z_offset.

source: If the difference between the minimum reported z_offset and the maximum reported z_offset is greater than 25 microns (.025mm) then the probe is not suitable for typical bed leveling procedures. See the [Bed Level document](Bed_Level.md) for manual probe alternatives.
ta: குறைந்தபட்ச அறிக்கையிடப்பட்ட Z_OFFSET மற்றும் அதிகபட்சமாக அறிவிக்கப்பட்ட Z_OFFSET க்கு இடையிலான வேறுபாடு 25 மைக்ரான் (.025 மிமீ) ஐ விட அதிகமாக இருந்தால், வழக்கமான படுக்கை சமப்படுத்தும் நடைமுறைகளுக்கு ஆய்வு பொருத்தமானதல்ல. கையேடு ஆய்வு மாற்றுகளுக்கு [படுக்கை நிலை ஆவணம்] (BED_LEVEL.MD) ஐப் பார்க்கவும்.
uk: Якщо різниця між мінімальним повідомленням z_offset і максимальною заявленою z_offset є більше 25 мікронів (.025mm) після чого зонд не підходить для типових процедур вирівнювання ліжко. Дивитися [Bed Level документа](Bed_Level.md) для ручних альтернатив зон проби.

source: Temperature Bias
ta: வெப்பநிலை சார்பு
uk: Температура Bias

source: Many probes have a systemic bias when probing at different temperatures. For example, the probe may consistently trigger at a lower height when the probe is at a higher temperature.
ta: வெவ்வேறு வெப்பநிலையில் ஆராயும்போது பல ஆய்வுகள் ஒரு முறையான சார்புகளைக் கொண்டுள்ளன. எடுத்துக்காட்டாக, ஆய்வு அதிக வெப்பநிலையில் இருக்கும்போது ஆய்வு தொடர்ந்து குறைந்த உயரத்தில் தூண்டக்கூடும்.
uk: Багато зондів мають системний зсув при проборі при різних температурах. Наприклад, зонд може послідовно спрацьовуватися при меншій висоті, коли зонд знаходиться при більшій температурі.

source: It is recommended to run the bed leveling tools at a consistent temperature to account for this bias. For example, either always run the tools when the printer is at room temperature, or always run the tools after the printer has obtained a consistent print temperature. In either case, it is a good idea to wait several minutes after the desired temperature is reached, so that the printer apparatus is consistently at the desired temperature.
ta: இந்த சார்புக்கு கணக்கில் ஒரு நிலையான வெப்பநிலையில் படுக்கை சமப்படுத்தும் கருவிகளை இயக்க பரிந்துரைக்கப்படுகிறது. எடுத்துக்காட்டாக, அச்சுப்பொறி அறை வெப்பநிலையில் இருக்கும்போது எப்போதும் கருவிகளை இயக்கவும், அல்லது அச்சுப்பொறி ஒரு நிலையான அச்சு வெப்பநிலையைப் பெற்ற பிறகு எப்போதும் கருவிகளை இயக்கவும். இரண்டிலும், விரும்பிய வெப்பநிலை அடைந்த பல நிமிடங்கள் காத்திருப்பது நல்லது, இதனால் அச்சுப்பொறி கருவி தொடர்ந்து விரும்பிய வெப்பநிலையில் இருக்கும்.
uk: Рекомендується запускати засоби вирівнювання постільних речей при незмінній температурі на рахунок цього зносу. Наприклад, як завжди працюють інструменти, коли принтер знаходиться при кімнатній температурі, або завжди запускають інструменти після принтера, отриманих послідовною температурою друку. У будь-якому випадку, це гарна ідея, щоб почекати кілька хвилин після досягнення бажаної температури, щоб пристрій принтера послідовно при бажаній температурі.

source: To check for a temperature bias, start with the printer at room temperature and then home the printer, move the head to a position near the center of the bed, and run the `PROBE_ACCURACY` command. Note the results. Then, without homing or disabling the stepper motors, heat the printer nozzle and bed to printing temperature, and run the `PROBE_ACCURACY` command again. Ideally, the command will report identical results. As above, if the probe does have a temperature bias then be careful to always use the probe at a consistent temperature.
ta: வெப்பநிலை சார்புகளைச் சரிபார்க்க, அறை வெப்பநிலையில் அச்சுப்பொறியுடன் தொடங்கி, பின்னர் அச்சுப்பொறியை வீட்டிற்கு வைத்து, படுக்கையின் மையத்திற்கு அருகிலுள்ள நிலைக்கு தலையை நகர்த்தவும், `ஆய்வு_அக்யூரசி` கட்டளையை இயக்கவும். முடிவுகளைக் கவனியுங்கள். பின்னர், ச்டெப்பர் மோட்டார்கள் ஓமிங் அல்லது முடக்காமல், அச்சுப்பொறி முனை மற்றும் படுக்கையை வெப்பநிலையை அச்சிடுவதற்கு சூடாக்கி, மீண்டும் `Probe_accuracy` கட்டளையை இயக்கவும். வெறுமனே, கட்டளை ஒரே மாதிரியான முடிவுகளைப் புகாரளிக்கும். மேலே உள்ளபடி, ஆய்வுக்கு வெப்பநிலை சார்பு இருந்தால், ஒரு நிலையான வெப்பநிலையில் எப்போதும் ஆய்வைப் பயன்படுத்த கவனமாக இருங்கள்.
uk: Щоб перевірити температурний зсув, починайте з принтером при кімнатній температурі, а потім додому принтер, перемістіть голову в позицію біля центру ліжка, і запустіть команду `PROBE_ACCURACY`. Зверніть увагу на результати. Потім, не захоплюючий або відключаючи степперові мотори, нагрівайте насадку принтера і ліжко до температури друку, і запустіть команду `PROBE_ACCURACY`. В ідеалі команда звітує ідентичні результати. Як і вище, якщо зонд має температуру, то будьте обережні, щоб завжди використовувати зонд при послідовній температурі.

source: PROBE
uk: ПРОБЛЕ

source: Recv: // toolhead: X:46.500000 Y:27.000000 Z:15.000000 E:0.000000
uk: Recv: // інструментголова: X:46.500000 Y:27.000000 З:15.000000 E:0.000000

source: SAVE_CONFIG
uk: ПРОКСИМУС
