Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Protocol.po
Languages: bg, ru

source: The Klipper messaging protocol is used for low-level communication between the Klipper host software and the Klipper micro-controller software. At a high level the protocol can be thought of as a series of command and response strings that are compressed, transmitted, and then processed at the receiving side. An example series of commands in uncompressed human-readable format might look like:
bg: Протоколът за съобщения на Klipper се използва за комуникация на ниско ниво между хост софтуера на Klipper и софтуера на микроконтролера Klipper. На високо ниво протоколът може да се разглежда като поредица от низове с команди и отговори, които се компресират, предават и след това се обработват от приемащата страна. Примерна поредица от команди в некомпресиран формат, удобен за четене от човека, може да изглежда така:
ru: Протокол обмена сообщениями Klipper используется для низкоуровневой связи между программным обеспечением хоста Klipper и программным обеспечением микроконтроллера Klipper. На высоком уровне протокол можно рассматривать как последовательность строк команд и ответов, которые сжимаются, передаются, а затем обрабатываются на принимающей стороне. Примерная серия команд в несжатом удобочитаемом формате может выглядеть следующим образом:

source: See the [mcu commands](MCU_Commands.md) document for information on available commands. See the [debugging](Debugging.md) document for information on how to translate a G-Code file into its corresponding human-readable micro-controller commands.
bg: Вижте документа [mcu commands](MCU_Commands.md) за информация относно наличните команди. Вижте документа [debugging](Debugging.md) за информация как да преведете G-Code файл в съответните му четими за човека команди за микроконтролера.
ru: Смотрите [mcu commands](MCU_Commands.md) документ для получения информации о доступных командах. См. документ [отладка](Debugging.md) для получения информации о том, как преобразовать файл G-кода в соответствующие команды микроконтроллера, доступные для чтения человеком.

source: This page provides a high-level description of the Klipper messaging protocol itself. It describes how messages are declared, encoded in binary format (the "compression" scheme), and transmitted.
bg: Тази страница съдържа описание на високо ниво на самия протокол за обмен на съобщения Klipper. Тя описва как съобщенията се декларират, кодират в двоичен формат ("компресираща" схема) и предават.
ru: На этой странице представлено высокоуровневое описание самого протокола обмена сообщениями Klipper. В нем описывается, как сообщения объявляются, кодируются в двоичном формате (схема "сжатия") и передаются.

source: The goal of the protocol is to enable an error-free communication channel between the host and micro-controller that is low-latency, low-bandwidth, and low-complexity for the micro-controller.
bg: Целта на протокола е да осигури безпогрешен комуникационен канал между хоста и микроконтролера, който е с ниска латентност, ниска честотна лента и ниска сложност за микроконтролера.
ru: Цель протокола — обеспечить безошибочную работу канала связи между хостом и микроконтроллером с низкой задержкой, низкой пропускной способностью и низкой сложностью для микроконтроллера.

source: Micro-controller Interface
bg: Интерфейс на микроконтролера
ru: Интерфейс микроконтроллера

source: The Klipper transmission protocol can be thought of as a [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) mechanism between micro-controller and host. The micro-controller software declares the commands that the host may invoke along with the response messages that it can generate. The host uses that information to command the micro-controller to perform actions and to interpret the results.
bg: Протоколът за предаване Klipper може да се разглежда като механизъм [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) между микроконтролера и хоста. Софтуерът на микроконтролера декларира командите, които хостът може да извика, заедно със съобщенията за отговор, които може да генерира. Домакинът използва тази информация, за да командва микроконтролера да извършва действия и да интерпретира резултатите.
ru: Протокол передачи данных Klipper можно представить как механизм [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) между микроконтроллером и хостом. Программное обеспечение микроконтроллера объявляет команды, которые может вызывать хост, а также ответные сообщения, которые он может генерировать. Хост использует эту информацию, чтобы дать команду микроконтроллеру на выполнение действий и интерпретировать их результаты.

source: Declaring commands
bg: Деклариране на команди
ru: Объявление команд

source: The micro-controller software declares a "command" by using the DECL_COMMAND() macro in the C code. For example:
bg: Софтуерът на микроконтролера декларира "команда", като използва макроса DECL_COMMAND() в кода на езика С. Например:
ru: Программное обеспечение микроконтроллера объявляет "команду" с помощью макроса DECL_COMMAND() в коде на C. Например:

source: The above declares a command named "update_digital_out". This allows the host to "invoke" this command which would cause the command_update_digital_out() C function to be executed in the micro-controller. The above also indicates that the command takes two integer parameters. When the command_update_digital_out() C code is executed, it will be passed an array containing these two integers - the first corresponding to the 'oid' and the second corresponding to the 'value'.
bg: Горното декларира команда с име "update_digital_out". Това позволява на хоста да "извика" тази команда, което ще доведе до изпълнение на функцията command_update_digital_out() C в микроконтролера. Горното също така показва, че командата приема два целочислени параметъра. Когато кодът command_update_digital_out() C бъде изпълнен, ще му бъде предаден масив, съдържащ тези две цели числа - първото, съответстващо на "oid", и второто, съответстващо на "value".
ru: Выше объявлена команда с именем "update_digital_out". Это позволяет хосту "вызвать" эту команду, что приведет к выполнению C-функции command_update_digital_out() в микроконтроллере. Выше также указано, что команда принимает два целочисленных параметра. При выполнении C-кода command_update_digital_out() ему будет передан массив, содержащий эти два целых числа - первое, соответствующее 'oid', и второе, соответствующее 'value'.

source: In general, the parameters are described with printf() style syntax (eg, "%u"). The formatting directly corresponds to the human-readable view of commands (eg, "update_digital_out oid=7 value=1"). In the above example, "value=" is a parameter name and "%c" indicates the parameter is an integer. Internally, the parameter name is only used as documentation. In this example, the "%c" is also used as documentation to indicate the expected integer is 1 byte in size (the declared integer size does not impact the parsing or encoding).
bg: По принцип параметрите се описват със синтаксис в стил printf() (например "%u"). Форматирането пряко съответства на разбираемия за човека вид на командите (напр. "update_digital_out oid=7 value=1"). В горния пример "value=" е име на параметър, а "%c" показва, че параметърът е цяло число. Вътрешно името на параметъра се използва само като документация. В този пример "%c" се използва и като документация, за да покаже, че очакваното цяло число е с размер 1 байт (декларираният размер на цялото число не влияе на парсинга или кодирането).
ru: В общем случае параметры описываются с помощью синтаксиса в стиле printf() (например, "%u"). Форматирование напрямую соответствует человекочитаемому виду команд (например, "update_digital_out oid=7 value=1"). В приведенном выше примере "value=" - это имя параметра, а "%c" указывает на то, что параметр является целым числом. Внутри программы имя параметра используется только в качестве документации. В этом примере "%c" также используется в качестве документации, чтобы указать, что ожидаемое целое число имеет размер 1 байт (объявленный размер целого числа не влияет на синтаксический анализ или кодировку).

source: The micro-controller build will collect all commands declared with DECL_COMMAND(), determine their parameters, and arrange for them to be callable.
bg: Изграждането на микроконтролера ще събере всички команди, декларирани с DECL_COMMAND(), ще определи техните параметри и ще ги подготви за извикване.
ru: Сборка микроконтроллера соберет все команды, объявленные с помощью DECL_COMMAND(), определит их параметры и сделает их вызываемыми.

source: Declaring responses
bg: Деклариране на отговори
ru: Объявление ответов

source: To send information from the micro-controller to the host a "response" is generated. These are both declared and transmitted using the sendf() C macro. For example:
bg: За да се изпрати информация от микроконтролера към хоста, се генерира "отговор". Те се декларират и предават с помощта на макроса sendf() C. Например:
ru: Для передачи информации от микроконтроллера к хосту генерируется "ответ". Они объявляются и передаются с помощью макроса sendf() C. Например:

source: The above transmits a "status" response message that contains two integer parameters ("clock" and "status"). The micro-controller build automatically finds all sendf() calls and generates encoders for them. The first parameter of the sendf() function describes the response and it is in the same format as command declarations.
bg: В горния случай се предава съобщение за отговор "статус", което съдържа два целочислени параметъра ("clock" и "status"). Изграждането на микроконтролера автоматично открива всички sendf() повиквания и генерира енкодери за тях. Първият параметър на функцията sendf() описва отговора и е в същия формат като декларациите на командите.
ru: Выше передается ответное сообщение "status", содержащее два целочисленных параметра ("clock" и "status"). Сборка микроконтроллера автоматически находит все вызовы sendf() и генерирует для них кодировщики. Первый параметр функции sendf() описывает ответ и имеет тот же формат, что и объявления команд.

source: The host can arrange to register a callback function for each response. So, in effect, commands allow the host to invoke C functions in the micro-controller and responses allow the micro-controller software to invoke code in the host.
bg: Домакинът може да регистрира функция за обратно извикване за всеки отговор. Така на практика командите позволяват на хоста да извиква C функции в микроконтролера, а отговорите позволяват на софтуера на микроконтролера да извиква код в хоста.
ru: Хост может зарегистрировать функцию обратного вызова для каждого ответа. Таким образом, команды позволяют хосту вызывать функции C в микроконтроллере, а ответы позволяют программному обеспечению микроконтроллера вызывать код в хосте.

source: The sendf() macro should only be invoked from command or task handlers, and it should not be invoked from interrupts or timers. The code does not need to issue a sendf() in response to a received command, it is not limited in the number of times sendf() may be invoked, and it may invoke sendf() at any time from a task handler.
bg: Макросът sendf() трябва да се извиква само от обработчици на команди или задачи и не трябва да се извиква от прекъсвачи или таймери. Не е необходимо кодът да издава sendf() в отговор на получена команда, той не е ограничен в броя на случаите, в които може да бъде извикан sendf(), и може да извика sendf() по всяко време от обработчик на задачи.
ru: Макрос sendf() должен вызываться только из обработчиков команд или задач и не должен вызываться из прерываний или таймеров. Коду не нужно выдавать sendf() в ответ на полученную команду, он не ограничен в количестве вызовов sendf() и может вызывать sendf() в любое время из обработчика задачи.

source: Output responses
bg: Изходни отговори
ru: Выходные ответы

source: To simplify debugging, there is also an output() C function. For example:
bg: За да се улесни отстраняването на грешки, има и функция output() C. Например:
ru: Для упрощения отладки также имеется функция вывода() на Си. Например:

source: The output() function is similar in usage to printf() - it is intended to generate and format arbitrary messages for human consumption.
bg: Функцията output() е подобна на printf() - тя е предназначена за генериране и форматиране на произволни съобщения за човешка употреба.
ru: Функция output() по своему назначению похожа на printf() - она предназначена для генерации и форматирования произвольных сообщений для человеческого потребления.

source: Declaring enumerations
bg: Деклариране на изброявания
ru: Объявление перечислений

source: Enumerations allow the host code to use string identifiers for parameters that the micro-controller handles as integers. They are declared in the micro-controller code - for example:
bg: Изброяването позволява на кода на хоста да използва символни низове за параметри, които микроконтролерът обработва като цели числа. Те се декларират в кода на микроконтролера - например:
ru: Перечисления позволяют коду хоста использовать строковые идентификаторы для параметров, которые микроконтроллер обрабатывает как целые числа. Они объявляются в коде микроконтроллера - например:

source: If the first example, the DECL_ENUMERATION() macro defines an enumeration for any command/response message with a parameter name of "spi_bus" or parameter name with a suffix of "_spi_bus". For those parameters the string "spi" is a valid value and it will be transmitted with an integer value of zero.
bg: В първия пример макросът DECL_ENUMERATION() дефинира изброяване за всяко съобщение за команда/отговор с име на параметър "spi_bus" или име на параметър със суфикс "_spi_bus". За тези параметри низът "spi" е валидна стойност и тя ще бъде предадена с цяло число, равно на нула.
ru: В первом примере макрос DECL_ENUMERATION() определяет перечисление для любого сообщения команды/ответа с именем параметра "spi_bus" или именем параметра с суффиксом "_spi_bus". Для этих параметров строка "spi" является допустимым значением и будет передаваться с целым значением, равным нулю.

source: It's also possible to declare an enumeration range. In the second example, a "pin" parameter (or any parameter with a suffix of "_pin") would accept PC0, PC1, PC2, ..., PC7 as valid values. The strings will be transmitted with integers 16, 17, 18, ..., 23.
bg: Възможно е също така да декларирате обхват на изброяване. Във втория пример параметърът "pin" (или всеки параметър със суфикс "_pin") ще приема като валидни стойности PC0, PC1, PC2, ..., PC7. Низовете ще се предават с цели числа 16, 17, 18, ..., 23.
ru: Также можно объявить диапазон перечислений. Во втором примере параметр "pin" (или любой другой параметр с суффиксом "_pin") будет принимать в качестве допустимых значений PC0, PC1, PC2, ..., PC7. Строки будут передаваться целыми числами 16, 17, 18, ..., 23.

source: Declaring constants
bg: Деклариране на константи
ru: Объявление констант

source: Constants can also be exported. For example, the following:
bg: Константите също могат да бъдат експортирани. Например, следното:
ru: Константы также можно экспортировать. Например, следующее:

source: would export a constant named "SERIAL_BAUD" with a value of 250000 from the micro-controller to the host. It is also possible to declare a constant that is a string - for example:
bg: ще експортира константа с име "SERIAL_BAUD" със стойност 250000 от микроконтролера към хоста. Възможно е също така да декларирате константа, която представлява низ - например:
ru: экспортирует из микроконтроллера в хост константу с именем "SERIAL_BAUD" со значением 250000. Также можно объявить константу, которая является строкой - например:

source: Low-level message encoding
bg: Кодиране на съобщения на ниско ниво
ru: Низкоуровневое кодирование сообщений

source: To accomplish the above RPC mechanism, each command and response is encoded into a binary format for transmission. This section describes the transmission system.
bg: За да се осъществи горепосоченият механизъм RPC, всяка команда и отговор се кодират в двоичен формат за предаване. Този раздел описва системата за предаване.
ru: Чтобы реализовать описанный выше механизм RPC, каждая команда и ответ кодируются в двоичный формат для передачи. В этом разделе описывается система передачи данных.

source: Message Blocks
bg: Блокове за съобщения
ru: Блоки сообщений

source: All data sent from host to micro-controller and vice-versa are contained in "message blocks". A message block has a two byte header and a three byte trailer. The format of a message block is:
bg: Всички данни, изпращани от хоста към микроконтролера и обратно, се съдържат в "блокове за съобщения". Блокът от съобщения има два байта заглавие и три байта трейлър. Форматът на блока от съобщения е:
ru: Все данные, передаваемые от хоста к микроконтроллеру и наоборот, содержатся в "блоках сообщений". Блок сообщения имеет двухбайтовый заголовок и трехбайтовый трейлер. Формат блока сообщений следующий:

source: The length byte contains the number of bytes in the message block including the header and trailer bytes (thus the minimum message length is 5 bytes). The maximum message block length is currently 64 bytes. The sequence byte contains a 4 bit sequence number in the low-order bits and the high-order bits always contain 0x10 (the high-order bits are reserved for future use). The content bytes contain arbitrary data and its format is described in the following section. The crc bytes contain a 16bit CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) of the message block including the header bytes but excluding the trailer bytes. The sync byte is 0x7e.
bg: Байтът за дължина съдържа броя на байтовете в блока на съобщението, включително байтовете на заглавието и трейлъра (по този начин минималната дължина на съобщението е 5 байта). В момента максималната дължина на блока от съобщения е 64 байта. Байтът на последователността съдържа 4-битов номер на последователността в ниските битове, а високите битове винаги съдържат 0x10 (високите битове са запазени за бъдеща употреба). Байтовете със съдържание съдържат произволни данни и техният формат е описан в следващия раздел. Байтовете crc съдържат 16-битов CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) на блока от съобщения, включително байтовете на заглавието, но без байтовете на ремаркето. Синхронизиращият байт е 0x7e.
ru: Байт длины содержит количество байт в блоке сообщения, включая байты заголовка и трейлера (таким образом, минимальная длина сообщения составляет 5 байт). Максимальная длина блока сообщения в настоящее время составляет 64 байта. Байт последовательности содержит 4-битный номер последовательности в младших битах, а старшие биты всегда содержат 0x10 (старшие биты зарезервированы для будущего использования). Байт содержимого содержит произвольные данные, их формат описан в следующем разделе. Байт crc содержит 16-битный CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) блока сообщения, включая байты заголовка, но исключая байты трейлера. Байт синхронизации имеет значение 0x7e.

source: The format of the message block is inspired by [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control) message frames. Like in HDLC, the message block may optionally contain an additional sync character at the start of the block. Unlike in HDLC, a sync character is not exclusive to the framing and may be present in the message block content.
bg: Форматът на блока от съобщения е вдъхновен от рамките от съобщения [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control). Подобно на HDLC, блокът от съобщения може по желание да съдържа допълнителен синхронизиращ символ в началото на блока. За разлика от HDLC, символът за синхронизация не е изключителен за рамкирането и може да присъства в съдържанието на блока от съобщения.
ru: Формат блока сообщений разработан по образцу кадров сообщений [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control). Как и в HDLC, блок сообщений может опционально содержать дополнительный символ синхронизации в начале блока. В отличие от HDLC, символ синхронизации не является исключительной частью фрейма и может присутствовать в содержимом блока сообщений.

source: Message Block Contents
bg: Съдържание на блока от съобщения
ru: Содержание блока сообщений

source: Each message block sent from host to micro-controller contains a series of zero or more message commands in its contents. Each command starts with a [Variable Length Quantity](#variable-length-quantities) (VLQ) encoded integer command-id followed by zero or more VLQ parameters for the given command.
bg: Всеки блок от съобщения, изпратен от хоста към микроконтролера, съдържа поредица от нула или повече команди за съобщения. Всяка команда започва с [Variable Length Quantity](#variable-length-quantities) (VLQ) кодирано цяло число command-id, последвано от нула или повече VLQ параметри за дадената команда.
ru: Каждый блок сообщений, передаваемый от хоста к микроконтроллеру, содержит серию из нуля или более команд сообщений. Каждая команда начинается с [Variable Length Quantity](#variable-length-quantities) (VLQ), закодированного целочисленного command-id, за которым следуют ноль или более VLQ-параметров для данной команды.

source: As an example, the following four commands might be placed in a single message block:
bg: Например, следните четири команди могат да бъдат поставени в един блок от съобщения:
ru: Например, следующие четыре команды могут быть помещены в один блок сообщений:

source: and encoded into the following eight VLQ integers:
bg: и се кодират в следните осем VLQ цели числа:
ru: и кодируются в следующие восемь целых чисел VLQ:

source: In order to encode and parse the message contents, both the host and micro-controller must agree on the command ids and the number of parameters each command has. So, in the above example, both the host and micro-controller would know that "id_update_digital_out" is always followed by two parameters, and "id_get_config" and "id_get_clock" have zero parameters. The host and micro-controller share a "data dictionary" that maps the command descriptions (eg, "update_digital_out oid=%c value=%c") to their integer command-ids. When processing the data, the parser will know to expect a specific number of VLQ encoded parameters following a given command id.
bg: За да се кодира и анализира съдържанието на съобщението, хостът и микроконтролерът трябва да се споразумеят за идентификаторите на командите и броя на параметрите на всяка команда. Така в горния пример и хостът, и микроконтролерът ще знаят, че "id_update_digital_out" винаги е последвана от два параметъра, а "id_get_config" и "id_get_clock" имат нула параметри. Домакинът и микроконтролерът споделят "речник на данните", който съпоставя описанията на командите (например "update_digital_out oid=%c value=%c") с техните целочислени идентификатори на командите. Когато обработва данните, анализаторът знае, че трябва да очаква определен брой VLQ кодирани параметри след даден идентификатор на команда.
ru: Чтобы закодировать и разобрать содержимое сообщения, хост и микроконтроллер должны договориться об идентификаторах команд и количестве параметров в каждой команде. Так, в приведенном выше примере и хост, и микроконтроллер будут знать, что за командой "id_update_digital_out" всегда следуют два параметра, а команды "id_get_config" и "id_get_clock" имеют нулевые параметры. Хост и микроконтроллер совместно используют "словарь данных", который сопоставляет описания команд (например, "update_digital_out oid=%c value=%c") с их целочисленными идентификаторами команд. При обработке данных синтаксический анализатор будет знать, что после заданного идентификатора команды следует определенное количество параметров в кодировке VLQ.
