Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Protocol.po
Languages: bg, ru

source: The message contents for blocks sent from micro-controller to host follow the same format. The identifiers in these messages are "response ids", but they serve the same purpose and follow the same encoding rules. In practice, message blocks sent from the micro-controller to the host never contain more than one response in the message block contents.
bg: Съдържанието на съобщенията за блоковете, изпращани от микроконтролера към хоста, следва същия формат. Идентификаторите в тези съобщения са "идентификатори на отговора", но те служат за същата цел и следват същите правила за кодиране. На практика блоковете от съобщения, изпращани от микроконтролера към хоста, никога не съдържат повече от един отговор в съдържанието на блока от съобщения.
ru: Содержание сообщений для блоков, отправляемых от микроконтроллера к хосту, имеет одинаковый формат. Идентификаторы в этих сообщениях - это "идентификаторы ответов", но они служат той же цели и подчиняются тем же правилам кодирования. На практике блоки сообщений, отправляемые от микроконтроллера к хосту, никогда не содержат более одного ответа в содержимом блока сообщений.

source: Variable Length Quantities
bg: Количества с променлива дължина
ru: Количества переменной длины

source: See the [wikipedia article](https://en.wikipedia.org/wiki/Variable-length_quantity) for more information on the general format of VLQ encoded integers. Klipper uses an encoding scheme that supports both positive and negative integers. Integers close to zero use less bytes to encode and positive integers typically encode using less bytes than negative integers. The following table shows the number of bytes each integer takes to encode:
bg: Вижте статията в [Уикипедия](https://en.wikipedia.org/wiki/Variable-length_quantity) за повече информация относно общия формат на VLQ кодираните цели числа. Klipper използва схема за кодиране, която поддържа както положителни, така и отрицателни цели числа. Цели числа, близки до нула, използват по-малко байтове за кодиране, а положителните цели числа обикновено се кодират с по-малко байтове, отколкото отрицателните цели числа. Следващата таблица показва броя на байтовете, необходими за кодиране на всяко цяло число:
ru: Более подробную информацию об общем формате целых чисел, закодированных в VLQ, смотрите в статье [wikipedia](https://en.wikipedia.org/wiki/Variable-length_quantity). Klipper использует схему кодирования, которая поддерживает как положительные, так и отрицательные целые числа. Для кодирования целых чисел, близких к нулю, требуется меньше байт, а для кодирования положительных целых чисел обычно требуется меньше байт, чем для отрицательных. В следующей таблице показано количество байт, необходимых для кодирования каждого целого числа:

source: Integer
bg: Цели числа
ru: Целое число

source: Encoded size
bg: Кодиран размер
ru: Размер в кодировке

source: Variable length strings
bg: Низове с променлива дължина
ru: Строки переменной длины

source: As an exception to the above encoding rules, if a parameter to a command or response is a dynamic string then the parameter is not encoded as a simple VLQ integer. Instead it is encoded by transmitting the length as a VLQ encoded integer followed by the contents itself:
bg: Като изключение от горните правила за кодиране, ако параметър на команда или отговор е динамичен низ, тогава параметърът не се кодира като просто цяло число VLQ. Вместо това той се кодира чрез предаване на дължината като VLQ кодирано цяло число, последвано от самото съдържание:
ru: В качестве исключения из вышеуказанных правил кодирования, если параметр команды или ответа представляет собой динамическую строку, то параметр не кодируется как простое целое число VLQ. Вместо этого он кодируется путем передачи длины в виде целого числа в кодировке VLQ, за которым следует само содержимое:

source: The command descriptions found in the data dictionary allow both the host and micro-controller to know which command parameters use simple VLQ encoding and which parameters use string encoding.
bg: Описанията на командите, които се намират в речника на данните, позволяват на хоста и микроконтролера да разберат кои параметри на командите използват просто VLQ кодиране и кои параметри използват символно кодиране.
ru: Описания команд, содержащиеся в словаре данных, позволяют хосту и микроконтроллеру узнать, какие параметры команды используют простую кодировку VLQ, а какие - строковую кодировку.

source: Data Dictionary
bg: Речник на данните
ru: Словарь данных

source: In order for meaningful communications to be established between micro-controller and host, both sides must agree on a "data dictionary". This data dictionary contains the integer identifiers for commands and responses along with their descriptions.
bg: За да може да се установи смислена комуникация между микроконтролера и хоста, двете страни трябва да се споразумеят за "речник на данните". Този речник на данните съдържа целочислените идентификатори на командите и отговорите, както и техните описания.
ru: Для того чтобы между микроконтроллером и хостом установился полноценный обмен данными, обе стороны должны договориться о "словаре данных". Этот словарь данных содержит целочисленные идентификаторы команд и ответов, а также их описания.

source: The micro-controller build uses the contents of DECL_COMMAND() and sendf() macros to generate the data dictionary. The build automatically assigns unique identifiers to each command and response. This system allows both the host and micro-controller code to seamlessly use descriptive human-readable names while still using minimal bandwidth.
bg: Изграждането на микроконтролера използва съдържанието на макросите DECL_COMMAND() и sendf(), за да генерира речника с данни. Изграждането автоматично присвоява уникални идентификатори на всяка команда и отговор. Тази система позволява както на кода на хоста, така и на кода на микроконтролера безпроблемно да използват описателни имена, които могат да се четат от човека, като същевременно използват минимална честотна лента.
ru: Сборка микроконтроллера использует содержимое макросов DECL_COMMAND() и sendf() для создания словаря данных. Сборка автоматически присваивает уникальные идентификаторы каждой команде и ответу. Такая система позволяет коду хоста и микроконтроллера без проблем использовать описательные человекопонятные имена, используя при этом минимальную пропускную способность.

source: The host queries the data dictionary when it first connects to the micro-controller. Once the host downloads the data dictionary from the micro-controller, it uses that data dictionary to encode all commands and to parse all responses from the micro-controller. The host must therefore handle a dynamic data dictionary. However, to keep the micro-controller software simple, the micro-controller always uses its static (compiled in) data dictionary.
bg: При първоначалното свързване с микроконтролера хостът прави запитване към речника с данни. След като хостът изтегли речника на данните от микроконтролера, той използва този речник на данните, за да кодира всички команди и да анализира всички отговори от микроконтролера. Следователно хостът трябва да работи с динамичен речник на данните. Въпреки това, за да се запази софтуерът на микроконтролера прост, микроконтролерът винаги използва своя статичен (компилиран) речник на данните.
ru: Хост запрашивает словарь данных при первом подключении к микроконтроллеру. Как только хост загружает словарь данных с микроконтроллера, он использует этот словарь данных для кодирования всех команд и разбора всех ответов микроконтроллера. Таким образом, хост должен работать с динамическим словарем данных. Однако, чтобы упростить программное обеспечение микроконтроллера, он всегда использует статический (скомпилированный) словарь данных.

source: The data dictionary is queried by sending "identify" commands to the micro-controller. The micro-controller will respond to each identify command with an "identify_response" message. Since these two commands are needed prior to obtaining the data dictionary, their integer ids and parameter types are hard-coded in both the micro-controller and the host. The "identify_response" response id is 0, the "identify" command id is 1. Other than having hard-coded ids the identify command and its response are declared and transmitted the same way as other commands and responses. No other command or response is hard-coded.
bg: В речника с данни се правят справки чрез изпращане на команди "идентификация" към микроконтролера. Микроконтролерът отговаря на всяка команда за идентификация със съобщение "identify_response". Тъй като тези две команди са необходими преди получаването на речника на данните, техните целочислени идентификатори и типове параметри са твърдо кодирани както в микроконтролера, така и в хоста. Идентификаторът на отговора "identify_response" е 0, а идентификаторът на командата "identify" е 1. Освен че имат твърдо кодирани идентификатори, командата "identify" и нейният отговор се декларират и предават по същия начин, както другите команди и отговори. Нито една друга команда или отговор не са твърдо кодирани.
ru: Словарь данных запрашивается путем отправки микроконтроллеру команд "identify". Микроконтроллер отвечает на каждую команду identify сообщением "identify_response". Поскольку эти две команды необходимы для получения словаря данных, их целочисленные идентификаторы и типы параметров жестко закодированы как в микроконтроллере, так и в хосте. Идентификатор ответа "identify_response" равен 0, а идентификатор команды "identify" - 1. Кроме жестко закодированных идентификаторов, команда "identify" и ее ответ объявляются и передаются так же, как и другие команды и ответы. Никакие другие команды или ответы не имеют жестко закодированных идентификаторов.

source: The format of the transmitted data dictionary itself is a zlib compressed JSON string. The micro-controller build process generates the string, compresses it, and stores it in the text section of the micro-controller flash. The data dictionary can be much larger than the maximum message block size - the host downloads it by sending multiple identify commands requesting progressive chunks of the data dictionary. Once all chunks are obtained the host will assemble the chunks, uncompress the data, and parse the contents.
bg: Самият формат на предавания речник с данни е компресиран от zlib JSON низ. Процесът на изграждане на микроконтролера генерира този низ, компресира го и го съхранява в текстовата секция на флаш паметта на микроконтролера. Речникът на данните може да бъде много по-голям от максималния размер на блока за съобщения - хостът го изтегля, като изпраща множество команди за идентификация, изискващи прогресивни части от речника на данните. След като получи всички части, хостът сглобява частите, разкомпресира данните и анализира съдържанието.
ru: Сам формат передаваемого словаря данных представляет собой сжатую в zlib строку JSON. Процесс сборки микроконтроллера генерирует эту строку, сжимает ее и сохраняет в текстовом разделе флэш-памяти микроконтроллера. Словарь данных может быть намного больше максимального размера блока сообщений - хост загружает его, посылая несколько команд identify, запрашивающих последовательные фрагменты словаря данных. После получения всех фрагментов хост соберет их, распакует данные и разберет их содержимое.

source: In addition to information on the communication protocol, the data dictionary also contains the software version, enumerations (as defined by DECL_ENUMERATION), and constants (as defined by DECL_CONSTANT).
bg: В допълнение към информацията за комуникационния протокол, речникът на данните съдържа и версията на софтуера, изброявания (както са дефинирани от DECL_ENUMERATION) и константи (както са дефинирани от DECL_CONSTANT).
ru: Помимо информации о протоколе связи, словарь данных также содержит версию программного обеспечения, перечисления (как определено в DECL_ENUMERATION) и константы (как определено в DECL_CONSTANT).

source: Message flow
bg: Поток на съобщението
ru: Поток сообщений

source: Message commands sent from host to micro-controller are intended to be error-free. The micro-controller will check the CRC and sequence numbers in each message block to ensure the commands are accurate and in-order. The micro-controller always processes message blocks in-order - should it receive a block out-of-order it will discard it and any other out-of-order blocks until it receives blocks with the correct sequencing.
bg: Командите за съобщения, изпращани от хоста към микроконтролера, са предназначени да бъдат без грешки. Микроконтролерът проверява CRC и поредните номера във всеки блок от съобщения, за да гарантира, че командите са точни и подредени. Микроконтролерът винаги обработва блоковете със съобщения в правилен ред - ако получи блок с нарушен ред, той ще го изхвърли, както и всички други блокове с нарушен ред, докато не получи блокове с правилна последователност.
ru: Команды сообщений, передаваемые от хоста к микроконтроллеру, должны быть безошибочными. Микроконтроллер проверяет CRC и порядковые номера в каждом блоке сообщений, чтобы убедиться в точности и последовательности команд. Микроконтроллер всегда обрабатывает блоки сообщений по порядку - если он получит блок не по порядку, то отбросит его и все другие блоки не по порядку, пока не получит блоки с правильной последовательностью.

source: The low-level host code implements an automatic retransmission system for lost and corrupt message blocks sent to the micro-controller. To facilitate this, the micro-controller transmits an "ack message block" after each successfully received message block. The host schedules a timeout after sending each block and it will retransmit should the timeout expire without receiving a corresponding "ack". In addition, if the micro-controller detects a corrupt or out-of-order block it may transmit a "nak message block" to facilitate fast retransmission.
bg: Кодът на ниско ниво на хоста имплементира система за автоматично препредаване на изгубени и повредени блокове от съобщения, изпратени към микроконтролера. За да се улесни това, микроконтролерът предава "блок със съобщение за потвърждение" след всеки успешно получен блок със съобщение. Домакинът планира времетраене след изпращането на всеки блок и ще препредава, ако времетраенето изтече, без да получи съответното "ack". Освен това, ако микроконтролерът открие повреден или неподреден блок, той може да предаде "nak message block", за да улесни бързото повторно предаване.
ru: В низкоуровневом коде хоста реализована система автоматической ретрансляции потерянных и поврежденных блоков сообщений, отправленных на микроконтроллер. Для этого микроконтроллер передает "блок сообщений ack" после каждого успешно принятого блока сообщений. Хост устанавливает тайм-аут после отправки каждого блока и повторно передает сообщение, если по истечении тайм-аута не будет получен соответствующий "ack". Кроме того, если микроконтроллер обнаруживает поврежденный или неупорядоченный блок, он может передать "nak message block" для облегчения быстрой повторной передачи.

source: An "ack" is a message block with empty content (ie, a 5 byte message block) and a sequence number greater than the last received host sequence number. A "nak" is a message block with empty content and a sequence number less than the last received host sequence number.
bg: "Ack" е блок от съобщения с празно съдържание (т.е. блок от 5 байта) и номер на последователността, по-голям от последния получен номер на последователността на хоста. "Nak" е блок от съобщения с празно съдържание и номер на последователността, по-малък от последния получен номер на последователността на хоста.
ru: Ack" - это блок сообщения с пустым содержимым (т.е. блок сообщения размером 5 байт) и порядковым номером, большим, чем последний полученный порядковый номер хоста. nak" - это блок сообщения с пустым содержимым и номером последовательности, меньшим, чем последний полученный номер последовательности хоста.

source: The protocol facilitates a "window" transmission system so that the host can have many outstanding message blocks in-flight at a time. (This is in addition to the many commands that may be present in a given message block.) This allows maximum bandwidth utilization even in the event of transmission latency. The timeout, retransmit, windowing, and ack mechanism are inspired by similar mechanisms in [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).
bg: Протоколът улеснява системата за предаване на "прозорци", така че хостът може да разполага с много неизпратени блокове от съобщения в движение в даден момент. (Това е в допълнение към многото команди, които могат да се съдържат в даден блок от съобщения.) Това позволява максимално използване на честотната лента дори в случай на забавяне на предаването. Механизмите за прекъсване на времето, препредаване, прозорци и потвърждение са вдъхновени от подобни механизми в [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).
ru: Протокол поддерживает "оконную" систему передачи, так что у хоста может быть много незавершенных блоков сообщений в полете одновременно. (Это в дополнение к множеству команд, которые могут присутствовать в данном блоке сообщений). Это позволяет максимально использовать полосу пропускания даже в случае задержки передачи. Механизмы тайм-аута, повторной передачи, окна и подтверждения были вдохновлены аналогичными механизмами в [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).

source: In the other direction, message blocks sent from micro-controller to host are designed to be error-free, but they do not have assured transmission. (Responses should not be corrupt, but they may go missing.) This is done to keep the implementation in the micro-controller simple. There is no automatic retransmission system for responses - the high-level code is expected to be capable of handling an occasional missing response (usually by re-requesting the content or setting up a recurring schedule of response transmission). The sequence number field in message blocks sent to the host is always one greater than the last received sequence number of message blocks received from the host. It is not used to track sequences of response message blocks.
bg: В другата посока блоковете със съобщения, изпращани от микроконтролера към хоста, са проектирани така, че да не допускат грешки, но нямат гарантирано предаване. (Отговорите не трябва да са повредени, но могат да липсват.) Това е направено, за да се запази реализацията в микроконтролера проста. Няма автоматична система за препредаване на отговорите - очаква се кодът на високо ниво да може да се справя със случайни липсващи отговори (обикновено чрез повторно поискване на съдържанието или създаване на повтарящ се график за предаване на отговорите). Полето за пореден номер в блоковете от съобщения, изпращани към хоста, винаги е с единица по-голямо от последния получен пореден номер на блоковете от съобщения, получени от хоста. То не се използва за проследяване на последователността на блоковете със съобщения за отговор.
ru: В другом направлении блоки сообщений, передаваемые от микроконтроллера к хосту, спроектированы так, чтобы не допускать ошибок, но они не имеют гарантированной передачи. (Ответы не должны быть повреждены, но они могут пропасть.) Это сделано для того, чтобы сохранить простоту реализации в микроконтроллере. Автоматической системы повторной передачи ответов не существует - предполагается, что код высокого уровня будет способен справиться со случайным отсутствием ответа (обычно путем повторного запроса содержимого или установки повторяющегося расписания передачи ответов). Поле номера последовательности в блоках сообщений, отправляемых хосту, всегда на единицу больше последнего полученного номера последовательности в блоках сообщений, полученных от хоста. Оно не используется для отслеживания последовательности блоков ответных сообщений.

source: Protocol
bg: Протокол
ru: Протокол
