Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Releases.po
Languages: ta

source: History of Klipper releases. Please see [installation](Installation.md) for information on installing Klipper.
ta: கிளிப்பர் வெளியீடுகளின் வரலாறு. கிளிப்பரை நிறுவுவது குறித்த தகவலுக்கு [நிறுவல்] (நிறுவல்.எம்டி) ஐப் பார்க்கவும்.

source: Klipper 0.9.0
ta: வெட்டுதல் 0.9.0

source: Available on 20201020. Major changes in this release:
ta: 20201020 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Support for "Input Shaping" - a mechanism to counteract printer resonance. It can reduce or eliminate "ringing" in prints.
ta: "உள்ளீட்டு வடிவமைத்தல்" என்பதற்கான உதவி - அச்சுப்பொறி அதிர்வுகளை எதிர்ப்பதற்கான ஒரு வழிமுறை. இது அச்சிட்டுகளில் "ரிங்கிங்" ஐக் குறைக்கலாம் அல்லது அகற்றலாம்.

source: New "Smooth Pressure Advance" system. This implements "Pressure Advance" without introducing instantaneous velocity changes. It is also now possible to tune pressure advance using a "Tuning Tower" method.
ta: புதிய "மென்மையான அழுத்தம் அட்வான்ச்" அமைப்பு. இது உடனடி விரைவு மாற்றங்களை அறிமுகப்படுத்தாமல் "அழுத்தம் முன்னேற்றத்தை" செயல்படுத்துகிறது. "ட்யூனிங் டவர்" முறையைப் பயன்படுத்தி அழுத்தம் முன்கூட்டியே டியூன் செய்யவும் இப்போது சாத்தியமாகும்.

source: New "webhooks" API server. This provides a programmable JSON interface to Klipper.
ta: புதிய "வெப்ஊக்ச்" பநிஇ சேவையகம். இது கிளிப்பருக்கு ஒரு நிரல்படுத்தக்கூடிய சாதொபொகு இடைமுகத்தை வழங்குகிறது.

source: The LCD display and menu are now configurable using the Jinja2 template language.
ta: எல்.சி.டி காட்சி மற்றும் பட்டியல் இப்போது சின்சா 2 வார்ப்புரு மொழியைப் பயன்படுத்தி கட்டமைக்கக்கூடியவை.

source: The TMC2208 stepper motor drivers can now be used in "standalone" mode with Klipper.
ta: TMC2208 ச்டெப்பர் மின்னோடி இயக்கிகளை இப்போது கிளிப்பருடன் "தனித்தனி" பயன்முறையில் பயன்படுத்தலாம்.

source: Improved BL-Touch v3 support.
ta: மேம்படுத்தப்பட்ட பி.எல்-டச் வி 3 உதவி.

source: Improved USB identification. Klipper now has its own USB identification code and micro-controllers can now report their unique serial numbers during USB identification.
ta: மேம்படுத்தப்பட்ட யூ.எச்.பி அடையாளம். கிளிப்பர் இப்போது அதன் சொந்த யூ.எச்.பி அடையாளக் குறியீட்டைக் கொண்டுள்ளது மற்றும் மைக்ரோ-கன்ட்ரோலர்கள் இப்போது யூ.எச்.பி அடையாளத்தின் போது அவற்றின் தனித்துவமான வரிசை எண்களைப் புகாரளிக்க முடியும்.

source: New kinematic support for "Rotary Delta" and "CoreXZ" printers.
ta: "ரோட்டரி டெல்டா" மற்றும் "கோரக்ச்" அச்சுப்பொறிகளுக்கான புதிய இயக்கவியல் உதவி.

source: Micro-controller improvements: support for stm32f070, support for stm32f207, support for GPIO pins on "Linux MCU", stm32 "HID bootloader" support, Chitu bootloader support, MKS Robin bootloader support.
ta: மைக்ரோ-கான்ட்ரோலர் மேம்பாடுகள்: STM32F070 க்கான உதவி, STM32F207 க்கான உதவி, "லினக்ச் எம்.சி.யு", எச்.டி.எம் 32 "இட் பூட் லோடர்" உதவி, சிட்டு பூட்ட்லோடர் உதவி, எம்.கே.எச் ராபின் பூட்லோடர் உதவி ஆகியவற்றில் சி.பி.ஐ.ஓ ஊசிகளுக்கான உதவி.

source: Improved handling of Python "garbage collection" events.
ta: பைதான் "குப்பை சேகரிப்பு" நிகழ்வுகளின் மேம்பட்ட கையாளுதல்.

source: Many additional modules added: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole
ta: பல கூடுதல் தொகுதிகள் சேர்க்கப்பட்டுள்ளன: ADC_SCALED, BME280, Display_status, Extruder_stepper, Fan_generic, Hall_filament_width_sensor, HTU21D, ஓமிங்_எச், உள்ளீடு_சீப்பர்ச், எல்எம் 75, அச்சுப்பொறிகள், கிராஃபோரேட்டர், கிராஃபோரேட்டர், கிராஃபோரேட்டர், இயக்கம், வரைபடம்_சேப்பர், வரைபடம்_டெம்ப்_சென்சர், WHCONSOLE

source: Several bug fixes and code cleanups.
ta: பல பிழை திருத்தங்கள் மற்றும் குறியீடு தூய்மைப்படுத்தல்கள்.

source: Klipper 0.9.1
ta: வெட்டுதல் 0.1.1

source: Available on 20201028. Release containing only bug fixes.
ta: 20201028 இல் கிடைக்கிறது. பிழை திருத்தங்களை மட்டுமே கொண்ட வெளியீடு.

source: Klipper 0.8.0
ta: வெட்டுதல் 0.8.0

source: Available on 20191021. Major changes in this release:
ta: 20191021 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: New G-Code command template support. G-Code in the config file is now evaluated with the Jinja2 template language.
ta: புதிய சி-கோட் கட்டளை வார்ப்புரு உதவி. கட்டமைப்பு கோப்பில் உள்ள சி-குறியீடு இப்போது சின்சா 2 வார்ப்புரு மொழியுடன் மதிப்பீடு செய்யப்படுகிறது.

source: Improvements to Trinamic stepper drivers:
ta: டிரினாமிக் ச்டெப்பர் டிரைவர்களுக்கான மேம்பாடுகள்:

source: New support for TMC2209 and TMC5160 drivers.
ta: TMC2209 மற்றும் TMC5160 இயக்கிகளுக்கு புதிய உதவி.

source: Improved DUMP_TMC, SET_TMC_CURRENT, and INIT_TMC G-Code commands.
ta: மேம்படுத்தப்பட்ட DUMP_TMC, SET_TMC_CURRENT, மற்றும் INIT_TMC G-CODE கட்டளைகள்.

source: Improved support for TMC UART handling with an analog mux.
ta: அனலாக் MUX உடன் TMC UART கையாளுதலுக்கான மேம்பட்ட உதவி.

source: Improved homing, probing, and bed leveling support:
ta: மேம்படுத்தப்பட்ட ஓமிங், ஆய்வு மற்றும் படுக்கை சமன் ஆதரவு:

source: New manual_probe, bed_screws, screws_tilt_adjust, skew_correction, safe_z_home modules added.
ta: புதிய கையேடு_பிரோப், படுக்கை_சிறப்புக்கள், திருகுகள்_பில்ட்_ஏடிசச்ட், ச்கீ_ காரெக்சன், பாதுகாப்பான_இசட்_ஓம் தொகுதிகள் சேர்க்கப்பட்டன.

source: Enhanced multi-sample probing with median, average, and retry logic.
ta: சராசரி, சராசரி மற்றும் மீண்டும் தர்க்கத்துடன் மேம்படுத்தப்பட்ட பல மாதிரி ஆய்வு.

source: Improved documentation for BL-Touch, probe calibration, endstop calibration, delta calibration, sensorless homing, and endstop phase calibration.
ta: பி.எல்-டச், ஆய்வு அளவுத்திருத்தம், எண்ட்ச்டாப் அளவுத்திருத்தம், டெல்டா அளவுத்திருத்தம், சென்சார்லெச் ஓமிங் மற்றும் எண்ட்ச்டாப் கட்ட அளவுத்திருத்தத்திற்கான மேம்பட்ட ஆவணங்கள்.

source: Improved homing support on a large Z axis.
ta: ஒரு பெரிய சட் அச்சில் மேம்பட்ட ஓமிங் உதவி.

source: Many Klipper micro-controller improvements:
ta: பல கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் மேம்பாடுகள்:

source: Klipper ported to: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4
ta: கிளிப்பர் போர்ட்டு: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4

source: New USB CDC driver implementations on SAM3X, SAM4, STM32F4.
ta: SAM3x, SAM4, STM32F4 இல் புதிய யூ.எச்.பி சி.டி.சி இயக்கி செயலாக்கங்கள்.

source: Enhanced support for flashing Klipper over USB.
ta: யூ.எச்.பி மீது கிளிப்பரை ஒளிரச் செய்வதற்கான மேம்பட்ட உதவி.

source: Software SPI support.
ta: மென்பொருள் SPI உதவி.

source: Greatly improved temperature filtering on the LPC176x.
ta: LPC176X இல் வெப்பநிலை வடிகட்டுதல் பெரிதும் மேம்படுத்தப்பட்டது.

source: Early output pin settings can be configured in the micro-controller.
ta: ஆரம்ப வெளியீட்டு முள் அமைப்புகளை மைக்ரோ-கன்ட்ரோலரில் கட்டமைக்க முடியும்.

source: New website with the Klipper documentation: http://klipper3d.org/
ta: கிளிப்பர் ஆவணத்துடன் புதிய வலைத்தளம்: http://klipper3d.org/

source: Klipper now has a logo.
ta: கிளிப்பருக்கு இப்போது ஒரு லோகோ உள்ளது.

source: Experimental support for polar and "cable winch" kinematics.
ta: துருவ மற்றும் "கேபிள் வின்ச்" இயக்கவியலுக்கான சோதனை உதவி.

source: The config file can now include other config files.
ta: கட்டமைப்பு கோப்பில் இப்போது பிற கட்டமைப்பு கோப்புகள் சேர்க்கலாம்.

source: Many additional modules added: board_pins, controller_fan, delayed_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower
ta: பல கூடுதல் தொகுதிகள் சேர்க்கப்பட்டுள்ளன: போர்டு_பின்கள், தாமதமான_சோட், டாட்ச்டார், ஃபிலமென்ட்_ச்விட்ச்_சென்சர், ஃபார்ம்வேர்_ரெட்சன், சி.கோட்_பட்டன், ஈட்டர்_செனெரிக், கையேடு_ச்டெப்பர், எம்.சி.பி 4728, நியூபிக்செல், அல்லது, ட்யூனிங்_டவர்

source: Many additional commands added: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET
ta: பல கூடுதல் கட்டளைகள் சேர்க்கப்பட்டுள்ளன: restore_gcode_state, save_gcode_state, set_gcode_variable, set_heater_temperature, set_idle_timeout, set_temperature_fan_target

source: Klipper 0.7.0
ta: வெட்டுதல் 0.7.0

source: Available on 20181220. Major changes in this release:
ta: 20181220 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Klipper now supports "mesh" bed leveling
ta: கிளிப்பர் இப்போது "மெச்" படுக்கை சமநிலையை ஆதரிக்கிறார்

source: New support for "enhanced" delta calibration (calibrates print x/y dimensions on delta printers)
ta: "மேம்படுத்தப்பட்ட" டெல்டா அளவுத்திருத்தத்திற்கான புதிய உதவி (டெல்டா அச்சுப்பொறிகளில் அச்சு x/y பரிமாணங்களை அளவீடு செய்கிறது)

source: Support for run-time configuration of Trinamic stepper motor drivers (tmc2130, tmc2208, tmc2660)
ta: டிரினாமிக் ச்டெப்பர் மின்னோடி டிரைவர்களின் ரன்-டைம் உள்ளமைவுக்கான உதவி (டிஎம்சி 2130, டிஎம்சி 2208, டிஎம்சி 2660)

source: Improved temperature sensor support: MAX6675, MAX31855, MAX31856, MAX31865, custom thermistors, common pt100 style sensors
ta: மேம்படுத்தப்பட்ட வெப்பநிலை சென்சார் ஆதரவு: MAX6675, MAX31855, MAX31856, MAX31865, தனிப்பயன் தெர்மிச்டர்கள், பொதுவான PT100 பாணி சென்சார்கள்

source: Several new modules: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch
ta: பல புதிய தொகுதிகள்: வெப்பநிலை_பான், எச்எக்ச் 1509, ஃபோர்ச்_மோவ், எம்.சி.பி 4451, இசட்_டில்ட், குவாட்_கான்ட்ரி_லெவல், எண்ட்ச்டாப்_பேச், பி.எல்.டி.

source: Several new commands added: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, custom g-code macros
ta: பல புதிய கட்டளைகள் சேர்க்கப்பட்டன: Save_config, set_pressure_advance, set_gcode_offset, set_velocity_limit, stepper_buzz, turn_off_heaters, m204, தனிப்பயன் சி-குறியீடு மேக்ரோக்கள்

source: Expanded LCD display support:
ta: விரிவாக்கப்பட்ட எல்சிடி காட்சி ஆதரவு:

source: Support for run-time menus
ta: ரன்-டைம் மெனுக்களுக்கான உதவி

source: New display icons
ta: புதிய காட்சி சின்னங்கள்

source: Support for "uc1701" and "ssd1306" displays
ta: "UC1701" மற்றும் "SSD1306" காட்சிகளுக்கான உதவி

source: Additional micro-controller support:
ta: கூடுதல் மைக்ரோ-கன்ட்ரோலர் ஆதரவு:

source: Klipper ported to: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" devices), atmega32u4
ta: கிளிப்பர் போர்டட்: எல்பிசி 176 ஃச் (ச்மூத்திபோர்டுகள்), SAM4E8E (டூயட் 2), SAMD21 (Arduino பூச்சியம்), STM32F103 ("நீல மாத்திரை" சாதனங்கள்), ATMEGA32U4

source: New Generic USB CDC driver implemented on AVR, LPC176x, SAMD21, and STM32F103
ta: புதிய பொதுவான யூ.எச்.பி சி.டி.சி இயக்கி ஏ.வி.ஆர், எல்பிசி 176 ஃச், எச்ஏஎம்.டி 21 மற்றும் எச்.டி.எம் 32 எஃப் 103 இல் செயல்படுத்தப்பட்டது

source: Performance improvements on ARM processors
ta: கை செயலிகளில் செயல்திறன் மேம்பாடுகள்

source: The kinematics code was rewritten to use an "iterative solver"
ta: இயக்கவியல் குறியீடு ஒரு "மறுசீரமைப்பு தீர்வி" பயன்படுத்த மீண்டும் எழுதப்பட்டது

source: New automatic test cases for the Klipper host software
ta: கிளிப்பர் புரவலன் மென்பொருளுக்கான புதிய தானியங்கி சோதனை வழக்குகள்

source: Many new example config files for common off-the-shelf printers
ta: பொதுவான ஆஃப்-தி-செல்ஃப் அச்சுப்பொறிகளுக்கு பல புதிய எடுத்துக்காட்டு கட்டமைப்பு கோப்புகள்

source: Documentation updates for bootloaders, benchmarking, micro-controller porting, config checks, pin mapping, slicer settings, packaging, and more
ta: துவக்க ஏற்றிகள், தரப்படுத்தல், மைக்ரோ-கன்ட்ரோலர் போர்ட்டிங், கட்டமைப்பு காசோலைகள், முள் மேப்பிங், ச்லைசர் அமைப்புகள், பேக்கேசிங் மற்றும் பலவற்றிற்கான ஆவண புதுப்பிப்புகள்

source: Several bug fixes and code cleanups
ta: பல பிழை திருத்தங்கள் மற்றும் குறியீடு தூய்மைப்படுத்தல்கள்

source: Klipper 0.6.0
ta: மோவர் 0.6.0

source: Available on 20180331. Major changes in this release:
ta: 20180331 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Enhanced heater and thermistor hardware failure checks
ta: மேம்படுத்தப்பட்ட ஈட்டர் மற்றும் தெர்மோச்டர் வன்பொருள் தோல்வி சோதனைகள்

source: Support for Z probes
ta: சட் ஆய்வுகளுக்கான உதவி

source: Initial support for automatic parameter calibration on deltas (via a new delta_calibrate command)
ta: டெல்டாக்களில் தானியங்கி அளவுரு அளவுத்திருத்தத்திற்கான ஆரம்ப உதவி (புதிய டெல்டா_கலிப்ரேட் கட்டளை வழியாக)

source: Initial support for bed tilt compensation (via bed_tilt_calibrate command)
ta: படுக்கை சாய்வு இழப்பீட்டுக்கான ஆரம்ப உதவி (BED_TILT_CALIBRATE கட்டளை வழியாக)

source: Initial support for "safe homing" and homing overrides
ta: "பாதுகாப்பான ஓமிங்" மற்றும் ஓமிங் மேலெழுதல்களுக்கான ஆரம்ப உதவி

source: Initial support for displaying status on RepRapDiscount style 2004 and 12864 displays
ta: Reprapdiscount சூல் தண்டு 2004 மற்றும் 12864 காட்சிகளில் நிலையை காண்பிப்பதற்கான ஆரம்ப உதவி

source: New multi-extruder improvements:
ta: புதிய மல்டி-எக்ச்ட்ரூடர் மேம்பாடுகள்:

source: Support for shared heaters
ta: பகிரப்பட்ட ஈட்டர்களுக்கான உதவி

source: Initial support for dual carriages
ta: இரட்டை வண்டிகளுக்கான ஆரம்ப உதவி

source: Support for configuring multiple steppers per axis (eg, dual Z)
ta: ஒரு அச்சுக்கு பல ச்டெப்பர்களை உள்ளமைப்பதற்கான உதவி (எ.கா., இரட்டை இசட்)

source: Support for custom digital and pwm output pins (with a new SET_PIN command)
ta: தனிப்பயன் டிசிட்டல் மற்றும் பி.டபிள்யூ.எம் வெளியீட்டு ஊசிகளுக்கான உதவி (புதிய செட்_பின் கட்டளையுடன்)

source: Initial support for a "virtual sdcard" that allows printing directly from Klipper (helps on machines too slow to run OctoPrint well)
ta: கிளிப்பரிலிருந்து நேரடியாக அச்சிட அனுமதிக்கும் "மெய்நிகர் SDCARD" க்கான ஆரம்ப உதவி (ஆக்டோபிரிண்டை நன்றாக இயக்க இயந்திரங்களில் மிகவும் மெதுவாக உதவுகிறது)

source: Support for setting different arm lengths on each tower of a delta
ta: டெல்டாவின் ஒவ்வொரு கோபுரத்திலும் வெவ்வேறு கை நீளங்களை அமைப்பதற்கான உதவி

source: Support for G-Code M220/M221 commands (speed factor override / extrude factor override)
ta: சி-குறியீடு M220 / M221 கட்டளைகளுக்கான உதவி (வேக காரணி மேலெழுதல் / எக்ச்ட்ரூட் காரணி மேலெழுதல்)

source: Several documentation updates:
ta: பல ஆவணங்கள் புதுப்பிப்புகள்:

source: New multiple MCU config example
ta: புதிய பல MCU கட்டமைப்பு எடுத்துக்காட்டு

source: New bltouch sensor config example
ta: புதிய BLTOUCH சென்சார் கட்டமைப்பு எடுத்துக்காட்டு

source: New FAQ, config check, and G-Code documents
ta: புதிய கேள்விகள், கட்டமைப்பு காசோலை மற்றும் சி-குறியீடு ஆவணங்கள்

source: Initial support for continuous integration testing on all github commits
ta: அனைத்து அறிவிலிமையம் கமிட்டுகளிலும் தொடர்ச்சியான ஒருங்கிணைப்பு சோதனைக்கான ஆரம்ப உதவி

source: Klipper 0.5.0
ta: வெட்டுதல் 0.5.0

source: Available on 20171025. Major changes in this release:
ta: 20171025 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Support for printers with multiple extruders.
ta: பல எக்ச்ட்ரூடர்களுடன் அச்சுப்பொறிகளுக்கான உதவி.

source: Initial support for running on the Beaglebone PRU. Initial support for the Replicape board.
ta: பீகல்போன் ப்ரூவில் இயங்குவதற்கான ஆரம்ப உதவி. பிரதி வாரியத்திற்கான ஆரம்ப உதவி.

source: Initial support for running the micro-controller code in a real-time Linux process.
ta: நிகழ்நேர லினக்ச் செயல்பாட்டில் மைக்ரோ-கன்ட்ரோலர் குறியீட்டை இயக்குவதற்கான ஆரம்ப உதவி.

source: Support for multiple micro-controllers. (For example, one could control an extruder with one micro-controller and the rest of the printer with another.) Software clock synchronization is implemented to coordinate actions between micro-controllers.
ta: பல மைக்ரோ-கன்ட்ரோலர்களுக்கான உதவி. .

source: Stepper performance improvements (20Mhz AVRs up to 189K steps per second).
ta: ச்டெப்பர் செயல்திறன் மேம்பாடுகள் (20 மெகா எர்ட்ச் ஏ.வி.ஆர் கள் நொடிக்கு 189 கி படிகள் வரை).

source: Support for controlling servos and support for defining nozzle cooling fans.
ta: சர்வோக்களைக் கட்டுப்படுத்துவதற்கான உதவி மற்றும் முனை குளிரூட்டும் ரசிகர்களை வரையறுப்பதற்கான உதவி.

source: Klipper 0.4.0
ta: வெட்டுதல் 0.4.0

source: Available on 20170503. Major changes in this release:
ta: 20170503 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Improved installation on Raspberry Pi machines. Most of the install is now scripted.
ta: ராச்பெர்ரி பை இயந்திரங்களில் மேம்படுத்தப்பட்ட நிறுவல். நிறுவலின் பெரும்பாலானவை இப்போது ச்கிரிப்ட் செய்யப்பட்டுள்ளன.

source: Support for corexy kinematics
ta: கோர்சி இயக்கவியலுக்கான உதவி

source: Documentation updates: New Kinematics document, new Pressure Advance tuning guide, new example config files, and more
ta: ஆவணப்படுத்தல் புதுப்பிப்புகள்: புதிய இயக்கவியல் ஆவணம், புதிய பிரசர் அட்வான்ச் ட்யூனிங் வழிகாட்டி, புதிய எடுத்துக்காட்டு கட்டமைப்பு கோப்புகள் மற்றும் பல

source: Stepper performance improvements (20Mhz AVRs over 175K steps per second, Arduino Due over 460K)
ta: ச்டெப்பர் செயல்திறன் மேம்பாடுகள் (வினாடிக்கு 175K படிகளுக்கு மேல் 20 மெகா எர்ட்ச் ஏ.வி.ஆர்.எச், 460 கி.

source: Support for automatic micro-controller resets. Support for resets via toggling USB power on Raspberry Pi.
ta: தானியங்கி மைக்ரோ-கன்ட்ரோலர் மீட்டமைப்புக்கான உதவி. ராச்பெர்ரி பையில் யூ.எச்.பி சக்தியை மாற்றுவதன் மூலம் மீட்டமைப்புக்கான உதவி.

source: The pressure advance algorithm now works with look-ahead to reduce pressure changes during cornering.
ta: அழுத்த முன்கூட்டியே அல்காரிதம் இப்போது மூலைவிட்டத்தின் போது அழுத்தம் மாற்றங்களைக் குறைக்க தோற்றத்துடன் செயல்படுகிறது.

source: Support for limiting the top speed of short zigzag moves
ta: குறுகிய சிக்சாக் நகர்வுகளின் உயர் வேகத்தை கட்டுப்படுத்துவதற்கான உதவி

source: Support for AD595 sensors
ta: AD595 சென்சார்களுக்கான உதவி

source: Klipper 0.3.0
ta: வெட்டுதல் 0.3.0

source: Available on 20161223. Major changes in this release:
ta: 20161223 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Improved documentation
ta: மேம்படுத்தப்பட்ட ஆவணங்கள்

source: Support for robots with delta kinematics
ta: டெல்டா இயக்கவியலுடன் ரோபோக்களுக்கான உதவி

source: Support for Arduino Due micro-controller (ARM cortex-M3)
ta: ஆர்டுயினோ டியூ மைக்ரோ-கன்ட்ரோலருக்கான உதவி (ARM CORTEX-M3)

source: Support for USB based AVR micro-controllers
ta: யூ.எச்.பி அடிப்படையிலான ஏ.வி.ஆர் மைக்ரோ-கன்ட்ரோலர்களுக்கான உதவி

source: Support for "pressure advance" algorithm - it reduces ooze during prints.
ta: "பிரசர் அட்வான்ச்" வழிமுறைக்கான உதவி - இது அச்சிட்டுகளின் போது ஓசைக் குறைக்கிறது.

source: New "stepper phased based endstop" feature - enables higher precision on endstop homing.
ta: புதிய "ச்டெப்பர் கட்டம் அடிப்படையிலான எண்ட்ச்டாப்" நற்பொருத்தம் - எண்ட்ச்டாப் ஓமிங்கில் அதிக துல்லியத்தை செயல்படுத்துகிறது.

source: Support for "extended g-code" commands such as "help", "restart", and "status".
ta: "உதவி", "மறுதொடக்கம்" மற்றும் "நிலை" போன்ற "நீட்டிக்கப்பட்ட சி-குறியீடு" கட்டளைகளுக்கான உதவி.

source: Support for reloading the Klipper config and restarting the host software by issuing a "restart" command from the terminal.
ta: முனையத்திலிருந்து "மறுதொடக்கம்" கட்டளையை வழங்குவதன் மூலம் கிளிப்பர் கட்டமைப்பை மீண்டும் ஏற்றுவதற்கும் புரவலன் மென்பொருளை மறுதொடக்கம் செய்வதற்கும் உதவி.

source: Stepper performance improvements (20Mhz AVRs up to 158K steps per second).
ta: ச்டெப்பர் செயல்திறன் மேம்பாடுகள் (20 மெகா எர்ட்ச் ஏ.வி.ஆர் கள் நொடிக்கு 158 கி படிகள் வரை).

source: Improved error reporting. Most errors now shown via the terminal along with help on how to resolve.
ta: மேம்படுத்தப்பட்ட பிழை அறிக்கை. பெரும்பாலான பிழைகள் இப்போது முனையம் வழியாக காட்டப்பட்டுள்ளன, மேலும் எவ்வாறு தீர்ப்பது என்பதற்கான உதவியுடன்.

source: Klipper 0.2.0
ta: வெட்டுதல் 0.2.0

source: Initial release of Klipper. Available on 20160525. Major features available in the initial release include:
ta: கிளிப்பரின் ஆரம்ப வெளியீடு. 20160525 இல் கிடைக்கிறது. ஆரம்ப வெளியீட்டில் கிடைக்கும் முக்கிய நற்பொருத்தங்கள் பின்வருமாறு:

source: Basic support for cartesian printers (steppers, extruder, heated bed, cooling fan).
ta: கார்ட்டீசியன் அச்சுப்பொறிகளுக்கான அடிப்படை உதவி (ச்டெப்பர்கள், எக்ச்ட்ரூடர், சூடான படுக்கை, குளிரூட்டும் விசிறி).

source: Support for common g-code commands. Support for interfacing with OctoPrint.
ta: பொதுவான சி-குறியீடு கட்டளைகளுக்கான உதவி. ஆக்டோபிரிண்டுடன் இடைமுகப்படுத்துவதற்கான உதவி.

source: Acceleration and lookahead handling
ta: முடுக்கம் மற்றும் பார்வை கையாளுதல்

source: Support for AVR micro-controllers via standard serial ports
ta: நிலையான தொடர் துறைமுகங்கள் வழியாக ஏ.வி.ஆர் மைக்ரோ-கன்ட்ரோலர்களுக்கான உதவி

source: Klipper 0.10.0
ta: வெட்டுதல் 0.10.0

source: Available on 20210929. Major changes in this release:
ta: 20210929 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Support for "Multi-MCU Homing". It is now possible for a stepper motor and its endstop to be wired to separate micro-controllers. This simplifies wiring of Z probes on "toolhead boards".
ta: "மல்டி-எம்.சி.யு ஓமிங்" க்கான உதவி. மைக்ரோ-கன்ட்ரோலர்களைப் பிரிக்க ஒரு ச்டெப்பர் மின்னோடி மற்றும் அதன் எண்ட்ச்டாப்பை கம்பி செய்ய இப்போது சாத்தியமாகும். இது "கருவிஎட் போர்டுகள்" இல் சட் ஆய்வுகளின் வயரிங் எளிதாக்குகிறது.

source: Klipper now has a [Community Discord Server](https://discord.klipper3d.org) and a [Community Discourse Server](https://community.klipper3d.org).
ta: கிளிப்பரில் இப்போது [சமூக டிச்கார்ட் சேவையகம்] (https://discord.klipper3d.org) மற்றும் [சமூக சொற்பொழிவு சேவையகம்] (https://community.klipper3d.org) உள்ளன.

source: The [Klipper website](https://www.klipper3d.org) now uses the "mkdocs" infrastructure. There is also a [Klipper Translations](https://github.com/Klipper3d/klipper-translations) project.
ta: [கிளிப்பர் வலைத்தளம்] (https://www.klipper3d.org) இப்போது "MKDOCS" உள்கட்டமைப்பைப் பயன்படுத்துகிறது. [கிளிப்பர் மொழிபெயர்ப்புகள்] (https://github.com/klipper3d/klipper- மொழிபெயர்ப்பு) திட்டமும் உள்ளது.

source: Automated support for flashing firmware via sdcard on many boards.
ta: பல பலகைகளில் SDCARD வழியாக ஒளிரும் ஃபார்ம்வேரை தானியங்கு உதவி.

source: New kinematic support for "Hybrid CoreXY" and "Hybrid CoreXZ" printers.
ta: "ஐப்ரிட் கோர்எக்சி" மற்றும் "ஐப்ரிட் கோர்எக்ச்இச்" அச்சுப்பொறிகளுக்கான புதிய இயக்கவியல் உதவி.

source: Klipper now uses `rotation_distance` to configure stepper motor travel distances.
ta: கிளிப்பர் இப்போது ச்டெப்பர் மின்னோடி பயண தூரங்களை உள்ளமைக்க `சுழற்சி_டிச்` ஐப் பயன்படுத்துகிறார்.

source: The main Klipper host code can now directly communicate with micro-controllers using CAN bus.
ta: முக்கிய கிளிப்பர் புரவலன் குறியீடு இப்போது CAN பச்சைப் பயன்படுத்தி மைக்ரோ-கன்ட்ரோலர்களுடன் நேரடியாக தொடர்பு கொள்ளலாம்.

source: New "motion analysis" system. Klipper's internal motion updates and sensor results can be tracked and logged for analysis.
ta: புதிய "இயக்க பகுப்பாய்வு" அமைப்பு. கிளிப்பரின் உள் இயக்க புதுப்பிப்புகள் மற்றும் சென்சார் முடிவுகள் கண்காணிக்கப்பட்டு பகுப்பாய்விற்கு உள்நுழையலாம்.

source: Trinamic stepper motor drivers are now continuously monitored for error conditions.
ta: டிரினாமிக் ச்டெப்பர் மின்னோடி இயக்கிகள் இப்போது பிழை நிலைமைகளுக்கு தொடர்ந்து கண்காணிக்கப்படுகின்றன.

source: Support for the rp2040 micro-controller (Raspberry Pi Pico boards).
ta: RP2040 மைக்ரோகண்ட்ரோலருக்கு (ராச்பெர்ரி பை பைக்கோ போர்டு) உதவி.

source: The "make menuconfig" system now utilizes kconfiglib.
ta: "மேக் மெனுகான்ஃபிக்" அமைப்பு இப்போது Kconfiglib ஐப் பயன்படுத்துகிறது.

source: Many additional modules added: ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu
ta: பல கூடுதல் தொகுதிகள் சேர்க்கப்பட்டுள்ளன: DS18B20, Duciplical_pin_override, filemament_motion_sensor, pate2, motion_report, pca9533, bulse_counter, save_variables, sdcard_loop, statem_host, வெப்பநிலை_ம்கு

source: Klipper 0.11.0
ta: வெட்டுதல் 0.11.0

source: Available on 20221128. Major changes in this release:
ta: 20221128 இல் கிடைக்கிறது. இந்த வெளியீட்டில் பெரிய மாற்றங்கள்:

source: Trinamic stepper motor driver "step on both edges" optimization.
ta: டிரினாமிக் ச்டெப்பர் மின்னோடி டிரைவர் "இரண்டு விளிம்புகளிலும் படி" தேர்வுமுறை.

source: Support for Python3. The Klipper host code will run with either Python2 or Python3.
ta: பைதான் 3 க்கான உதவி. கிளிப்பர் புரவலன் குறியீடு பைதான் 2 அல்லது பைதான் 3 உடன் இயங்கும்.
