Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Releases.po
Languages: ta

source: Enhanced CAN bus support. Support for CAN bus on rp2040, stm32g0, stm32h7, same51, and same54 chips. Support for "USB to CAN bus bridge" mode.
ta: மேம்படுத்தப்பட்ட கேன் பச் உதவி. RP2040, STM32G0, STM32H7, SIME51, மற்றும் SIGH54 சில்லுகளில் CAN பச்சுக்கான உதவி. "யூ.எச்.பி டு கேன் பச் பிரிட்ச்" பயன்முறைக்கு உதவி.

source: Support for CanBoot bootloader.
ta: கான்பூட் துவக்க ஏற்றிக்கு உதவி.

source: Support for mpu9250 and mpu6050 accelerometers.
ta: MPU9250 மற்றும் MPU6050 முடுக்கமானிகளுக்கான உதவி.

source: Improved error handling for max31856, max31855, max31865, and max6675 temperature sensors.
ta: MAX31856, MAX31855, MAX31865 மற்றும் MAX6675 வெப்பநிலை சென்சார்களுக்கான மேம்பட்ட பிழை கையாளுதல்.

source: It is now possible to configure LEDs to update during long running G-Code commands using LED "template" support.
ta: எல்.ஈ.டி "வார்ப்புரு" ஆதரவைப் பயன்படுத்தி நீண்ட காலமாக இயங்கும் சி-குறியீடு கட்டளைகளின் போது புதுப்பிக்க எல்.ஈ.டிகளை உள்ளமைக்க இப்போது சாத்தியமாகும்.

source: Several micro-controller improvements. New support for stm32h743, stm32h750, stm32l412, stm32g0b1, same70, same51, and same54 chips. Support for i2c reads on atsamd and stm32f0. Hardware pwm support on stm32. Linux mcu signal based event dispatch. New rp2040 support for "make flash", i2c, and rp2040-e5 USB errata.
ta: பல மைக்ரோ-கட்டுப்பாட்டு மேம்பாடுகள். STM32H743, STM32H750, STM32L412, STM32G0B1, Sime70, Soe51, மற்றும் SIME54 சில்லுகளுக்கான புதிய உதவி. I2C க்கான உதவி ATSAMD மற்றும் STM32F0 இல் படிக்கிறது. STM32 இல் வன்பொருள் PWM உதவி. லினக்ச் எம்.சி.யு சிக்னல் அடிப்படையிலான நிகழ்வு அனுப்புதல். "மேக் ஃப்ளாச்", I2C மற்றும் RP2040-E5 யூ.எச்.பி பிழைக்கான புதிய RP2040 உதவி.

source: New modules added: angle, dac084S085, exclude_object, led, mpu9250, pca9632, smart_effector, z_thermal_adjust. New deltesian kinematics added. New dump_mcu tool added.
ta: புதிய தொகுதிகள் சேர்க்கப்பட்டன: கோணம், DAC084S085, விலக்கு_ஆப்செக்ட், எல்.ஈ.டி, எம்.பி. புதிய டெல்டீசியன் இயக்கவியல் சேர்க்கப்பட்டது. புதிய டம்ப்_எம்சி கருவி சேர்க்கப்பட்டது.
