Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/RPi_microcontroller.po
Languages: ta, uk

source: This document describes the process of running Klipper on a RPi and use the same RPi as secondary mcu.
ta: இந்த ஆவணம் ஒரு RPI இல் கிளிப்பரை இயக்கும் செயல்முறையை விவரிக்கிறது மற்றும் அதே RPI ஐ இரண்டாம் நிலை MCU ஐப் பயன்படுத்துகிறது.
uk: Цей документ описує процес запуску Klipper на RPi і використовувати той же RPi як вторинний Mcu.

source: Why use RPi as a secondary MCU?
ta: இரண்டாம் நிலை MCU ஆக RPI ஐ ஏன் பயன்படுத்த வேண்டும்?
uk: Чому використовують RPi як вторинний MCU?

source: Often the MCUs dedicated to controlling 3D printers have a limited and pre-configured number of exposed pins to manage the main printing functions (thermal resistors, extruders, steppers ...). Using the RPi where Klipper is installed as a secondary MCU gives the possibility to directly use the GPIOs and the buses (i2c, spi) of the RPi inside klipper without using Octoprint plugins (if used) or external programs giving the ability to control everything within the print GCODE.
ta: முக்கிய அச்சிடும் செயல்பாடுகளை (வெப்ப மின்தடையங்கள், எக்ச்ட்ரூடர்கள், ச்டெப்பர்கள் ...) நிர்வகிக்க 3D அச்சுப்பொறிகளைக் கட்டுப்படுத்த அர்ப்பணிக்கப்பட்ட MCU கள் ஒரு வரையறுக்கப்பட்ட மற்றும் முன் கட்டமைக்கப்பட்ட ஊசிகளின் எண்ணிக்கையைக் கொண்டுள்ளன. இரண்டாம் நிலை எம்.சி.யுவாக கிளிப்பர் நிறுவப்பட்டுள்ள ஆர்.பி.ஐ.யைப் பயன்படுத்துவது, ஆக்டோப்ரிண்ட் செருகுநிரல்கள் (பயன்படுத்தப்பட்டால்) அல்லது வெளிப்புற நிரல்களைப் பயன்படுத்தாமல் கிளிப்பருக்குள் உள்ள ஆர்.பி.ஐ. அச்சு gcode.
uk: Часто МКУ, присвячені контролінгу 3D-принтерів, мають обмежену і попередньо налаштовану кількість піддаються шпилькам для управління основними функціями друку (термальні резистори, екструдери, крокуси ...). Використання RPi, де Klipper встановлюється як вторинний MCU дає можливість безпосередньо використовувати GPIOs і автобуси (i2c, spi) RPi всередині klipper без використання плагінів Octoprint (якщо використовується) або зовнішніх програм, що дають можливість контролювати всі в межах друку GCODE.

source: **Warning**: If your platform is a *Beaglebone* and you have correctly followed the installation steps, the linux mcu is already installed and configured for your system.
ta: ** எச்சரிக்கை **: உங்கள் தளம் ஒரு*பீகல்போன்*மற்றும் நிறுவல் படிகளை நீங்கள் சரியாகப் பின்பற்றினால், லினக்ச் எம்.சி.யு ஏற்கனவே நிறுவப்பட்டு உங்கள் கணினிக்காக கட்டமைக்கப்பட்டுள்ளது.
uk: **Налаштування**: Якщо ваша платформа є *Beaglebone* і ви повинні правильно дотримуватися кроків установки, Linux mcu вже встановлена і налаштована для вашої системи.

source: Install the rc script
ta: ஆர்.சி ச்கிரிப்டை நிறுவவும்
uk: Встановіть rc скрипт

source: If you want to use the host as a secondary MCU the klipper_mcu process must run before the klippy process.
ta: நீங்கள் இரண்டாம் நிலை MCU ஆக ஓச்டைப் பயன்படுத்த விரும்பினால், கிளிப்பர்_எம்சியூ செயல்முறை கிளிப்பி செயல்முறைக்கு முன் இயங்க வேண்டும்.
uk: Якщо ви хочете використовувати хост як вторинний MCU, процес klipper_mcu повинен працювати перед процесом затискання.

source: After installing Klipper, install the script. run:
ta: கிளிப்பரை நிறுவிய பிறகு, ச்கிரிப்டை நிறுவவும். ரன்:
uk: Після установки Кліппер, встановіть скрипт. Запуск:

source: Building the micro-controller code
ta: மைக்ரோ-கன்ட்ரோலர் குறியீட்டை உருவாக்குதல்
uk: Створення мікроконтролерного коду

source: To compile the Klipper micro-controller code, start by configuring it for the "Linux process":
ta: கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் குறியீட்டை தொகுக்க, அதை "லினக்ச் செயல்முறை" க்கு உள்ளமைப்பதன் மூலம் தொடங்கவும்:
uk: Щоб компілювати код мікроконтролера Klipper, запустіть настройку для процесу "Linux":

source: In the menu, set "Microcontroller Architecture" to "Linux process," then save and exit.
ta: பட்டியலில், "மைக்ரோகண்ட்ரோலர் கட்டிடக்கலை" ஐ "லினக்ச் செயல்முறை" என அமைக்கவும், பின்னர் சேமித்து வெளியேறவும்.
uk: У меню встановіть «Мікроконтролер Архітектура» на «Linux process», потім збережіть і виходите.

source: To build and install the new micro-controller code, run:
ta: புதிய மைக்ரோ-கண்ட்ரோலர் குறியீட்டை உருவாக்க மற்றும் நிறுவ, இயக்கவும்:
uk: Для побудови та встановлення нового мікроконтролюючого коду запустіть:

source: If klippy.log reports a "Permission denied" error when attempting to connect to `/tmp/klipper_host_mcu` then you need to add your user to the tty group. The following command will add the "pi" user to the tty group:
ta: `/Tmp/klipper_host_mcu` உடன் இணைக்க முயற்சிக்கும்போது" இசைவு மறுக்கப்பட்டது "பிழையைப் புகாரளித்தால், உங்கள் பயனரை TTY குழுவில் சேர்க்க வேண்டும். பின்வரும் கட்டளை "பை" பயனரை TTY குழுவில் சேர்க்கும்:
uk: Якщо klippy.log повідомляє про помилку "Попередня відмова" при спробі підключення до `/tmp/klipper_host_mcu`, після чого потрібно додати користувача до групи шин. Наступне командування додасть користувачу "Пі" групі:

source: Remaining configuration
uk: Конфігурація, що залишилася

source: Complete the installation by configuring Klipper secondary MCU following the instructions in [RaspberryPi sample config](../config/sample-raspberry-pi.cfg) and [Multi MCU sample config](../config/sample-multi-mcu.cfg).
ta: [ராச்பெர்ரிய்பிஐ மாதிரி கட்டமைப்பு] (../ config/மாதிரி-ராச்பெர்ரி-பிஐ.சிஎஃப்சி) மற்றும் [மல்டி எம்.சி.யு மாதிரி கட்டமைப்பு] (../ உள்ளமைவு/மாதிரி-மல்டி-எம்.சி.யு ஆகியவற்றில் உள்ள வழிமுறைகளைப் பின்பற்றி கிளிப்பர் இரண்டாம் நிலை எம்.சி.யுவை உள்ளமைப்பதன் மூலம் நிறுவலை முடிக்கவும். சி.எஃப்.சி).
uk: Завершіть інсталяцію, налаштувавши вторинний MCU Klipper, дотримуючись інструкцій у [зразок конфігурації RaspberryPi](../config/sample-raspberry-pi.cfg) і [Зразок конфігурації кількох MCU](../config/sample-multi-mcu.cfg).

source: Optional: Identify the correct gpiochip
ta: விரும்பினால்: சரியான GPIOCHIP ஐ அடையாளம் காணவும்
uk: Додатково: Визначте правильний gpiochip

source: To install the *Linux GPIO character device - binary* on a debian based distro like octopi run:
ta: ஆக்டோபி ரன் போன்ற டெபியன் அடிப்படையிலான டிச்ட்ரோவில் * லினக்ச் சி.பி.ஐ.ஓ எழுத்து சாதனத்தை நிறுவ: பைனரி *:
uk: Щоб встановити *Linux GPIO пристрій персонажа - бінарний* на основі дебеля, як octopi запустити:

source: To check available gpiochip run:
ta: கிடைக்கக்கூடிய GPIOCHIP ரன் சரிபார்க்க:
uk: Для перевірки наявного gpiochip-сервера:

source: To check the pin number and the pin availability tun:
ta: முள் எண் மற்றும் முள் கிடைக்கும் டன் சரிபார்க்க:
uk: Для перевірки номера шпильки і наявності шпильки:

source: ***Warning:*** only gpio marked as `unused` can be used. It is not possible for a *line* to be used by multiple processes simultaneously.
ta: *** எச்சரிக்கை: *** `பயன்படுத்தப்படாத` எனக் குறிக்கப்பட்ட GPIO மட்டுமே பயன்படுத்தப்படலாம். ஒரே நேரத்தில் பல செயல்முறைகளால் ஒரு * வரி * பயன்படுத்த முடியாது.
uk: ***Попередня:*** тільки gpio позначений як `unused`. Не можна використовувати для *line* для одночасного використання декількох процесів.

source: For example on a RPi 3B+ where klipper use the GPIO20 for a switch:
ta: எடுத்துக்காட்டாக, ஒரு RPI 3B+ இல் கிளிப்பர் ஒரு சுவிட்சுக்கு GPIO20 ஐப் பயன்படுத்துகிறது:
uk: Наприклад, на RPi 3B+, де клаппер використовують GPIO20 для перемикача:

source: cd ~/klipper/ make menuconfig
uk: cd ~ / клиппер / налаштування меню

source: sudo service klipper stop make flash sudo service klipper start
uk: sudo service klipper stop зробити спалах sudo service klipper start

source: sudo apt-get install gpiod
uk: sudo apt-get встановити gpiod

source: gpiodetect
uk: труси

source: $ gpiodetect gpiochip0 [pinctrl-bcm2835] (54 lines) gpiochip1 [raspberrypi-exp-gpio] (8 lines) $ gpioinfo gpiochip0 - 54 lines: line 0: unnamed unused input active-high line 1: unnamed unused input active-high line 2: unnamed unused input active-high line 3: unnamed unused input active-high line 4: unnamed unused input active-high line 5: unnamed unused input active-high line 6: unnamed unused input active-high line 7: unnamed unused input active-high line 8: unnamed unused input active-high line 9: unnamed unused input active-high line 10: unnamed unused input active-high line 11: unnamed unused input active-high line 12: unnamed unused input active-high line 13: unnamed unused input active-high line 14: unnamed unused input active-high line 15: unnamed unused input active-high line 16: unnamed unused input active-high line 17: unnamed unused input active-high line 18: unnamed unused input active-high line 19: unnamed unused input active-high line 20: unnamed "klipper" output active-high [used] line 21: unnamed unused input active-high line 22: unnamed unused input active-high line 23: unnamed unused input active-high line 24: unnamed unused input active-high line 25: unnamed unused input active-high line 26: unnamed unused input active-high line 27: unnamed unused input active-high line 28: unnamed unused input active-high line 29: unnamed "led0" output active-high [used] line 30: unnamed unused input active-high line 31: unnamed unused input active-high line 32: unnamed unused input active-high line 33: unnamed unused input active-high line 34: unnamed unused input active-high line 35: unnamed unused input active-high line 36: unnamed unused input active-high line 37: unnamed unused input active-high line 38: unnamed unused input active-high line 39: unnamed unused input active-high line 40: unnamed unused input active-high line 41: unnamed unused input active-high line 42: unnamed unused input active-high line 43: unnamed unused input active-high line 44: unnamed unused input active-high line 45: unnamed unused input active-high line 46: unnamed unused input active-high line 47: unnamed unused input active-high line 48: unnamed unused input active-high line 49: unnamed unused input active-high line 50: unnamed unused input active-high line 51: unnamed unused input active-high line 52: unnamed unused input active-high line 53: unnamed unused input active-high gpiochip1 - 8 lines: line 0: unnamed unused input active-high line 1: unnamed unused input active-high line 2: unnamed "led1" output active-low [used] line 3: unnamed unused input active-high line 4: unnamed unused input active-high line 5: unnamed unused input active-high line 6: unnamed unused input active-high line 7: unnamed unused input active-high
uk: $ gpiodetect gpiochip0 [pinctrl-bcm2835] (54 рядки) gpiochip1 [raspberrypi-exp-gpio] (8 рядків) $gpioinfo gpiochip0 - 54 рядки: рядок 0: безіменний невикористаний вхідний активний високий рядок 1: безіменний невикористаний вхідний активний високий рядок 2: безіменний невикористаний вхідний активний високий рядок 3: безіменний невикористаний вхідний активний високий рядок 4: безіменний невикористаний вхідний активний високий рядок 5: безіменний невикористаний вхідний активний високий рядок 6: безіменний невикористаний вхідний активний високий рядок 7: безіменний невикористаний вхідний активний високий рядок 8: безіменний невикористаний вхідний активний високий рядок 9: безіменний невикористаний вхідний активний високий рядок 10: безіменний невикористаний вхідний активний високий рядок 11: безіменний невикористаний вхід активний-високий рядок 12: безіменний невикористаний вхідний активний високий рядок 13: безіменний невикористаний вхідний активний високий рядок 14: безіменний невикористаний вхідний активний високий рядок 15: безіменний невикористаний вхідний активний високий рядок 16: безіменний невикористаний вхідний активний високий рядок 17: безіменний невикористаний вхідний активний високий рядок 18: безіменний невикористаний вхідний активний високий рядок 19: безіменний невикористаний вхідний активний високий рядок 20: безіменний вихід "klipper" активний високий [використовується] рядок 21: безіменний невикористаний вхідний активний високий рядок 22: безіменний невикористаний вхідний активний високий рядок 23: безіменний невикористаний вхідний активний високий рядок 24: безіменний невикористаний вхідний активний високий рядок 25: безіменний невикористаний вхідний активний високий рядок 26: безіменний невикористаний вхідний активний високий рядок 27: безіменний невикористаний вхідний активний високий рядок 28: безіменний невикористаний вхід активний-високий рядок 29: безіменний вихід "led0" активний-високий [використовується] рядок 30: безіменний невикористаний вхідний активний високий рядок 31: безіменний невикористаний вхідний активний високий рядок 32: безіменний невикористаний вхідний активний високий рядок 33: безіменний невикористаний вхідний активний високий рядок 34: безіменний невикористаний вхідний активний високий рядок 35: безіменний невикористаний вхідний активний високий рядок 36: безіменний невикористаний вхідний активний високий рядок 37: безіменний невикористаний вхідний активний високий рядок 38: безіменний невикористаний вхідний активний високий рядок 39: безіменний невикористаний вхідний активний високий рядок 40: безіменний невикористаний вхідний активний високий рядок 41: безіменний невикористаний вхідний активний високий рядок 42: безіменний невикористаний вхідний активний високий рядок 43: безіменний невикористаний вхідний активний високий рядок 44: безіменний невикористаний вхід активний-високий рядок 45: безіменний невикористаний вхідний активний високий рядок 46: безіменний невикористаний вхідний активний високий рядок 47: безіменний невикористаний вхідний активний високий рядок 48: безіменний невикористаний вхідний активний високий рядок 49: безіменний невикористаний вхідний активний високий рядок 50: безіменний невикористаний вхідний активний високий рядок 51: безіменний невикористаний вхідний активний високий рядок 52: безіменний невикористаний вхідний активний високий рядок 53: безіменний невикористаний вхідний активний високий gpiochip1 - 8 рядків: рядок 0: безіменний невикористаний вхідний активний високий рядок 1: безіменний невикористаний вхідний активний високий рядок 2: безіменний вихід "led1" активний низький [використовується] рядок 3: безіменний невикористаний вхідний активний високий рядок 4: безіменний невикористаний вхідний активний високий рядок 5: безіменний невикористаний вхідний активний високий рядок 6: безіменний невикористаний вхідний активний високий рядок 7: безіменний невикористаний вхідний активний високий

source: Optional: Hardware PWM
ta: விரும்பினால்: வன்பொருள் PWM
uk: Додатково: Обладнання PWM

source: Raspberry Pi's have two PWM channels (PWM0 and PWM1) which are exposed on the header or if not, can be routed to existing gpio pins. The Linux mcu daemon uses the pwmchip sysfs interface to control hardware pwm devices on Linux hosts. The pwm sysfs interface is not exposed by default on a Raspberry and can be activated by adding a line to `/boot/config.txt`:
ta: ராச்பெர்ரி பைக்களில் இரண்டு பி.டபிள்யூ.எம் சேனல்கள் (பி.டபிள்யூ.எம் 0 மற்றும் பி.டபிள்யூ.எம் 1) உள்ளன, அவை தலைப்பில் அம்பலப்படுத்தப்படுகின்றன அல்லது இல்லையென்றால், இருக்கும் சி.பி.ஐ.ஓ ஊசிகளுக்கு அனுப்பப்படலாம். லினக்ச் ஓச்ட்களில் வன்பொருள் PWM சாதனங்களைக் கட்டுப்படுத்த லினக்ச் MCU டீமான் PWMCHIP SYSFS இடைமுகத்தைப் பயன்படுத்துகிறது. PWM SYSFS இடைமுகம் இயல்புநிலையாக ஒரு ராச்பெர்ரியில் அம்பலப்படுத்தப்படவில்லை, மேலும் `/boot/config.txt` க்கு ஒரு வரியைச் சேர்ப்பதன் மூலம் செயல்படுத்தப்படலாம்:
uk: Raspberry Pi має два канали PWM (PWM0 і PWM1), які висвітлюються на заголовку або, якщо ні, можуть бути спрямовані на наявні контакти gpio. Демон Linux mcu використовує інтерфейс pwmchip sysfs для керування апаратними пристроями PWM на хостах Linux. Інтерфейс pwm sysfs не надається за замовчуванням на Raspberry, і його можна активувати, додавши рядок до `/boot/config.txt`:

source: # Enable pwmchip sysfs interface dtoverlay=pwm,pin=12,func=4
uk: # Увімкнути інтерфейс pwmchip sysfs dtoverlay=pwm,pin=12,func=4

source: With the sysfs in place, you can now use either the pwm channel(s) by adding the following piece of configuration to your `printer.cfg`:
ta: SYSF கள் இடத்தில், உங்கள் `printel.cfg` இல் பின்வரும் உள்ளமைவைச் சேர்ப்பதன் மூலம் இப்போது PWM சேனலை (கள்) பயன்படுத்தலாம்:
uk: За допомогою sysfs на місці ви можете використовувати або канал Pwm (s), додавши наступний шматок конфігурації до вашого `printer.cfg`:

source: RPi microcontroller
ta: RPI மைக்ரோகண்ட்ரோலர்
uk: Мікроконтролер RPi

source: PWM0 can be routed to gpio12 and gpio18, PWM1 can be routed to gpio13 and gpio19:
ta: PWM0 ஐ GPIO12 மற்றும் GPIO18 க்கு அனுப்பலாம், PWM1 ஐ GPIO13 மற்றும் GPIO19 க்கு அனுப்பலாம்:
uk: PWM0 може бути переданий до gpio12 і gpio18, PWM1 можна відстежити до gpio13 і gpio19:

source: PWM
ta: பி.டபிள்யூ.எம்
uk: ПВМ

source: gpio PIN
ta: GPIO முள்
uk: христина белла

source: Func
uk: Панчохи

source: Optional: Enabling SPI
ta: விரும்பினால்: SPI ஐ இயக்குகிறது
uk: Додатково: збірка SPI

source: Make sure the Linux SPI driver is enabled by running `sudo raspi-config` and enabling SPI under the "Interfacing options" menu.
uk: Переконайтеся, що драйвер Linux SPI працює `sudo raspi-config` і дозволяє SPI під меню «Інфракційні параметри».

source: The chosen pin can thus be used within the configuration as `gpiochip<n>/gpio<o>` where **n** is the chip number as seen by the `gpiodetect` command and **o** is the line number seen by the`gpioinfo` command.
ta: தேர்ந்தெடுக்கப்பட்ட முள் உள்ளமைவுக்குள் `gpiochip <n>/gpio <o>` எங்கே ** n ** என்பது சிப் எண் `gpiodetect` கட்டளை மற்றும் ** o ** வரி எண் `Gpioinfo` கட்டளையால் பார்த்தது.
uk: Вибраний шпилька може використовуватися в конфігурації, як `gpiochip<n>/gpio<o>`, де **n** є номер чіпа, як видно `gpiodetect` команди і **o** є номер лінії, виданий`gpioinfo`.

source: On Raspberry Pi and on many clones the pins exposed on the GPIO belong to the first gpiochip. They can therefore be used on klipper simply by referring them with the name `gpio0..n`. However, there are cases in which the exposed pins belong to gpiochips other than the first. For example in the case of some OrangePi models or if a Port Expander is used. In these cases it is useful to use the commands to access the *Linux GPIO character device* to verify the configuration.
ta: ராச்பெர்ரி பை மற்றும் பல குளோன்களில் GPIO இல் வெளிப்படுத்தப்பட்ட ஊசிகளும் முதல் GPIOCHIP க்கு சொந்தமானவை. எனவே அவற்றை `gpio0..n` என்ற பெயருடன் குறிப்பிடுவதன் மூலம் கிளிப்பரில் பயன்படுத்தலாம். இருப்பினும், அம்பலப்படுத்தப்பட்ட ஊசிகளும் முதல் gpiochips க்கு சொந்தமான வழக்குகள் உள்ளன. உதாரணமாக சில ஆரஞ்ச்பி மாதிரிகள் அல்லது ஒரு துறைமுக விரிவாக்கம் பயன்படுத்தப்பட்டால். இந்த சந்தர்ப்பங்களில், உள்ளமைவை சரிபார்க்க * லினக்ச் சி.பி.ஐ.ஓ எழுத்து சாதனத்தை * அணுக கட்டளைகளைப் பயன்படுத்துவது பயனுள்ளதாக இருக்கும்.
uk: На Малини Пі і на багатьох клонах шпильки, які піддаються GPIO, належать до першого gpiochip. Таким чином, можна використовувати на клиппері, просто, посилаючи їх з назвою `gpio0.n`. Тим не менш, є випадки, в яких відкриті штифти належать gpiochips, крім першого. Наприклад, у випадку деяких моделей OrangePi або якщо використовується Port Expander. У цих випадках корисно використовувати команди для доступу до *Linux GPIO * для перевірки конфігурації.

source: Optional: Enabling I2C
ta: விரும்பினால்: I2C ஐ இயக்குகிறது
uk: Додатково: Включення I2C

source: Make sure the Linux I2C driver is enabled by running `sudo raspi-config` and enabling I2C under the "Interfacing options" menu. If planning to use I2C for the MPU accelerometer, it is also required to set the baud rate to 400000 by: adding/uncommenting `dtparam=i2c_arm=on,i2c_arm_baudrate=400000` in `/boot/config.txt` (or `/boot/firmware/config.txt` in some distros).
ta: `சூடோ ராச்பி-கான்ஃபிக்` ஐ இயக்குவதன் மூலமும்," இடைமுக விருப்பங்கள் "மெனுவின் கீழ் I2C ஐ இயக்குவதன் மூலமும் லினக்ச் I2C இயக்கி இயக்கப்பட்டிருப்பதை உறுதிசெய்க. MPU முடுக்கமானிக்கு I2C ஐப் பயன்படுத்தத் திட்டமிட்டால், பாட் வீதத்தை 400000 ஆக அமைக்க வேண்டும்: `dtparam = i2c_arm = on, i2c_arm_baudrate = 400000` இல்`/boot/config.txt` (அல்லது `/ சில டிச்ட்ரோக்களில் துவக்க/நிலைபொருள்/config.txt`).
uk: Переконайтеся, що драйвер Linux I2C ввімкнено за допомогою запуску `sudo raspi-config` і дозволяє I2C під меню «Інфракційні параметри». Якщо планується використовувати I2C для акселерометра МПУ, необхідно також встановити курс на бас до 400000: додавання/розвантаження `dtparam=i2c_arm=on,i2c_arm_baudrate=400000` в `/завантаження/config.txt` (або `/завантаження/підтвердження/config.txt` в деяких дистроях).

source: cd ~/klipper/ sudo cp ./scripts/klipper-mcu.service /etc/systemd/system/ sudo systemctl enable klipper-mcu.service
uk: cd ~ / клиппер / javascript licenses api веб-сайт go1.13.8 sudo systemctl включити klipper-mcu.service

source: This example enables only PWM0 and routes it to gpio12. If both PWM channels need to be enabled you can use `pwm-2chan`:
ta: இந்த எடுத்துக்காட்டு PWM0 ஐ மட்டுமே செயல்படுத்துகிறது மற்றும் அதை GPIO12 க்கு வழிநடத்துகிறது. இரண்டு PWM சேனல்களையும் இயக்க வேண்டும் என்றால், நீங்கள் `PWM-2Chan` ஐப் பயன்படுத்தலாம்:
uk: Цей приклад дозволяє тільки PWM0 і маршрути його до gpio12. Якщо обидві канали PWM повинні бути включені, ви можете використовувати `pwm-2chan`:

source: # Enable pwmchip sysfs interface dtoverlay=pwm-2chan,pin=12,func=4,pin2=13,func2=4
uk: # Увімкнути інтерфейс pwmchip sysfs dtoverlay=pwm-2chan,pin=12,func=4,pin2=13,func2=4

source: This example additionally enables PWM1 and routes it to gpio13.
ta: இந்த எடுத்துக்காட்டு கூடுதலாக PWM1 ஐ செயல்படுத்துகிறது மற்றும் அதை GPIO13 க்கு வழிநடத்துகிறது.
uk: Цей приклад додатково дозволяє PWM1 і маршрути його до gpio13.

source: The overlay does not expose the pwm line on sysfs on boot and needs to be exported by echo'ing the number of the pwm channel to `/sys/class/pwm/pwmchip0/export`. This will create device `/sys/class/pwm/pwmchip0/pwm0` in the filesystem. The easiest way to do this is by adding this to `/etc/rc.local` before the `exit 0` line:
ta: மேலடுக்கு துவக்கத்தில் SYSF களில் PWM வரியை அம்பலப்படுத்தாது, மேலும் PWM சேனலின் எண்ணிக்கையை `/sys/class/pwm/pwmchip0/export` க்கு எதிரொலிப்பதன் மூலம் ஏற்றுமதி செய்ய வேண்டும். இது கோப்பு முறைமையில் சாதனம் `/sys/class/pwm/pwmchip0/pwm0` ஐ உருவாக்கும். இதைச் செய்வதற்கான எளிதான வழி, `/etc/rc.local` இல்` வெளியேறு 0` வரிக்கு முன் சேர்ப்பதன் மூலம்:
uk: Накладка не виводить лінію рами на сосфах на завантаженні і потрібно експортувати в ехо кількість каналу pwm до `/sys/class/pwmchip0/export`. Це створить пристрій `/sys/class/pwmchip0/pwm0` в файловій системі. Найпростіший спосіб зробити це, додавши до `/etc/rc.local` перед `exit 0` рядок:

source: # Enable pwmchip sysfs interface echo 0 > /sys/class/pwm/pwmchip0/export
uk: Нема Увімкнути інтерфейс sysfs pwmchip echo 0 > /sys/class/pwmchip0/export

source: When using both PWM channels, the number of the second channel needs to be echo'd as well:
ta: இரண்டு PWM சேனல்களையும் பயன்படுத்தும் போது, இரண்டாவது சேனலின் எண்ணிக்கையும் எதிரொலிக்க வேண்டும்:
uk: При використанні як каналів PWM, кількість другого каналу необхідно бути ехо і:

source: # Enable pwmchip sysfs interface echo 0 > /sys/class/pwm/pwmchip0/export echo 1 > /sys/class/pwm/pwmchip0/export
uk: Нема Увімкнути інтерфейс sysfs pwmchip echo 0 > /sys/class/pwmchip0/export echo 1 > /sys/class/pwmchip0/export

source: [output_pin caselight] pin: host:pwmchip0/pwm0 pwm: True hardware_pwm: True cycle_time: 0.000001 [output_pin beeper] pin: host:pwmchip0/pwm1 pwm: True hardware_pwm: True value: 0 shutdown_value: 0 cycle_time: 0.0005
uk: [вихід_pin caselight] шпилька: господар:pwmchip0/pwm0 pwm: Правда Обладнання_pwm: Про нас час: 0.000001 [вихід_pin beeper] шпилька: господар:pwmchip0/pwm1 pwm: Правда Обладнання_pwm: Про нас значення: 0 0 товар(ов) - 0.00 € час: 0.0005

source: This will add hardware pwm control to gpio12 and gpio13 on the Pi (because the overlay was configured to route pwm0 to pin=12 and pwm1 to pin=13).
ta: இது PI இல் GPIO12 மற்றும் GPIO13 க்கு வன்பொருள் PWM கட்டுப்பாட்டைச் சேர்க்கும் (ஏனெனில் மேலடுக்கு PWM0 க்கு முள் = 12 மற்றும் PWM1 க்கு முள் = 13 வரை கட்டமைக்கப்பட்டது).
uk: Це додасть апаратне управління ромбами до gpio12 і gpio13 на Пі (при використанні накладу було налаштовано до маршруту pwm0 до шпильки=12 і pwm1 для шпильки=13).
