Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/SDCard_Updates.po
Languages: uk

source: Many of today's popular controller boards ship with a bootloader capable of updating firmware via SD Card. While this is convenient in many circumstances, these bootloaders typically provide no other way to update firmware. This can be a nuisance if your board is mounted in a location that is difficult to access or if you need to update firmware often. After Klipper has been initially flashed to a controller it is possible to transfer new firmware to the SD Card and initiate the flashing procedure via ssh.
uk: Багато популярних щитів контролера сьогодні корабель з завантажувачем, здатний оновити прошивку через SD-карт. Хоча це зручно в багатьох обставинах, ці завантажувачі зазвичай не забезпечують інший спосіб оновлення прошивки. Це може бути нагота, якщо ваша дошка встановлена в місці, що важко отримати доступ або якщо вам потрібно оновити прошивку часто. Після того, як Klipper спочатку спалахнув на контролер, можна перенести нову прошивку на SD-карту і ініціювати процедуру миття через Ssh.

source: Typical Upgrade Procedure
uk: Типова процедура оновлення

source: The procedure for updating MCU firmware using the SD Card is similar to that of other methods. Instead of using `make flash` it is necessary to run a helper script, `flash-sdcard.sh`. Updating a BigTreeTech SKR 1.3 might look like the following:
uk: Процедура оновлення мікропрограми МКУ з використанням SD-карти схожа на інші методи. замість використання `make flash` потрібно запустити скрипт помічника, `flash-sdcard.sh`. Оновлення BigTreeTech SKR 1.3 може виглядати наступним чином:

source: It is up to the user to determine the device location and board name. If a user needs to flash multiple boards, `flash-sdcard.sh` (or `make flash` if appropriate) should be run for each board prior to restarting the Klipper service.
uk: Щоб визначити розташування пристрою та назву дошки. Якщо користувач повинен спалахувати декілька дощок, `flash-sdcard.sh` (або `make flash`, якщо це доречно) слід запустити для кожної дошки до перезавантаження сервісу Klipper.

source: Supported boards can be listed with the following command:
uk: Підтримувані дошки можуть бути вказані з наступним командуванням:

source: If you do not see your board listed it may be necessary to add a new board definition as [described below](#board-definitions).
uk: Якщо ви не бачите вашу дошку, вказану вона може бути обов'язково, щоб додати нову дошку, як [описаний нижче](#board-definitions).

source: Advanced Usage
uk: Розширене використання

source: The above commands assume that your MCU connects at the default baud rate of 250000 and the firmware is located at `~/klipper/out/klipper.bin`. The `flash-sdcard.sh` script provides options for changing these defaults. All options can be viewed by the help screen:
uk: Наведені вище команди припускають, що ваш MCU з'єднується з частотою за замовчуванням 250000 і прошивкою знаходиться на ` ~/klipper/out/klipper.bin`. `flash-sdcard.sh` скрипт надає параметри для зміни цих за замовчуванням. Всі варіанти можна переглянути за допомогою екрана:

source: If your board is flashed with firmware that connects at a custom baud rate it is possible to upgrade by specifying the `-b` option:
uk: Якщо ваша дошка миготливий з прошивкою, яка з'єднує в користувацькій швидкості baud, можна оновити, вказавши параметр `-b`:

source: If you wish to flash a build of Klipper located somewhere other than the default location it can be done by specifying the `-f` option:
uk: Якщо ви хочете поспілкуватися з будівництвом Кліппера, розташованого десь, крім розташування за замовчуванням, його можна зробити, вказавши параметр `-f`:

source: Note that when upgrading a MKS Robin E3 it is not necessary to manually run `update_mks_robin.py` and supply the resulting binary to `flash-sdcard.sh`. This procedure is automated during the upload process.
uk: Зауважте, що при модернізації MKS Robin E3 не потрібно вручну запустити `update_mks_robin.py` і постачання отриманого бінарного до `flash-sdcard.sh`. Ця процедура автоматизована в процесі завантаження.

source: Caveats
uk: Печера

source: As mentioned in the introduction, this method only works for upgrading firmware. The initial flashing procedure must be done manually per the instructions that apply to your controller board.
uk: Як зазначено в впровадженні цей метод працює тільки для оновлення прошивки. Початкова процедура миготіння повинна бути виконана вручну за вказівкою, яка застосовується до вашої плати контролера.

source: While it is possible to flash a build that changes the Serial Baud or connection interface (ie: from USB to UART), verification will always fail as the script will be unable to reconnect to the MCU to verify the current version.
uk: В той час як можна флешбудувати, що змінює інтерфейс Serial Baud або підключення (тобто: від USB до UART), перевірка завжди не може відключатися до MCU, щоб перевірити точну версію.

source: Board Definitions
uk: Визначення Правління

source: Most common boards should be available, however it is possible to add a new board definition if necessary. Board definitions are located in `~/klipper/scripts/spi_flash/board_defs.py`. The definitions are stored in dictionary, for example:
uk: Найпоширеніші дошки повинні бути доступні, проте можна додати нове визначення дошки при необхідності. ` ~/klipper/scripts/spi_flash/board_defs.py`. Визначення зберігаються у словнику, наприклад:

source: The following fields may be specified:
uk: Ви можете вказати наступні поля:

source: `firmware_path`: The path on the SD Card where firmware should be transferred. The default is `firmware.bin`.
uk: `firmware_path`: Шлях на SD-карті, де прошивка повинна передаватися. За замовчуванням `firmware.bin`.

source: `spi_pins`: This should be 3 comma separated pins that are connected to the SD Card in the format of `miso,mosi,sclk`.
uk: `spi_pins`: це мають бути 3 контакти, розділені комами, які під’єднані до SD-карти у форматі `miso,mosi,sclk`.

source: Prior to creating a new board definition one should check to see if an existing board definition meets the criteria necessary for the new board. If this is the case, a `BOARD_ALIAS` may be specified. For example, the following alias may be added to specify `my-new-board` as an alias for `generic-lpc1768`:
uk: Перед створенням нової дошки слід перевірити, чи відповідає існуюча дошка критеріям, необхідні для нової дошки. Якщо це справа, то можна вказати `BOARD_ALIAS`. Наприклад, для уточнення `my-new-board` як псевдонім для `generic-lpc1768`:

source: If you need a new board definition and you are uncomfortable with the procedure outlined above it is recommended that you request one in the [Klipper Community Discord](Contact.md#discord).
uk: Якщо вам потрібна нова дошка визначення, і ви некомфортний з процедурою, зазначеною вище, рекомендується запитати один в [Klipper Community Discord](Контакт.md#discord).

source: sudo service klipper stop cd ~/klipper git pull make clean make menuconfig make ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-skr-v1.3 sudo service klipper start
uk: sudo обслуговування klipper стоп cd ~ / клиппер git тягнути Чистий Налаштування меню Зроби JavaScript licenses API Веб-сайт Go1.13.8 sudo сервіс klipper старт

source: ./scripts/flash-sdcard.sh -l
uk: javascript licenses api веб-сайт go1.13.8 -л

source: ./scripts/flash-sdcard.sh -b 115200 /dev/ttyAMA0 btt-skr-v1.3
uk: JavaScript licenses API Веб-сайт Go1.13.8

source: ./scripts/flash-sdcard.sh -f ~/downloads/klipper.bin /dev/ttyAMA0 btt-skr-v1.3
uk: JavaScript licenses API Веб-сайт Go1.13.8 JavaScript licenses API Веб-сайт Go1.13.8 /dev/ttyAMA0 btt-skr-v1.3

source: BOARD_DEFS = { 'generic-lpc1768': { 'mcu': "lpc1768", 'spi_bus': "ssp1", "cs_pin": "P0.6" }, ...<further definitions> }
uk: BOARD_DEFS = { 'generic-lpc1768': { 'mcu': "lpc1768", 'spi_bus': "ssp1", "cs_pin": "P0.6" Головна ...<додаткові визначення> Про нас

source: BOARD_ALIASES = { ...<previous aliases>, 'my-new-board': BOARD_DEFS['generic-lpc1768'], }
uk: BOARD_ALIASES = { ... <previous aliases>, 'my-new-board': BOARD_DEFS['generic-lpc1768'], Про нас

source: SDCard updates
uk: Оновлення SDCard

source: ./scripts/flash-sdcard.sh -h SD Card upload utility for Klipper usage: flash_sdcard.sh [-h] [-l] [-c] [-b <baud>] [-f <firmware>] <device> <board> positional arguments: <device> device serial port <board> board type optional arguments: -h show this message -l list available boards -c run flash check/verify only (skip upload) -b <baud> serial baud rate (default is 250000) -f <firmware> path to klipper.bin
uk: JavaScript licenses API Веб-сайт Go1.13.8 -час SD Card завантажити утиліту для Klipper Використання: flash_sdcard.sh [-h] [-l] [-c] [-b <baud>] [-f <firmware>] <device> <board>> <device> <board> <board>><device>>> <board>>>><device>> <board>>>><device>>><device>>> <board>>>>>>>>>>>>>>>>>><device>>>>>>>>>>>>>>>>><device>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> позиціональні аргументи: <device> пристрій серійного порту <board> тип дошки додаткові аргументи: -h показати це повідомлення -l список доступних плат -c запустіть флеш-перевірку/перевірити тільки (завантажити) -b <baud> серійний курс шнура (за замовчуванням 250000) -f <firmware> шлях до клиппера. бін

source: The `-c` option is used to perform a check or verify-only operation to test if the board is running the specified firmware correctly. This option is primarily intended for cases where a manual power-cycle is necessary to complete the flashing procedure, such as with bootloaders that use SDIO mode instead of SPI to access their SD Cards. (See Caveats below) But, it can also be used anytime to verify if the code flashed into the board matches the version in your build folder on any supported board.
uk: Варіант `-c` використовується для виконання перевірки або перевірки операції для тестування, якщо дошка працює правильно зазначена прошивка. Ця опція призначена для випадків, коли ручна електростанція повинна завершити процедуру миття, такі як завантажувачі, які використовують режим SDIO замість SPI для доступу до своїх SD-карт. (Ше Печери нижче) Але також можна використовувати будь-який час, щоб переконатися, що код, що спалахнув в дошку, відповідає версії в папці вашого будівництва на будь-якій підтриманій дошці.

source: Only boards that use SPI for SD Card communication are supported. Boards that use SDIO, such as the Flymaker Flyboard and MKS Robin Nano V1/V2, will not work in SDIO mode. However, it's usually possible to flash such boards using Software SPI mode instead. But if the board's bootloader only uses SDIO mode to access the SD Card, a power-cycle of the board and SD Card will be necessary so that the mode can switch from SPI back to SDIO to complete reflashing. Such boards should be defined with `skip_verify` enabled to skip the verify step immediately after flashing. Then after the manual power-cycle, you can rerun the exact same `./scripts/flash-sdcard.sh` command, but add the `-c` option to complete the check/verify operation. See [Flashing Boards that use SDIO](#flashing-boards-that-use-sdio) for examples.
uk: Підтримуються тільки дошки, які використовують SPI для SD-карт. Дошки, які використовують SDIO, такі як Flymaker Flyboard і MKS Robin Nano V1/V2, не будуть працювати в режимі SDIO. Тим не менш, це, як правило, можна спалахувати такі дошки за допомогою програми SPI режим. Але якщо завантажувач дошки використовується тільки режим SDIO для доступу до SD-карти, буде потрібно для того, щоб режим може переключатися з SPI назад до SDIO, щоб завершити рефлешинг. Такі дошки повинні бути визначені `skip_verify`, щоб пропустити контрольний крок відразу після миття. Потім після ручної роботи ви можете перезапустити те ж саме `./scripts/flash-sdcard.sh` команди, але додати `-c` варіант для завершення роботи перевірки/перевірки. Див. [Файлингові дошки, які використовують SDIO](#flashing-boards-that-use-sdio) для прикладів.

source: `current_firmware_path`: The path on the SD Card where the renamed firmware file is located after a successful flash. The default is `firmware.cur`.
uk: `current_firmware_path`: Шлях на SD-карті, де перейменований файл прошивки знаходиться після вдалого спалаху. За замовчуванням `firmware.cur`.

source: `skip_verify`: This defines a boolean value which tells the scripts to skip the firmware verification step during the flashing process. The default is `False`. It can be set to `True` for boards that require a manual power-cycle to complete flashing. To verify the firmware afterward, run the script again with the `-c` option to perform the verification step. [See caveats with SDIO cards](#caveats)
uk: `skip_verify`: це визначає логічне значення, яке повідомляє сценаріям пропустити етап перевірки мікропрограми під час процесу прошивки. Типовим значенням є `False`. Його можна встановити на `True` для плат, які потребують ручного циклу живлення для завершення перепрошивки. Щоб згодом перевірити мікропрограму, запустіть сценарій ще раз із опцією `-c`, щоб виконати крок перевірки. [Див. застереження щодо карт SDIO](#caveats)

source: If software SPI is required, the `spi_bus` field should be set to `swspi` and the following additional field should be specified:
uk: Якщо програмне забезпечення SPI потрібна, поле `spi_bus` повинна бути встановлена до `swspi` і вказане додаткове поле:

source: It should be exceedingly rare that Software SPI is necessary, typically only boards with design errors or boards that normally only support SDIO mode for their SD Card will require it. The `btt-skr-pro` board definition provides an example of the former, and the `btt-octopus-f446-v1` board definition provides an example of the latter.
uk: Це має бути надзвичайно рідкісним, що програмне забезпечення SPI є обов'язковим, як правило, тільки дошки з помилками дизайну або дошками, які зазвичай підтримують режим SDIO для своєї SD-карти. `btt-skr-pro` визначення дошки забезпечує приклад колишнього, а `btt-octopus-f446-v1` визначення дошки забезпечує приклад останнього.

source: Flashing Boards that use SDIO
uk: Флеш-дошки, які використовують SDIO

source: [As mentioned in the Caveats](#caveats), boards whose bootloader uses SDIO mode to access their SD Card require a power-cycle of the board, and specifically the SD Card itself, in order to switch from the SPI Mode used while writing the file to the SD Card back to SDIO mode for the bootloader to flash it into the board. These board definitions will use the `skip_verify` flag, which tells the flashing tool to stop after writing the firmware to the SD Card so that the board can be manually power-cycled and the verification step deferred until that's complete.
uk: [Згадані в печериці](#caveats), дошки, чиї завантажувач використовує режим SDIO для доступу до своєї SD-карти, що вимагає енергетичного циклу дошки, а особливо самої SD-карти, для того, щоб перейти від SPI-режиму, який використовується при написанні файлу до SD-карти назад в режим SDIO для завантажувача, щоб спалахнути його в дошку. Ці визначення дошки будуть використовувати прапор `скіп_verify`, який розповідає про миготливий інструмент, щоб зупинитися після написання прошивки SD-карт так, щоб дошка може бути ручним зарядом і кроком перевірки відкладається до завершення.

source: There are two scenarios -- one with the RPi Host running on a separate power supply and the other when the RPi Host is running on the same power supply as the main board being flashed. The difference is whether or not it's necessary to also shutdown the RPi and then `ssh` again after the flashing is complete in order to do the verification step, or if the verification can be done immediately. Here's examples of the two scenarios:
uk: Є два сценарії - один з RPi Хост, що працює на окремому електроживленні та інших при RPi Хост працює на одному електропостачанні, як і на головній дошці. Відмінність полягає в тому, чи не потрібно також вимкнути RPi, а потім `ssh` знову після завершення флешки, щоб зробити крок перевірки, або якщо перевірка може бути зроблено відразу. Ось приклади двох сценаріїв:

source: SDIO Programming with RPi on Separate Power Supply
uk: ПІО Програмування з RPi на окремому блокі живлення

source: A typical session with the RPi on a Separate Power Supply looks like the following. You will, of course, need to use your proper device path and board name:
uk: Типова сесія з RPi на окремому блокі живлення виглядає наступним чином: Ви будете, звичайно, повинні використовувати правильний шлях пристрою і назву дошки:

source: sudo service klipper stop cd ~/klipper git pull make clean make menuconfig make ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-octopus-f446-v1 [[[manually power-cycle the printer board here when instructed]]] ./scripts/flash-sdcard.sh -c /dev/ttyACM0 btt-octopus-f446-v1 sudo service klipper start
uk: sudo обслуговування klipper стоп cd ~ / клиппер git тягнути Чистий Налаштування меню Зроби JavaScript licenses API Веб-сайт Go1.13.8 [[[[[manually power-cycle]]]]] JavaScript licenses API Веб-сайт Go1.13.8 -c /dev/ttyACM0 btt-octopus-f446-v1 sudo сервіс klipper старт

source: SDIO Programming with RPi on the Same Power Supply
uk: ПІО Програмування з RPi на Same Power Supply

source: A typical session with the RPi on the Same Power Supply looks like the following. You will, of course, need to use your proper device path and board name:
uk: Типова сесія з RPi на Same Power Supply виглядає наступним чином: Ви будете, звичайно, повинні використовувати правильний шлях пристрою і назву дошки:

source: sudo service klipper stop cd ~/klipper git pull make clean make menuconfig make ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-octopus-f446-v1 sudo shutdown -h now [[[wait for the RPi to shutdown, then power-cycle and ssh again to the RPi when it restarts]]] sudo service klipper stop cd ~/klipper ./scripts/flash-sdcard.sh -c /dev/ttyACM0 btt-octopus-f446-v1 sudo service klipper start
uk: sudo обслуговування klipper стоп cd ~ / клиппер git тягнути Чистий Налаштування меню Зроби JavaScript licenses API Веб-сайт Go1.13.8 sudo вимкнення -h тепер [[[відповіді для РПІ, щоб відхилити, потім знову до РПІ, коли він перезавантажує]]]]] sudo обслуговування klipper стоп cd ~ / клиппер JavaScript licenses API Веб-сайт Go1.13.8 -c /dev/ttyACM0 btt-octopus-f446-v1 sudo сервіс klipper старт

source: In this case, since the RPi Host is being restarted, which will restart the `klipper` service, it's necessary to stop `klipper` again before doing the verification step and restart it after verification is complete.
uk: У цьому випадку з RPi Хост перезавантажений, який перезавантажить `klipper` сервіс, необхідно зупинити `klipper` знову перед початком перевірки і перезавантажити його після завершення перевірки.

source: SDIO to SPI Pin Mapping
uk: SDIO до SPI Pin Mapping

source: If your board's schematic uses SDIO for its SD Card, you can map the pins as described in the chart below to determine the compatible Software SPI pins to assign in the `board_defs.py` file:
uk: Якщо schematic використовує SDIO для своєї SD-карти, ви можете намітити шпильки, як описані в діаграмі нижче, щоб визначити сумісні програми SPI шпильки, щоб призначити в `board_defs.py` файл:

source: SD Card Pin
uk: Сонце Карниз

source: Micro SD Card Pin
uk: Мікро SD Карниз

source: SDIO Pin Name
uk: ПІО Ім'я файла

source: SPI Pin Name
uk: СПИ Ім'я файла

source: DATA2
uk: ДАТА2

source: None (PU)*
uk: None (ПУ)*

source: CS
uk: Р

source: CMD
uk: КМД

source: MOSI
uk: КОШИК

source: +3.3V (VDD)
uk: +3.3В (ВД)

source: CLK
uk: КАРК

source: SCLK
uk: СКЛК

source: GND (VSS)
uk: ГНД (ВС)

source: DATA0
uk: ДАТА0

source: MISO
uk: МІСО

source: DATA1
uk: ДАТА1

source: N/A
uk: недоступно

source: Card Detect (CD)
uk: Детект карти (CD)

source: GND
uk: ГНД

source: \* None (PU) indicates an unused pin with a pull-up resistor
uk: \* Ні (ПУ) вказує невикористаний штифт з резистором

source: `mcu`: The mcu type. This can be retrieved after configuring the build via `make menuconfig` by running `cat .config | grep CONFIG_MCU`. This field is required.
uk: `mcu`: Тип маку. Це може бути відновлено після налаштування збірки через `make менюconfig`, використовуючи `cat .config grep CONFIG_MCU`. Це поле обов'язково.

source: `spi_bus`: The SPI bus connected to the SD Card. This should be retrieved from the board's schematic. This field is required.
uk: `spi_bus`: Автобус SPI підключений до SD-карт. Це повинно бути отримано від схеми дошки. Це поле обов'язково.

source: `cs_pin`: The Chip Select Pin connected to the SD Card. This should be retrieved from the board schematic. This field is required.
uk: `cs_pin`: Чіп Виберіть шпильку підключений до SD-карт. Це слід отримати з дошки schematic. Це поле обов'язково.
