Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Skew_Correction.po
Languages: bg

source: Skew correction
bg: Корекция на наклона

source: Software based skew correction can help resolve dimensional inaccuracies resulting from a printer assembly that is not perfectly square. Note that if your printer is significantly skewed it is strongly recommended to first use mechanical means to get your printer as square as possible prior to applying software based correction.
bg: Софтуерно базираната корекция на изкривяването може да помогне за отстраняване на неточностите в размерите, произтичащи от сглобка на принтер, която не е идеално квадратна. Имайте предвид, че ако принтерът ви е значително изкривен, силно се препоръчва първо да използвате механични средства, за да направите принтера си възможно най-квадратен, преди да приложите софтуерна корекция.

source: Print a Calibration Object
bg: Отпечатване на обект за калибриране

source: The first step in correcting skew is to print a [calibration object](https://www.thingiverse.com/thing:2563185/files) along the plane you want to correct. There is also a [calibration object](https://www.thingiverse.com/thing:2972743) that includes all planes in one model. You want the object oriented so that corner A is toward the origin of the plane.
bg: Първата стъпка в коригирането на наклона е да отпечатате [обект за калибриране](https://www.thingiverse.com/thing:2563185/files) по дължината на равнината, която искате да коригирате. Съществува и [обект за калибриране](https://www.thingiverse.com/thing:2972743), който включва всички равнини в един модел. Искате обектът да е ориентиран така, че ъгъл А да е към началото на равнината.

source: Make sure that no skew correction is applied during this print. You may do this by either removing the `[skew_correction]` module from printer.cfg or by issuing a `SET_SKEW CLEAR=1` gcode.
bg: Уверете се, че по време на това отпечатване не е приложена корекция на изкривяването. Можете да направите това или като премахнете модула `[skew_correction]` от printer.cfg, или като издадете gcode `SET_SKEW CLEAR=1`.

source: Take your measurements
bg: Направете своите измервания

source: Configure your skew
bg: Конфигуриране на изкривяването

source: Make sure `[skew_correction]` is in printer.cfg. You may now use the `SET_SKEW` gcode to configure skew_correcton. For example, if your measured lengths along XY are as follows:
bg: Уверете се, че `[skew_correction]` е в printer.cfg. Сега можете да използвате gcode `SET_SKEW`, за да конфигурирате skew_correcton. Например, ако измерените дължини по XY са следните:

source: `SET_SKEW` can be used to configure skew correction for the XY plane.
bg: `SET_SKEW` може да се използва за конфигуриране на корекция на изкривяването за равнината XY.

source: You may also add measurements for XZ and YZ to the gcode:
bg: Можете също така да добавите измервания за XZ и YZ към gcode:

source: The `[skew_correction]` module also supports profile management in a manner similar to `[bed_mesh]`. After setting skew using the `SET_SKEW` gcode, you may use the `SKEW_PROFILE` gcode to save it:
bg: Модулът `[skew_correction]` поддържа и управление на профили по начин, подобен на този на `[bed_mesh]`. След като зададете изкривяването с помощта на гкода `SET_SKEW`, можете да използвате гкода `SKEW_PROFILE`, за да го запазите:

source: After this command you will be prompted to issue a `SAVE_CONFIG` gcode to save the profile to persistent storage. If no profile is named `my_skew_profile` then a new profile will be created. If the named profile exists it will be overwritten.
bg: След тази команда ще бъдете подканени да издадете gcode `SAVE_CONFIG`, за да запазите профила в постоянна памет. Ако няма профил с име `my_skew_profile`, ще бъде създаден нов профил. Ако именуваният профил съществува, той ще бъде презаписан.

source: Once you have a saved profile, you may load it:
bg: След като сте запазили профил, можете да го заредите:

source: It is also possible to remove an old or out of date profile:
bg: Възможно е също така да премахнете стар или неактуален профил:

source: After removing a profile you will be prompted to issue a `SAVE_CONFIG` to make this change persist.
bg: След като премахнете профил, ще бъдете подканени да издадете `SAVE_CONFIG`, за да запазите тази промяна.

source: Verifying your correction
bg: Проверка на вашата корекция

source: After skew_correction has been configured you may reprint the calibration part with correction enabled. Use the following gcode to check your skew on each plane. The results should be lower than those reported via `GET_CURRENT_SKEW`.
bg: След конфигурирането на корекция на изкривяването можете да отпечатате отново частта за калибриране с активирана корекция. Използвайте следния gcode, за да проверите наклона на всяка равнина. Резултатите трябва да са по-ниски от тези, отчетени чрез `GET_CURRENT_SKEW`.

source: Caveats
bg: Предупреждения

source: Due to the nature of skew correction it is recommended to configure skew in your start gcode, after homing and any kind of movement that travels near the edge of the print area such as a purge or nozzle wipe. You may use use the `SET_SKEW` or `SKEW_PROFILE` gcodes to accomplish this. It is also recommended to issue a `SET_SKEW CLEAR=1` in your end gcode.
bg: Поради естеството на корекцията на наклона е препоръчително да конфигурирате наклона в началния gcode, след навиване и всякакъв вид движение, което се движи близо до ръба на зоната за печат, като например прочистване или избърсване на дюзата. За тази цел можете да използвате гкодовете `SET_SKEW` или `SKEW_PROFILE`. Препоръчително е също така да зададете `SET_SKEW CLEAR=1` в крайния си gcode.

source: Keep in mind that it is possible for `[skew_correction]` to generate a correction that moves the tool beyond the printer's boundaries on the X and/or Y axes. It is recommended to arrange parts away from the edges when using `[skew_correction]`.
bg: Имайте предвид, че е възможно `[skew_correction]` да генерира корекция, която премества инструмента извън границите на принтера по осите X и/или Y. Препоръчително е при използване на `[skew_correction]` да подреждате детайлите далеч от ръбовете.

source: The `[skew_correction]` module requires 3 measurements for each plane you want to correct; the length from Corner A to Corner C, the length from Corner B to Corner D, and the length from Corner A to Corner D. When measuring length AD do not include the flats on the corners that some test objects provide.
bg: Модулът `[skew_correction]` изисква 3 измервания за всяка равнина, която искате да коригирате; дължината от ъгъл A до ъгъл C, дължината от ъгъл B до ъгъл D и дължината от ъгъл A до ъгъл D. Когато измервате дължината, AD не включва плоските ъгли, които някои тестови обекти предоставят.
