Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Sponsors.po
Languages: uk

source: Sponsors
uk: Спонсори

source: Klipper is Free Software. We depend on the generous support from sponsors. Please consider sponsoring Klipper or supporting our sponsors.
uk: Klipper є безкоштовним програмним забезпеченням. Від спонсорів залежить щедра підтримка. Будь ласка, врахуйте спонсорів Klipper або підтримайте наших спонсорів.

source: BIGTREETECH
uk: БІГТРИТЕХ

source: BIGTREETECH is the official mainboard sponsor of Klipper. BIGTREETECH is committed to developing innovative and competitive products to serve the 3D printing community better. Follow them on [Facebook](https://www.facebook.com/BIGTREETECH) or [Twitter](https://twitter.com/BigTreeTech).
uk: BIGTREETECH є офіційним спонсором материнської плати Klipper. BIGTREETECH прагне розробляти інноваційні та конкурентоспроможні продукти, щоб краще служити спільноті 3D-друку. Слідкуйте за ними у [Facebook](https://www.facebook.com/BIGTREETECH) або [Twitter](https://twitter.com/BigTreeTech).

source: Klipper Developers
uk: Розробники Klipper

source: Kevin O'Connor
uk: Кевін О'Коннор

source: Eric Callahan
uk: Ерік Калаган

source: Eric is the author of bed_mesh, spi_flash, and several other Klipper modules. Eric has a donations page at: <https://ko-fi.com/arksine>
uk: Ерік є автором ліжко_меш, spi_flash, і декількох інших модулів Klipper. <https://ko-fi.com/arksine>

source: Related Klipper Projects
uk: Пов'язані Klipper проекти

source: Klipper is frequently used with other Free Software. Consider using or supporting these projects.
uk: Klipper часто використовується з іншими безкоштовним програмним забезпеченням. Розглянуто використання або супровід цих проектів.

source: Kevin is the original author and current maintainer of Klipper. Donate at: <https://ko-fi.com/koconnor> or <https://www.patreon.com/koconnor>
uk: Кевін є оригінальним автором і поточним прихильником Кліппера. Довідник: <https://ko-fi.com/koconnor> або <https://www.patreon.com/koconnor>
