Repository: KevinOConnor/klipper-translations
Catalog: locales/*/LC_MESSAGES/Using_PWM_Tools.po
Languages: ta

source: This document describes how to setup a PWM-controlled laser or spindle using `output_pin` and some macros.
ta: `வெளியீடு_பின்` மற்றும் சில மேக்ரோக்களைப் பயன்படுத்தி PWM- கட்டுப்படுத்தப்பட்ட லேசர் அல்லது சுழல் எவ்வாறு அமைப்பது என்பதை இந்த ஆவணம் விவரிக்கிறது.

source: With re-purposing the printhead's fan pwm output, you can control lasers or spindles. This is useful if you use switchable print heads, for example the E3D toolchanger or a DIY solution. Usually, cam-tools such as LaserWeb can be configured to use `M3-M5` commands, which stand for *spindle speed CW* (`M3 S[0-255]`), *spindle speed CCW* (`M4 S[0-255]`) and *spindle stop* (`M5`).
ta: அச்சுப்பொறியின் விசிறி பி.டபிள்யூ.எம் வெளியீட்டை மீண்டும் செலுத்துவதன் மூலம், நீங்கள் லேசர்கள் அல்லது சுழல்களைக் கட்டுப்படுத்தலாம். நீங்கள் மாறக்கூடிய அச்சு தலைகளைப் பயன்படுத்தினால் இது பயனுள்ளதாக இருக்கும், எடுத்துக்காட்டாக E3D கருவித்தொகுப்பு அல்லது DIY தீர்வு. வழக்கமாக, லேசர்வெப் போன்ற கேம்-கருவிகளை `M3-M5` கட்டளைகளைப் பயன்படுத்த கட்டமைக்க முடியும், அவை * சுழல் விரைவு CW * (` M3 S [0-255] `), * சுழல் விரைவு CCW * (` M4 கள் [ 0-255] `) மற்றும் * சுழல் நிறுத்தம் * (` M5`).

source: **Warning:** When driving a laser, keep all security precautions that you can think of! Diode lasers are usually inverted. This means, that when the MCU restarts, the laser will be *fully on* for the time it takes the MCU to start up again. For good measure, it is recommended to *always* wear appropriate laser-goggles of the right wavelength if the laser is powered; and to disconnect the laser when it is not needed. Also, you should configure a safety timeout, so that when your host or MCU encounters an error, the tool will stop.
ta: ** எச்சரிக்கை: ** லேசரை ஓட்டும்போது, நீங்கள் நினைக்கும் அனைத்து பாதுகாப்பு முன்னெச்சரிக்கை நடவடிக்கைகளையும் வைத்திருங்கள்! டையோடு ஒளிக்கதிர்கள் பொதுவாக தலைகீழாக இருக்கும். இதன் பொருள், எம்.சி.யு மறுதொடக்கம் செய்யும்போது, எம்.சி.யு மீண்டும் தொடங்குவதற்கு லேசர் * முழுமையாக இருக்கும் *. நல்ல அளவிற்கு, லேசர் இயக்கப்பட்டால் சரியான அலைநீளத்தின் பொருத்தமான லேசர்-கண்ணாடிகளை அணிய * எப்போதும் * பரிந்துரைக்கப்படுகிறது; லேசர் தேவையில்லாதபோது அதைத் துண்டிக்க. மேலும், நீங்கள் ஒரு பாதுகாப்பு நேரத்தை கட்டமைக்க வேண்டும், இதனால் உங்கள் புரவலன் அல்லது எம்.சி.யு ஒரு பிழையை எதிர்கொள்ளும்போது, கருவி நின்றுவிடும்.

source: Current Limitations
ta: தற்போதைய வரம்புகள்

source: There is a limitation of how frequent PWM updates may occur. While being very precise, a PWM update may only occur every 0.1 seconds, rendering it almost useless for raster engraving. However, there exists an [experimental branch](https://github.com/Cirromulus/klipper/tree/laser_tool) with its own tradeoffs. In long term, it is planned to add this functionality to main-line klipper.
ta: PWM புதுப்பிப்புகள் எவ்வளவு அடிக்கடி நிகழக்கூடும் என்பதற்கான வரம்பு உள்ளது. மிகவும் துல்லியமாக இருக்கும்போது, ஒரு PWM புதுப்பிப்பு ஒவ்வொரு 0.1 விநாடிகளிலும் மட்டுமே ஏற்படக்கூடும், இது ராச்டர் வேலைப்பாட்டிற்கு கிட்டத்தட்ட பயனற்றதாக இருக்கும். இருப்பினும், ஒரு [பரிசோதனை கிளை] (https://github.com/cirromusulus/klipper/tree/laser_tool) அதன் சொந்த பரிமாற்றங்களுடன் உள்ளது. நீண்ட காலத்திற்கு, இந்த செயல்பாட்டை முதன்மையான வரி கிளிப்பரில் சேர்க்க திட்டமிடப்பட்டுள்ளது.

source: Commands
ta: கட்டளைகள்

source: `M3/M4 S<value>` : Set PWM duty-cycle. Values between 0 and 255. `M5` : Stop PWM output to shutdown value.
ta: `M3/M4 S <மதிப்பு>`: PWM கடமை-சுழற்சியை அமைக்கவும். 0 மற்றும் 255 க்கு இடையிலான மதிப்புகள். `M5`: பணிநிறுத்தம் மதிப்புக்கு PWM வெளியீட்டை நிறுத்துங்கள்.

source: Laserweb Configuration
ta: லேசர்வெப் உள்ளமைவு

source: If you use Laserweb, a working configuration would be:
ta: நீங்கள் லேசர்வெப்பைப் பயன்படுத்தினால், வேலை செய்யும் உள்ளமைவு:

source: Using PWM tools
ta: PWM கருவிகளைப் பயன்படுத்துதல்

source: For an example configuration, see [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
ta: எடுத்துக்காட்டு உள்ளமைவுக்கு, [CONFIG/மாதிரி-PWM-TOOL.CFG] (/CONFIG/மாதிரி-PWM-TOOL.CFG) ஐப் பார்க்கவும்.
