Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/API_Server.po
Languages: ta, uk

source: This endpoint allows one to query and then subscribe to information from printer objects. The endpoint request and response is identical to the "objects/query" endpoint. For example: `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state"]}, "response_template":{}}}` might return: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` and result in subsequent asynchronous messages such as: `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`
ta: இந்த இறுதிப்புள்ளி ஒன்றை வினவவும் பின்னர் அச்சுப்பொறி பொருள்களிலிருந்து தகவல்களுக்கு குழுசேரவும் அனுமதிக்கிறது. இறுதிப்புள்ளி கோரிக்கை மற்றும் பதில் "பொருள்கள்/வினவல்" இறுதிப்புள்ளிக்கு ஒத்ததாகும். எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" பொருள்கள்/குழுசேர் "," அளவுருக்கள் ": {" பொருள்கள் ": {" கருவி ": [" நிலை "]," வெப்ஊக்ச் ": [" நிலை "] . {"நிலை": [0.0, 0.0, 0.0, 0.0]}}, "நிகழ்வு நேரம்": 3052153.382083195} `மற்றும் அதன் விளைவாக அடுத்தடுத்த ஒத்திசைவற்ற செய்திகள்:` {"அளவு": {"நிலை": {"வெப்ஊக்குகள்" {"மாநிலம்": "பணிநிறுத்தம்"}}, "நிகழ்வு நேரம்": 3052165.418815847}} `
uk: Ця кінцева точка дозволяє переробити, а потім підписатися на інформацію з об'єктів принтера. Запит кінцевої точки та відповідь ідентична кінцевій точці "об'єктів / стежки". Наприклад: `{52"id": 123, "метод": "об'єкти/писати", "парам": {"об'єкти":{"toolhead": ["Положення"], "webhooks": ["держава"]}, "відповіді_template":{{` може повернутися: `{"id": 123, "регулятор": {"status": {"webhooks": {"state": "повідомлення"}, "toolhead": {"позиція": [0.0, 0.0, 0.0, 0.0]}}, "події: 3052153.382083195[165]

source: gcode/help
ta: gcode/உதவி

source: This endpoint allows one to query available G-Code commands that have a help string defined. For example: `{"id": 123, "method": "gcode/help"}` might return: `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restore a previously saved G-Code state", "PID_CALIBRATE": "Run PID calibration test", "QUERY_ADC": "Report the last value of an analog pin", ...}}`
ta: உதவி சரம் வரையறுக்கப்பட்ட கிடைக்கக்கூடிய சி-கோட் கட்டளைகளை வினவுவதற்கு இந்த இறுதிப்புள்ளி ஒன்றை அனுமதிக்கிறது. எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" gcode/help "}` திரும்பலாம்: `{" ஐடி ": 123," முடிவு ": {" restore_gcode_state ":" முன்பு சேமித்த சி-குறியீட்டை மீட்டெடுக்கவும் state "," PID_Calibrate ":" PID அளவுத்திருத்த சோதனை இயக்கவும் "," Query_adc ":" ஒரு அனலாக் முள் கடைசி மதிப்பைப் புகாரளிக்கவும் ", ...}}`
uk: Ця кінцева точка дозволяє одному запиту доступні команди G-Code, які мають рядок, визначений. Наприклад: `{"id": 123, "метод": "gcode/help"}` може повернутися: `{"id": 123, "реулт": {"RESTORE_GCODE_STATE": "Відновити раніше збережений стан G-Code", "PID_CALIBRATE": "Вихід калібрування PID", "QUERY_ADC": "Репортувати останнє значення аналогового штифта", ..._`

source: gcode/script
ta: gcode/ச்கிரிப்ட்

source: This endpoint allows one to run a series of G-Code commands. For example: `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`
ta: இந்த இறுதிப்புள்ளி ஒரு தொடர் சி-கோட் கட்டளைகளை இயக்க அனுமதிக்கிறது. எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" gcode/script "," params ": {" ச்கிரிப்ட் ":" G90 "}}`
uk: Цей кінцевий пункт дозволяє запустити серію команд G-Code. Наприклад: `{"id": 123, "метод": "кодування/script", "парми": {"script": "G90"}}`

source: If the provided G-Code script raises an error, then an error response is generated. However, if the G-Code command produces terminal output, that terminal output is not provided in the response. (Use the "gcode/subscribe_output" endpoint to obtain G-Code terminal output.)
ta: வழங்கப்பட்ட சி-குறியீடு ச்கிரிப்ட் ஒரு பிழையை எழுப்பினால், பிழை பதில் உருவாக்கப்படுகிறது. இருப்பினும், சி-கோட் கட்டளை முனைய வெளியீட்டை உருவாக்கினால், அந்த முனைய வெளியீடு பதிலில் வழங்கப்படவில்லை. (சி-குறியீடு முனைய வெளியீட்டைப் பெற "GCODE/CHARBCIBRE_OUTPUT" இறுதிப்புள்ளியைப் பயன்படுத்தவும்.)
uk: Якщо надана скрипт G-Code підвищує помилку, то створюється відповідь про помилку. Тим не менш, якщо команда G-Code виробляє вихід терміналу, що вихід терміналу не надається у відповідь. (Використовувати кінцеву точку кінцевого пункту "gcode/subscribe_виходу" G-Code.)

source: If there is a G-Code command being processed when this request is received, then the provided script will be queued. This delay could be significant (eg, if a G-Code wait for temperature command is running). The JSON response message is sent when the processing of the script fully completes.
ta: இந்த கோரிக்கை பெறப்படும்போது சி-கோட் கட்டளை செயலாக்கப்பட்டால், வழங்கப்பட்ட ச்கிரிப்ட் வரிசையில் நிற்கப்படும். இந்த நேரந்தவறுகை குறிப்பிடத்தக்கதாக இருக்கலாம் (எ.கா., வெப்பநிலை கட்டளை இயங்கும் ஒரு சி-குறியீடு காத்திருந்தால்). ச்கிரிப்டின் செயலாக்கம் முழுமையாக முடிந்ததும் சாதொபொகு மறுமொழி செய்தி அனுப்பப்படுகிறது.
uk: Якщо є команда G-Code, яка обробляється при отриманні цього запиту, то надана сцена буде черги. Ця затримка може бути значним (наприклад, якщо працює G-Code). Повідомлення про відповідь JSON направляється при обробці сценарію повністю завершено.

source: gcode/restart
ta: gcode/மறுதொடக்கம்

source: This endpoint allows one to request a restart - it is similar to running the G-Code "RESTART" command. For example: `{"id": 123, "method": "gcode/restart"}`
ta: இந்த இறுதிப்புள்ளி மறுதொடக்கம் கோர ஒன்றை அனுமதிக்கிறது - இது ஐயா -குறியீடு "மறுதொடக்கம்" கட்டளையை இயக்குவதற்கு ஒத்ததாகும். எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" gcode/மறுதொடக்கம் "}`
uk: Ця кінцева точка дозволяє запитувати решту - вона схожа на запуск команди G-Code "RESTART". Наприклад: `{"id": 123, "метод": "gcode/restart"}`

source: As with the "gcode/script" endpoint, this endpoint only completes after any pending G-Code commands complete.
ta: "GCode/Script" இறுதிப்புள்ளியைப் போலவே, நிலுவையில் உள்ள எந்த சி-குறியீட்டு கட்டளைகளும் முடிந்த பின்னரே இந்த இறுதிப் புள்ளி நிறைவடையும்.
uk: Як з кінцевою точкою "gcode/script" цей кінцевий пункт завершується тільки після завершення будь-яких команд G-Code.

source: This is similar to the "gcode/restart" endpoint - it implements the G-Code "FIRMWARE_RESTART" command. For example: `{"id": 123, "method": "gcode/firmware_restart"}`
ta: இது "GCODE/RESTART" இறுதிப்புள்ளிக்கு ஒத்ததாகும் - இது g -code "firmware_restart" கட்டளையை செயல்படுத்துகிறது. எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" gcode/firmware_restart "}`
uk: Це схоже на кінцеву точку "gcode/restart" - він реалізує команду G-Code "FIRMWARE_RESTART". Наприклад: `{"id": 123, "метод": "gcode/firmware_restart"}`

source: gcode/subscribe_output
ta: gcode/margricus_output

source: This endpoint is used to subscribe to G-Code terminal messages that are generated by Klipper. For example: `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` might later produce asynchronous messages such as: `{"params": {"response": "// Klipper state: Shutdown"}}`
ta: கிளிப்பரால் உருவாக்கப்படும் சி-கோட் முனைய செய்திகளுக்கு குழுசேர இந்த இறுதிப்புள்ளி பயன்படுத்தப்படுகிறது. எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" gcode/carbrickrice_output "," அளவுருக்கள் ": {" மறுமொழி_டெம்ப்ளேட் ": {}}}` பின்னர் ஒத்திசைவற்ற செய்திகளை உருவாக்கக்கூடும்: `{" அளவுரு ": { "பதில்": "// கிளிப்பர் நிலை: பணிநிறுத்தம்"}} `
uk: Цей кінцевий пункт використовується для підписки на G-Code термінал повідомлень, які генеруються Klipper. Наприклад: `{"id": 123, "метод": "gcode/subscribe_вихід", "params": {"response_template":{` може бути пізніше виготовляти асинхронні повідомлення, такі як: `{"params": {"response": "//Klipper State: Shutdown"}}`

source: This endpoint is intended to support human interaction via a "terminal window" interface. Parsing content from the G-Code terminal output is discouraged. Use the "objects/subscribe" endpoint to obtain updates on Klipper's state.
ta: இந்த இறுதிப்புள்ளி "முனைய சாளரம்" இடைமுகம் வழியாக மனித தொடர்புகளை ஆதரிக்கும் நோக்கம் கொண்டது. சி-கோட் முனைய வெளியீட்டிலிருந்து உள்ளடக்கத்தை பாகுபடுத்துகிறது. கிளிப்பரின் நிலையில் புதுப்பிப்புகளைப் பெற "பொருள்கள்/குழுசேர்" இறுதிப் புள்ளியைப் பயன்படுத்தவும்.
uk: Ця кінцева точка призначена для підтримки взаємодії людини за допомогою інтерфейсу «термінального вікна». Утилізація вмісту в терміналі G-Code Використовуйте кінцеву точку "objects/subscribe" для отримання оновлень на державі Кліппера.

source: pause_resume/cancel
ta: pause_resume/ரத்துசெய்
uk: пауза_resume/cancel

source: This endpoint is similar to running the "PRINT_CANCEL" G-Code command. For example: `{"id": 123, "method": "pause_resume/cancel"}`
ta: இந்த இறுதிப்புள்ளி "print_cancel" சி-குறியீட்டு கட்டளையை இயக்குவதற்கு ஒத்ததாகும். எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" pause_resume/rancel "}`
uk: Ця кінцева точка схожа на запуск "PRINT_CANCEL" G-Code команди. Наприклад: `{"id": 123, "метод": "pause_resume/cancel"}`

source: pause_resume/pause
ta: BREAK_RESUME/BREAK
uk: pause_resume / пауза

source: This endpoint is similar to running the "PAUSE" G-Code command. For example: `{"id": 123, "method": "pause_resume/pause"}`
ta: இந்த இறுதிப்புள்ளி "இடைநிறுத்தம்" சி-குறியீட்டு கட்டளையை இயக்குவதற்கு ஒத்ததாகும். எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" pause_resume/pause "}`
uk: Ця кінцева точка схожа на запуск команди G-Code. Наприклад: `{"id": 123, "метод": "pause_resume/pause"}`

source: This endpoint is similar to running the "RESUME" G-Code command. For example: `{"id": 123, "method": "pause_resume/resume"}`
ta: இந்த இறுதிப்புள்ளி "மறுதொடக்கம்" சி-கோட் கட்டளையை இயக்குவதற்கு ஒத்ததாகும். எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" pause_resume/resume "}`
uk: Цей кінцевий пункт схожий на запуск "RESUME" G-Code команди. Наприклад: `{"id": 123, "метод": "pause_resume/resume"}`

source: This endpoint will query the active endpoints and return their status. For example: `{"id": 123, "method": "query_endstops/status"}` might return: `{"id": 123, "result": {"y": "open", "x": "open", "z": "TRIGGERED"}}`
ta: இந்த இறுதிப்புள்ளி செயலில் உள்ள இறுதிப் புள்ளிகளை வினவி அவற்றின் நிலையைத் தரும். எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" Query_endstops/status "}` திரும்பலாம்: `{" ஐடி ": 123," முடிவு ": {" ஒய் ":" திறந்திருக்கும் "," ஃச் ": "திறந்த", "z": "தூண்டப்பட்டது"}} `
uk: Цей кінцевий пункт буде запитувати активні кінцеві точки та повернути їх статус. Наприклад: `{"id": 123, "метод": "query_endstops/status"}` може повернутися: `{"id": 123, "result": {"y": "відкрито", "x": "відкрито", "z": "TRIGGERED"}}`

source: ~/klippy-env/bin/python ~/klipper/klippy/klippy.py ~/printer.cfg -a /tmp/klippy_uds -l /tmp/klippy.log
ta: ~/Klippy -env/bin/python ~/klipper/klippy/klippy.py ~/printen.cfg -a/tmp/klippy_uds -l /tmp/klippy.log

source: [gcode_macro PANELDUE_BEEP] gcode: {action_call_remote_method("paneldue_beep", frequency=300, duration=1.0)}
ta: [gcode_macro paneltue_beep] gcode: {action_call_remote_method ("paneltue_beep", அதிர்வெண் = 300, காலம் = 1.0)}

source: API server
ta: பநிஇ சேவையகம்
uk: Сервер API

source: motion_report/dump_stepper
ta: Motion_Report/diff_stepper

source: This endpoint is used to subscribe to Klipper's internal stepper queue_step command stream for a stepper. Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
ta: ஒரு ச்டெப்பருக்கான கிளிப்பரின் உள் ச்டெப்பர் வரிசை_ச்டெப் கட்டளை ச்ட்ரீமுக்கு குழுசேர இந்த இறுதிப்புள்ளி பயன்படுத்தப்படுகிறது. இந்த குறைந்த-நிலை இயக்க புதுப்பிப்புகளைப் பெறுவது கண்டறியும் மற்றும் பிழைத்திருத்த நோக்கங்களுக்கு பயனுள்ளதாக இருக்கும். இந்த இறுதிப்புள்ளியைப் பயன்படுத்துவது கிளிப்பரின் கணினி சுமையை அதிகரிக்கக்கூடும்.
uk: Ця кінцева точка використовується для підписки на внутрішню чергу командного рядка Klipper. Зберігаючи ці оновлення руху низького рівня можуть бути корисними для діагностичних і знеболюючих цілей. Використання цього кінцевого пункту може збільшити навантаження системи Klipper.

source: A request may look like: `{"id": 123, "method":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {}}}` and might return: `{"id": 123, "result": {"header": ["interval", "count", "add"]}}` and might later produce asynchronous messages such as: `{"params": {"first_clock": 179601081, "first_time": 8.98, "first_position": 0, "last_clock": 219686097, "last_time": 10.984, "data": [[179601081, 1, 0], [29573, 2, -8685], [16230, 4, -1525], [10559, 6, -160], [10000, 976, 0], [10000, 1000, 0], [10000, 1000, 0], [10000, 1000, 0], [9855, 5, 187], [11632, 4, 1534], [20756, 2, 9442]]}}`
ta: ஒரு கோரிக்கை போல் இருக்கலாம்: `{" ஐடி ": 123," முறை ":" மோசன்_ரிபோர்ட்/டம்ப்_ச்டெப்பர் "," சுமை ": {" பெயர் ":" ச்டெபர்_எக்ச் "," மறுமொழி_டெம்ப்ளேட் ": {}}}` மற்றும் திரும்பலாம்: `{" ஐடி ": 123," முடிவு ": {" தலைப்பு ": [" இடைவெளி "," எண்ணிக்கை "," சேர் "]}}` மற்றும் பின்னர் ஒத்திசைவற்ற செய்திகளை உருவாக்கலாம்: `{" அளவுரு ": {" FIRST_CLOCK ": 179601081," முதல்_ நேரம் ": 8.98," முதல்_போசிசன் ": 0," லாச்ட்_ கிளாக் ": 219686097," லாச்ட்_ டைம் ": 10.984," தரவு ": [[179601081, 1, 0], [29573, 2, --8685] . .
uk: Запит може виглядати як: `{"id": 123, "метод":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {contact` і може повернутися: `{"id": 123, "result": {"9442"", "count", "add"]` і може пізніше випускати асинхронні повідомлення, такі як: `{"params": {"first_clock": 179601081 "first_978"first_97_88_88_88_88_88_88_88_88"

source: The "header" field in the initial query response is used to describe the fields found in later "data" responses.
ta: ஆரம்ப வினவல் பதிலில் "தலைப்பு" புலம் பிற்கால "தரவு" பதில்களில் காணப்படும் புலங்களை விவரிக்கப் பயன்படுகிறது.
uk: Поле "голова" в початковій відповіді запиту використовується для опису полів, знайдених в більш пізній "data".

source: motion_report/dump_trapq
ta: motion_report/dif_trapq
uk: javascript licenses api веб-сайт

source: This endpoint is used to subscribe to Klipper's internal "trapezoid motion queue". Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
ta: கிளிப்பரின் உள் "ட்ரெப்சாய்டு மோசன் வரிசையில்" குழுசேர இந்த இறுதிப்புள்ளி பயன்படுத்தப்படுகிறது. இந்த குறைந்த-நிலை இயக்க புதுப்பிப்புகளைப் பெறுவது கண்டறியும் மற்றும் பிழைத்திருத்த நோக்கங்களுக்கு பயனுள்ளதாக இருக்கும். இந்த இறுதிப்புள்ளியைப் பயன்படுத்துவது கிளிப்பரின் கணினி சுமையை அதிகரிக்கக்கூடும்.
uk: Ця кінцева точка використовується для підписки на внутрішню «трапецієподібну чергу руху». Зберігаючи ці оновлення руху низького рівня можуть бути корисними для діагностичних і знеболюючих цілей. Використання цього кінцевого пункту може збільшити навантаження системи Klipper.

source: A request may look like: `{"id": 123, "method": "motion_report/dump_trapq", "params": {"name": "toolhead", "response_template":{}}}` and might return: `{"id": 1, "result": {"header": ["time", "duration", "start_velocity", "acceleration", "start_position", "direction"]}}` and might later produce asynchronous messages such as: `{"params": {"data": [[4.05, 1.0, 0.0, 0.0, [300.0, 0.0, 0.0], [0.0, 0.0, 0.0]], [5.054, 0.001, 0.0, 3000.0, [300.0, 0.0, 0.0], [-1.0, 0.0, 0.0]]]}}`
ta: ஒரு கோரிக்கை போல் இருக்கலாம்: `{" ஐடி ": 123," முறை ":" மோசன்_ரிபோர்ட்/டம்ப்_பிராப் "," அளவுருக்கள் ": {" பெயர் ":" டூல்எட் "," மறுமொழி_டெம்ப்ளேட் ": {}}}` மற்றும் திரும்பலாம்: `{" ஐடி ": 1," முடிவு ": {" தலைப்பு ":. போன்ற செய்திகள்: {"அளவுரு": {"தரவு": [[4.05, 1.0, 0.0, 0.0, [300.0, 0.0, 0.0], [0.0, 0.0, 0.0], [5.054, 0.001, 0.0, 3000.0 , [300.0, 0.0, 0.0], [-1.0, 0.0, 0.0]]]]
uk: Запит може виглядати як: `{"id": 123, "метод": "motion_report/dump_trapq", "params": {"name": "toolhead", "response_template":{ 0.04` і може повернутися: `{"id": 1, "result": {"header": ["time", "тривалість", "start_velocity", " 0.030" 0.03" 0.030"

source: adxl345/dump_adxl345
ta: adxl345/dif_adxl345

source: This endpoint is used to subscribe to ADXL345 accelerometer data. Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
ta: ADXL345 முடுக்கமானி தரவுக்கு குழுசேர இந்த இறுதிப்புள்ளி பயன்படுத்தப்படுகிறது. இந்த குறைந்த-நிலை இயக்க புதுப்பிப்புகளைப் பெறுவது கண்டறியும் மற்றும் பிழைத்திருத்த நோக்கங்களுக்கு பயனுள்ளதாக இருக்கும். இந்த இறுதிப்புள்ளியைப் பயன்படுத்துவது கிளிப்பரின் கணினி சுமையை அதிகரிக்கக்கூடும்.
uk: Ця кінцева точка використовується для підписки на дані акселерометра ADXL345. Зберігаючи ці оновлення руху низького рівня можуть бути корисними для діагностичних і знеболюючих цілей. Використання цього кінцевого пункту може збільшити навантаження системи Klipper.

source: A request may look like: `{"id": 123, "method":"adxl345/dump_adxl345", "params": {"sensor": "adxl345", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","x_acceleration","y_acceleration", "z_acceleration"]}}` and might later produce asynchronous messages such as: `{"params":{"overflows":0,"data":[[3292.432935,-535.44309,-1529.8374,9561.4], [3292.433256,-382.45935,-1606.32927,9561.48375]]}}`
ta: ஒரு கோரிக்கை போல் இருக்கலாம்: `{" ஐடி ": 123," முறை ":" adxl345/dump_adxl345 "," அளவுரு ": {" சென்சார் ":" adxl345 "," மறுமொழி_டெம்ப்ளேட் ": {}}}` மற்றும் திரும்பலாம்: `{" ஐடி ": 123," முடிவு ": {" தலைப்பு ":. "
uk: Запит може виглядати як: `{"id": 123, "метод":"adxl345/dump_adxl345", "params": {"sensor": "adxl345", "response_template": ` і може повернутися: `{"id": 123,"result":{"header":["time","x_acceleration", "_acceleration", "z_acceleration"]}}` і може пізніше випускати асинхронні повідомлення, такі як: `{"params":{"overflows":0,"data": [[3292.432935,-535.44309,-1529.8374,9561.4], [3292.433256,-382.45935,-1606.32927,95.484]

source: angle/dump_angle
ta: கோணம்/டம்ப்_காங்

source: This endpoint is used to subscribe to [angle sensor data](Config_Reference.md#angle). Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
ta: [கோண சென்சார் தரவு] (config_reference.md#கோணம்) க்கு குழுசேர இந்த இறுதிப்புள்ளி பயன்படுத்தப்படுகிறது. இந்த குறைந்த-நிலை இயக்க புதுப்பிப்புகளைப் பெறுவது கண்டறியும் மற்றும் பிழைத்திருத்த நோக்கங்களுக்கு பயனுள்ளதாக இருக்கும். இந்த இறுதிப்புள்ளியைப் பயன்படுத்துவது கிளிப்பரின் கணினி சுமையை அதிகரிக்கக்கூடும்.
uk: Ця кінцева точка використовується для підписки на дані датчика [кутник](Config_Reference.md#angle). Зберігаючи ці оновлення руху низького рівня можуть бути корисними для діагностичних і знеболюючих цілей. Використання цього кінцевого пункту може збільшити навантаження системи Klipper.

source: A request may look like: `{"id": 123, "method":"angle/dump_angle", "params": {"sensor": "my_angle_sensor", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","angle"]}}` and might later produce asynchronous messages such as: `{"params":{"position_offset":3.151562,"errors":0, "data":[[1290.951905,-5063],[1290.952321,-5065]]}}`
ta: ஒரு கோரிக்கை போல் இருக்கலாம்: `{" ஐடி ": 123," முறை ":" ஆங்கிள்/டம்ப்_கான் "," அளவுரு ": {" சென்சார் ":" my_angle_sensor "," மறுமொழி_டெம்ப்ளேட் ": {}}}` மற்றும் திரும்பலாம்: `{" ஐடி ": 123," முடிவு ": {" தலைப்பு ": [" நேரம் "," கோணம் "]}}` மற்றும் பின்னர் ஒத்திசைவற்ற செய்திகளை உருவாக்கக்கூடும்: `{" அளவுரு ": {" நிலை_ஆஃப்செட் ": 3.151562 ,"errors":0, "data":[[1290.951905,-5063],[1290.952321,-5065]]}}`
uk: Запит може виглядати як: `{"id": 123, "метод":"кутник/dump_кутник", "params": "my_angle_sensor", "response_template": {contact` і може повернутися: `{"id": 123,"result":{"header":["time","angle"]}}` і може пізніше випускати асинхронні повідомлення, такі як: `{"params":{"tion_offset":3.1512,"errors:012[12]

source: See the [Moonraker](https://github.com/Arksine/moonraker) project for a popular tool that can forward HTTP requests to Klipper's API Server Unix Domain Socket.
ta: கிளிப்பரின் பநிஇ சர்வர் யுனிக்ச் டொமைன் சாக்கெட்டுக்கு HTTP கோரிக்கைகளை அனுப்பக்கூடிய பிரபலமான கருவிக்கான [மூன்ராகேக்கர்] (https://github.com/arksine/monraker) திட்டத்தைக் காண்க.
uk: Дивитися проект [Moonraker](https://github.com/Arksine/moonraker) для популярного інструменту, який може переадресувати HTTP-запити на API сервер Unix .

source: This endpoint is used to subscribe to raw HX711 and HX717 ADC data. Obtaining these low-level ADC updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
ta: இந்த இறுதிப்புள்ளி மூல HX711 மற்றும் HX717 ADC தரவுகளுக்கு குழுசேர பயன்படுத்தப்படுகிறது. இந்த குறைந்த அளவிலான ஏடிசி புதுப்பிப்புகளைப் பெறுவது கண்டறியும் மற்றும் பிழைத்திருத்த நோக்கங்களுக்கு பயனுள்ளதாக இருக்கும். இந்த இறுதிப்புள்ளியைப் பயன்படுத்துவது கிளிப்பரின் கணினி சுமையை அதிகரிக்கக்கூடும்.
uk: Ця кінцева точка використовується для підписки на сирі дані HX711 та HX717 ADC. Отримуючи ці оновлення низького рівня ADC можуть бути корисними для діагностичних і знеболюючих цілей. Використання цього кінцевого пункту може збільшити навантаження системи Klipper.

source: A request may look like: `{"id": 123, "method":"hx71x/dump_hx71x", "params": {"sensor": "load_cell", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","counts","value"]}}` and might later produce asynchronous messages such as: `{"params":{"data":[[3292.432935, 562534, 0.067059278], [3292.4394937, 5625322, 0.670590639]]}}`
ta: ஒரு கோரிக்கை போல் இருக்கலாம்: `{" ஐடி ": 123," முறை ":" HX71X/DUMP_HX71X "," அளவுருக்கள் ": {" சென்சார் ":" load_cell "," Response_Template ": {}}}` மற்றும் திரும்பலாம்: `{" ஐடி ": 123," முடிவு ": {" தலைப்பு ": [" நேரம் "," எண்ணிக்கைகள் "," மதிப்பு "]}}` மற்றும் பின்னர் ஒத்திசைவற்ற செய்திகளை உருவாக்கலாம்: `{" அளவுரு ": {" தரவு ": [[3292.432935, 562534, 0.067059278], [3292.4394937, 5625322, 0.670590639]]}}`
uk: Запит може виглядати як: `{"id": 123, "метод":"hx71x/dump_hx71x", "params": {"sensor": "load_cell", "response_template": ` і може повернутися: `{"id": 123,"result":{"header":["time", "counts","value"]}}` і може пізніше виробляти асинхронні повідомлення, такі як: `{"params":{"data":[3292.432935, 562534, 0.067059278], [3292.4394937, 5625322, 0.670590639]]}}`

source: ads1220/dump_ads1220
ta: ADS1220/DIMB_ADS1220

source: This endpoint is used to subscribe to raw ADS1220 ADC data. Obtaining these low-level ADC updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
ta: மூல ADS1220 ADC தரவுகளுக்கு குழுசேர இந்த இறுதிப்புள்ளி பயன்படுத்தப்படுகிறது. இந்த குறைந்த அளவிலான ஏடிசி புதுப்பிப்புகளைப் பெறுவது கண்டறியும் மற்றும் பிழைத்திருத்த நோக்கங்களுக்கு பயனுள்ளதாக இருக்கும். இந்த இறுதிப்புள்ளியைப் பயன்படுத்துவது கிளிப்பரின் கணினி சுமையை அதிகரிக்கக்கூடும்.
uk: Ця кінцева точка використовується для підписки на сирі дані ADS1220 ADC. Отримуючи ці оновлення низького рівня ADC можуть бути корисними для діагностичних і знеболюючих цілей. Використання цього кінцевого пункту може збільшити навантаження системи Klipper.
