Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/API_Server.po
Languages: ta, uk

source: A request may look like: `{"id": 123, "method":"ads1220/dump_ads1220", "params": {"sensor": "load_cell", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","counts","value"]}}` and might later produce asynchronous messages such as: `{"params":{"data":[[3292.432935, 562534, 0.067059278], [3292.4394937, 5625322, 0.670590639]]}}`
ta: ஒரு கோரிக்கை போல் இருக்கலாம்: `{" ஐடி ": 123," முறை ":" ADS1220/DUMP_ADS1220 "," அளவுருக்கள் ": {" சென்சார் ":" load_cell "," Response_Template ": {}}}` மற்றும் திரும்பலாம்: `{" ஐடி ": 123," முடிவு ": {" தலைப்பு ": [" நேரம் "," எண்ணிக்கைகள் "," மதிப்பு "]}}` மற்றும் பின்னர் ஒத்திசைவற்ற செய்திகளை உருவாக்கலாம்: `{" அளவுரு ": {" தரவு ": [[3292.432935, 562534, 0.067059278], [3292.4394937, 5625322, 0.670590639]]}}`
uk: Запит може виглядати як: `{"id": 123, "метод":"ads1220/dump_ads1220", "params": "load_cell", "response_template": ` і може повернутися: `{"id": 123,"result":{"header":["time", "counts","value"]}}` і може пізніше виробляти асинхронні повідомлення, такі як: `{"params":{"data":[3292.432935, 562534, 0.067059278], [3292.4394937, 5625322, 0.670590639]]}}`

source: Dumps the configuration and state for the current mesh and all saved profiles.
ta: தற்போதைய கண்ணி மற்றும் சேமிக்கப்பட்ட அனைத்து சுயவிவரங்களுக்கும் உள்ளமைவு மற்றும் நிலையை கொட்டுகிறது.
uk: Дамп конфігурації та стану для поточної сітки та всіх збережених профілів.

source: For example: `{"id": 123, "method": "bed_mesh/dump_mesh"}`
ta: எடுத்துக்காட்டாக: `{" ஐடி ": 123," முறை ":" bed_mesh/dump_mesh "}`
uk: Наприклад: `{"id": 123, "метод": "bed_mesh/dump_mesh"}`

source: might return:
ta: திரும்பலாம்:
uk: може повернутись:

source: { "current_mesh": { "name": "eddy-scan-test", "probed_matrix": [...], "mesh_matrix": [...], "mesh_params": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "algo": "bicubic", "tension": 0.5, "min_x": 20, "max_x": 330, "min_y": 30, "max_y": 320 } }, "profiles": { "default": { "points": [...], "mesh_params": { "min_x": 20, "max_x": 330, "min_y": 30, "max_y": 320, "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "algo": "bicubic", "tension": 0.5 } }, "eddy-scan-test": { "points": [...], "mesh_params": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "algo": "bicubic", "tension": 0.5, "min_x": 20, "max_x": 330, "min_y": 30, "max_y": 320 } }, "eddy-rapid-test": { "points": [...], "mesh_params": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "algo": "bicubic", "tension": 0.5, "min_x": 20, "max_x": 330, "min_y": 30, "max_y": 320 } } }, "calibration": { "points": [...], "config": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "algo": "bicubic", "tension": 0.5, "mesh_min": [ 20, 30 ], "mesh_max": [ 330, 320 ], "origin": null, "radius": null }, "probe_path": [...], "rapid_path": [...] }, "probe_offsets": [ 0, 25, 0.5 ], "axis_minimum": [ 0, 0, -5, 0 ], "axis_maximum": [ 351, 358, 330, 0 ] }
ta: { "நடப்பு_மேச்": { "பெயர்": "எடி-ச்கேன்-சோதனை", "ஆய்வு_மாட்ரிக்ச்": [...], "மெச்_மாட்ரிக்ச்": [...], "Mesh_params": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "அல்கோ": "பிக்யூபிக்", "பதற்றம்": 0.5, "min_x": 20, "max_x": 330, "min_y": 30, "MAX_Y": 320 } }, "சுயவிவரங்கள்": { "இயல்புநிலை": { "புள்ளிகள்": [...], "Mesh_params": { "min_x": 20, "max_x": 330, "min_y": 30, "MAX_Y": 320, "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "அல்கோ": "பிக்யூபிக்", "பதற்றம்": 0.5 } }, "எடி-ச்கேன்-சோதனை": { "புள்ளிகள்": [...], "Mesh_params": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "அல்கோ": "பிக்யூபிக்", "பதற்றம்": 0.5, "min_x": 20, "max_x": 330, "min_y": 30, "MAX_Y": 320 } }, "எடி-ராபிட்-சோதனை": { "புள்ளிகள்": [...], "Mesh_params": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "அல்கோ": "பிக்யூபிக்", "பதற்றம்": 0.5, "min_x": 20, "max_x": 330, "min_y": 30, "MAX_Y": 320 } } }, "அளவுத்திருத்தம்": { "புள்ளிகள்": [...], "கட்டமைப்பு": { "x_count": 9, "y_count": 9, "mesh_x_pps": 2, "mesh_y_pps": 2, "அல்கோ": "பிக்யூபிக்", "பதற்றம்": 0.5, "மெச்_மின்": [ 20, 30 ], "மெச்_மேக்ச்": [ 330, 320 ], "தோற்றம்": பூச்யம், "ஆரம்": சுழியம் }, "probe_path": [...], "ரேபிட்_பாத்": [...] }, "probe_offsets": [ 0, 25, 0.5 ], "ஆக்சிச்_மினிமம்": [ 0, 0, -5, 0 ], "ஆக்சிச்_மாக்சம்": [ 351, 358, 330, 0 ]] }

source: The `dump_mesh` endpoint takes one optional parameter, `mesh_args`. This parameter must be an object, where the keys and values are parameters available to [BED_MESH_CALIBRATE](#bed_mesh_calibrate). This will update the mesh configuration and probe points using the supplied parameters prior to returning the result. It is recommended to omit mesh parameters unless it is desired to visualize the probe points and/or travel path before performing `BED_MESH_CALIBRATE`.
ta: `டம்ப்_மேச்` எண்ட்பாயிண்ட் ஒரு விருப்ப அளவுருவை எடுக்கும்,` Mesh_args`. இந்த அளவுரு ஒரு பொருளாக இருக்க வேண்டும், அங்கு விசைகள் மற்றும் மதிப்புகள் [bed_mesh_calibrate] (#bed_mesh_calibrate) க்கு கிடைக்கும் அளவுருக்கள். இது முடிவைத் திருப்புவதற்கு முன் வழங்கப்பட்ட அளவுருக்களைப் பயன்படுத்தி கண்ணி உள்ளமைவு மற்றும் ஆய்வு புள்ளிகளைப் புதுப்பிக்கும். `BED_MESH_CALIBRATE` நிகழ்த்துவதற்கு முன் ஆய்வு புள்ளிகள் மற்றும்/அல்லது பயண பாதையை காட்சிப்படுத்த விரும்பினால் தவிர, கண்ணி அளவுருக்களைத் தவிர்க்க பரிந்துரைக்கப்படுகிறது.
uk: Кінцева точка `dump_mesh` приймає один необов’язковий параметр, `mesh_args`. Цей параметр має бути об’єктом, де ключі та значення є параметрами, доступними для [BED_MESH_CALIBRATE](#bed_mesh_calibrate). Це оновить конфігурацію сітки та точки зонду за допомогою наданих параметрів перед поверненням результату. Рекомендується опускати параметри сітки, якщо не потрібно візуалізувати точки зонда та/або траєкторію перед виконанням `BED_MESH_CALIBRATE`.
