Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Axis_Twist_Compensation.po
Languages: bg, hu, zh_hans

source: Axis Twist Compensation
bg: Компенсация на усукването на оста
hu: Tengely fordulat kompenzáció
zh_hans: 轴扭曲补偿

source: This document describes the [axis_twist_compensation] module.
bg: Този документ описва модула [axis_twist_compensation].
hu: Ez a dokumentum leírja az [axis_twist_compensation] modult.
zh_hans: 本文档介绍了[AXIS_TWIST_COMPOMENT]模块。

source: Some printers may have a small twist in their X rail which can skew the results of a probe attached to the X carriage. This is common in printers with designs like the Prusa MK3, Sovol SV06 etc and is further described under [probe location bias](Probe_Calibrate.md#location-bias-check). It may result in probe operations such as [Bed Mesh](Bed_Mesh.md), [Screws Tilt Adjust](G-Codes.md#screws_tilt_adjust), [Z Tilt Adjust](G-Codes.md#z_tilt_adjust) etc returning inaccurate representations of the bed.
bg: Някои принтери могат да имат малко усукване на релсата X, което може да изкриви резултатите от сондата, прикрепена към каретката X. Това е често срещано при принтери с дизайн като Prusa MK3, Sovol SV06 и т.н. и е описано по-подробно в раздела [probe location bias](Probe_Calibrate.md#location-bias-check). Това може да доведе до операции на сондата, като например [Bed Mesh](Bed_Mesh.md), [Screws Tilt Adjust](G-Codes.md#screws_tilt_adjust), [Z Tilt Adjust](G-Codes.md#z_tilt_adjust) и т.н., които връщат неточни изображения на леглото.
hu: Néhány nyomtatónak lehet egy kis csavarodása az X kocsiban, amely az X mozgásához csatolt szonda eredményeit elronthatja. Ez gyakori olyan nyomtatókban, mint a Prusa MK3, Sovol SV06 stb., és a [hely torzítás ellenőrzése](Probe_Calibrate.md#location-bias-check). Előfordulhat, hogy a problémás műveletek, például az [Ágy háló](Bed_Mesh.md), [Csavarok dőlésszög beállítása](G-Codes.md#screws_tilt_adjust), [Z dőlésszög beállítása](G-Codes.md#z_tilt_adjust) stb. visszatérő pontatlan méréseket eredményezhet.
zh_hans: 某些打印机的X导轨可能有一个小的扭曲，这可能会歪曲连接到X托架的探头的结果。这在具有Prusa MK3、SoVOL SV06等设计的打印机中很常见，并在[Probe Location bias](Probe_Calibrate.md#location-bias-check).]一节中进一步描述。这可能会导致探测操作，如[Bed Mesh](Bed_Mesh.md)、[螺旋倾斜调整](G-Codes.md#螺旋倾斜调整)、[Z倾斜调整](G-Codes.md#z_tilt_adjust)等返回不准确的床表示。

source: This module uses manual measurements by the user to correct the probe's results. Note that if your axis is significantly twisted it is strongly recommended to first use mechanical means to fix it prior to applying software corrections.
bg: Този модул използва ръчните измервания на потребителя за коригиране на резултатите от сондата. Обърнете внимание, че ако оста е значително усукана, силно се препоръчва първо да използвате механични средства, за да я фиксирате, преди да прилагате софтуерни корекции.
hu: Ez a modul kézi méréseket használ a felhasználó számára, hogy korrigálja a szonda eredményeit. Vedd figyelembe, hogy ha a tengely jelentősen csavart, akkor határozottan ajánlott először mechanikai eszközöket használni a szoftveres korrekciók alkalmazása előtt.
zh_hans: 该模块使用用户手动测量来修正探头的结果。请注意，如果您的轴严重扭曲，强烈建议您在应用软件更正之前首先使用机械方法修复它。

source: **Warning**: This module is not compatible with dockable probes yet and will try to probe the bed without attaching the probe if you use it.
bg: **Предупреждение**: Този модул все още не е съвместим с докинг сондите и ако го използвате, ще се опита да изследва леглото, без да е прикрепена сондата.
hu: **Figyelem**: Ez a modul még nem kompatibilis a dokkolható szondákkal, és a szonda csatlakoztatása nélkül próbáld meg megmérni az ágyat, mielőtt használod.
zh_hans: **警告**：此模块暂时与可对接探头不兼容，如果使用，将尝试在不连接探头的情况下探床。

source: Overview of compensation usage
bg: Преглед на използването на компенсациите
hu: A kompenzációs használat áttekintése
zh_hans: 薪酬使用概览

source: **Tip:** Make sure the [probe X and Y offsets](Config_Reference.md#probe) are correctly set as they greatly influence calibration.
bg: **Съвет:** Уверете се, че [отместванията на сондата X и Y](Config_Reference.md#probe) са правилно зададени, тъй като те оказват голямо влияние върху калибрирането.
hu: **Tip:** Győződj meg róla, hogy az [ X és Y eltolás](Config_Reference.md#probe) megfelelően van beállítva, mivel nagymértékben befolyásolják a kalibrálást.
zh_hans: **提示：**请确保正确设置[Probe X和Y Offset](Config_Reference.md#Probe)，因为它们对校准影响很大。

source: **Tip:** Bed temperature and nozzle temperature and size do not seem to have an influence to the calibration process.
bg: **Съвет:** Изглежда, че температурата на леглото и температурата и размерът на дюзата не оказват влияние върху процеса на калибриране.
hu: **Tipp:** Úgy tűnik, hogy az ágy hőmérséklete és a fúvóka hőmérséklete és mértéke nem befolyásolja a kalibrálási folyamatot.
zh_hans: **提示：**床温、喷嘴温度和尺寸似乎对校准过程没有影响。

source: [axis_twist_compensation] setup and commands
bg: [axis_twist_compensation] настройка и команди
hu: [axis_twist_compensation] beállítások és parancsok
zh_hans: [AXIS_TWIST_COMMENTION]设置和命令

source: Configuration options for [axis_twist_compensation] can be found in the [Configuration Reference](Config_Reference.md#axis_twist_compensation).
bg: Опциите за конфигуриране за [axis_twist_compensation] могат да бъдат намерени в [Configuration Reference](Config_Reference.md#axis_twist_compensation).
hu: Az [axis_twist_compensation] konfigurációs beállításai a [Konfigurációs referenciában](Config_Reference.md#axis_twist_compensation) találhatóak.
zh_hans: 可在[配置Reference](Config_Reference.md#axis_twist_compensation).]中找到[AXIS_TWIST_COMPOMENT]的配置选项。

source: Commands for [axis_twist_compensation] can be found in the [G-Codes Reference](G-Codes.md#axis_twist_compensation)
bg: Командите за [axis_twist_compensation] могат да бъдат намерени в [G-Codes Reference](G-Codes.md#axis_twist_compensation)
hu: Az [axis_twist_compensation] parancsok megtalálhatók a [G-Kódok referencia](G-Codes.md#axis_twist_compensation) című dokumentumban
zh_hans: 可在[G-Codes Reference](G-Codes.md#axis_twist_compensation)]中找到[AXIS_TWIST_COMPATION]的命令

source: Basic Usage: X-Axis Calibration
hu: Alapvető használat: X-Tengely kalibrálás

source: After setting up the `[axis_twist_compensation]` module, run:
hu: Az `[axis_twist_compensation]` modul beállítása után futtasd a következőt:

source: This command will calibrate the X-axis by default. - The calibration wizard will prompt you to measure the probe Z offset at several points along the bed. - By default, the calibration uses 3 points, but you can specify a different number with the option: `SAMPLE_COUNT=<value>`
hu: Ez a parancs alapértelmezés szerint az X-tengelyt kalibrálja. - A kalibrációs varázsló felszólít, hogy mérd meg a szonda Z eltolását az ágy mentén több ponton. - Alapértelmezés szerint a kalibrálás 3 pontot használ, de a `SAMPLE_COUNT=<value>` opcióval más számot is megadhatsz.

source: **Adjust Your Z Offset:** After completing the calibration, be sure to [adjust your Z offset] (Probe_Calibrate.md#calibrating-probe-z-offset).
hu: **Z-eltolás beállítása:** A kalibrálás befejezése után mindenképpen [állítsd be a Z-eltolást] (Probe_Calibrate.md#calibrating-probe-z-offset).

source: **Perform Bed Leveling Operations:** Use probe-based operations as needed, such as:
hu: **Perform Bed Leveling Operations:** Használj szonda alapú műveleteket, például:

source: [Screws Tilt Adjust](G-Codes.md#screws_tilt_adjust)
hu: [Csavarok dőlésszög beállítása](G-Codes.md#screws_tilt_adjust)

source: [Z Tilt Adjust](G-Codes.md#z_tilt_adjust)
hu: [Z dőlésszög beállítása](G-Codes.md#z_tilt_adjust)

source: **Finalize the Setup:**
hu: **A beállítás befejezése:**

source: Home all axes, and perform a [Bed Mesh](Bed_Mesh.md) if necessary.
hu: Küldj kezdő pozícióba minden tengelyt, és hajtsd végre az [Ágy háló](Bed_Mesh.md) parancsot, ha szükséges.

source: Run a test print, followed by any [fine-tuning](Axis_Twist_Compensation.md#fine-tuning) if needed.
hu: Futtass egy próbanyomtatást, majd szükség esetén [finomhangolást](Axis_Twist_Compensation.md#fine-tuning).

source: For Y-Axis Calibration
hu: Y-Tengely kalibrálása

source: The calibration process for the Y-axis is similar to the X-axis. To calibrate the Y-axis, use:
hu: Az Y-tengely kalibrálási folyamata hasonló az X-tengelyéhez. Az Y-tengely kalibrálásához használd a következőt:

source: This will guide you through the same measuring process as for the X-axis.
hu: Ez végigvezet Téged ugyanazon a mérési folyamaton, mint az X-tengely esetében.

source: Automatic Calibration for Both Axes
hu: Automatikus kalibrálás mindkét tengelyhez

source: To perform automatic calibration for both the X and Y axes without manual intervention, use:
hu: Az X és Y tengely automatikus kalibrálásához kézi beavatkozás nélkül használd a következőt:

source: In this mode, the calibration process will run for both axes automatically.
hu: Ebben az üzemmódban a kalibrációs folyamat mindkét tengelyre automatikusan lefut.

source: After setting up the [axis_twist_compensation] module, perform `AXIS_TWIST_COMPENSATION_CALIBRATE`
bg: След като настроите модула [axis_twist_compensation], изпълнете `AXIS_TWIST_COMPENSATION_CALIBRATE`.
zh_hans: 设置好[AXIS_TWIST_COMPOMENT]模块后，执行`AXIS_TWIST_COMCOMPATION_CALIBRATE`

source: The calibration wizard will prompt you to measure the probe Z offset at a few points along the bed
bg: Съветникът за калибриране ще ви подкани да измерите изместването на сондата Z в няколко точки по протежение на леглото.
zh_hans: 校准向导将提示您在床上的几个点上测量探头Z偏移量

source: The calibration defaults to 3 points but you can use the option `SAMPLE_COUNT=` to use a different number.
bg: По подразбиране калибрирането е с 3 точки, но можете да използвате опцията `SAMPLE_COUNT=`, за да използвате друг брой.
zh_hans: 该校准默认为3分，但您可以使用选项`SAMPLE_COUNT=`来使用不同的数字。

source: [Adjust your Z offset](Probe_Calibrate.md#calibrating-probe-z-offset)
bg: [Настройте изместването Z](Probe_Calibrate.md#calibrating-probe-z-offset)
zh_hans: [调整您的Z offset](Probe_Calibrate.md#calibrating-probe-z-offset)

source: Perform automatic/probe-based bed tramming operations, such as [Screws Tilt Adjust](G-Codes.md#screws_tilt_adjust), [Z Tilt Adjust](G-Codes.md#z_tilt_adjust) etc
bg: Извършване на автоматични/базирани на сонда операции за трамбоване на леглото, като например [Screws Tilt Adjust](G-Codes.md#screws_tilt_adjust), [Z Tilt Adjust](G-Codes.md#z_tilt_adjust) и др.
zh_hans: 执行自动/探针式床铺操作，如[螺旋倾斜调整](G-Codes.md#螺旋倾斜调整)、[Z倾斜调整](G-Codes.md#z_倾斜调整)等

source: Home all axis, then perform a [Bed Mesh](Bed_Mesh.md) if required
bg: Поставете всички оси в изходно положение, след което при необходимост направете [Bed Mesh](Bed_Mesh.md)
zh_hans: 原点所有轴，然后根据需要执行[Bed Mesh](Bed_Mesh.md)

source: Perform a test print, followed by any [fine-tuning](Axis_Twist_Compensation.md#fine-tuning) as desired
bg: Извършете тестово отпечатване, последвано от [фина настройка](Axis_Twist_Compensation.md#fine-tuning) по желание.
zh_hans: 执行测试打印，然后根据需要执行任何[fine-tuning](Axis_Twist_Compensation.md#fine-tuning)
