Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Beaglebone.po
Languages: ru, ta

source: Beaglebone
ru: Плата BeagleBone
ta: பீகல்போன்

source: This document describes the process of running Klipper on a Beaglebone PRU.
ru: В этом документе описывается процесс запуска Klipper на Beaglebone PRU.
ta: இந்த ஆவணம் ஒரு பீகல்போன் ப்ரூவில் கிளிப்பரை இயக்கும் செயல்முறையை விவரிக்கிறது.

source: Building an OS image
ru: Сборка образа ОС
ta: ஒரு OS படத்தை உருவாக்குதல்

source: git clone https://github.com/foosel/OctoPrint.git cd OctoPrint/ virtualenv venv ./venv/bin/python setup.py install
ta: git நகலி https://github.com/foosel/octoprint.git குறுவட்டு ஆக்டோபிரிண்ட்/ மெய்நிகர் ஈவ் ./venv/bin/python setup.py நிறுவல்

source: And setup OctoPrint to start at bootup:
ru: И настройте OctoPrint на запуск при загрузке:
ta: துவக்கத்தில் தொடங்க ஆக்டோபிரிண்ட் அமைக்கவும்:

source: sudo cp ~/OctoPrint/scripts/octoprint.init /etc/init.d/octoprint sudo chmod +x /etc/init.d/octoprint sudo cp ~/OctoPrint/scripts/octoprint.default /etc/default/octoprint sudo update-rc.d octoprint defaults
ta: sudo cp ~/ஆக்டோப்ரின்ட்/ச்கிரிப்ட்கள்/ஆக்டோபிரின்ட்.இனிட் /etc/init.d/octoprint sudo chmod +x /etc/init.d/octoprint sudo cp ~/ஆக்டோப்ரின்ட்/ச்கிரிப்டுகள்/ஆக்டோபிரின்ட் sudo Update-rc.d ஆக்டோப்ரின்ட் இயல்புநிலை

source: It is necessary to modify OctoPrint's **/etc/default/octoprint** configuration file. One must change the `OCTOPRINT_USER` user to `debian`, change `NICELEVEL` to `0`, uncomment the `BASEDIR`, `CONFIGFILE`, and `DAEMON` settings and change the references from `/home/pi/` to `/home/debian/`:
ru: Необходимо изменить файл конфигурации **/etc/default/octoprint** OctoPrint. Необходимо изменить пользователя OCTOPRINT_USER на debian, NICELEVEL на 0, раскомментировать настройки BASEDIR, CONFIGFILE и DAEMON и изменить ссылки с /home/pi/ на `/home/debian/`:
ta: ஆக்டோப்ரின்ட்டின் **/etc/இயல்புநிலை/ஆக்டோப்ரிண்ட் ** உள்ளமைவு கோப்பை மாற்ற வேண்டியது தேவை. ஒருவர் `ஆக்டோபிரின்ட்_சர்` பயனரை` டெபியன்` ஆக மாற்ற வேண்டும், `நைசெலெவலை` 0` ஆக மாற்ற வேண்டும், `அடிப்படையிலானவர்`,` உள்ளமைவு`, மற்றும் `டீமான்` அமைப்புகளை மாற்றவும்,`/home/pi/`என்பதிலிருந்து குறிப்புகளை மாற்றவும் `/வீடு/டெபியன்/`:

source: Then start the Octoprint service:
ru: Затем запустите сервис Octoprint:
ta: பின்னர் ஆக்டோபிரிண்ட் சேவையைத் தொடங்கவும்:

source: sudo systemctl start octoprint
ta: sudo systemctl தொடக்க ஆக்டோபிரிண்ட்

source: cd ~/klipper/ make menuconfig
ta: குறுவட்டு ~/கிளிப்பர்/ மெனுகான்ஃபிக் செய்யுங்கள்

source: sudo service klipper stop make flash sudo service klipper start
ta: சூடோ பணி வெட்டுக்கள் நிறுத்தம் ஃபிளாச் செய்யுங்கள் சூடோ பணி வெட்டுதல் தொடக்க

source: It is also necessary to compile and install the micro-controller code for a Linux host process. Configure it a second time for a "Linux process":
ru: Также необходимо скомпилировать и установить код микроконтроллера для хост-процесса Linux. Настройте его второй раз для «процесса Linux»:
ta: லினக்ச் புரவலன் செயல்முறைக்கு மைக்ரோ-கன்ட்ரோலர் குறியீட்டை தொகுத்து நிறுவுவதும் தேவை. "லினக்ச் செயல்முறை" க்கு இரண்டாவது முறையாக அதை உள்ளமைக்கவும்:

source: make menuconfig
ta: மெனுகான்ஃபிக் செய்யுங்கள்

source: Then install this micro-controller code as well:
ru: Затем установите также этот код микроконтроллера:
ta: பின்னர் இந்த மைக்ரோ-கண்ட்ரோலர் குறியீட்டை நிறுவவும்:

source: Remaining configuration
ru: Оставшаяся конфигурация
ta: மீதமுள்ள உள்ளமைவு

source: Printing on the Beaglebone
ru: Печать на Beaglebone
ta: பீகிள் பாயில் அச்சிடுதல்

source: Start by installing the [Debian 11.7 2023-09-02 4GB microSD IoT](https://beagleboard.org/latest-images) image. One may run the image from either a micro-SD card or from builtin eMMC. If using the eMMC, install it to eMMC now by following the instructions from the above link.
ru: Начните с установки образа [Debian 11.7 2023-09-02 4GB microSD IoT](https://beagleboard.org/latest-images). Образ можно запустить как с карты micro-SD, так и со встроенной eMMC. Если вы используете eMMC, установите его на eMMC, следуя инструкциям по ссылке выше.
ta: [டெபியன் 11.7 2023-09-02 4 சிபி மைக்ரோ எச்.டி ஐஓடி] (https://beagleboard.org/latest-images) படத்தை நிறுவுவதன் மூலம் தொடங்கவும். ஒருவர் மைக்ரோ-எச்.டி கார்டிலிருந்து அல்லது பில்டின் ஈ.எம்.எம்.சி யிலிருந்து படத்தை இயக்கலாம். EMMC ஐப் பயன்படுத்தினால், மேலே உள்ள இணைப்பிலிருந்து வழிமுறைகளைப் பின்பற்றி இப்போது EMMC இல் நிறுவவும்.

source: Then ssh into the Beaglebone machine (`ssh debian@beaglebone` -- password is `temppwd`).
ru: Затем зайдите по ssh на машину Beaglebone (`ssh debian@beaglebone` -- пароль `temppwd`).
ta: பின்னர் பீகல்போன் இயந்திரத்தில் பாஓடு (`SSH DEBIAN@BeagleBone` - கடவுச்சொல்` temppwd`).

source: Before start installing Klipper you need to free-up additional space. there are 3 options to do that:
ru: Перед началом установки Klipper необходимо освободить дополнительное пространство. Для этого есть 3 варианта:
ta: கிளிப்பரை நிறுவத் தொடங்குவதற்கு முன் நீங்கள் கூடுதல் இடத்தை விடுவிக்க வேண்டும். அதைச் செய்ய 3 விருப்பங்கள் உள்ளன:

source: remove some BeagleBone "Demo" resources
ru: удалить некоторые "демонстрационные" ресурсы BeagleBone
ta: சில பீகல்போன் "டெமோ" வளங்களை அகற்றவும்

source: if you did boot from SD-Card, and it's bigger than 4Gb - you can expand current filesystem to take whole card space
ru: Если вы загрузились с SD-карты, и ее объем превышает 4 Гб - вы можете расширить текущую файловую систему, чтобы она заняла все пространство карты
ta: நீங்கள் எச்டி -கார்டிலிருந்து துவக்கினால், அது 4 சிபியை விட பெரியது - முழு அட்டை இடத்தையும் எடுக்க தற்போதைய கோப்பு முறைமையை விரிவாக்கலாம்

source: do option #1 and #2 together.
ru: выполните варианты №1 и №2 вместе.
ta: விருப்பம் #1 மற்றும் #2 ஐ ஒன்றாகச் செய்யுங்கள்.

source: To remove some BeagleBone "Demo" resources execute these commands
ru: Чтобы удалить некоторые ресурсы BeagleBone "Демо", выполните следующие команды
ta: சில பீகல்போன் "டெமோ" வளங்களை அகற்ற இந்த கட்டளைகளை இயக்கவும்

source: sudo apt remove bb-node-red-installer sudo apt remove bb-code-server
ta: sudo apt bb-node-red-நிறுவலை அகற்று sudo apt பிபி-கோட்-சேவையகத்தை அகற்று

source: To expand filesystem to full size of your SD-Card execute this command, reboot is not required.
ru: Чтобы расширить файловую систему до полного размера SD-карты, выполните эту команду, перезагрузка не требуется.
ta: உங்கள் எச்டி-கார்டின் முழு அளவிற்கு கோப்பு முறைமையை விரிவாக்க இந்த கட்டளையை இயக்க, மறுதொடக்கம் தேவையில்லை.

source: sudo growpart /dev/mmcblk0 1 sudo resize2fs /dev/mmcblk0p1
ta: sudo cowpart /dev /mmcblk0 1 sudo resize2fs /dev /mmcblk0p1

source: Install Klipper by running the following commands:
ru: Установите Klipper, выполнив следующие команды:
ta: பின்வரும் கட்டளைகளை இயக்குவதன் மூலம் கிளிப்பரை நிறுவவும்:

source: git clone https://github.com/Klipper3d/klipper.git ./klipper/scripts/install-beaglebone.sh
ta: git நகலி https://github.com/klipper3d/klipper.git ./klipper/scripts/install-beaglebone.sh

source: After installing Klipper you need to decide what kind of deployment do you need, but take a note that BeagleBone is 3.3v based hardware and in most cases you can't directly connect pins to 5v or 12v based hardware without conversion boards.
ru: После установки Klipper вам нужно решить, какой тип развертки вам нужен, но учтите, что BeagleBone - это оборудование на базе 3,3 В, и в большинстве случаев вы не можете напрямую подключить контакты к оборудованию на базе 5 или 12 В без плат-переходников.
ta: கிளிப்பரை நிறுவிய பிறகு, உங்களுக்கு என்ன வகையான வரிசைப்படுத்தல் தேவை என்பதை நீங்கள் தீர்மானிக்க வேண்டும், ஆனால் பீகல்போன் 3.3 வி அடிப்படையிலான வன்பொருள் என்பதையும், பெரும்பாலான சந்தர்ப்பங்களில் மாற்று பலகைகள் இல்லாமல் ஊசிகளை நேரடியாக 5 வி அல்லது 12 வி அடிப்படையிலான வன்பொருளுடன் இணைக்க முடியாது என்பதையும் கவனியுங்கள்.

source: As Klipper have multimodule architecture on BeagleBone you can achieve many different use cases, but general ones are following:
ru: Поскольку Klipper имеет многомодульную архитектуру на BeagleBone, вы можете реализовать множество различных сценариев использования, но общие из них следующие:
ta: கிளிப்பர் பீகல்பேனில் மல்டிமோடூல் கட்டமைப்பைக் கொண்டிருப்பதால், நீங்கள் பல வேறுபட்ட பயன்பாட்டு நிகழ்வுகளை அடையலாம், ஆனால் பொதுவானவை பின்வருமாறு:

source: Use case 1: Use BeagleBone only as a host system to run Klipper and additional software like OctoPrint/Fluidd + Moonraker/... and this configuration will be driving external micro-controllers via serial/usb/canbus connections.
ru: Вариант использования 1: использование BeagleBone только в качестве хост-системы для запуска Klipper и дополнительного программного обеспечения, такого как OctoPrint/Fluidd + Moonraker/... и эта конфигурация будет управлять внешними микроконтроллерами через последовательные/usb/canbus соединения.
ta: வழக்கு 1 ஐப் பயன்படுத்தவும்: கிளிப்பரை இயக்க புரவலன் அமைப்பாகவும், ஆக்டோப்ரின்ட்/ஃப்ளூயிட் டி + மூன்ராகேக்கர்/போன்ற கூடுதல் மென்பொருளாகவும் பீகிள்போனை மட்டுமே பயன்படுத்தவும் ... மேலும் இந்த உள்ளமைவு சீரியல்/யூ.எச்.பி/கான்பச் இணைப்புகள் வழியாக வெளிப்புற மைக்ரோ-கன்ட்ரோலர்களை இயக்கும்.

source: Use case 2: Use BeagleBone with extension board (cape) like CRAMPS board. in this configuration BeagleBone will host Klipper + additional software, and it will drive extension board with BeagleBone PRU cores (2 additional cores 200Mh, 32Bit).
ru: Вариант использования 2: использование BeagleBone с платой расширения (накидкой), подобной плате CRAMPS. В этой конфигурации BeagleBone будет размещать Klipper + дополнительное программное обеспечение, и он будет управлять платой расширения с помощью ядер BeagleBone PRU (2 дополнительных ядра 200Mh, 32Bit).
ta: வழக்கு 2 ஐப் பயன்படுத்தவும்: க்ராம்ப்ச் போர்டு போன்ற நீட்டிப்பு வாரியத்துடன் (கேப்) பீகல்போனைப் பயன்படுத்தவும். இந்த உள்ளமைவில் பீகல்போன் கிளிப்பர் + கூடுதல் மென்பொருளை வழங்கும், மேலும் இது பீகல்போன் ப்ரூ கோர்களுடன் (2 கூடுதல் கோர்கள் 200 எம்.எச், 32 பிட்) நீட்டிப்பு பலகையை இயக்கும்.

source: Use case 3: It's same as "Use case 1" but additionally you want to drive BeagleBone GPIOs with high speed by utilizing PRU cores to offload main CPU.
ru: Пример 3: То же самое, что и в случае 1, но дополнительно вы хотите управлять GPIO BeagleBone с высокой скоростью, используя ядра PRU, чтобы разгрузить основной процессор.
ta: வழக்கு 3 ஐப் பயன்படுத்துங்கள்: இது "வழக்கு 1 ஐப் பயன்படுத்துங்கள்" போன்றது, ஆனால் கூடுதலாக நீங்கள் பீகல் போன் சி.பி.ஓ.எச்சை அதிவேகத்துடன் இயக்க விரும்புகிறீர்கள், முதன்மையான சிபியு ஐ ஆஃப்லோட் செய்ய PRU கோர்களைப் பயன்படுத்துவதன் மூலம்.

source: Installing Octoprint
ru: Установка Octoprint
ta: ஆக்டோபிரிண்ட் நிறுவுதல்

source: One may then install Octoprint or fully skip this section if desired other software:
ru: После этого можно установить Octoprint или полностью пропустить этот раздел при желании установить другое программное обеспечение:
ta: ஒன்று பின்னர் ஆக்டோப்ரின்ட்டை நிறுவலாம் அல்லது பிற மென்பொருளை விரும்பினால் இந்த பகுதியை முழுமையாக தவிர்க்கலாம்:

source: Wait 1-2 minutes and make sure the OctoPrint web server is accessible - it should be at: <http://beaglebone:5000/>
ru: Подождите 1-2 минуты и убедитесь, что веб-сервер OctoPrint доступен - он должен находиться по адресу: <http://beaglebone:5000/>
ta: 1-2 நிமிடங்கள் காத்திருந்து ஆக்டோப்ரிண்ட் வலை சேவையகம் அணுகக்கூடியது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் - அது இருக்க வேண்டும்: <http: // bealebone: 5000/>

source: Building the BeagleBone PRU micro-controller code (PRU firmware)
ru: Создание кода микроконтроллера BeagleBone PRU (прошивка PRU)
ta: பீகல்போன் ப்ரூ மைக்ரோ-கன்ட்ரோலர் குறியீட்டை உருவாக்குதல் (ப்ரூ ஃபார்ம்வேர்)

source: This section is required for "Use case 2" and "Use case 3" mentioned above, you should skip it for "Use case 1".
ru: Этот раздел необходим для "Варианта использования 2" и "Варианта использования 3", упомянутых выше, для "Варианта использования 1" его следует пропустить.
ta: மேலே குறிப்பிட்டுள்ள "வழக்கு 2 ஐப் பயன்படுத்துங்கள்" மற்றும் "பயன்பாடு 3" க்கு இந்த பிரிவு தேவைப்படுகிறது, நீங்கள் அதை "பயன்பாட்டு வழக்கு 1" க்கு தவிர்க்க வேண்டும்.

source: Check that required devices are present
ru: Проверьте наличие необходимых устройств
ta: தேவையான சாதனங்கள் உள்ளனவா என்பதை சரிபார்க்கவும்

source: sudo beagle-version
ta: சூடோ பீகல்-பதிப்பு

source: You should check that output contains successful "remoteproc" drivers loading and presence of PRU cores, in Kernel 5.10 they should be "remoteproc1" and "remoteproc2" (4a334000.pru, 4a338000.pru) Also check that many GPIOs are loaded they will look like "Allocated GPIO id=0 name='P8_03'" Usually everything is fine and no hardware configuration is required. If something is missing - try to play with "uboot overlays" options or with cape-overlays Just for reference some output of working BeagleBone Black configuration with CRAMPS board:
ru: Необходимо проверить, что вывод содержит успешную загрузку драйверов "remoteproc" и наличие ядер PRU, в Kernel 5.10 это должны быть "remoteproc1" и "remoteproc2" (4a334000.pru, 4a338000.pru) Также проверьте, что многие GPIO загружены, они будут выглядеть как "Allocated GPIO id=0 name='P8_03'" Обычно все в порядке и не требуется аппаратная настройка. Если чего-то не хватает - попробуйте поиграть с опциями "uboot overlays" или с cape-overlays Просто для справки несколько выводов рабочей конфигурации BeagleBone Black с платой CRAMPS:
ta: கர்னல் 5.10 இல், வெளியீட்டில் வெற்றிகரமான "ரிமோட்பிராக்" டிரைவர்கள் ஏற்றுதல் மற்றும் ப்ரூ கோர்களின் இருப்பு ஆகியவை உள்ளதா என்பதை நீங்கள் சரிபார்க்க வேண்டும், அவை "ரிமோட்ப்ரோக் 1" மற்றும் "ரிமோட்ரோக் 2" (4A334000.PRU, 4A338000.PRU) பல சி.பி.ஓக்கள் ஏற்றப்படுமா என்பதை சரிபார்க்கவும் "ஒதுக்கப்பட்ட GPIO ஐடி = 0 பெயர் = 'P8_03'" போன்றவை பொதுவாக எல்லாம் நன்றாக இருக்கும் மற்றும் வன்பொருள் உள்ளமைவு தேவையில்லை. ஏதேனும் காணவில்லை என்றால் - "யுபூட் மேலடுக்குகள்" விருப்பங்களுடன் அல்லது கேப் -ஓவர்லேசுடன் விளையாட முயற்சிக்கவும்

source: model:[TI_AM335x_BeagleBone_Black] UBOOT: Booted Device-Tree:[am335x-boneblack-uboot-univ.dts] UBOOT: Loaded Overlay:[BB-ADC-00A0.bb.org-overlays] UBOOT: Loaded Overlay:[BB-BONE-eMMC1-01-00A0.bb.org-overlays] kernel:[5.10.168-ti-r71] /boot/uEnv.txt Settings: uboot_overlay_options:[enable_uboot_overlays=1] uboot_overlay_options:[disable_uboot_overlay_video=0] uboot_overlay_options:[disable_uboot_overlay_audio=1] uboot_overlay_options:[disable_uboot_overlay_wireless=1] uboot_overlay_options:[enable_uboot_cape_universal=1] pkg:[bb-cape-overlays]:[4.14.20210821.0-0~bullseye+20210821] pkg:[bb-customizations]:[1.20230720.1-0~bullseye+20230720] pkg:[bb-usb-gadgets]:[1.20230414.0-0~bullseye+20230414] pkg:[bb-wl18xx-firmware]:[1.20230414.0-0~bullseye+20230414] ............. .............
ta: மாதிரி: [ti_am335x_beaglebone_black] Uboot: துவக்கப்பட்ட சாதனம்-மரம்: [AM335X-BONEBLACK-UBOOT-univ.dts] Uboot: ஏற்றப்பட்ட மேலடுக்கு: [BB-ADC-00A0.BB.org-overlys] Uboot: ஏற்றப்பட்ட மேலடுக்கு: [BB-BONE-EMMC1-01-00A0.BB.org-OverLays] கர்னல்: [5.10.168-TI-R71] /boot/uenv.txt அமைப்புகள்: uboot_overlay_options: [enable_uboot_overlys = 1] uboot_overlay_options: [disable_uboot_overlay_video = 0] uboot_overlay_options: [disable_uboot_overlay_audio = 1] uboot_overlay_options: [disable_uboot_overlay_wireless = 1] uboot_overlay_options: [enable_uboot_cape_universal = 1] பி.கே.சி: [பிபி-கேப்-ஓவர்லேச்]: [4.14.20210821.0-0 ~ புல்செய்+20210821] பி.கே.சி: [பிபி-தனிப்பயனாக்குதல்]: [1.20230720.1-0 ~ புல்செய்+20230720] பி.கே.சி: [பிபி-யு.எச்.பி-கேசெட்டுகள்]: [1.20230414.0-0 ~ புல்செய்+20230414] பி.கே.சி: [பிபி-டபிள்யூ.எல். ............. .............

source: To compile the Klipper micro-controller code, start by configuring it for the "Beaglebone PRU", for "BeagleBone Black" additionally disable options "Support GPIO Bit-banging devices" and disable "Support LCD devices" inside the "Optional features" because they will not fit in 8Kb PRU firmware memory, then exit and save config:
ru: Чтобы скомпилировать код микроконтроллера Klipper, начните с его настройки для "Beaglebone PRU", для "BeagleBone Black" дополнительно отключите опции " Поддержка GPIO Bit-banging устройств" и отключите "Поддержка LCD устройств" в разделе "Дополнительные функции", так как они не поместятся в 8 Кб памяти прошивки PRU, затем выйдите и сохраните конфиг:
ta: கிளிப்பர் மைக்ரோ-கம்யூன்ட்ரோலர் குறியீட்டை தொகுக்க, "பீகல்போன் ப்ரூ" க்காக அதை உள்ளமைப்பதன் மூலம் தொடங்கவும், "பீகல்போன் பிளாக்" கூடுதலாக விருப்பங்களை முடக்கு "சிபிஐஓ பிட்-பேஞ்சிங் சாதனங்களை ஆதரிக்கவும் மற்றும்" விருப்ப அம்சங்களுக்குள் "உதவி எல்சிடி சாதனங்களை ஆதரிக்கவும்" அவை 8KB PRU ஃபார்ம்வேர் நினைவகத்தில் பொருந்தாது, பின்னர் வெளியேறி கட்டமைப்பைச் சேமிக்கவும்:

source: To build and install the new PRU micro-controller code, run:
ru: Чтобы собрать и установить новый код микроконтроллера PRU, выполните команду:
ta: புதிய PRU மைக்ரோ-கண்ட்ரோலர் குறியீட்டை உருவாக்க மற்றும் நிறுவ, இயக்கவும்:

source: After previous commands was executed your PRU firmware should be ready and started to check if everything was fine you can execute following command
ru: После выполнения предыдущих команд прошивка вашего PRU должна быть готова и запущена, чтобы проверить, все ли в порядке, выполните следующую команду
ta: முந்தைய கட்டளைகள் செயல்படுத்தப்பட்ட பிறகு, உங்கள் PRU ஃபார்ம்வேர் தயாராக இருக்க வேண்டும், எல்லாம் நன்றாக இருக்கிறதா என்று சரிபார்க்கத் தொடங்க வேண்டும், நீங்கள் பின்வரும் கட்டளையை இயக்க முடியும்

source: dmesg
ta: டி.எம்.எச்.சி.

source: and compare last messages with sample one which indicate that everything started properly:
ru: и сравните последние сообщения с образцом, который показывает, что все запустилось правильно:
ta: எல்லாவற்றையும் சரியாகத் தொடங்கியது என்பதைக் குறிக்கும் மாதிரி ஒன்றோடு கடைசி செய்திகளை ஒப்பிடுக:

source: [ 71.105499] remoteproc remoteproc1: 4a334000.pru is available [ 71.157155] remoteproc remoteproc2: 4a338000.pru is available [ 73.256287] remoteproc remoteproc1: powering up 4a334000.pru [ 73.279246] remoteproc remoteproc1: Booting fw image am335x-pru0-fw, size 97112 [ 73.285807] remoteproc1#vdev0buffer: registered virtio0 (type 7) [ 73.285836] remoteproc remoteproc1: remote processor 4a334000.pru is now up [ 73.286322] remoteproc remoteproc2: powering up 4a338000.pru [ 73.313717] remoteproc remoteproc2: Booting fw image am335x-pru1-fw, size 188560 [ 73.313753] remoteproc remoteproc2: header-less resource table [ 73.329964] remoteproc remoteproc2: header-less resource table [ 73.348321] remoteproc remoteproc2: remote processor 4a338000.pru is now up [ 73.443355] virtio_rpmsg_bus virtio0: creating channel rpmsg-pru addr 0x1e [ 73.443727] virtio_rpmsg_bus virtio0: msg received with no recipient [ 73.444352] virtio_rpmsg_bus virtio0: rpmsg host is online [ 73.540993] rpmsg_pru virtio0.rpmsg-pru.-1.30: new rpmsg_pru device: /dev/rpmsg_pru30
ta: [71 [71 [ 73.256287] remoteproc remoteproc1: powering மேலே 4a334000.pru . . . [ 73.286322] remoteproc remoteproc2: powering மேலே 4a338000.pru . [ 73.313753] remoteproc remoteproc2: header-less resource table [73 . [ 73.443355] virtio_rpmsg_bus virtio0: creating வாய்க்கால் rpmsg-pru addr 0x1e [ 73.443727] virtio_rpmsg_bus virtio0: msg received with இல்லை recipient [ 73.444352] virtio_rpmsg_bus virtio0: rpmsg விருந்தோம்பி is online [ 73.540993] rpmsg_pru virtio0.rpmsg-pru.-1.30: புதிய rpmsg_pru device: /dev/rpmsg_pru30

source: take a note about "/dev/rpmsg_pru30" - it's your future serial device for main mcu configuration this device is required to be present, if it's absent - your PRU cores did not start properly.
ru: обратите внимание на "/dev/rpmsg_pru30" - это ваше будущее последовательное устройство для основной конфигурации mcu. Это устройство должно присутствовать, если оно отсутствует - ваши ядра PRU не запустились должным образом.
ta: "/dev/rpmsg_pru30" பற்றி ஒரு குறிப்பை எடுத்துக் கொள்ளுங்கள் - இது முதன்மையான MCU உள்ளமைவுக்கான உங்கள் எதிர்கால தொடர் சாதனம் இந்த சாதனம் இருக்க வேண்டும், அது இல்லாவிட்டால் - உங்கள் ப்ரூ கோர்கள் சரியாகத் தொடங்கவில்லை.

source: Building and installing Linux host micro-controller code
ru: Сборка и установка кода микроконтроллера на хост Linux
ta: லினக்ச் புரவலன் மைக்ரோ-கன்ட்ரோலர் குறியீட்டை உருவாக்குதல் மற்றும் நிறுவுதல்

source: This section is required for "Use case 2" and optional for "Use case 3" mentioned above
ru: Этот раздел обязателен для "Варианта использования 2" и необязателен для "Варианта использования 3", упомянутого выше
ta: இந்த பிரிவு "வழக்கு 2 ஐப் பயன்படுத்தவும்" மற்றும் மேலே குறிப்பிட்டுள்ள "வழக்கு 3" க்கு விருப்பமானது

source: take a note about "/tmp/klipper_host_mcu" - it will be your future serial device for "mcu host" if that file don't exist - refer to "scripts/klipper-mcu.service" file, it was installed by previous commands, and it's responsible for it.
ru: обратите внимание на "/tmp/klipper_host_mcu" - это будет ваше будущее последовательное устройство для "mcu host", если этот файл не существует - обратитесь к файлу "scripts/klipper-mcu.service", он был установлен предыдущими командами и отвечает за это.
ta: "/TMP/KLIPPER_HOST_MCU" பற்றி ஒரு குறிப்பை எடுத்துக் கொள்ளுங்கள் - அந்தக் கோப்பு இல்லாவிட்டால் "MCU புரவலன்" க்கான உங்கள் எதிர்கால தொடர் சாதனமாக இது இருக்கும் - "ச்கிரிப்ட்கள்/கிளிப்பர் -MCU.Service" கோப்பைப் பார்க்கவும், இது முந்தைய கட்டளைகளால் நிறுவப்பட்டது , அதற்கு அது பொறுப்பு.

source: Take a note for "Use case 2" about following: when you will define printer configuration you should always use temperature sensors from "mcu host" because ADCs not present in default "mcu" (PRU cores). Sample configuration of "sensor_pin" for extruder and heated bed are available in "generic-cramps.cfg" You can use any other GPIO directly from "mcu host" by referencing them this way "host:gpiochip1/gpio17" but that should be avoided because it will be creating additional load on main CPU and most probably you can't use them for stepper control.
ru: Обратите внимание для "Use case 2" на следующее: когда вы будете определять конфигурацию принтера, вы всегда должны использовать датчики температуры из "mcu host", потому что АЦП не присутствуют в "mcu" по умолчанию (ядра PRU). Примеры конфигурации "sensor_pin" для экструдера и подогреваемого ложа доступны в "generic-cramps.cfg" Вы можете использовать любые другие GPIO непосредственно с "mcu host", ссылаясь на них таким образом "host:gpiochip1/gpio17", но этого следует избегать, поскольку это будет создавать дополнительную нагрузку на основной процессор и, скорее всего, вы не сможете использовать их для управления шаговиками.
ta: பின்வருவனவற்றைப் பற்றி "வழக்கு 2 ஐப் பயன்படுத்துங்கள்" என்பதற்கான குறிப்பை எடுத்துக் கொள்ளுங்கள்: நீங்கள் அச்சுப்பொறி உள்ளமைவை வரையறுக்கும் போது நீங்கள் எப்போதும் "MCU புரவலன்" இலிருந்து வெப்பநிலை சென்சார்களைப் பயன்படுத்த வேண்டும், ஏனெனில் ADC கள் இயல்புநிலை "MCU" (PRU கோர்கள்) இல் இல்லை. எக்ச்ட்ரூடர் மற்றும் சூடான படுக்கைக்கான "சென்சார்_பின்" இன் மாதிரி உள்ளமைவு "செனரிக்-கிராம்ப்.கிராம்ப்களில் கிடைக்கிறது. ஏனெனில் இது முதன்மையான சிபியு இல் கூடுதல் சுமையை உருவாக்கும், மேலும் அவற்றை நீங்கள் ச்டெப்பர் கட்டுப்பாட்டுக்கு பயன்படுத்த முடியாது.

source: Complete the installation by configuring Klipper following the instructions in the main [Installation](Installation.md#configuring-octoprint-to-use-klipper) document.
ru: Завершите установку, настроив Klipper в соответствии с инструкциями в основном документе [Установка](Installation.md#configuring-octoprint-to-use-klipper).
ta: முதன்மையான [நிறுவல்] (நிறுவல். எம்.டி#கட்டமைத்தல்-ஆக்டோப்ரின்ட்-டு-யூச்-கிளிப்பர்) ஆவணத்தில் உள்ள வழிமுறைகளைப் பின்பற்றி கிளிப்பரை உள்ளமைப்பதன் மூலம் நிறுவலை முடிக்கவும்.
