Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Beaglebone.po
Languages: ru, ta

source: Unfortunately, the Beaglebone processor can sometimes struggle to run OctoPrint well. Print stalls have been known to occur on complex prints (the printer may move faster than OctoPrint can send movement commands). If this occurs, consider using the "virtual_sdcard" feature (see [Config Reference](Config_Reference.md#virtual_sdcard) for details) to print directly from Klipper and disable any DEBUG or VERBOSE logging options if you did enable them.
ru: К сожалению, процессор Beaglebone иногда не справляется с работой OctoPrint. Известно, что при сложных отпечатках происходят задержки печати (принтер может двигаться быстрее, чем OctoPrint может отправлять команды перемещения). Если это происходит, воспользуйтесь функцией "virtual_sdcard" (подробности см. в [Config Reference](Config_Reference.md#virtual_sdcard)) для печати непосредственно из Klipper и отключите любые опции протоколирования DEBUG или VERBOSE, если вы их включили.
ta: துரதிர்ச்டவசமாக, பீகல்போன் செயலி சில நேரங்களில் ஆக்டோப்ரின்ட்டை நன்றாக இயக்க போராடுகிறது. சிக்கலான அச்சிட்டுகளில் அச்சு ச்டால்கள் நிகழும் என்று அறியப்படுகிறது (ஆக்டோபிரிண்ட் இயக்க கட்டளைகளை அனுப்புவதை விட அச்சுப்பொறி வேகமாக நகரக்கூடும்). இது நிகழ்ந்தால், கிளிப்பரில் இருந்து நேரடியாக அச்சிடவும், நீங்கள் அவற்றை இயக்கினால் எந்த பிழைத்திருத்த அல்லது வாய்மொழி பதிவு செய்யும் விருப்பங்களை முடக்கவும் "மெய்நிகர்_ச்ட்கார்டு" அம்சத்தைப் பயன்படுத்துவதைக் கவனியுங்கள் (விவரங்களுக்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#virtual_sdcard)).

source: AVR micro-controller code build
ru: Сборка кода микроконтроллера AVR
ta: ஏ.வி.ஆர் மைக்ரோ-கன்ட்ரோலர் குறியீடு உருவாக்க

source: This environment have everything to build necessary micro-controller code except AVR, AVR packages was removed because of conflict with PRU packages. if you still want to build AVR micro-controller code in this environment you need to remove PRU packages and install AVR packages by executing following commands
ru: В этой среде есть все для сборки необходимого кода микроконтроллера, кроме AVR, пакеты AVR были удалены из-за конфликта с пакетами PRU. Если вы все еще хотите собирать код микроконтроллера AVR в этой среде, вам нужно удалить пакеты PRU и установить пакеты AVR, выполнив следующие команды
ta: ஏ.வி.ஆர் தவிர தேவையான மைக்ரோ-கன்ட்ரோலர் குறியீட்டை உருவாக்க இந்த சூழலில் எல்லாவற்றையும் கொண்டுள்ளது, ப்ரூ தொகுப்புகளுடன் முரண்படுவதால் ஏ.வி.ஆர் தொகுப்புகள் அகற்றப்பட்டன. இந்த சூழலில் ஏ.வி.ஆர் மைக்ரோ-கான்ரோலர் குறியீட்டை நீங்கள் இன்னும் உருவாக்க விரும்பினால், பின்வரும் கட்டளைகளை இயக்குவதன் மூலம் PRU தொகுப்புகளை அகற்றி AVR தொகுப்புகளை நிறுவ வேண்டும்

source: sudo apt-get remove gcc-pru sudo apt-get install avrdude gcc-avr binutils-avr avr-libc
ta: sudo apt-get gcc-pru ஐ அகற்று sudo apt-get நிறுவு avrdude gcc-avr binutils-avr avr-libc

source: if you need to restore PRU packages - then remove ARV packages before that
ru: если вам нужно восстановить пакеты PRU, удалите перед этим пакеты ARV
ta: நீங்கள் PRU தொகுப்புகளை மீட்டெடுக்க வேண்டும் என்றால் - அதற்கு முன் ARV தொகுப்புகளை அகற்றவும்

source: sudo apt-get remove avrdude gcc-avr binutils-avr avr-libc sudo apt-get install gcc-pru
ta: sudo apt-get avrdude gcc-avr binutils-avr avr-libc ஐ அகற்று sudo apt-get install gcc-pru

source: Hardware Pin designation
ru: Обозначение выводов аппаратного обеспечения
ta: வன்பொருள் முள் பதவி

source: BeagleBone is very flexible in terms of pin designation, same pin can be configured for different function but always single function for single pin, same function can be present on different pins. So you can't have multiple functions on single pin or have same function on multiple pins. Example: P9_20 - i2c2_sda/can0_tx/spi1_cs0/gpio0_12/uart1_ctsn P9_19 - i2c2_scl/can0_rx/spi1_cs1/gpio0_13/uart1_rtsn P9_24 - i2c1_scl/can1_rx/gpio0_15/uart1_tx P9_26 - i2c1_sda/can1_tx/gpio0_14/uart1_rx
ru: BeagleBone очень гибкий в плане обозначения выводов, один и тот же вывод может быть настроен на разные функции, но всегда одна функция для одного вывода, одна и та же функция может присутствовать на разных выводах. Таким образом, вы не можете иметь несколько функций на одном выводе или иметь одну и ту же функцию на нескольких выводах. Пример: P9_20 - i2c2_sda/can0_tx/spi1_cs0/gpio0_12/uart1_ctsn P9_19 - i2c2_scl/can0_rx/spi1_cs1/gpio0_13/uart1_rtsn P9_24 - i2c1_scl/can1_rx/gpio0_15/uart1_tx P9_26 - i2c1_sda/can1_tx/gpio0_14/uart1_rx
ta: முள் பதவியின் அடிப்படையில் பீகல்போன் மிகவும் நெகிழ்வானது, ஒரே முள் வெவ்வேறு செயல்பாடுகளுக்கு கட்டமைக்கப்படலாம், ஆனால் எப்போதும் ஒற்றை முள் ஒற்றை செயல்பாடு, ஒரே செயல்பாடு வெவ்வேறு ஊசிகளில் இருக்க முடியும். எனவே நீங்கள் ஒற்றை முள் மீது பல செயல்பாடுகளைக் கொண்டிருக்க முடியாது அல்லது பல ஊசிகளில் ஒரே செயல்பாட்டைக் கொண்டிருக்க முடியாது. எடுத்துக்காட்டு: p9_20 - i2c2_sda/can0_tx/spi1_cs0/gpio0_12/uart1_ctsn p9_19 - i2c2_scl/can0_rx/spi1/gpio0_13/uart1_rtsn p9_24 _26 - I2C1_SDA/CAN1_TX/GPIO0_14/UART1_RX

source: Pin designation is defined by using special "overlays" which will be loaded during linux boot they are configured by editing file /boot/uEnv.txt with elevated permissions
ru: Назначение выводов определяется с помощью специальных "оверлеев", которые будут загружаться при загрузке linux, они настраиваются путем редактирования файла /boot/uEnv.txt с повышенными правами
ta: சிறப்பு "மேலடுக்குகளை" பயன்படுத்துவதன் மூலம் முள் பதவி வரையறுக்கப்படுகிறது, இது லினக்ச் துவக்கத்தின் போது ஏற்றப்படும், அவை உயர்த்தப்பட்ட அனுமதிகளுடன் கோப்பைத் திருத்துவதன் மூலம் கட்டமைக்கப்படுகின்றன

source: sudo editor /boot/uEnv.txt
ta: Sudo திருத்தி /boot/uenv.txt

source: and defining which functionality to load, for example to enable CAN1 you need to define overlay for it
ru: и определение функциональности, которую нужно загрузить, например, чтобы включить CAN1, нужно определить для него оверлей
ta: எந்த செயல்பாட்டை ஏற்ற வேண்டும் என்பதை வரையறுத்தல், எடுத்துக்காட்டாக, CAN1 ஐ இயக்க நீங்கள் அதற்கான மேலடுக்கை வரையறுக்க வேண்டும்

source: This overlay BB-CAN1-00A0.dtbo will reconfigure all required pins for CAN1 and create CAN device in Linux. Any change in overlays will require system reboot to be applied. If you need to understand which pins are involved in some overlay - you can analyze source files in this location: /opt/sources/bb.org-overlays/src/arm/ or search info in BeagleBone forums.
ru: Этот оверлей BB-CAN1-00A0.dtbo перенастроит все необходимые контакты для CAN1 и создаст CAN-устройство в Linux. Для применения любых изменений в оверлеях потребуется перезагрузка системы. Если вам нужно понять, какие пины задействованы в том или ином оверлее - вы можете проанализировать исходные файлы в этом месте: /opt/sources/bb.org-overlays/src/arm/ или поискать информацию на форумах BeagleBone.
ta: இந்த மேலடுக்கு BB-CAN1-00A0.DTBO CAN1 க்கு தேவையான அனைத்து ஊசிகளையும் மறுசீரமைத்து, லினக்சில் CAN சாதனத்தை உருவாக்குங்கள். மேலடுக்குகளில் ஏதேனும் மாற்றத்திற்கு கணினி மறுதொடக்கம் பயன்படுத்தப்பட வேண்டும். சில மேலடுக்கில் எந்த ஊசிகளை நீங்கள் புரிந்து கொள்ள வேண்டும் என்றால் - இந்த இடத்தில் மூலக் கோப்புகளை பகுப்பாய்வு செய்யலாம்: /opt/sources/bb.org-overlays/src/arm/ அல்லது பீகிள்போன் மன்றங்களில் தேடல் செய்தி.

source: Enabling hardware SPI
ru: Включение аппаратного SPI
ta: வன்பொருள் SPI ஐ இயக்குகிறது

source: BeagleBone usually have multiple hardware SPI buses, for example BeagleBone Black can have 2 of them, they can work up to 48Mhz, but usually they are limited to 16Mhz by Kernel Device-tree. By default, in BeagleBone Black some of SPI1 pins are configured for HDMI-Audio output, to fully enable 4-wire SPI1 you need to disable HDMI Audio and enable SPI1 To do that edit file /boot/uEnv.txt with elevated permissions
ru: BeagleBone обычно имеет несколько аппаратных шин SPI, например, BeagleBone Black может иметь 2 из них, они могут работать до 48Mhz, но обычно они ограничены 16Mhz деревом устройств ядра. По умолчанию в BeagleBone Black некоторые из выводов SPI1 сконфигурированы для вывода HDMI-Audio, чтобы полностью включить 4-проводной SPI1, необходимо отключить HDMI Audio и включить SPI1 Для этого отредактируйте файл /boot/uEnv.txt с повышенными правами
ta: பீகல்போன் வழக்கமாக பல வன்பொருள் ச்பை பேருந்துகளைக் கொண்டிருக்கும், எடுத்துக்காட்டாக பீகல்போன் பிளாக் அவற்றில் 2 ஐக் கொண்டிருக்கலாம், அவை 48 மெகா எர்ட்ச் வரை வேலை செய்யலாம், ஆனால் வழக்கமாக அவை கர்னல் சாதன மரத்தால் 16 மெகா எர்ட்ச் வரை வரையறுக்கப்படுகின்றன. இயல்பாக, பீகிள் போன் கருப்பு நிறத்தில் சில SPI1 ஊசிகள் HDMI-AUDIO வெளியீட்டிற்காக கட்டமைக்கப்பட்டுள்ளன, 4-கம்பி SPI1

source: uncomment variable
ru: некомментируемая переменная
ta: கருத்திநீக்கு மாறி

source: disable_uboot_overlay_audio=1
ta: DISPACE_UBOOT_OVERLAY_AUDIO = 1

source: next uncomment variable and define it this way
ru: затем отмените переменную и определите ее следующим образом
ta: அடுத்து அன் -காம்மென்ட் மாறி மற்றும் அதை இந்த வழியில் வரையறுக்கவும்

source: Save changes in /boot/uEnv.txt and reboot the board. Now you have SPI1 Enabled, to verify its presence execute command
ru: Сохраните изменения в файле /boot/uEnv.txt и перезагрузите плату. Теперь у вас включен SPI1, чтобы проверить его наличие, выполните команду
ta: /Boot/uenv.txt இல் மாற்றங்களைச் சேமித்து பலகையை மீண்டும் துவக்கவும். இப்போது நீங்கள் SPI1 இயக்கப்பட்டிருக்கிறீர்கள், அதன் இருப்பு கட்டளையை சரிபார்க்கவும்

source: Take a note that BeagleBone usually is 3.3v based hardware and to use 5V SPI devices you need to add Level-Shifting chip, for example SN74CBTD3861, SN74LVC1G34 or similar. If you are using CRAMPS board - it already contains Level-Shifting chip and SPI1 pins will become available on P503 port, and they can accept 5v hardware, check CRAMPS board Schematics for pin references.
ru: Обратите внимание, что BeagleBone обычно работает на 3,3 В, и для использования 5 В SPI-устройств необходимо добавить микросхему Level-Shifting, например SN74CBTD3861, SN74LVC1G34 или аналогичную. Если вы используете плату CRAMPS - она уже содержит микросхему Level-Shifting, и контакты SPI1 станут доступны на порту P503, и они могут принимать 5В оборудование, проверьте схемы платы CRAMPS на предмет ссылок на контакты.
ta: பீகல்போன் வழக்கமாக 3.3 வி அடிப்படையிலான வன்பொருள் மற்றும் 5 வி எச்பிஐ சாதனங்களைப் பயன்படுத்த நீங்கள் நிலை மாற்ற சிப்பைச் சேர்க்க வேண்டும் என்பதை நினைவில் கொள்க, எடுத்துக்காட்டாக SN74CBTD3861, SN74LVC1G34 அல்லது அது போன்றவை. நீங்கள் க்ராம்ப்ச் போர்டைப் பயன்படுத்துகிறீர்கள் என்றால் - அதில் ஏற்கனவே நிலை -மாற்ற சிப் மற்றும் SPI1 ஊசிகள் P503 போர்ட்டில் கிடைக்கும், மேலும் அவை 5V வன்பொருளை ஏற்றுக்கொள்ளலாம், முள் குறிப்புகளுக்கான பிடிப்பு போர்டு திட்டங்களை சரிபார்க்கவும்.

source: Enabling hardware I2C
ru: Включение аппаратного I2C
ta: வன்பொருள் I2C ஐ இயக்குகிறது

source: BeagleBone usually have multiple hardware I2C buses, for example BeagleBone Black can have 3 of them, they support speed up-to 400Kbit Fast mode. By default, in BeagleBone Black there are two of them (i2c-1 and i2c-2) usually both are already configured and present on P9, third ic2-0 usually reserved for internal use. If you are using CRAMPS board then i2c-2 is present on P303 port with 3.3v level, If you want to obtain I2c-1 in CRAMPS board - you can get them on Extruder1.Step, Extruder1.Dir pins, they also are 3.3v based, check CRAMPS board Schematics for pin references. Related overlays, for [Hardware Pin designation](#hardware-pin-designation): I2C1(100Kbit): BB-I2C1-00A0.dtbo I2C1(400Kbit): BB-I2C1-FAST-00A0.dtbo I2C2(100Kbit): BB-I2C2-00A0.dtbo I2C2(400Kbit): BB-I2C2-FAST-00A0.dtbo
ru: BeagleBone обычно имеет несколько аппаратных шин I2C, например, у BeagleBone Black их может быть 3, они поддерживают скорость до 400 Кбит в режиме Fast. По умолчанию в BeagleBone Black их две (i2c-1 и i2c-2), обычно обе уже настроены и присутствуют на P9, третья ic2-0 обычно зарезервирована для внутреннего использования. Если вы используете плату CRAMPS, то i2c-2 присутствует на порту P303 с уровнем 3.3v, если вы хотите получить I2c-1 в плате CRAMPS - вы можете получить их на контактах Extruder1.Step, Extruder1.Dir, они также основаны на 3.3v, проверьте схемы платы CRAMPS для ссылок на контакты. Соответствующие накладки для [Hardware Pin designation](#hardware-pin-designation): I2C1(100Kbit): BB-I2C1-00A0.dtbo I2C1(400Kbit): BB-I2C1-FAST-00A0.dtbo I2C2(100Kbit): BB-I2C2-00A0.dtbo I2C2(400Kbit): BB-I2C2-FAST-00A0.dtbo
ta: பீகல்போன் வழக்கமாக பல வன்பொருள் ஐ 2 சி பேருந்துகளைக் கொண்டிருக்கும், எடுத்துக்காட்டாக பீகல்போன் பிளாக் அவற்றில் 3 ஐக் கொண்டிருக்கலாம், அவை 400KBIT வேகமான பயன்முறையை ஆதரிக்கின்றன. இயல்பாக, பீகல்போன் கருப்பு நிறத்தில் அவற்றில் இரண்டு உள்ளன (I2C-1 மற்றும் I2C-2) வழக்கமாக இரண்டும் ஏற்கனவே கட்டமைக்கப்பட்டு P9 இல் உள்ளன, மூன்றாவது IC2-0 பொதுவாக உள் பயன்பாட்டிற்காக ஒதுக்கப்பட்டுள்ளது. நீங்கள் க்ராம்ப்ச் போர்டைப் பயன்படுத்துகிறீர்கள் என்றால், பி 303 போர்ட்டில் 3.3 வி மட்டத்துடன் I2C-2 உள்ளது, நீங்கள் பிடிப்புகள் குழுவில் I2C-1 ஐப் பெற விரும்பினால்-அவற்றை எக்ச்ட்ரூடர் 1.step, extruder1.dir pins இல் பெறலாம், அவை 3.3 ஆகும் v அடிப்படையிலான, முள் குறிப்புகளுக்கான பிடிப்பு போர்டு திட்டங்களை சரிபார்க்கவும். தொடர்புடைய மேலடுக்குகள், [வன்பொருள் முள் பதவிக்கு] (#வன்பொருள்-பின்-வடிவமைப்பு): I2C1 (100Kbit): BB-I2C1-00A0.DTBO I2C1 (400KBIT): BB-I2C1-FAST-00A0.DTBO I2C2 (100KBIT): BBB -I2C2-00A0.DTBO I2C2 (400Kbit): BB-I2C2-FAST-00A0.DTBO

source: Enabling hardware UART(Serial)/CAN
ru: Включение аппаратного UART(Serial)/CAN
ta: வன்பொருள் UART (சீரியல்)/CAN ஐ இயக்குகிறது

source: BeagleBone have up to 6 hardware UART(Serial) buses (up to 3Mbit) and up to 2 hardware CAN(1Mbit) buses. UART1(RX,TX) and CAN1(TX,RX) and I2C2(SDA,SCL) are using same pins - so you need to chose what to use UART1(CTSN,RTSN) and CAN0(TX,RX) and I2C1(SDA,SCL) are using same pins - so you need to chose what to use All UART/CAN related pins are 3.3v based, so you will need to use Transceiver chips/boards like SN74LVC2G241DCUR (for UART), SN65HVD230 (for CAN), TTL-RS485 (for RS-485) or something similar which can convert 3.3v signals to appropriate levels.
ru: BeagleBone имеет до 6 аппаратных шин UART(Serial) (до 3 Мбит) и до 2 аппаратных шин CAN(1 Мбит). UART1(RX,TX) и CAN1(TX,RX) и I2C2(SDA,SCL) используют одни и те же контакты - поэтому вам нужно выбрать, что использовать UART1(CTSN,RTSN) и CAN0(TX,RX) и I2C1(SDA,SCL) используют одни и те же контакты - поэтому вам нужно выбрать, что использовать Все контакты, связанные с UART/CAN, имеют напряжение 3. 3v, поэтому вам нужно использовать чипы/платы трансиверов, такие как SN74LVC2G241DCUR (для UART), SN65HVD230 (для CAN), TTL-RS485 (для RS-485) или что-то подобное, что может преобразовывать сигналы 3.3v в соответствующие уровни.
ta: பீகல்போன் 6 வன்பொருள் UART (சீரியல்) பேருந்துகள் (3mbit வரை) மற்றும் 2 வன்பொருள் கேன் (1Mbit) பேருந்துகள் வரை உள்ளது. UART1 (RX, TX) மற்றும் CAN1 (TX, RX) மற்றும் I2C2 (SDA, SCL) ஆகியவை ஒரே ஊசிகளைப் பயன்படுத்துகின்றன - எனவே UART1 (CTSN, RTSN) மற்றும் CAN0 (TX, RX) மற்றும் I2C1 (SDA1 (SDA . TTL-RS485 (RS-485 க்கு) அல்லது 3.3V சமிக்ஞைகளை பொருத்தமான நிலைகளுக்கு மாற்றக்கூடிய ஒத்த ஒன்று.

source: Related overlays, for [Hardware Pin designation](#hardware-pin-designation) CAN0: BB-CAN0-00A0.dtbo CAN1: BB-CAN1-00A0.dtbo UART0: - used for Console UART1(RX,TX): BB-UART1-00A0.dtbo UART1(RTS,CTS): BB-UART1-RTSCTS-00A0.dtbo UART2(RX,TX): BB-UART2-00A0.dtbo UART3(RX,TX): BB-UART3-00A0.dtbo UART4(RS-485): BB-UART4-RS485-00A0.dtbo UART5(RX,TX): BB-UART5-00A0.dtbo
ru: Связанные накладки, для [Hardware Pin designation](#hardware-pin-designation) CAN0: BB-CAN0-00A0.dtbo CAN1: BB-CAN1-00A0.dtbo UART0: - используется для консоли UART1(RX,TX): BB-UART1-00A0.dtbo UART1(RTS,CTS): BB-UART1-RTSCTS-00A0.dtbo UART2(RX,TX): BB-UART2-00A0.dtbo UART3(RX,TX): BB-UART3-00A0.dtbo UART4(RS-485): BB-UART4-RS485-00A0.dtbo UART5(RX,TX): BB-UART5-00A0.dtbo
ta: தொடர்புடைய மேலடுக்குகள், [வன்பொருள் முள் பதவி] (#வன்பொருள்-பின்-வடிவமைப்பு) CAN0: BB-CAN0-00A0.DTBO CAN1: BB-CAN1-00A0.DTBO UART0:-CONSOLE UART1 (RX, TX): BB- UART1-00A0.DTBO UART1 (RTS, CTS): BB-UART1-RTSCTS-00A0.DTBO UART2 (RX, TX): BB-UART2-00A0.DTBO UART3 (RX, TX): BB-UART3-00A0.DTBO UART4 (RS-485): BB-UART4-RS485-00A0.dtbo UART5(RX,TX): BB-UART5-00A0.dtbo
