Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Level.po
Languages: bg, pl, ta, uk

source: The current height of the nozzle (as the printer currently understands it) is shown between the "--> <--". The number to the right is the height of the last probe attempt just greater than the current height, and to the left is the last probe attempt less than the current height (or ?????? if no attempt has been made).
bg: Текущата височина на дюзата (както принтерът я разбира в момента) се показва между символите "--> <--". Числото вдясно е височината на последния опит на сондата, която е само по-голяма от текущата височина, а вляво е последният опит на сондата, който е по-малък от текущата височина (или ??????, ако не е направен опит).
pl: Aktualna wysokość dyszy (tak jak drukarka ją obecnie rozumie) jest wyświetlana pomiędzy "--> <--". Liczba po prawej stronie to wysokość ostatniej próby pomiaru, nieznacznie większa od bieżącej wysokości, a po lewej stronie to ostatnia próba pomiaru mniejsza od bieżącej wysokości (lub ?????? jeśli nie podjęto żadnej próby).
ta: முனையின் தற்போதைய உயரம் (அச்சுப்பொறி தற்போது புரிந்துகொள்வது போல) "-> <-" க்கு இடையில் காட்டப்பட்டுள்ளது. வலதுபுறத்தில் உள்ள எண்ணிக்கை தற்போதைய உயரத்தை விட கடைசி ஆய்வு முயற்சியின் உயரம், இடதுபுறத்தில் தற்போதைய உயரத்தை விட கடைசி ஆய்வு முயற்சி (அல்லது ?????? எந்த முயற்சியும் செய்யப்படவில்லை என்றால்).
uk: Поточна висота сопла (як її зараз розуміє принтер) відображається між «--> <--». Число праворуч означає висоту останньої спроби зондування, трохи більшу за поточну висоту, а ліворуч означає останню спробу зондування, меншу за поточну висоту (або ??????, якщо спроби не було зроблено).

source: Place the paper between the nozzle and bed. It can be useful to fold a corner of the paper so that it is easier to grab. (Try not to push down on the bed when moving the paper back and forth.)
bg: Поставете хартията между дюзата и леглото. Може да е полезно да сгънете ъгъла на хартията, за да я хванете по-лесно. (Опитайте се да не натискате леглото, когато премествате хартията напред-назад.)
pl: Umieść papier między dyszą a stołem. Może być przydatne zgięcie rogu kartki, aby łatwiej ją było chwycić. (Staraj się nie naciskać na łóżko, przesuwając papier tam i z powrotem.)
ta: முனை மற்றும் படுக்கைக்கு இடையில் காகிதத்தை வைக்கவும். காகிதத்தின் ஒரு மூலையை மடிப்பது பயனுள்ளதாக இருக்கும், இதனால் அதைப் பிடிக்க எளிதானது. (காகிதத்தை முன்னும் பின்னுமாக நகர்த்தும்போது படுக்கையில் கீழே தள்ள வேண்டாம்.)
uk: Помістіть папір між соплом і ложем. Може бути корисно загнути кут паперу, щоб його було легше захопити. (Намагайтеся не натискати на ліжко, коли рухаєте папір вперед-назад.)

source: ![paper-test](img/paper-test.jpg)
ta: ! [காகித-சோதனை] (img/paper-test.jpg)
uk: ![папір-тест](img/папер-тест.jpg)

source: Use the TESTZ command to request the nozzle to move closer to the paper. For example:
bg: Използвайте командата TESTZ, за да поискате дюзата да се доближи до хартията. Например:
pl: Użyj polecenia TESTZ, aby zażądać zbliżenie się dyszy bliżej do papieru. Na przykład:
ta: காகிதத்துடன் நெருக்கமாக செல்ல முனை கோர டெச்ட்ச் கட்டளையைப் பயன்படுத்தவும். உதாரணமாக:
uk: Використовуйте команду TESTZ, щоб попросити сопло наблизитися до паперу. Наприклад:

source: The TESTZ command will move the nozzle a relative distance from the nozzle's current position. (So, `Z=-.1` requests the nozzle to move closer to the bed by .1mm.) After the nozzle stops moving, push the paper back and forth to check if the nozzle is in contact with the paper and to feel the amount of friction. Continue issuing TESTZ commands until one feels a small amount of friction when testing with the paper.
bg: Командата TESTZ ще премести дюзата на относително разстояние от текущата позиция на дюзата. (Така `Z=-.1` изисква дюзата да се доближи до леглото с .1 mm.) След като дюзата спре да се движи, избутайте хартията напред-назад, за да проверите дали дюзата е в контакт с хартията и да усетите степента на триене. Продължете да издавате команди TESTZ, докато не усетите малко количество триене при тестването с хартията.
pl: Polecenie TESTZ przesunie dyszę o względną odległość od bieżącej pozycji dyszy. (Tak więc `Z=-.1` żąda, aby dysza przesunęła się bliżej do stołu o .1 mm.) Po zatrzymaniu się dyszy, przesuwaj papier tam i z powrotem, aby sprawdzić, czy dysza styka się z papierem i aby poczuć tarcie. Kontynuuj wydawanie poleceń TESTZ, aż poczujesz niewielkie tarcie podczas testowania z papierem.
ta: டெச்ட்ச் கட்டளை முனை முனை தற்போதைய நிலையிலிருந்து ஒப்பீட்டு தூரத்தை நகர்த்தும். (எனவே, `Z =-. உராய்வின் அளவு. காகிதத்துடன் சோதனை செய்யும் போது ஒரு சிறிய அளவு உராய்வை உணரும் வரை டெச்ட்ச் கட்டளைகளை வழங்குவதைத் தொடரவும்.
uk: Команда TESTZ перемістить сопло на відносну відстань від поточного положення сопла. (Отже, `Z=-.1` вимагає, щоб насадка наблизилася до ліжка на 0,1 мм.) Після того, як насадка припинить рух, штовхніть папір вперед-назад, щоб перевірити, чи насадка торкається паперу, і відчути величина тертя. Продовжуйте видавати команди TESTZ, поки не відчуєте невелике тертя під час тестування з папером.

source: If too much friction is found then one can use a positive Z value to move the nozzle up. It is also possible to use `TESTZ Z=+` or `TESTZ Z=-` to "bisect" the last position - that is to move to a position half way between two positions. For example, if one received the following prompt from a TESTZ command:
bg: Ако се установи твърде голямо триене, може да се използва положителна стойност на Z, за да се премести дюзата нагоре. Възможно е също така да се използва `TESTZ Z=+` или `TESTZ Z=-`, за да се "бисектира" последната позиция - т.е. да се премести в позиция по средата между две позиции. Например, ако от команда TESTZ се получи следната подсказка:
pl: Jeśli tarcie jest zbyt duże, można użyć dodatniej wartości Z, aby przesunąć dyszę w górę. Można również użyć `TESTZ Z=+` lub `TESTZ Z=-`, aby "przeciąć" ostatnią pozycję - to znaczy przesunąć się do pozycji w połowie drogi między dwiema pozycjami. Na przykład, jeśli ktoś otrzymał następujący monit od polecenia TESTZ:
ta: அதிக உராய்வு காணப்பட்டால், ஒருவர் நேர்மறையான சட் மதிப்பைப் பயன்படுத்தலாம். `டெச்ட்ச் சட் =+` அல்லது `டெச்ட்ச் சட் = -` கடைசி நிலையை" பிரிக்க "பயன்படுத்தவும் முடியும் - அதாவது இரண்டு நிலைகளுக்கு இடையில் பாதி வழியில் செல்ல வேண்டும். எடுத்துக்காட்டாக, ஒரு டெச்ட்ச் கட்டளையிலிருந்து பின்வரும் வரியில் ஒருவர் பெற்றால்:
uk: Якщо виявлено занадто велике тертя, можна використовувати додатне значення Z, щоб перемістити сопло вгору. Також можна використовувати `TESTZ Z=+` або `TESTZ Z=-`, щоб «розділити» останню позицію навпіл, тобто перейти до позиції посередині між двома позиціями. Наприклад, якщо хтось отримав таке підказку від команди TESTZ:

source: Then a `TESTZ Z=-` would move the nozzle to a Z position of 0.180 (half way between 0.130 and 0.230). One can use this feature to help rapidly narrow down to a consistent friction. It is also possible to use `Z=++` and `Z=--` to return directly to a past measurement - for example, after the above prompt a `TESTZ Z=--` command would move the nozzle to a Z position of 0.130.
bg: След това с `TESTZ Z=-` дюзата ще се премести в позиция Z от 0,180 (половината път между 0,130 и 0,230). Човек може да използва тази функция, за да помогне за бързото ограничаване на постоянното триене. Възможно е също така да използвате `Z=++` и `Z=--`, за да се върнете директно към минало измерване - например, след горната подсказка командата `TESTZ Z=--` ще премести дюзата в позиция Z от 0,130.
pl: Wtedy `TESTZ Z=-` przesunęłoby dyszę do pozycji Z wynoszącej 0,180 (w połowie drogi między 0,130 a 0,230). Można użyć tej funkcji, aby szybko zawęzić do spójnego tarcia. Można również użyć `Z=++` i `Z=--`, aby powrócić bezpośrednio do poprzedniego pomiaru - na przykład po powyższym monicie polecenie `TESTZ Z=--` przesunęłoby dyszę do pozycji Z wynoszącej 0,130.
ta: பின்னர் ஒரு `டெச்ட்ச் சட் = -` முனை 0.180 (0.130 முதல் 0.230 க்கு இடையில் பாதி வழியில்) ஒரு சட் நிலைக்கு நகர்த்தும். இந்த அம்சத்தை ஒரு நிலையான உராய்வுக்கு விரைவாக குறைக்க உதவலாம். கடந்த கால அளவீட்டுக்குத் திரும்புவதற்கு `z = ++` மற்றும் `z =-` பயன்படுத்தவும் முடியும்-எடுத்துக்காட்டாக, மேலே உள்ள ஒரு `டெச்ட்ச் சட் =-` கட்டளை முனை ஒரு இசைக்கு நகர்த்தும் நிலை 0.130.
uk: Тоді `TESTZ Z=-` перемістить сопло в положення Z 0,180 (на півдорозі між 0,130 і 0,230). Можна використовувати цю функцію, щоб допомогти швидко звузити коло до постійного тертя. Також можна використовувати `Z=++` і `Z=--`, щоб повернутися безпосередньо до минулого вимірювання - наприклад, після наведеного вище підказки команда `TESTZ Z=--` перемістить сопло до Z положення 0,130.

source: After finding a small amount of friction run the ACCEPT command:
bg: След като откриете малко количество триене, изпълнете командата ACCEPT:
pl: Po znalezieniu niewielkiego tarcia uruchom polecenie ACCEPT:
ta: ஒரு சிறிய அளவு உராய்வைக் கண்டறிந்த பிறகு, ஏற்றுக்கொள்ளும் கட்டளையை இயக்கவும்:
uk: Після виявлення невеликої кількості тертя виконайте команду ACCEPT:

source: This will accept the given Z height and proceed with the given calibration tool.
bg: Това ще приеме зададената височина Z и ще продължи с дадения инструмент за калибриране.
pl: Spowoduje to zaakceptowanie podanej wysokości Z i przejście do podanego narzędzia kalibracyjnego.
ta: இது கொடுக்கப்பட்ட சட் உயரத்தை ஏற்றுக்கொண்டு கொடுக்கப்பட்ட அளவுத்திருத்த கருவியுடன் தொடரும்.
uk: Це прийме задану висоту Z і продовжить роботу з заданим інструментом калібрування.

source: The exact amount of friction felt isn't crucial, just as the amount of thermal expansion and exact width of the paper isn't crucial. Just try to obtain the same amount of friction each time one runs the test.
bg: Точният размер на усещаното триене не е от решаващо значение, точно както не е от решаващо значение размерът на топлинното разширение и точната ширина на хартията. Просто се опитайте да получите едно и също ниво на триене всеки път, когато провеждате теста.
pl: Dokładna ilość odczuwanego tarcia nie jest kluczowa, tak samo jak ilość rozszerzalności cieplnej i dokładna szerokość papieru nie są kluczowe. Po prostu staraj się uzyskać taką samą ilość tarcia za każdym razem, gdy przeprowadzasz test.
ta: வெப்ப விரிவாக்கத்தின் அளவு மற்றும் காகிதத்தின் சரியான அகலம் ஆகியவை முக்கியமானவை அல்ல என்பதால், உராய்வின் சரியான அளவு முக்கியமானது அல்ல. ஒவ்வொரு முறையும் ஒருவர் சோதனையை நடத்தும்போது அதே அளவு உராய்வைப் பெற முயற்சிக்கவும்.
uk: Точна величина тертя не має вирішального значення, так само як величина теплового розширення та точна ширина паперу не мають вирішального значення. Просто намагайтеся отримати однакову кількість тертя кожного разу, коли запускаєте тест.

source: If something goes wrong during the test, one can use the `ABORT` command to exit the calibration tool.
bg: Ако нещо се обърка по време на теста, можете да използвате командата `ABORT`, за да излезете от инструмента за калибриране.
pl: Jeżeli w trakcie testu coś pójdzie nie tak, można użyć polecenia `ABORT`, aby opuścić narzędzie kalibracji.
ta: சோதனையின் போது ஏதேனும் தவறு நடந்தால், அளவுத்திருத்த கருவியிலிருந்து வெளியேற `ABORT` கட்டளையைப் பயன்படுத்தலாம்.
uk: Якщо під час тесту щось піде не так, можна скористатися командою `ABORT`, щоб вийти з інструменту калібрування.

source: Determining Thermal Expansion
bg: Определяне на топлинното разширение
pl: Określanie rozszerzalności cieplnej
ta: வெப்ப விரிவாக்கத்தை தீர்மானித்தல்
uk: Визначення теплового розширення

source: This type of calculation is generally not needed as most users find the simple "paper test" provides good results.
bg: Този тип изчисления обикновено не са необходими, тъй като повечето потребители смятат, че простият "хартиен тест" дава добри резултати.
pl: Ten typ obliczeń nie jest zazwyczaj potrzebny, gdyż większość użytkowników uważa, że prosty "test papieru" daje dobre wyniki.
ta: பெரும்பாலான பயனர்கள் எளிமையான "காகித சோதனை" நல்ல முடிவுகளை வழங்குவதால் இந்த வகை கணக்கீடு பொதுவாக தேவையில்லை.
uk: Зазвичай цей тип обчислення не потрібен, оскільки більшість користувачів вважає, що простий «паперовий тест» дає хороші результати.

source: The easiest way to make this calculation is to print a test object that has straight walls on all sides. The large hollow square found in [docs/prints/square.stl](prints/square.stl) can be used for this. When slicing the object, make sure the slicer uses the same layer height and extrusion widths for the first level that it does for all subsequent layers. Use a coarse layer height (the layer height should be around 75% of the nozzle diameter) and do not use a brim or raft.
bg: Най-лесният начин да направите това изчисление е да отпечатате тестови обект, който има прави стени от всички страни. За целта може да се използва големият кух квадрат, който се намира в [docs/prints/square.stl](prints/square.stl). Когато нарязвате обекта, уверете се, че нарязващото устройство използва същата височина на слоя и ширина на екструдиране за първото ниво, както за всички следващи слоеве. Използвайте груба височина на слоя (височината на слоя трябва да е около 75% от диаметъра на дюзата) и не използвайте ръб или сал.
pl: Najprostszym sposobem wykonania tego obliczenia jest wydrukowanie obiektu testowego, który ma proste ściany ze wszystkich stron. Można do tego celu użyć dużego pustego kwadratu znalezionego w [docs/prints/square.stl](prints/square.stl). Podczas slicowania obiektu upewnij się, że slicer używa tej samej wysokości warstwy i szerokości linii dla pierwszej warstwy, co dla wszystkich kolejnych warstw. Użyj grubej wysokości warstwy (wysokość warstwy powinna wynosić około 75% średnicy dyszy) i nie używaj brimu ani raftu.
ta: இந்த கணக்கீட்டைச் செய்வதற்கான எளிதான வழி, எல்லா பக்கங்களிலும் நேராக சுவர்களைக் கொண்ட ஒரு சோதனை பொருளை அச்சிடுவதாகும். [டாக்ச்/அச்சிட்டுகள்/சதுக்கம். பொருளை வெட்டும்போது, ச்லைசர் அதே அடுக்கு உயரம் மற்றும் வெளியேற்ற அகலங்களை முதல் நிலைக்கு அடுத்தடுத்த அனைத்து அடுக்குகளுக்கும் பயன்படுத்துகிறது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். ஒரு கரடுமுரடான அடுக்கு உயரத்தைப் பயன்படுத்தவும் (அடுக்கு உயரம் முனை விட்டம் 75% ஆக இருக்க வேண்டும்) மற்றும் ஒரு விளிம்பு அல்லது படகைப் பயன்படுத்த வேண்டாம்.
uk: Найпростіший спосіб зробити цей розрахунок — надрукувати тестовий об’єкт, який має прямі стінки з усіх боків. Для цього можна використати великий порожнистий квадрат, знайдений у [docs/prints/square.stl](prints/square.stl). Розрізаючи об’єкт, переконайтеся, що слайсер використовує ту саму висоту шару та ширину екструзії для першого рівня, що й для всіх наступних шарів. Використовуйте грубу висоту шару (висота шару має становити близько 75% діаметра сопла) і не використовуйте краї або пліт.

source: Print the test object, wait for it to cool, and remove it from the bed. Inspect the lowest layer of the object. (It may also be useful to run a finger or nail along the bottom edge.) If one finds the bottom layer bulges out slightly along all sides of the object then it indicates the nozzle was slightly closer to the bed then it should be. One can issue a `SET_GCODE_OFFSET Z=+.010` command to increase the height. In subsequent prints one can inspect for this behavior and make further adjustment as needed. Adjustments of this type are typically in 10s of microns (.010mm).
bg: Отпечатайте тестовия обект, изчакайте да изстине и го извадете от леглото. Проверете най-долния слой на обекта. (Също така може да е полезно да прокарате пръст или нокът по долния ръб.) Ако установите, че долният слой е леко изпъкнал от всички страни на обекта, това означава, че дюзата е била малко по-близо до леглото, отколкото трябва. Може да се издаде команда `SET_GCODE_OFFSET Z=+.010`, за да се увеличи височината. При последващи разпечатки може да се провери това поведение и да се направи допълнителна настройка, ако е необходимо. Подобни корекции обикновено се извършват в десетки микрони (0,010 мм).
pl: Wydrukuj obiekt testowy, poczekaj, aż ostygnie, i zdejmij go ze stołu. Sprawdź najniższą warstwę obiektu. (Może być również przydatne przesunięcie palcem lub paznokciem wzdłuż dolnej krawędzi.) Jeśli zauważysz, że dolna warstwa lekko wybrzusza się wzdłuż wszystkich boków obiektu, oznacza to, że dysza była nieco za blisko stołu. Możesz wydać polecenie `SET_GCODE_OFFSET Z=+.010`, aby zwiększyć wysokość. W kolejnych wydrukach możesz sprawdzić to zachowanie i dokonać dalszych korekt w razie potrzeby. Korekty tego typu są zazwyczaj w dziesiątkach mikronów (.010 mm).
ta: சோதனை பொருளை அச்சிட்டு, அது குளிர்விக்கும் வரை காத்திருந்து, படுக்கையிலிருந்து அகற்றவும். பொருளின் மிகக் குறைந்த அடுக்கை ஆய்வு செய்யுங்கள். . உயரத்தை அதிகரிக்க ஒருவர் `set_gcode_offset சட் =+. 010` கட்டளையை வழங்கலாம். அடுத்தடுத்த அச்சிட்டுகளில் ஒருவர் இந்த நடத்தைக்கு ஆய்வு செய்யலாம் மற்றும் தேவைக்கேற்ப மேலும் சரிசெய்தல் செய்யலாம். இந்த வகையின் சரிசெய்தல் பொதுவாக 10s மைக்ரான்களில் (.010 மிமீ) இருக்கும்.
uk: Роздрукуйте тестовий об’єкт, зачекайте, поки він охолоне, і зніміть його з ложа. Огляньте нижній шар предмета. (Також може бути корисно провести пальцем або нігтем уздовж нижнього краю.) Якщо нижній шар злегка виступає вздовж усіх боків об’єкта, це означає, що сопло було трохи ближче до ложа, ніж повинно бути. Щоб збільшити висоту, можна виконати команду `SET_GCODE_OFFSET Z=+.010`. У наступних відбитках можна перевірити цю поведінку та за потреби внести додаткові коригування. Коригування цього типу, як правило, становить 10 мікрон (0,010 мм).

source: If the bottom layer consistently appears narrower than subsequent layers then one can use the SET_GCODE_OFFSET command to make a negative Z adjustment. If one is unsure, then one can decrease the Z adjustment until the bottom layer of prints exhibit a small bulge, and then back-off until it disappears.
bg: Ако долният слой постоянно изглежда по-тесен от следващите слоеве, можете да използвате командата SET_GCODE_OFFSET, за да направите отрицателна Z корекция. Ако не сте сигурни, можете да намалите корекцията Z, докато най-долният слой на отпечатъците не покаже малка изпъкналост, и след това да я намалите, докато изчезне.
pl: Jeśli dolna warstwa stale wydaje się grubsza niż kolejne warstwy, można użyć polecenia SET_GCODE_OFFSET, aby dokonać ujemnej korekty Z. Jeśli nie jest się pewnym, można zmniejszyć wartość korekty Z, aż dolna warstwa wydruków wykaże niewielkie wybrzuszenie, a następnie cofnąć się, aż zniknie.
ta: கீழ் அடுக்கு தொடர்ச்சியாக அடுத்தடுத்த அடுக்குகளை விட குறுகலாகத் தோன்றினால், எதிர்மறையான சட் சரிசெய்தல் செய்ய SET_GCODE_OFFSET கட்டளையைப் பயன்படுத்தலாம். ஒருவர் உறுதியாக தெரியாவிட்டால், அச்சிட்டுகளின் கீழ் அடுக்கு ஒரு சிறிய வீக்கத்தை வெளிப்படுத்தும் வரை சட் சரிசெய்தலைக் குறைக்கலாம், பின்னர் அது மறைந்துவிடும் வரை பின்வாங்கலாம்.
uk: Якщо нижній шар постійно здається вужчим, ніж наступні шари, можна використати команду SET_GCODE_OFFSET, щоб зробити негативне коригування Z. Якщо хтось не впевнений, можна зменшити коригування Z, доки нижній шар відбитків не покаже невелику опуклість, а потім відступити, доки вона не зникне.

source: The easiest way to apply the desired Z adjustment is to create a START_PRINT g-code macro, arrange for the slicer to call that macro during the start of each print, and add a SET_GCODE_OFFSET command to that macro. See the [slicers](Slicers.md) document for further details.
bg: Най-лесният начин за прилагане на желаната Z корекция е да се създаде макрос START_PRINT g-code, да се организира извикването на този макрос от режещата машина в началото на всяко отпечатване и да се добави командата SET_GCODE_OFFSET към този макрос. За повече подробности вижте документа [slicers](Slicers.md).
pl: Najprostszym sposobem zastosowania pożądanej korekty Z jest utworzenie makra g-code START_PRINT, skonfigurowanie wywołania tego makra przez slicer podczas rozpoczęcia każdego wydruku i dodanie polecenia SET_GCODE_OFFSET do tego makra. Więcej szczegółów można znaleźć w dokumencie [slicers](Slicers.md).
ta: விரும்பிய சட் சரிசெய்தலைப் பயன்படுத்துவதற்கான எளிதான வழி, ஒரு START_PRINT G-CODE மேக்ரோவை உருவாக்குவது, ஒவ்வொரு அச்சின் தொடக்கத்திலும் அந்த மேக்ரோவை அழைக்க ச்லைசருக்கு ஏற்பாடு செய்யுங்கள், மேலும் அந்த மேக்ரோவில் ஒரு SET_GCODE_OFFSET கட்டளையைச் சேர்க்கவும். மேலும் விவரங்களுக்கு [ச்லைசர்ச்] (ச்லீசர்ச்.எம்டி) ஆவணத்தைப் பார்க்கவும்.
uk: Найпростіший спосіб застосувати потрібне коригування Z — це створити макрос g-code START_PRINT, організувати виклик цього макросу зрізувачем на початку кожного друку та додати до цього макросу команду SET_GCODE_OFFSET. Додаткову інформацію див. у документі [slicers](Slicers.md).

source: Recv: // Starting manual Z probe. Use TESTZ to adjust position. Recv: // Finish with ACCEPT or ABORT command. Recv: // Z position: ?????? --> 5.000 <-- ??????
ta: RECV: // தொடக்க கையேடு சட் ஆய்வு. நிலையை சரிசெய்ய டெச்ட்சைப் பயன்படுத்தவும். RECV: // கட்டளையை ஏற்றுக்கொள் அல்லது கைவிடவும். Recv: // சட் நிலை: ??????? -> 5.000 <-???????
uk: Recv: // Запуск ручного Z-зонда. Використовуйте TESTZ для налаштування положення. Recv: // Завершити командою ACCEPT або ABORT. Recv: // Позиція Z: ?????? --> 5.000 <-- ??????

source: TESTZ Z=-.1
ta: சோதனை சட் =-

source: Recv: // Z position: 0.130 --> 0.230 <-- 0.280
ta: Recv: // சட் நிலை: 0.130-> 0.230 <-0.280

source: ACCEPT
ta: ஏற்றுக்கொள்
uk: ПРИЙНЯТИ

source: Bed leveling
bg: Изравняване на леглата
pl: Poziomowanie stołu
ta: படுக்கை சமநிலை
uk: Вирівнювання столу

source: In order to perform the paper test, cut a small rectangular piece of paper using a pair of scissors (eg, 5x3 cm). The paper generally has a thickness of around 100 microns (0.100mm). (The exact thickness of the paper isn't crucial.)
bg: За да извършите теста с хартия, изрежете малко правоъгълно парче хартия с помощта на ножица (например 5x3 cm). Дебелината на хартията обикновено е около 100 микрона (0,100 mm). (Точната дебелина на хартията не е от решаващо значение.)
pl: Aby wykonać test papieru, wytnij nożyczkami mały prostokątny kawałek papieru (np. 5x3 cm). Papier ma zazwyczaj grubość około 100 mikronów (0,100 mm). (Dokładna grubość papieru nie jest kluczowa.)
ta: காகித சோதனையைச் செய்ய, ஒரு இணை கத்தரிக்கோலைப் பயன்படுத்தி ஒரு சிறிய செவ்வக துண்டு காகிதத்தை வெட்டுங்கள் (எ.கா., 5x3 செ.மீ). காகிதத்தில் பொதுவாக 100 மைக்ரான் (0.100 மிமீ) தடிமன் உள்ளது. (காகிதத்தின் சரியான தடிமன் முக்கியமானது அல்ல.)
uk: Для виконання паперового тесту виріжте невеликий прямокутний аркуш паперу за допомогою ножиць (наприклад, 5x3 см). Папір зазвичай має товщину близько 100 мікрон (0,100 мм). (Точна товщина паперу не має вирішального значення.)
