Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: hu, ru

source: Most users will likely find that the visualizers included with applications such as Mainsail, Fluidd, and Octoprint are sufficient for basic analysis. However, Klipper's `scripts` folder contains the `graph_mesh.py` script that may be used to perform additional visualizations and more detailed analysis, particularly useful for debugging hardware or the results produced by `bed_mesh`:
hu: A legtöbb felhasználó valószínűleg úgy találja, hogy az olyan alkalmazásokhoz, mint a Mainsail, a Fluidd és az Octoprint mellékelt vizualizátorok elegendőek az alapvető elemzésekhez. A Klipper `scripts` mappája azonban tartalmazza a `graph_mesh.py` szkriptet, amely további vizualizációk és részletesebb elemzések elvégzéséhez használható, különösen hasznos a hardver vagy a `bed_mesh` által előállított eredmények hibakereséséhez:
ru: Большинство пользователей, скорее всего, сочтут, что визуализаторов, входящих в состав таких приложений, как Mainsail, Fluidd и Octoprint, достаточно для базового анализа. Однако в папке scripts Klipper находится скрипт `graph_mesh.py`, который можно использовать для дополнительной визуализации и более детального анализа, особенно полезного для отладки оборудования или результатов, полученных с помощью `bed_mesh`:

source: usage: graph_mesh.py [-h] {list,plot,analyze,dump} ... Graph Bed Mesh Data positional arguments: {list,plot,analyze,dump} list List available plot types plot Plot a specified type analyze Perform analysis on mesh data dump Dump API response to json file options: -h, --help show this help message and exit
hu: usage: graph_mesh.py [-h] {list,plot,analyze,dump} ... Ágy háló adatok grafikonja pozícionális érvek: {list,plot,analyze,dump} list Elérhető parcellatípusok listája plot Megadott típus ábrázolása analyze Elemzés elvégzése a hálóadatokon dump API-válasz kiürítése json fájlba options: -h, --help megjeleníti a súgóüzenetet és kilép

source: Pre-requisites
hu: Előfeltételek
ru: Пререквизиты

source: Like most graphing tools provided by Klipper, `graph_mesh.py` requires the `matplotlib` and `numpy` python dependencies. In addition, connecting to Klipper via Moonraker's websocket requires the `websockets` python dependency. While all visualizations can be output to an `svg` file, most of the visualizations offered by `graph_mesh.py` are better viewed in live preview mode on a desktop class PC. For example, the 3D visualizations may be rotated and zoomed in preview mode, and the path visualizations can optionally be animated in preview mode.
hu: A Klipper által biztosított legtöbb grafikus eszközhöz hasonlóan a `graph_mesh.py`-nak is szüksége van a `matplotlib` és a `numpy` python függőségekre. Ezen kívül a Klipper-hez a Moonraker websocketjén keresztül történő csatlakozáshoz a `websockets` python függőségre van szükség. Bár az összes vizualizáció kimenete `svg` fájlban is megjeleníthető, a `graph_mesh.py` által kínált legtöbb vizualizáció jobb, ha élő előnézeti módban, asztali számítógépen nézzük meg. Például a 3D-s megjelenítések előnézeti módban forgathatók és nagyíthatók, az útvonalak megjelenítése pedig opcionálisan animálható előnézeti módban.
ru: Как и большинство инструментов для построения графиков, предоставляемых Klipper, `graph_mesh.py` требует python-зависимости `matplotlib` и `numpy`. Кроме того, для подключения к Klipper через веб-сокет Moonraker требуется python-зависимость `websockets`. Хотя все визуализации могут быть выведены в файл `svg, большинство визуализаций, предлагаемых `graph_mesh.py`, лучше просматривать в режиме живого просмотра на настольном компьютере. Например, 3D-визуализации можно поворачивать и масштабировать в режиме предварительного просмотра, а визуализации путей могут быть анимированы в режиме предварительного просмотра.

source: Plotting Mesh data
hu: Hálóadatok ábrázolása
ru: Построение графика данных сетки

source: The `graph_mesh.py` tool can plot several types of visualizations. Available types can be shown by running `graph_mesh.py list`:
hu: A `graph_mesh.py` eszköz többféle vizualizáció készítésére képes. A rendelkezésre álló típusok a `graph_mesh.py list` futtatásával jeleníthetők meg:
ru: Инструмент `graph_mesh.py` может строить несколько типов визуализаций. Доступные типы можно посмотреть, выполнив команду `graph_mesh.py list`:

source: graph_mesh.py list points Plot original generated points path Plot probe travel path rapid Plot rapid scan travel path probedz Plot probed Z values meshz Plot mesh Z values overlay Plots the current probed mesh overlaid with a profile delta Plots the delta between current probed mesh and a profile
hu: graph_mesh.py list points Eredeti generált pontok ábrázolása path Szonda útvonalának megrajzolása rapid Gyors mérési útvonal megrajzolása probedz Vizsgált Z-értékek ábrázolása meshz Háló Z-értékeinek ábrázolása overlay Aktuális szondázott hálót egy profillal átfedve ábrázolja delta Aktuális szondázott háló és egy profil közötti delta ábrázolása

source: Several options are available when plotting visualizations:
hu: A megjelenítések ábrázolásakor számos lehetőség áll rendelkezésre:
ru: При построении визуализаций доступно несколько вариантов:

source: usage: graph_mesh.py plot [-h] [-a] [-s] [-p PROFILE_NAME] [-o OUTPUT] <plot type> <input> positional arguments: <plot type> Type of data to graph <input> Path/url to Klipper Socket or path to json file options: -h, --help show this help message and exit -a, --animate Animate paths in live preview -s, --scale-plot Use axis limits reported by Klipper to scale plot X/Y -p PROFILE_NAME, --profile-name PROFILE_NAME Optional name of a profile to plot for 'probedz' -o OUTPUT, --output OUTPUT Output file path
hu: usage: graph_mesh.py plot [-h] [-a] [-s] [-p PROFILE_NAME] [-o OUTPUT] <plot type> <input> pozícionális érvek: <plot type> Grafikusan ábrázolandó adatok típusa <input> A Klipper Socket elérési útvonala/url vagy a json fájl elérési útvonala opciók: -h, --help megjeleníti a súgóüzenetet és kilép -a, --animate Útvonalak animálása élő előnézetben -s, --scale-plot A Klipper által jelentett tengelyhatárok használata a plot X/Y skálázásához -p PROFILE_NAME, --profile-name PROFILE_NAME A 'probedz' számára ábrázolandó profil opcionális neve -o OUTPUT, --output OUTPUT Kimeneti fájl elérési útja

source: Below is a description of each argument:
hu: Az alábbiakban az egyes érvek leírása következik:
ru: Ниже приведено описание каждого аргумента:

source: `plot type`: A required positional argument designating the type of visualization to generate. Must be one of the types output by the `graph_mesh.py list` command.
hu: `plot type`: A létrehozandó vizualizáció típusát jelölő kötelező pozicionális argumentum. A `graph_mesh.py list` parancs által kiadott típusok egyikének kell lennie.
ru: `Тип участка`: Необходимый позиционный аргумент, указывающий тип генерируемой визуализации. Должен быть одним из типов, выводимых командой `graph_mesh.py list`.

source: `input`: A required positional argument containing a path or url to the input source. This must be one of the following:
hu: `bemenet`: A bemeneti forrás elérési útvonalát vagy URL-címét tartalmazó, kötelezően megadandó pozicionális argumentum. Ennek az alábbiak egyikének kell lennie:
ru: `ввод`: Обязательный позиционный аргумент, содержащий путь или url к источнику входных данных. Это должно быть одно из следующих значений:

source: A path to Klipper's Unix Domain Socket
hu: A Klipper Unix Domain Socket elérési útvonala
ru: Путь к Unix-доменному сокету Клиппера

source: A url to an instance of Moonraker
hu: Moonraker egy példányának URL-je
ru: url на экземпляр Moonraker

source: A path to a json file produced by `graph_mesh.py dump <input>`
hu: A `graph_mesh.py dump <input>` által előállított json fájl elérési útvonala
ru: Путь к json-файлу, создаваемому командой `graph_mesh.py dump <input>`

source: `-a`: Optional animation for the `path` and `rapid` visualization types. Animations only apply to a live preview.
hu: `-a`: Az `útvonal` és a `gyors` vizualizációs típusokhoz választható animáció. Az animációk csak az élő előnézetre vonatkoznak.
ru: `-a`: Необязательная анимация для типов визуализации `путь` и `скорость`. Анимация применяется только для живого предварительного просмотра.

source: `-s`: Optionally scales a plot using the `axis_minimum` and `axis_maximum` values reported by Klipper's `toolhead` object when the dump file was generated.
hu: `-s`: A Klipper `toolhead` objektuma által a dump fájl létrehozásakor jelentett `axis_minimum` és `axis_maximum` értékek segítségével méretezi a diagramot.
ru: `-s`: Опционально масштабирует график, используя значения `axis_minimum` и `axis_maximum`, сообщенные объектом Klipper `toolhead` при создании файла дампа.

source: `-p`: A profile name that may be specified when generating the `probedz` 3D mesh visualization. When generating an `overlay` or `delta` visualization this argument must be provided.
hu: `-p`: Egy profilnév, amelyet a `probedz` 3D háló vizualizáció generálásakor lehet megadni. Az `overlay` vagy `delta` vizualizáció generálásakor ezt az argumentumot meg kell adni.
ru: `-p`: Имя профиля, которое может быть указано при генерации 3D-визуализации сетки `probedz`. При генерации визуализации `overlay` или `delta` этот аргумент должен быть указан.

source: `-o`: An optional file path indicating that the script should save the visualization to this location rather than run in preview mode. Images are saved in `svg` format.
hu: `-o`: Egy opcionális fájl elérési útja, amely jelzi, hogy a szkriptnek a vizualizációt erre a helyre kell mentenie, nem pedig előnézeti módban futtatnia. A képek `svg` formátumban kerülnek mentésre.
ru: `-o`: Необязательный путь к файлу, указывающий, что скрипт должен сохранить визуализацию в этом месте, а не запускать в режиме предварительного просмотра. Изображения сохраняются в формате `svg`.

source: For example, to plot an animated rapid path, connecting via Klipper's unix socket:
hu: Például egy animált gyors útvonal megrajzolásához, a Klipper unix foglalatán keresztül csatlakozva:
ru: Например, чтобы построить анимированный быстрый путь, подключившись через unix-сокет Klipper:

source: Or to plot a 3d visualization of the mesh, connecting via Moonraker:
hu: A háló 3D-s vizualizációjának megrajzolásához, a Moonraker segítségével csatlakozva:
ru: Или постройте 3d-визуализацию сетки, подключившись через Moonraker:

source: Bed Mesh Analysis
hu: Ágy háló elemzés
ru: Анализ сетки кровати

source: The `graph_mesh.py` tool may also be used to perform an analysis on the data provided by the [bed_mesh/dump_mesh](#dumping-mesh-data) API:
hu: A `graph_mesh.py` eszköz használható a [bed_mesh/dump_mesh](#dumping-mesh-data) API által szolgáltatott adatok elemzéséhez is:
ru: Инструмент `graph_mesh.py` также может быть использован для анализа данных, предоставляемых API [bed_mesh/dump_mesh](#dumping-mesh-data):

source: As with the `plot` command, the `<input>` must be a path to Klipper's unix socket, a URL to an instance of Moonraker, or a path to a json file generated by the dump command.
hu: A `plot` parancshoz hasonlóan az `<input>` a Klipper unix socketjének elérési útvonala, a Moonraker egy példányának URL címe, vagy a dump parancs által generált json fájl elérési útvonala kell, hogy legyen.
ru: Как и в команде `plot`, `<input>` должен представлять собой путь к unix-сокету Klipper, URL-адрес экземпляра Moonraker или путь к json-файлу, сгенерированному командой dump.

source: To begin, the analysis will perform various checks on the points and probe paths generated by `bed_mesh` at the time of the dump. This includes the following:
hu: Kezdetben az elemzés különböző ellenőrzéseket végez a `bed_mesh` által a dump idején generált pontokon és mérések útvonalain. Ezek közé tartozik a következő:
ru: Для начала анализ выполнит различные проверки точек и траекторий зондов, сгенерированных `bed_mesh` во время создания дампа. К ним относятся следующие:

source: The number of probe points generated, without any additions
hu: A generált mérési pontok száma, kiegészítések nélkül
ru: Количество точек зондирования, созданных без каких-либо дополнений

source: The number of probe points generated including any points generated as the result faulty regions and/or a configured zero reference position.
hu: A generált mérési pontok száma, beleértve a hibás területek és a konfigurált nulla referenciapozíció eredményeként generált pontokat is.
ru: Количество сгенерированных точек зонда, включая любые точки, сгенерированные в результате неисправных областей и/или сконфигурированного нулевого опорного положения.

source: The number of probe points generated when performing a rapid scan.
hu: A gyors mérések során generált mérőpontok száma.
ru: Количество точек зондирования, создаваемых при выполнении быстрого сканирования.

source: The total number of moves generated for a rapid scan.
hu: A gyors méréshez generált mozgások teljes száma.
ru: Общее количество ходов, созданных для быстрого сканирования.

source: A validation that the probe points generated for a rapid scan are identical to the probe points generated for a standard probing procedure.
hu: Annak igazolása, hogy a gyors méréshez generált mérőpontok megegyeznek a szabvány mérési eljáráshoz generált mérőpontokkal.
ru: Проверка того, что точки зондирования, созданные для быстрого сканирования, идентичны точкам зондирования, созданным для стандартной процедуры зондирования.

source: A "backtracking" check for both the standard probe path and a rapid scan path. Backtracking can be defined as moving to the same position more than once during the probing procedure. Backtracking should never occur during a standard probe. Faulty regions *can* result in backtracking during a rapid scan in an attempt to avoid entering a faulty region when approaching or leaving a probe location, however should never occur otherwise.
hu: A "visszalépés" ellenőrzése mind a szabványos mérőút, mind a gyors mérési útvonal esetében. A visszalépés úgy definiálható, hogy a mérési eljárás során többször is elmozdul ugyanabba a pozícióba. A visszalépés soha nem fordulhat elő normál mérés során. A hibás régiók *visszalépést* eredményezhetnek a gyors mérés során, hogy elkerüljék a hibás régióba való belépést, amikor megközelítik vagy elhagyják a mérési helyet, de soha nem fordulhat elő másként.
ru: Проверка "обратного хода" как для стандартной траектории зондирования, так и для траектории быстрого сканирования. Обратный ход можно определить как перемещение в одну и ту же позицию более одного раза во время процедуры зондирования. Обратный путь никогда не должен возникать во время стандартного зондирования. Неисправные области *могут* привести к отступлению во время быстрого сканирования в попытке избежать попадания в неисправную область при приближении или удалении от места зондирования, однако в противном случае этого не должно происходить.

source: Next each probed mesh present in the dump will by analyzed, beginning with the mesh loaded at the time of the dump (if present) and followed by any saved profiles. The following data is extracted:
hu: Ezután minden, a dump-ban lévő mért háló elemzésre kerül, kezdve a kiíráskor betöltött hálóval (ha van), majd az esetleges mentett profilokkal. A következő adatok kerülnek kinyerésre:
ru: Далее анализируется каждая зондируемая сетка, присутствующая в дампе, начиная с сетки, загруженной во время дампа (если она присутствует), и затем все сохраненные профили. Извлекаются следующие данные:

source: Mesh shape (Min X,Y, Max X,Y Probe Count)
hu: Háló alakja (min. X,Y, max. X,Y mérésszám)
ru: Форма сетки (минимальное количество зондов X,Y, максимальное количество зондов X,Y)

source: Mesh Z range, (Minimum Z, Maximum Z)
hu: Háló Z tartomány, (Minimum Z, Maximum Z)
ru: Диапазон Z сетки, (минимальный Z, максимальный Z)

source: Mean Z value in the mesh
hu: Átlagos Z érték a hálóban
ru: Среднее значение Z в сетке

source: Standard Deviation of the Z values in the Mesh
hu: A szabvány Z-értékek szórása a hálóban
ru: Стандартное отклонение значений Z в сетке

source: In addition to the above, a delta analysis is performed between meshes with the same shape, reporting the following:
hu: A fentieken kívül delta-analízist végeznek az azonos alakú hálók között, amely a következőket jelenti:
ru: Кроме того, между сетками одинаковой формы проводится дельта-анализ, который дает следующие результаты:

source: The range of the delta between to meshes (Minimum and Maximum)
hu: A delta tartománya a hálók között (Minimum és Maximum)
ru: Диапазон дельты между сетками (минимум и максимум)

source: The mean delta
hu: Az átlagos delta
ru: Средняя дельта

source: Standard Deviation of the delta
hu: A delta szabványos szórása
ru: Стандартное отклонение дельты

source: The absolute maximum difference
hu: Az abszolút maximális különbség
ru: Абсолютная максимальная разница

source: The absolute mean
hu: Az abszolút átlag
ru: Среднее абсолютное значение

source: Save mesh data to a file
hu: A hálóadatok mentése fájlba
ru: Сохраните данные сетки в файл

source: The `dump` command may be used to save the response to a file which can be shared for analysis when troubleshooting:
hu: A `dump` paranccsal a válasz menthető egy fájlba, amely megosztható elemzés céljából a hibaelhárítás során:
ru: Команда `dump` может быть использована для сохранения ответа в файл, который можно использовать для анализа при устранении неполадок:

source: The `<input>` should be a path to Klipper's unix socket or a URL to an instance of Moonraker. The `-o` option may be used to specify the path to the output file. If omitted, the file will be saved in the working directory, with a file name in the following format:
hu: A `<input>` a Klipper unix socketjének elérési útja, vagy a Moonraker egy példányának URL-je. A "-o" opció használható a kimeneti fájl elérési útjának megadására. Ha kihagyod, a fájl a munkakönyvtárba kerül mentésre, a következő formátumú fájlnévvel:
ru: Параметр `<input>` должен представлять собой путь к unix-сокету Klipper или URL-адрес экземпляра Moonraker. Опция `-o` может быть использована для указания пути к выходному файлу. Если опция опущена, файл будет сохранен в рабочем каталоге с именем в следующем формате:

source: `BED_MESH_PROFILE REMOVE=default`
ru: `BED_MESH_PROFILE REMOVE=по умолчанию`

source: `ALGORITHM`
ru: `АЛГОРИТМ`

source: `ADAPTIVE`
ru: `АДАПТИВНОСТЬ`

source: `BED_MESH_OFFSET [X=<value>] [Y=<value>] [ZFADE=<value>]`
ru: `BED_MESH_OFFSET [X=<значение>] [Y=<значение>] [ZFADE=<значение>]`

source: `{"id": 123, "method": "bed_mesh/dump_mesh"}`
ru: `{" идентификатор": 123, "метод": "bed_mesh/dump_mesh"}`.
