Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: hu, ru

source: Basic Configuration
hu: Alapvető konfiguráció
ru: Основные настройки

source: Rectangular Beds
hu: Téglalap alakú tárgyasztalok
ru: Прямоугольные Кровати

source: This example assumes a printer with a 250 mm x 220 mm rectangular bed and a probe with an x-offset of 24 mm and y-offset of 5 mm.
hu: Ez a példa egy 250 mm x 220 mm-es téglalap alakú tárgyasztalú nyomtatót és egy 24 mm-es x-eltolású és 5 mm-es y-eltolású szondát mutat.
ru: В этом примере предполагается, что принтер имеет прямоугольную станину размером 250 x 220 мм и датчик со смещением по оси x 24 мм и по оси y 5 мм.

source: `speed: 120` *Default Value: 50* The speed in which the tool moves between points.
hu: `speed: 120` * Alapértelmezett érték: 50* A sebesség, amellyel a fej a pontok között mozog.
ru: `speed: 120` *Default Value: 50* Скорость, с которой инструмент перемещается между точками.

source: `horizontal_move_z: 5` *Default Value: 5* The Z coordinate the probe rises to prior to traveling between points.
hu: `horizontal_move_z: 5` *Alapértelmezett érték: 5* A Z koordináta, amelyre a szonda a mérőpontok közötti utazás előtt emelkedik.
ru: `horizontal_move_z: 5` *Default Value: 5* Координата Z, по которой поднимается зонд перед перемещением между точками.

source: The illustration below demonstrates how the `mesh_min`, `mesh_max`, and `probe_count` options are used to generate probe points. The arrows indicate the direction of the probing procedure, beginning at `mesh_min`. For reference, when the probe is at `mesh_min` the nozzle will be at (11, 1), and when the probe is at `mesh_max`, the nozzle will be at (206, 193).
hu: Az alábbi ábra azt mutatja, hogy a `mesh_min`, `mesh_max` és `probe_count` opciók hogyan használhatók a mérőpontok létrehozására. A nyilak jelzik a mérési eljárás irányát, kezdve a `mesh_min` ponttól. Hivatkozásképpen, amikor a szonda a `mesh_min` pontnál van, a fúvóka a (11, 1) pontnál lesz, és amikor a szonda a `mesh_max` pontnál van, a fúvóka a (206, 193) pontnál lesz.
ru: На рисунке ниже показано, как опции `mesh_min`, `mesh_max` и `probe_count` используются для генерации точек зондирования. Стрелки указывают направление процедуры зондирования, начиная с точки `mesh_min`. Для примера, когда зонд находится в точке `mesh_min`, сопло будет находиться в точке (11, 1), а когда зонд находится в точке `mesh_max`, сопло будет находиться в точке (206, 193).

source: Round beds
hu: Kerek tárgyasztalok
ru: Круглые лежаки

source: This example assumes a printer equipped with a round bed radius of 100mm. We will use the same probe offsets as the rectangular example, 24 mm on X and 5 mm on Y.
hu: Ez a példa egy 100 mm-es kerek tárgyasztallal felszerelt nyomtatót feltételez. Ugyanazokat a szondaeltolásokat fogjuk használni, mint a téglalap alakú példánál, 24 mm-t X-en és 5 mm-t Y-on.
ru: В этом примере предполагается, что принтер оснащен круглой станиной радиусом 100 мм. Мы будем использовать те же смещения датчиков, что и в прямоугольном примере: 24 мм по оси X и 5 мм по оси Y.

source: `mesh_radius: 75` *Required* The radius of the probed mesh in mm, relative to the `mesh_origin`. Note that the probe's offsets limit the size of the mesh radius. In this example, a radius larger than 76 would move the tool beyond the range of the printer.
hu: `mesh_radius: 75` *Required* A vizsgált háló sugara mm-ben, a `mesh_origin`-hez képest. Vedd figyelembe, hogy a szonda eltolásai korlátozzák a háló sugarának méretét. Ebben a példában a 76-nál nagyobb sugár a szerszámot a nyomtató hatótávolságán kívülre helyezné.
ru: `mesh_radius: 75` *Required* Радиус сетки зонда в мм относительно `mesh_origin`. Обратите внимание, что смещение зонда ограничивает размер радиуса сетки. В данном примере радиус, превышающий 76, выведет инструмент за пределы диапазона принтера.

source: `round_probe_count: 5` *Default Value: 5* This is an integer value that defines the maximum number of probed points along the X and Y axes. By "maximum", we mean the number of points probed along the mesh origin. This value must be an odd number, as it is required that the center of the mesh is probed.
hu: `round_probe_count: 5` *Alapértelmezett érték: 5* Ez egy egész szám, amely meghatározza az X és Y tengely mentén mért pontok maximális számát. A "maximális" alatt a háló origója mentén mért pontok számát értjük. Ennek az értéknek páratlan számnak kell lennie, mivel a háló középpontját kell megvizsgálni.
ru: `round_probe_count: 5` *Значение по умолчанию: 5* Это целочисленное значение, определяющее максимальное количество точек, прощупываемых по осям X и Y. Под "максимальным" подразумевается количество точек, прощупываемых вдоль начала сетки. Это значение должно быть нечетным, так как требуется, чтобы центр сетки был прозондирован.

source: Advanced Configuration
hu: Speciális konfiguráció
ru: Расширенная конфигурация

source: Below the more advanced configuration options are explained in detail. Each example will build upon the basic rectangular bed configuration shown above. Each of the advanced options apply to round beds in the same manner.
hu: Az alábbiakban részletesen ismertetjük a fejlettebb konfigurációs lehetőségeket. Minden példa a fent bemutatott téglalap alakú alapkonfigurációra épül. A speciális lehetőségek mindegyike ugyanúgy alkalmazható a kerek tárgyasztalokra is.
ru: Ниже подробно описаны более сложные варианты конфигурации. Каждый пример основан на базовой конфигурации прямоугольной кровати, показанной выше. Все дополнительные опции аналогичным образом применяются к круглым кроватям.

source: Mesh Interpolation
hu: Háló interpoláció
ru: Интерполяция сетки

source: `algorithm: lagrange` *Default Value: lagrange* The algorithm used to interpolate the mesh. May be `lagrange` or `bicubic`. Lagrange interpolation is capped at 6 probed points as oscillation tends to occur with a larger number of samples. Bicubic interpolation requires a minimum of 4 probed points along each axis, if less than 4 points are specified then lagrange sampling is forced. If `mesh_pps` is set to 0 then this value is ignored as no mesh interpolation is done.
hu: `algorithm: lagrange` * Alapértelmezett érték: lagrange* A háló interpolálásához használt algoritmus. Lehet `lagrange` vagy `bicubic`. A Lagrange-interpoláció 6 szondázott pontnál van korlátozva, mivel nagyobb számú minta esetén oszcilláció lép fel. A bikubik interpolációhoz mindkét tengely mentén legalább 4 szondázott pont szükséges, ha 4 pontnál kevesebb van megadva, akkor a Lagrange mintavételezés kikényszerül. Ha a `mesh_pps` 0-ra van állítva, akkor ez az érték figyelmen kívül marad, mivel nem történik hálóinterpoláció.
ru: `алгоритм: lagrange` *Значение по умолчанию: lagrange* Алгоритм, используемый для интерполяции сетки. Может быть `lagrange` или `bicubic`. Интерполяция Лагранжа ограничена 6 точками зондирования, так как при большем количестве выборок возникают колебания. Бикубическая интерполяция требует минимум 4 точки вдоль каждой оси, если указано менее 4 точек, то выборка по Лагранжу будет принудительной. Если `mesh_pps` установлено в 0, то это значение игнорируется, так как интерполяция сетки не выполняется.

source: `bicubic_tension: 0.2` *Default Value: 0.2* If the `algorithm` option is set to bicubic it is possible to specify the tension value. The higher the tension the more slope is interpolated. Be careful when adjusting this, as higher values also create more overshoot, which will result in interpolated values higher or lower than your probed points.
hu: `bicubic_tension: 0.2` *Alapértelmezett érték: 0.2* Ha az `algorithm` opció bicubic-ra van állítva, akkor lehet megadni a feszültség értékét. Minél nagyobb a feszültség, annál nagyobb meredekséget interpolál. Legyél óvatos ennek beállításakor, mivel a magasabb értékek több túlhúzást is eredményeznek, ami a mért pontoknál magasabb vagy alacsonyabb interpolált értékeket eredményez.
ru: `bicubic_tension: 0.2` *Значение по умолчанию: 0.2* Если опция `алгоритм` установлена на bicubic, то можно указать значение натяжения. Чем выше натяжение, тем больше наклон интерполируется. Будьте осторожны при настройке этого параметра, так как более высокие значения также создают большую перегрузку, что приведет к тому, что интерполированные значения будут выше или ниже, чем ваши измеренные точки.

source: The illustration below shows how the options above are used to generate an interpolated mesh.
hu: Az alábbi ábra azt mutatja, hogy a fenti opciókat hogyan használjuk egy interpolált háló létrehozásához.
ru: На рисунке ниже показано, как перечисленные выше параметры используются для создания интерполированной сетки.

source: Move Splitting
hu: Mozgás felosztás
ru: Разделение движений

source: `move_check_distance: 5` *Default Value: 5* The minimum distance to check for the desired change in Z before performing a split. In this example, a move longer than 5mm will be traversed by the algorithm. Each 5mm a mesh Z lookup will occur, comparing it with the Z value of the previous move. If the delta meets the threshold set by `split_delta_z`, the move will be split and traversal will continue. This process repeats until the end of the move is reached, where a final adjustment will be applied. Moves shorter than the `move_check_distance` have the correct Z adjustment applied directly to the move without traversal or splitting.
hu: `move_check_distance: 5` *Alapértelmezett érték: 5* A minimális távolság, amellyel a kívánt Z-változást ellenőrizni kell a felosztás végrehajtása előtt. Ebben a példában az 5 mm-nél hosszabb mozgást fog az algoritmus végigjárni. Minden 5 mm-enként egy háló Z mérés történik, összehasonlítva azt az előző lépés Z értékével. Ha a delta eléri a `split_delta_z` által beállított küszöbértéket, akkor a mozgás felosztásra kerül, és a bejárás folytatódik. Ez a folyamat addig ismétlődik, amíg a lépés végére nem érünk, ahol egy végső kiigazítás történik. A `move_check_distance` értéknél rövidebb mozgásoknál a helyes Z kiigazítást közvetlenül a mozgásra alkalmazzák, áthaladás vagy felosztás nélkül.
ru: `move_check_distance: 5` *Значение по умолчанию: 5* Минимальное расстояние для проверки желаемого изменения Z перед выполнением разбиения. В данном примере алгоритм будет проверять перемещения длиной более 5 мм. Через каждые 5 мм будет выполняться поиск Z сетки, сравнивая его со значением Z предыдущего хода. Если дельта соответствует порогу, заданному параметром `split_delta_z`, ход будет разделен и обход продолжится. Этот процесс повторяется до тех пор, пока не будет достигнут конец перемещения, где будет применена окончательная корректировка. К перемещениям, длина которых меньше `move_check_distance`, правильная корректировка Z применяется непосредственно к перемещению без обхода или разбиения.

source: `split_delta_z: .025` *Default Value: .025* As mentioned above, this is the minimum deviation required to trigger a move split. In this example, any Z value with a deviation +/- .025mm will trigger a split.
hu: `split_delta_z: .025` *Alapértelmezett érték: .025* Mint fentebb említettük, ez a minimális eltérés szükséges a mozgás felosztásának elindításához. Ebben a példában bármely Z-érték +/- .025 mm eltérés kiváltja a felosztást.
ru: `split_delta_z: .025` *Значение по умолчанию: .025* Как упоминалось выше, это минимальное отклонение, необходимое для запуска разделения движения. В данном примере любое значение Z с отклонением +/- .025 мм вызовет сплит.

source: Mesh Fade
hu: Háló elhalványulás
ru: Сетчатый оттенок

source: When "fade" is enabled Z adjustment is phased out over a distance defined by the configuration. This is accomplished by applying small adjustments to the layer height, either increasing or decreasing depending on the shape of the bed. When fade has completed, Z adjustment is no longer applied, allowing the top of the print to be flat rather than mirror the shape of the bed. Fade also may have some undesirable traits, if you fade too quickly it can result in visible artifacts on the print. Also, if your bed is significantly warped, fade can shrink or stretch the Z height of the print. As such, fade is disabled by default.
hu: Ha a "fade" engedélyezve van, a Z-beállítás a konfiguráció által meghatározott távolságon belül fokozatosan megszűnik. Ez a rétegmagasság kis kiigazításával érhető el, a tárgyasztal alakjától függően növelve vagy csökkentve. Ha a fade befejeződött, a Z-beállítás már nem kerül alkalmazásra, így a nyomtatás teteje sík lesz, nem pedig a tárgyasztal alakját tükrözi. A fakításnak lehetnek nemkívánatos tulajdonságai is, ha túl gyorsan fakít, akkor látható leleteket eredményezhet a nyomaton. Továbbá, ha a tárgyasztal jelentősen megvetemedett, a fade zsugoríthatja vagy megnyújthatja a nyomat Z magasságát. Ezért a fade alapértelmezés szerint ki van kapcsolva.
ru: Когда включено "затухание", регулировка Z постепенно уменьшается на расстояние, определенное конфигурацией. Это достигается путем применения небольших корректировок высоты слоя, которые либо увеличиваются, либо уменьшаются в зависимости от формы ложа. По окончании затухания регулировка Z больше не применяется, что позволяет верхней части отпечатка быть плоской, а не зеркально отражать форму ложа. Затухание также может иметь некоторые нежелательные свойства: если затухать слишком быстро, это может привести к появлению видимых артефактов на отпечатке. Кроме того, если ваша кровать сильно деформирована, затухание может уменьшить или растянуть высоту Z отпечатка. Поэтому по умолчанию затухание отключено.

source: `fade_start: 1` *Default Value: 1* The Z height in which to start phasing out adjustment. It is a good idea to get a few layers down before starting the fade process.
hu: `fade_start: 1` *Alapértelmezett érték: 1* A Z magasság, amelyben a fokozatos kiigazítást el kell kezdeni. Jó ötlet, ha a fade folyamat megkezdése előtt néhány réteggel lejjebb kerül.
ru: `fade_start: 1` *Значение по умолчанию: 1* Высота Z, с которой следует начинать постепенное выравнивание. Перед началом процесса затухания рекомендуется спустить несколько слоев.

source: `fade_end: 10` *Default Value: 0* The Z height in which fade should complete. If this value is lower than `fade_start` then fade is disabled. This value may be adjusted depending on how warped the print surface is. A significantly warped surface should fade out over a longer distance. A near flat surface may be able to reduce this value to phase out more quickly. 10mm is a sane value to begin with if using the default value of 1 for `fade_start`.
hu: `fade_end: 10` *Alapértelmezett érték: 0* A Z magasság, amelyben a fade-nek be kell fejeződnie. Ha ez az érték kisebb, mint `fade_start` akkor a fade le van tiltva. Ezt az értéket a nyomtatási felület torzulásától függően lehet módosítani. Egy jelentősen görbült felületnek hosszabb távon kell elhalványulnia. Egy közel sík felület esetében ez az érték csökkenthető, hogy gyorsabban fakuljon ki. A 10 mm egy ésszerű érték, ha a `fade_start` alapértelmezett 1 értékét használjuk.
ru: `fade_end: 10` *Значение по умолчанию: 0* Высота Z, на которой должно завершиться затухание. Если это значение меньше, чем `fade_start`, то затухание будет отключено. Это значение может быть изменено в зависимости от того, насколько деформирована поверхность печати. Сильно деформированная поверхность должна затухать на большем расстоянии. На почти плоской поверхности это значение можно уменьшить, чтобы затухание происходило быстрее. 10 мм - разумное значение для начала, если использовать значение по умолчанию 1 для `fade_start`.

source: Faulty Regions
hu: Hibás régiók
ru: Неисправные регионы

source: It is possible for some areas of a bed to report inaccurate results when probing due to a "fault" at specific locations. The best example of this are beds with series of integrated magnets used to retain removable steel sheets. The magnetic field at and around these magnets may cause an inductive probe to trigger at a distance higher or lower than it would otherwise, resulting in a mesh that does not accurately represent the surface at these locations. **Note: This should not be confused with probe location bias, which produces inaccurate results across the entire bed.**
hu: Előfordulhat, hogy a tárgyasztal egyes területei pontatlan eredményeket jeleznek a mérés során, mivel bizonyos helyeken "hiba" van. Erre a legjobb példa a levehető acéllemezek rögzítésére használt integrált mágnesek sorozatával ellátott tárgyasztalok. Ezeknél a mágneseknél és körülöttük lévő mágneses mező hatására az induktív szonda magasabb vagy alacsonyabb távolságban mérhet, mint egyébként tenné, ami azt eredményezi, hogy a háló nem pontosan reprezentálja a felületet ezeken a helyeken. **Figyelem: Ez nem tévesztendő össze a szonda helyének torzításával, amely pontatlan eredményeket eredményez az egész tárgyasztalon.**
ru: Некоторые участки кровати могут показывать неточные результаты при зондировании из-за "неисправности" в определенных местах. Лучшим примером этого являются кровати с рядом встроенных магнитов, используемых для удержания съемных стальных листов. Магнитное поле на этих магнитах и вокруг них может заставить индуктивный датчик сработать на расстоянии выше или ниже, чем в противном случае, что приведет к получению сетки, которая неточно отображает поверхность в этих местах. **Примечание: Не следует путать это со смещением местоположения датчика, которое приводит к неточным результатам по всему слою**

source: The `faulty_region` options may be configured to compensate for this affect. If a generated point lies within a faulty region bed mesh will attempt to probe up to 4 points at the boundaries of this region. These probed values will be averaged and inserted in the mesh as the Z value at the generated (X, Y) coordinate.
hu: A `faulty_region` opciókat úgy lehet beállítani, hogy kompenzálják ezt a hatást. Ha egy generált pont egy hibás régióba esik, akkor a bed mesh megpróbál akár 4 pontot is megvizsgálni a régió határainál. Ezeket a mért értékeket átlagolja és beilleszti a hálóba Z értékben a generált (X, Y) koordinátán.
ru: Опции `faulty_region` могут быть настроены для компенсации этого влияния. Если сгенерированная точка находится в неисправной области, сетка попытается прощупать до 4 точек на границах этой области. Эти значения будут усреднены и вставлены в сетку как значение Z в сгенерированной координате (X, Y).

source: `faulty_region_{1...99}_min` `faulty_region_{1..99}_max` *Default Value: None (disabled)* Faulty Regions are defined in a way similar to that of mesh itself, where minimum and maximum (X, Y) coordinates must be specified for each region. A faulty region may extend outside of a mesh, however the alternate points generated will always be within the mesh boundary. No two regions may overlap.
hu: `faulty_region_{1...99}_min` `faulty_region_{1...99}_max` *Alapértelmezett érték: Nincs (letiltva)* A hibás régiók meghatározása hasonlóan történik, mint magának a hálónak a meghatározása, ahol minden egyes régióhoz meg kell adni a minimális és maximális (X, Y) koordinátákat. Egy hibás régió a hálón kívülre is kiterjedhet, azonban a generált váltakozó pontok mindig a háló határán belül lesznek. Két régió nem fedheti egymást.
ru: `faulty_region_{1...99}_min` `faulty_region_{1..99}_max` *Значение по умолчанию: None (отключено)* Дефектные регионы определяются аналогично сетке, где для каждого региона должны быть указаны минимальные и максимальные координаты (X, Y). Неисправный регион может выходить за пределы сетки, однако генерируемые альтернативные точки всегда будут находиться в границах сетки. Два региона не могут пересекаться.

source: The image below illustrates how replacement points are generated when a generated point lies within a faulty region. The regions shown match those in the sample config above. The replacement points and their coordinates are identified in green.
hu: Az alábbi kép azt szemlélteti, hogyan generálódnak a cserepontok, ha egy generált pont egy hibás területen belül van. Az ábrázolt régiók megegyeznek a fenti mintakonfigurációban szereplő régiókkal. A cserepontok és koordinátáik zöld színnel vannak jelölve.
ru: На изображении ниже показано, как генерируются точки замены, если сгенерированная точка находится в неисправном регионе. Показанные области соответствуют областям в приведенном выше примере конфигурации. Точки замены и их координаты выделены зеленым цветом.

source: Bed Mesh Gcodes
hu: Tárgyasztal háló G-kódok
ru: Кроватная сетка Gcodes

source: Calibration
hu: Kalibráció
ru: Калибровка

source: It is possible to specify mesh parameters to modify the probed area. The following parameters are available:
hu: Lehetőség van hálóparaméterek megadására a mért terület módosítására. A következő paraméterek állnak rendelkezésre:
ru: Можно задать параметры сетки, чтобы изменить зондируемую область. Доступны следующие параметры:

source: Rectangular beds (cartesian):
hu: Téglalap alakú tárgyasztalok (cartesian):
ru: Прямоугольные кровати (картезианские):

source: Round beds (delta):
hu: Kerek tárgyasztalok (delta):
ru: Круглые кровати (дельта):

source: All beds:
hu: Minden tárgyasztal:
ru: Все кровати:

source: Profiles
hu: Profilok
ru: Профили

source: Any other saved profile can be removed in the same fashion, replacing *default* with the named profile you wish to remove.
hu: Bármely más elmentett profil ugyanígy eltávolítható, a *default* helyettesítve az eltávolítani kívánt névvel.
ru: Любой другой сохраненный профиль можно удалить таким же образом, заменив * по умолчанию* на именованный профиль, который вы хотите удалить.

source: Output
hu: Kimenet
ru: Выход

source: Outputs the current mesh state to the terminal. Note that the mesh itself is output
hu: Az aktuális hálóállapotot adja ki a terminálra. Vegyük észre, hogy maga a háló is kimenetre kerül
ru: Выводит текущее состояние сетки на терминал. Обратите внимание, что сама сетка выводится

source: The PGP parameter is shorthand for "Print Generated Points". If `PGP=1` is set, the generated probed points will be output to the terminal:
hu: A PGP paraméter a "Print Generated Points" rövidítése. Ha `PGP=1` van beállítva, a generált mért pontok a terminálra kerülnek:
ru: Параметр PGP - это сокращение от "Print Generated Points". Если задано `PGP=1`, сгенерированные точки зондирования будут выводиться на терминал:

source: The "Tool Adjusted" points refer to the nozzle location for each point, and the "Probe" points refer to the probe location. Note that when manually probing the "Probe" points will refer to both the tool and nozzle locations.
hu: A "Tool Adjusted" pontok az egyes pontok fúvókájának helyére, a "Probe" pontok pedig a szonda helyére utalnak. Vedd figyelembe, hogy kézi mérés esetén a "Probe" pontok mind a szerszám, mind a fúvóka helyére vonatkoznak.
ru: Точки "Инструмент настроен" относятся к местоположению сопла для каждой точки, а точки "Зонд" - к местоположению зонда. Обратите внимание, что при ручном зондировании точки " Зонд" будут относиться как к месту расположения инструмента, так и к месту расположения сопла.

source: Clear Mesh State
hu: Tiszta hálós állapot
ru: Очистить состояние сетки

source: This gcode may be used to clear the internal mesh state.
hu: Ez a G-kód használható a belső háló állapotának törlésére.
ru: Этот код можно использовать для очистки внутреннего состояния сетки.

source: Apply X/Y offsets
hu: X/Y eltolások alkalmazása
ru: Применить смещение по оси X/Y

source: Bed Mesh
hu: Tárgyasztal háló
ru: Сетка стола

source: Initiates the probing procedure for Bed Mesh Calibration.
hu: Mérési eljárást indítása a tárgyasztal háló kalibrálásához.
ru: Запускает процедуру зондирования для калибровки сетки кровати.
