Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Level.po
Languages: bg, pl, ta, uk

source: Bed leveling (sometimes also referred to as "bed tramming") is critical to getting high quality prints. If a bed is not properly "leveled" it can lead to poor bed adhesion, "warping", and subtle problems throughout the print. This document serves as a guide to performing bed leveling in Klipper.
bg: Изравняването на леглото (понякога наричано още "трамбоване на леглото") е от решаващо значение за получаването на висококачествени разпечатки. Ако леглото не е правилно "изравнено", това може да доведе до лоша адхезия на леглото, "изкривяване" и фини проблеми по време на разпечатването. Този документ служи като ръководство за извършване на изравняване на леглото в Klipper.
pl: Poziomowanie stołu jest kluczowe w otrzymywaniu dobrej jakości wydruków. Jeżeli stół jest nieprawidłowo "wypoziomowany" prowadzi to do słabej adhezji filamentu, podwijania krawędzi obiektów i drobnych problemów przez cały wydruk .Ten dokument pokazuje jak wykonać poziomowanie stołu w systemie Klipper.
ta: படுக்கை சமப்படுத்துதல் (சில நேரங்களில் "படுக்கை மிதித்தல்" என்றும் குறிப்பிடப்படுகிறது) உயர்தர அச்சிட்டுகளைப் பெறுவதற்கு முக்கியமானது. ஒரு படுக்கை சரியாக "சமன் செய்யப்படாவிட்டால்" அது மோசமான படுக்கை ஒட்டுதல், "போரிடுதல்" மற்றும் அச்சு முழுவதும் நுட்பமான சிக்கல்களுக்கு வழிவகுக்கும். இந்த ஆவணம் கிளிப்பரில் படுக்கை சமநிலைப்படுத்துவதற்கான வழிகாட்டியாக செயல்படுகிறது.
uk: Вирівнювання ліжка (іноді його також називають «переміщенням ліжка») має вирішальне значення для отримання високоякісних відбитків. Якщо ложе неправильно «вирівняно», це може призвести до поганої адгезії ложа, «викривлення» та незначних проблем по всьому друку. Цей документ служить посібником для виконання вирівнювання ліжка в Klipper.

source: It's important to understand the goal of bed leveling. If the printer is commanded to a position `X0 Y0 Z10` during a print, then the goal is for the printer's nozzle to be exactly 10mm from the printer's bed. Further, should the printer then be commanded to a position of `X50 Z10` the goal is for the nozzle to maintain an exact distance of 10mm from the bed during that entire horizontal move.
bg: Важно е да разберете каква е целта на изравняването на леглото. Ако по време на отпечатване принтерът е командван в позиция `X0 Y0 Z10`, тогава целта е дюзата на принтера да бъде точно на 10 mm от леглото на принтера. Освен това, ако след това принтерът бъде командван в позиция `X50 Z10`, целта е дюзата да поддържа точното разстояние от 10 mm от леглото по време на цялото хоризонтално движение.
pl: Bardzo ważne jest zrozumienie celu poziomowania stołu. Jeśli drukarka otrzyma komendę `X0 Y0 Z10` podczas wydruku , wtedy celem dla drukarki jest utrzymanie dyszy dokładnie 10mm nad stołem. Dając kolejną komendę `X50 Z10` celem jest utrzymanie stałej wysokości 10mm między stołem a głowicą podczas wykonywania ruchu.
ta: படுக்கை சமநிலையின் இலக்கைப் புரிந்துகொள்வது முதன்மை. அச்சுப்பொறியின் படுக்கையில் இருந்து சரியாக 10 மிமீ ஆக இருக்கும் அச்சுப்பொறியின் முனை சரியாக 10 மி.மீ. மேலும்.
uk: Важливо розуміти мету вирівнювання грядки. Якщо під час друку принтер отримує команду перейти в положення `X0 Y0 Z10`, тоді мета полягає в тому, щоб сопло принтера було рівно 10 мм від станини принтера. Крім того, якщо потім принтеру буде надано команду перейти в положення "X50 Z10", мета полягає в тому, щоб сопло підтримувало точну відстань 10 мм від ліжка протягом усього цього горизонтального руху.

source: In order to get good quality prints the printer should be calibrated so that Z distances are accurate to within about 25 microns (.025mm). This is a small distance - significantly smaller than the width of a typical human hair. This scale can not be measured "by eye". Subtle effects (such as heat expansion) impact measurements at this scale. The secret to getting high accuracy is to use a repeatable process and to use a leveling method that leverages the high accuracy of the printer's own motion system.
bg: За да се получат разпечатки с добро качество, принтерът трябва да бъде калибриран така, че разстоянията Z да са с точност до около 25 микрона (0,025 мм). Това е малко разстояние - значително по-малко от ширината на типичен човешки косъм. Този мащаб не може да се измери "на око". Незначителни ефекти (като топлинното разширение) оказват влияние върху измерванията в този мащаб. Тайната за постигане на висока точност е да се използва повторяем процес и метод за нивелиране, който използва високата точност на собствената система за движение на принтера.
pl: W celu uzyskania dobrej jakości wydruków drukarka powinna być skalibrowana tak, aby odległości Z były dokładne z dokładnością do około 25 mikronów (.025mm). Jest to niewielka odległość - znacznie mniejsza niż szerokość typowego ludzkiego włosa. Skala ta nie może być mierzona "na oko". Subtelne efekty (takie jak rozszerzalność cieplna) wpływają na pomiary w tej skali. Sekretem uzyskania wysokiej dokładności jest zastosowanie powtarzalnego procesu oraz metody poziomowania, która wykorzystuje wysoką dokładność własnego systemu ruchu drukarki.
ta: நல்ல தரமான அச்சிட்டுகளைப் பெறுவதற்கு அச்சுப்பொறியை அளவீடு செய்ய வேண்டும், இதனால் சட் தூரங்கள் சுமார் 25 மைக்ரான் (.025 மிமீ) க்குள் துல்லியமாக இருக்கும். இது ஒரு சிறிய தூரம் - ஒரு பொதுவான மனித முடியின் அகலத்தை விட கணிசமாக சிறியது. இந்த அளவை "கண்ணால்" அளவிட முடியாது. இந்த அளவில் நுட்பமான விளைவுகள் (வெப்ப விரிவாக்கம் போன்றவை) தாக்க அளவீடுகள். அதிக துல்லியத்தைப் பெறுவதற்கான மறைபொருள், மீண்டும் மீண்டும் செய்யக்கூடிய செயல்முறையைப் பயன்படுத்துவதும், அச்சுப்பொறியின் சொந்த இயக்க அமைப்பின் உயர் துல்லியத்தை மேம்படுத்தும் ஒரு சமநிலை முறையைப் பயன்படுத்துவதும் ஆகும்.
uk: Для отримання якісних відбитків принтер слід відкалібрувати так, щоб відстані Z були з точністю приблизно до 25 мікрон (0,025 мм). Це невелика відстань - значно менша за ширину звичайної людської волосини. Цей масштаб неможливо виміряти «на око». Незначні ефекти (наприклад, теплове розширення) впливають на вимірювання в цьому масштабі. Секрет досягнення високої точності полягає у використанні повторюваного процесу та методі вирівнювання, який використовує високу точність власної системи руху принтера.

source: Choose the appropriate calibration mechanism
bg: Избор на подходящ механизъм за калибриране
pl: Wybierz odpowiedni mechanizm kalibracji
ta: பொருத்தமான அளவுத்திருத்த பொறிமுறையைத் தேர்வுசெய்க
uk: Виберіть відповідний механізм калібрування

source: Different types of printers use different methods for performing bed leveling. All of them ultimately depend on the "paper test" (described below). However, the actual process for a particular type of printer is described in other documents.
bg: При различните видове принтери се използват различни методи за изравняване на леглото. Всички те в крайна сметка зависят от "теста с хартия" (описан по-долу). Действителният процес за определен тип принтер обаче е описан в други документи.
pl: Różne typy drukarek stosują różne metody poziomowania stołu. Wszystkie ostatecznie zależą od „testu papierowego” (opisanego poniżej). Jednak faktyczny proces dla określonego typu drukarki jest opisany w innych dokumentach.
ta: வெவ்வேறு வகையான அச்சுப்பொறிகள் படுக்கை சமநிலைப்படுத்துவதற்கு வெவ்வேறு முறைகளைப் பயன்படுத்துகின்றன. அவை அனைத்தும் இறுதியில் "காகித சோதனை" (கீழே விவரிக்கப்பட்டுள்ளன) சார்ந்துள்ளது. இருப்பினும், ஒரு குறிப்பிட்ட வகை அச்சுப்பொறிக்கான உண்மையான செயல்முறை மற்ற ஆவணங்களில் விவரிக்கப்பட்டுள்ளது.
uk: Різні типи принтерів використовують різні методи для вирівнювання ложа. Усі вони зрештою залежать від «паперового тесту» (описаного нижче). Проте фактичний процес для конкретного типу принтера описано в інших документах.

source: Prior to running any of these calibration tools, be sure to run the checks described in the [config check document](Config_checks.md). It is necessary to verify basic printer motion before performing bed leveling.
bg: Преди да стартирате който и да е от тези инструменти за калибриране, не забравяйте да извършите проверките, описани в документа [Config check document](Config_checks.md). Необходимо е да се провери основното движение на принтера, преди да се извърши изравняване на леглото.
pl: Przed uruchomieniem któregokolwiek z tych narzędzi kalibracyjnych, należy wykonać kontrole opisane w [dokumencie sprawdzania konfiguracji](Config_checks.md). Przed wykonaniem poziomowania stołu konieczne jest sprawdzenie podstawowych ruchów drukarki.
ta: இந்த அளவுத்திருத்த கருவிகளில் ஏதேனும் ஒன்றை இயக்குவதற்கு முன்பு, [கட்டமைப்பு காசோலை ஆவணம்] (config_checks.md) இல் விவரிக்கப்பட்டுள்ள காசோலைகளை இயக்க மறக்காதீர்கள். படுக்கை சமநிலைப்படுத்துவதற்கு முன் அடிப்படை அச்சுப்பொறி இயக்கத்தை சரிபார்க்க வேண்டியது தேவை.
uk: Перш ніж запускати будь-який із цих інструментів калібрування, обов’язково виконайте перевірки, описані в [документі перевірки конфігурації](Config_checks.md). Необхідно перевірити основний рух принтера перед виконанням вирівнювання станини.

source: For printers with an "automatic Z probe" be sure to calibrate the probe following the directions in the [Probe Calibrate](Probe_Calibrate.md) document. For delta printers, see the [Delta Calibrate](Delta_Calibrate.md) document. For printers with bed screws and traditional Z endstops, see the [Manual Level](Manual_Level.md) document.
bg: За принтери с "автоматична Z-сонда" не забравяйте да калибрирате сондата, като следвате указанията в документа [Probe Calibrate](Probe_Calibrate.md). За делта-принтерите вижте документа [Delta Calibrate](Delta_Calibrate.md). За принтери с винтове за леглото и традиционни крайни ограничители Z, вижте документа [Ръчно ниво](Manual_Level.md).
pl: W przypadku drukarek z "automatyczną sondą Z" należy skalibrować sondę zgodnie z instrukcjami w dokumencie [Probe Calibrate](Probe_Calibrate.md). W przypadku drukarek delta należy zapoznać się z dokumentem [Delta Calibrate](Delta_Calibrate.md). W przypadku drukarek ze śrubami stołu i tradycyjnymi krańcówkami Z należy zapoznać się z dokumentem [Manual Level](Manual_Level.md).
ta: "தானியங்கி சட் ஆய்வு" கொண்ட அச்சுப்பொறிகளுக்கு [ஆய்வு அளவீடு] (probe_calibrate.md) ஆவணத்தில் உள்ள திசைகளைப் பின்பற்றும் ஆய்வை அளவீடு செய்ய மறக்காதீர்கள். டெல்டா அச்சுப்பொறிகளுக்கு, [டெல்டா அளவீடு] (டெல்டா_கலிபிரேட். எம்.டி) ஆவணத்தைப் பார்க்கவும். படுக்கை திருகுகள் மற்றும் பாரம்பரிய சட் எண்ட்ச்டாப்புகளைக் கொண்ட அச்சுப்பொறிகளுக்கு, [கையேடு நிலை] (Manual_level.md) ஆவணத்தைப் பார்க்கவும்.
uk: Для принтерів із «автоматичним зондом Z» обов’язково відкалібруйте датчик, дотримуючись вказівок у документі [Probe Calibrate](Probe_Calibrate.md). Щодо дельта-принтерів див. документ [Delta Calibrate](Delta_Calibrate.md). Інформацію про принтери з кріпильними гвинтами та традиційними торцевими упорами Z див. у документі [Manual Level](Manual_Level.md).

source: During calibration it may be necessary to set the printer's Z `position_min` to a negative number (eg, `position_min = -2`). The printer enforces boundary checks even during calibration routines. Setting a negative number allows the printer to move below the nominal position of the bed, which may help when trying to determine the actual bed position.
bg: По време на калибрирането може да се наложи да се зададе отрицателно число за Z `позиция_min` на принтера (например `позиция_min = -2`). Принтерът налага гранични проверки дори по време на процедурите за калибриране. Задаването на отрицателно число позволява на принтера да се движи под номиналната позиция на леглото, което може да помогне, когато се опитвате да определите действителната позиция на леглото.
pl: Podczas kalibracji może być konieczne ustawienie `position_min` osi Z drukarki na liczbę ujemną (np. `position_min = -2`). Drukarka wymusza sprawdzanie granic nawet podczas procedur kalibracji. Ustawienie liczby ujemnej pozwala drukarce na opuszczenie się poniżej nominalnej pozycji stołu, co może być pomocne podczas próby określenia rzeczywistej pozycji stołu.
ta: அளவுத்திருத்தத்தின் போது அச்சுப்பொறியின் சட் `pasition_min` ஐ எதிர்மறை எண்ணாக அமைக்க வேண்டியது தேவை (எ.கா.,` நிலை_மின் = -2`). அளவுத்திருத்த நடைமுறைகளின் போது கூட அச்சுப்பொறி எல்லை சோதனைகளை செயல்படுத்துகிறது. எதிர்மறை எண்ணை அமைப்பது அச்சுப்பொறியை படுக்கையின் பெயரளவு நிலைக்கு கீழே செல்ல அனுமதிக்கிறது, இது உண்மையான படுக்கை நிலையை தீர்மானிக்க முயற்சிக்கும்போது உதவக்கூடும்.
uk: Під час калібрування може знадобитися встановити для Z `position_min` принтера від’ємне число (наприклад, `position_min = -2`). Принтер перевіряє межі навіть під час калібрування. Встановлення від’ємного числа дозволяє принтеру рухатися нижче номінального положення станини, що може допомогти під час спроби визначити фактичне положення станини.

source: The "paper test"
bg: "Тестът на хартия"
pl: "Test papieru"
ta: "காகித சோதனை"
uk: «Паперовий тест»

source: The primary bed calibration mechanism is the "paper test". It involves placing a regular piece of "copy machine paper" between the printer's bed and nozzle, and then commanding the nozzle to different Z heights until one feels a small amount of friction when pushing the paper back and forth.
bg: Основният механизъм за калибриране на леглото е "тестът с хартия". Той включва поставяне на обикновено парче "копирна хартия" между леглото и дюзата на принтера, след което дюзата се командва на различни височини Z, докато се усети малко триене при бутане на хартията напред-назад.
pl: Podstawowym mechanizmem kalibracji łoża jest "test papieru". Polega on na umieszczeniu kartki papieru między stołem drukarki a dyszą, a następnie na ustawieniu dyszy na różnych wysokościach, aż poczuje się niewielki opór podczas przesuwania papieru tam i z powrotem.
ta: முதன்மை படுக்கை அளவுத்திருத்த வழிமுறை "காகித சோதனை" ஆகும். இது அச்சுப்பொறியின் படுக்கைக்கும் முனை இடையே ஒரு வழக்கமான "நகல் இயந்திர காகிதத்தை" வைப்பதை உள்ளடக்குகிறது, பின்னர் காகிதத்தை முன்னும் பின்னுமாக தள்ளும்போது ஒரு சிறிய அளவு உராய்வை உணரும் வரை முனை வெவ்வேறு சட் உயரங்களுக்கு கட்டளையிடுவதை உள்ளடக்குகிறது.
uk: Основним механізмом калібрування шару є «тест на папері». Це включає в себе розміщення звичайного шматка «копіювального паперу» між станиною принтера та соплом, а потім керування соплом на різній висоті Z, доки не відчується невелике тертя під час штовхання паперу вперед і назад.

source: It is important to understand the "paper test" even if one has an "automatic Z probe". The probe itself often needs to be calibrated to get good results. That probe calibration is done using this "paper test".
bg: Важно е да се разбере "хартиеният тест", дори ако човек разполага с "автоматична Z-сонда". Самата сонда често трябва да се калибрира, за да се получат добри резултати. Това калибриране на сондата се извършва с помощта на този "хартиен тест".
pl: Ważne jest zrozumienie "testu papieru", nawet jeśli ktoś ma "automatyczną sondę osi Z". Sama sonda często musi zostać skalibrowana, aby uzyskać dobre wyniki. Kalibracja sondy odbywa się za pomocą tego właśnie "testu papieru".
ta: ஒருவருக்கு "தானியங்கி சட் ஆய்வு" இருந்தாலும் "காகித சோதனை" புரிந்துகொள்வது முதன்மை. நல்ல முடிவுகளைப் பெற ஆய்வு பெரும்பாலும் அளவீடு செய்யப்பட வேண்டும். இந்த "காகித சோதனையை" பயன்படுத்தி அந்த ஆய்வு அளவுத்திருத்தம் செய்யப்படுகிறது.
uk: Важливо розуміти «паперовий тест», навіть якщо у вас є «автоматичний Z-зонд». Для отримання хороших результатів сам зонд часто потребує калібрування. Це калібрування зонда виконується за допомогою цього «паперового тесту».

source: The first step of the paper test is to inspect the printer's nozzle and bed. Make sure there is no plastic (or other debris) on the nozzle or bed.
bg: Първата стъпка от теста на хартията е да се проверят дюзата и леглото на принтера. Уверете се, че по дюзата или леглото няма пластмаса (или други замърсявания).
pl: Pierwszym krokiem testu papieru jest inspekcja dyszy i stołu drukarki. Upewnij się, że na dyszy lub stole nie ma plastiku (ani innych zanieczyszczeń).
ta: காகித சோதனையின் முதல் படி அச்சுப்பொறியின் முனை மற்றும் படுக்கையை ஆய்வு செய்வதாகும். முனை அல்லது படுக்கையில் பிளாச்டிக் (அல்லது பிற குப்பைகள்) இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Першим кроком перевірки паперу є перевірка сопла та ложа принтера. Переконайтеся, що на насадці чи ложі немає пластику (або іншого сміття).

source: **Inspect the nozzle and bed to ensure no plastic is present!**
bg: **Огледайте дюзата и леглото, за да се уверите, че няма наличие на пластмаса!**
pl: **Sprawdź dyszę i stół, aby upewnić się, że nie ma tam plastiku!**
ta: ** பிளாச்டிக் இல்லை என்பதை உறுதிப்படுத்த முனை மற்றும் படுக்கையை ஆய்வு செய்யுங்கள்! **
uk: **Огляньте сопло та ложе, щоб переконатися, що немає пластику!**

source: If there is plastic on the nozzle then heat up the extruder and use a metal tweezers to remove that plastic. Wait for the extruder to fully cool to room temperature before continuing with the paper test. While the nozzle is cooling, use the metal tweezers to remove any plastic that may ooze out.
bg: Ако върху дюзата има пластмаса, загрейте екструдера и използвайте метална пинсета, за да я отстраните. Изчакайте екструдерът да се охлади напълно до стайна температура, преди да продължите с теста на хартия. Докато дюзата се охлажда, използвайте металната пинсета, за да отстраните пластмасата, която може да изтече.
pl: Jeśli na dyszy znajduje się plastik, podgrzej głowicę i usuń plastik metalową pęsetą. Poczekaj, aż głowica całkowicie ostygnie do temperatury pokojowej, zanim przejdziesz do testu papieru. Podczas chłodzenia dyszy usuń plastik, który mógł wycieknąć, metalową pęsetą.
ta: முனை மீது பிளாச்டிக் இருந்தால், எக்ச்ட்ரூடரை சூடாக்கி, அந்த பிளாச்டிக்கை அகற்ற ஒரு உலோக சாமணம் பயன்படுத்தவும். காகித சோதனையைத் தொடர்வதற்கு முன் எக்ச்ட்ரூடர் அறை வெப்பநிலையை முழுமையாக குளிர்விக்கும் வரை காத்திருங்கள். முனை குளிர்ச்சியாக இருக்கும்போது, உலோக சாமணம் பயன்படுத்தவும், வெளியேறக்கூடிய எந்த பிளாச்டிக்கையும் அகற்றவும்.
uk: Якщо на соплі є пластик, нагрійте екструдер і використовуйте металевий пінцет, щоб видалити цей пластик. Зачекайте, поки екструдер повністю охолоне до кімнатної температури, перш ніж продовжувати перевірку паперу. Поки насадка охолоджується, використовуйте металевий пінцет, щоб видалити будь-який пластик, який може просочитися.

source: **Always perform the paper test when both nozzle and bed are at room temperature!**
bg: **Винаги извършвайте теста на хартията, когато и дюзата, и леглото са на стайна температура!**
pl: **Zawsze wykonuj test papieru, gdy dysza i stół mają temperaturę pokojową!**
ta: ** முனை மற்றும் படுக்கை இரண்டும் அறை வெப்பநிலையில் இருக்கும்போது எப்போதும் காகித சோதனையைச் செய்யுங்கள்! **
uk: **Завжди виконуйте тест на папері, коли і сопло, і ложе мають кімнатну температуру!**

source: It may seem odd to calibrate the distance at room temperature when the goal is to have a consistent distance when heated. However, if one calibrates when the nozzle is heated, it tends to impart small amounts of molten plastic on to the paper, which changes the amount of friction felt. That makes it harder to get a good calibration. Calibrating while the bed/nozzle is hot also greatly increases the risk of burning oneself. The amount of thermal expansion is stable, so it is easily accounted for later in the calibration process.
bg: Може да ви се стори странно да калибрирате разстоянието при стайна температура, когато целта е да постигнете еднакво разстояние при нагряване. Въпреки това, ако се калибрира, когато дюзата е нагрята, има тенденция да се отделят малки количества разтопена пластмаса върху хартията, което променя усещането за триене. Това затруднява получаването на добро калибриране. Калибрирането, докато леглото/дюзата са горещи, също увеличава значително риска от изгаряне. Големината на топлинното разширение е стабилна, така че лесно се отчита по-късно в процеса на калибриране.
pl: Może wydawać się dziwne kalibrowanie odległości w temperaturze pokojowej, gdy celem jest uzyskanie stałej odległości po podgrzaniu. Jednak jeśli kalibruje się, gdy dysza jest podgrzana, ma ona tendencję do wyciekania niewielkich ilości stopionego plastiku na papier, co zmienia ilość odczuwanego tarcia. Utrudnia to uzyskanie dobrej kalibracji. Kalibrowanie, gdy stół/dysza są gorące, również znacznie zwiększa ryzyko poparzenia. Ilość rozszerzalności cieplnej jest jednolita, więc można ją łatwo uwzględnić później w procesie kalibracji.
ta: அறை வெப்பநிலையில் தூரத்தை அளவீடு செய்வது ஒற்றைப்படை என்று தோன்றலாம். இருப்பினும், முனை வெப்பமடையும் போது ஒருவர் அளவீடு செய்தால், அது சிறிய அளவிலான உருகிய பிளாச்டிக் காகிதத்தில் வழங்க முனைகிறது, இது உணரப்பட்ட உராய்வின் அளவை மாற்றுகிறது. இது ஒரு நல்ல அளவுத்திருத்தத்தைப் பெறுவது கடினமானது. படுக்கை/முனை சூடாக இருக்கும்போது அளவீடு செய்வது தன்னை எரிக்கும் அபாயத்தை பெரிதும் அதிகரிக்கிறது. வெப்ப விரிவாக்கத்தின் அளவு நிலையானது, எனவே இது பின்னர் அளவுத்திருத்த செயல்பாட்டில் எளிதில் கணக்கிடப்படுகிறது.
uk: Може здатися дивним калібрувати відстань за кімнатної температури, коли мета полягає в тому, щоб мати постійну відстань при нагріванні. Однак, якщо виконати калібрування, коли сопло нагріте, воно має тенденцію додавати невелику кількість розплавленого пластику на папір, що змінює рівень тертя. Це ускладнює отримання хорошого калібрування. Калібрування, коли ліжко/насадка гарячі, також значно підвищує ризик отримання опіків. Величина теплового розширення є стабільною, тому її легко врахувати пізніше в процесі калібрування.

source: **Use an automated tool to determine precise Z heights!**
bg: **Използвайте автоматичен инструмент за определяне на точните Z височини!**
pl: **Użyj zautomatyzowanego narzędzia do określenia dokładnych wysokości Z!**
ta: ** துல்லியமான சட் உயரங்களை தீர்மானிக்க தானியங்கி கருவியைப் பயன்படுத்தவும்! **
uk: **Використовуйте автоматизований інструмент, щоб визначити точну висоту Z!**

source: Klipper has several helper scripts available (eg, MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). See the documents [described above](#choose-the-appropriate-calibration-mechanism) to choose one of them.
bg: Klipper разполага с няколко помощни скрипта (например MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). Вижте документите [описани по-горе](#choose-the-appropriate-calibration-mechanism), за да изберете един от тях.
pl: Klipper ma kilka skryptów pomocniczych (np. MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). Zobacz dokumenty [opisane powyżej](#choose-the-appropriate-calibration-mechanism), aby wybrać jeden z nich.
ta: கிளிப்பரில் பல உதவி ச்கிரிப்ட்கள் உள்ளன (எ.கா., கையேடு_ப்ரோப், Z_ENDSTOP_CALIBRATE, Probe_Calibrate, டெல்டா_கலிபிரேட்). அவற்றில் ஒன்றைத் தேர்வுசெய்ய ஆவணங்களை [மேலே விவரிக்கப்பட்டுள்ளது] (#தேர்வு-பொருத்தமான-அளவுத்திருத்த-மெக்கானிசம்) காண்க.
uk: Klipper має кілька доступних допоміжних сценаріїв (наприклад, MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). Перегляньте документи [описані вище](#choose-the-appropriate-calibration-mechanism), щоб вибрати один із них.

source: Run the appropriate command in the OctoPrint terminal window. The script will prompt for user interaction in the OctoPrint terminal output. It will look something like:
bg: Изпълнете съответната команда в терминалния прозорец на OctoPrint. Скриптът ще поиска взаимодействие от потребителя в изхода на терминала OctoPrint. Той ще изглежда по следния начин:
pl: Uruchom odpowiednie polecenie w oknie terminala OctoPrint. Skrypt poprosi o interakcję użytkownika w wyjściu terminala OctoPrint. Będzie wyglądać mniej więcej tak:
ta: ஆக்டோபிரிண்ட் முனைய சாளரத்தில் பொருத்தமான கட்டளையை இயக்கவும். ச்கிரிப்ட் ஆக்டோப்ரிண்ட் முனைய வெளியீட்டில் பயனர் தொடர்புக்கு கேட்கப்படும். இது அப்படி இருக்கும்:
uk: Виконайте відповідну команду у вікні терміналу OctoPrint. Сценарій запропонує користувачу взаємодіяти у вихідних даних терміналу OctoPrint. Це буде виглядати приблизно так:
