Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: hu, ru

source: Bed Mesh works by intercepting gcode move commands and applying a transform to their Z coordinate. Long moves must be split into smaller moves to correctly follow the shape of the bed. The options below control the splitting behavior.
hu: A tárgyasztal háló úgy működik, hogy megkapja a G-kód mozgatási parancsokat és transzformációt alkalmaz a Z koordinátájukra. A hosszú mozgásokat kisebb mozgásokra kell bontani, hogy helyesen kövessék a tárgyasztal alakját. Az alábbi opciók a felosztási viselkedést szabályozzák.
ru: Bed Mesh работает, перехватывая команды перемещения gcode и применяя трансформацию к их координате Z. Длинные перемещения должны быть разбиты на более мелкие, чтобы правильно следовать форме кровати. Опции ниже управляют поведением разбиения.

source: Prior to Mesh Calibration you will need to be sure that your Probe's Z-Offset is calibrated. If using an endstop for Z homing it will need to be calibrated as well. See [Probe Calibrate](Probe_Calibrate.md) and Z_ENDSTOP_CALIBRATE in [Manual Level](Manual_Level.md) for more information.
hu: A hálókalibrálás előtt meg kell győződnöd arról, hogy a szonda Z-eltolása kalibrálva van. Ha végállást használsz a Z-kezdőponthoz, akkor azt is kalibrálni kell. További információkért lásd a [Szonda Kalibrálás](Probe_Calibrate.md) és a Z_ENDSTOP_CALIBRATE című fejezetben a [Kézi Szintezést](Manual_Level.md).
ru: Перед калибровкой сетки необходимо убедиться, что Z-смещение зонда откалибровано. Если для наведения по Z используется концевой упор, его также необходимо откалибровать. Дополнительные сведения см. в разделе [Калибровка зонда](Probe_Calibrate.md) и Z_ENDSTOP_CALIBRATE в разделе [Ручной уровень](Manual_Level.md).

source: See the configuration documentation above for details on how each parameter applies to the mesh.
hu: Az egyes paraméterek hálóra való alkalmazásának részleteit lásd a fenti konfigurációs dokumentációban.
ru: Подробную информацию о том, как каждый параметр применяется к сетке, смотрите в документации по конфигурации выше.

source: After a BED_MESH_CALIBRATE has been performed, it is possible to save the current mesh state into a named profile. This makes it possible to load a mesh without re-probing the bed. After a profile has been saved using `BED_MESH_PROFILE SAVE=<name>` the `SAVE_CONFIG` gcode may be executed to write the profile to printer.cfg.
hu: A BED_MESH_CALIBRATE elvégzése után lehetőség van a háló aktuális állapotának elmentésére egy megnevezett profilba. Ez lehetővé teszi a háló betöltését a tárgyasztal újbóli mérése nélkül. Miután egy profilt a `BED_MESH_PROFILE SAVE=<name>` segítségével elmentettünk, a `SAVE_CONFIG` G-kód végrehajtható a profil printer.cfg fájlba való írásához.
ru: После выполнения BED_MESH_CALIBRATE можно сохранить текущее состояние сетки в именованном профиле. Это позволяет загрузить сетку без повторного зондирования кровати. После сохранения профиля с помощью команды `BED_MESH_PROFILE SAVE=<имя>` может быть выполнен код `SAVE_CONFIG` для записи профиля в файл printer.cfg.

source: Profiles can be loaded by executing `BED_MESH_PROFILE LOAD=<name>`.
hu: A profilok a `BED_MESH_PROFILE LOAD=<name>` parancs végrehajtásával tölthetők be.
ru: Профили можно загрузить, выполнив команду `BED_MESH_PROFILE LOAD=<имя>`.

source: `mesh_min: 35, 6` *Required* The first probed coordinate, nearest to the origin. This coordinate is relative to the probe's location.
hu: `mesh_min: 35, 6` *Ajánlott* Az első, az origóhoz legközelebbi koordináta. Ez a koordináta a szonda helyéhez képest relatív.
ru: `mesh_min: 35, 6` *Обязательно* Первая координата зонда, ближайшая к началу координат. Эта координата является относительной по отношению к местоположению зонда.

source: `probe_count: 5, 3` *Default Value: 3, 3* The number of points to probe on each axis, specified as X, Y integer values. In this example 5 points will be probed along the X axis, with 3 points along the Y axis, for a total of 15 probed points. Note that if you wanted a square grid, for example 3x3, this could be specified as a single integer value that is used for both axes, ie `probe_count: 3`. Note that a mesh requires a minimum probe_count of 3 along each axis.
hu: `probe_count: 5, 3` *Alapértelmezett érték: 3,3* Az egyes tengelyeken mérendő pontok száma, X, Y egész értékben megadva. Ebben a példában az X tengely mentén 5 pont lesz mérve, az Y tengely mentén 3 pont, összesen 15 mért pont. Vedd figyelembe, hogy ha négyzetrácsot szeretnél, például 3x3, akkor ezt egyetlen egész számértékként is megadhatod, amelyet mindkét tengelyre használsz, azaz `probe_count: 3`. Vedd figyelembe, hogy egy hálóhoz mindkét tengely mentén legalább 3 darab mérési számra van szükség.
ru: `probe_count: 5, 3` *Значение по умолчанию: 3, 3* Количество точек для зондирования по каждой оси, заданное как целочисленные значения X, Y. В этом примере по оси X будет прощупано 5 точек, а по оси Y - 3 точки, итого 15 точек. Обратите внимание, что если вам нужна квадратная сетка, например 3x3, это можно указать как одно целое значение, которое будет использоваться для обеих осей, то есть `probe_count: 3`. Обратите внимание, что для сетки требуется минимальное количество зондов (probe_count) по 3 вдоль каждой оси.

source: `mesh_origin: 0, 0` *Default Value: 0, 0* The center point of the mesh. This coordinate is relative to the probe's location. While the default is 0, 0, it may be useful to adjust the origin in an effort to probe a larger portion of the bed. See the illustration below.
hu: `mesh_origin: 0, 0` *Alapértelmezett érték: 0, 0* A háló középpontja. Ez a koordináta a szonda helyéhez képest relatív. Bár az alapértelmezett érték 0, 0 hasznos lehet az origó beállítása, ha a tárgyasztal nagyobb részét szeretnéd megmérni. Lásd az alábbi ábrát.
ru: `mesh_origin: 0, 0` *Значение по умолчанию: 0, 0* Центральная точка сетки. Эта координата находится относительно местоположения зонда. Хотя по умолчанию используется значение 0, 0, может оказаться полезным изменить начало координат, чтобы прозондировать большую часть кровати. См. иллюстрацию ниже.

source: `mesh_pps: 2, 3` *Default Value: 2, 2* The `mesh_pps` option is shorthand for Mesh Points Per Segment. This option specifies how many points to interpolate for each segment along the X and Y axes. Consider a 'segment' to be the space between each probed point. Like `probe_count`, `mesh_pps` is specified as an X, Y integer pair, and also may be specified a single integer that is applied to both axes. In this example there are 4 segments along the X axis and 2 segments along the Y axis. This evaluates to 8 interpolated points along X, 6 interpolated points along Y, which results in a 13x8 mesh. Note that if mesh_pps is set to 0 then mesh interpolation is disabled and the probed matrix will be sampled directly.
hu: `mesh_pps: 2, 3` *Alapértelmezett érték: 2, 2* A `mesh_pps` opció a Hálópontok szegmensenkénti rövidítése. Ez az opció azt adja meg, hogy hány pontot interpoláljon minden egyes szegmenshez az X és Y tengely mentén. Tekintsük egy 'szegmensnek' az egyes mért pontok közötti teret. A `probe_count`-hoz hasonlóan a `mesh_pps` is X, Y egész számpárként adható meg, de megadható egyetlen egész szám is, amely mindkét tengelyre vonatkozik. Ebben a példában 4 szegmens van az X tengely mentén és 2 szegmens az Y tengely mentén. Ez 8 interpolált pontot jelent az X mentén, 6 interpolált pontot az Y mentén, ami egy 13x8-as hálót eredményez. Vedd figyelembe, hogy ha a mesh_pps értéke 0, akkor a hálóinterpoláció le van tiltva, és a mért mátrixot közvetlenül mintavételezi a rendszer.
ru: `mesh_pps: 2, 3` *Значение по умолчанию: 2, 2* Параметр `mesh_pps` - это сокращение от Mesh Points Per Segment. Эта опция указывает, сколько точек интерполировать для каждого сегмента по осям X и Y. Считайте, что "сегмент" - это пространство между каждой точкой зондирования. Как и `probe_count`, `mesh_pps` задается как пара целых чисел X, Y, а также может быть задано одно целое число, которое применяется к обеим осям. В данном примере имеется 4 сегмента по оси X и 2 сегмента по оси Y. В результате получается 8 интерполированных точек по оси X, 6 интерполированных точек по оси Y, что дает сетку 13x8. Обратите внимание, что если значение mesh_pps равно 0, то интерполяция сетки отключается и матрица зондирования будет сэмплироваться напрямую.

source: Loading the default profile
hu: Az alapértelmezett profil betöltése
ru: Загрузка профиля по умолчанию

source: Previous versions of `bed_mesh` always loaded the profile named *default* on startup if it was present. This behavior has been removed in favor of allowing the user to determine when a profile is loaded. If a user wishes to load the `default` profile it is recommended to add `BED_MESH_PROFILE LOAD=default` to either their `START_PRINT` macro or their slicer's "Start G-Code" configuration, whichever is applicable.
hu: A `bed_mesh` korábbi verziói indításkor mindig betöltötték az *alapértelmezett* nevű profilt, ha az jelen volt. Ezt a viselkedést megszüntettük annak érdekében, hogy a felhasználó határozhassa meg, mikor töltődik be egy profil. Ha a felhasználó az `alapértelmezett` profilt kívánja betölteni, ajánlott a `BED_MESH_PROFILE LOAD=default` hozzáadása a `START_PRINT` makróhoz vagy a szeletelő "Start G-Code" konfigurációjához, attól függően, hogy melyik alkalmazandó.
ru: Предыдущие версии `bed_mesh` при запуске всегда загружали профиль с именем *default*, если он присутствовал. Это поведение было удалено в пользу того, чтобы позволить пользователю определять, когда загружать профиль. Если пользователь хочет загружать профиль `default`, рекомендуется добавить `BED_MESH_PROFILE LOAD=default` либо в макрос `START_PRINT`, либо в конфигурацию "Start G-Code" слайсера, в зависимости от того, что применимо.

source: Alternatively the old behavior of loading a profile at startup can be restored with a `[delayed_gcode]`:
hu: Alternatívaként a `[delayed_gcode]` segítségével visszaállítható a profil indításkor történő betöltésének régi viselkedése:
ru: В качестве альтернативы можно восстановить старое поведение загрузки профиля при запуске с помощью `[delayed_gcode]`:

source: The Bed Mesh module may be used to compensate for bed surface irregularities to achieve a better first layer across the entire bed. It should be noted that software based correction will not achieve perfect results, it can only approximate the shape of the bed. Bed Mesh also cannot compensate for mechanical and electrical issues. If an axis is skewed or a probe is not accurate then the bed_mesh module will not receive accurate results from the probing process.
hu: Az ágy háló modul használható az ágyfelület egyenetlenségeinek kiegyenlítésére, hogy jobb első réteget érjen el az egész ágyon. Meg kell jegyezni, hogy a szoftveralapú korrekció nem fog tökéletes eredményt elérni, csak megközelítőleg tudja az ágy alakját. A Bed Mesh szintén nem tudja kompenzálni a mechanikai és elektromos problémákat. Ha egy tengely ferde vagy egy szonda nem pontos, akkor a bed_mesh modul nem fog pontos eredményeket kapni a szondázásból.
ru: Модуль Bed Mesh можно использовать для компенсации неровностей поверхности кровати, чтобы добиться лучшего первого слоя по всей кровати. Следует отметить, что программная коррекция не позволяет достичь идеальных результатов, она может лишь приблизительно повторить форму ложа. Сетка станины также не может компенсировать механические и электрические проблемы. Если ось перекошена или датчик неточен, модуль bed_mesh не получит точных результатов от процесса измерения.

source: The illustration below shows how the probed points are generated. As you can see, setting the `mesh_origin` to (-10, 0) allows us to specify a larger mesh radius of 85.
hu: Az alábbi ábra mutatja, hogyan generálódnak a szondázott pontok. Amint látható, a `mesh_origin` (-10, 0) értékre állítása lehetővé teszi, hogy nagyobb, 85-ös hálósugarat adjunk meg.
ru: На рисунке ниже показано, как генерируются точки зондирования. Как видите, установка `mesh_origin` в (-10, 0) позволяет нам задать больший радиус сетки - 85.

source: While its possible to sample the probed matrix directly using simple bi-linear interpolation to determine the Z-Values between probed points, it is often useful to interpolate extra points using more advanced interpolation algorithms to increase mesh density. These algorithms add curvature to the mesh, attempting to simulate the material properties of the bed. Bed Mesh offers lagrange and bicubic interpolation to accomplish this.
hu: Míg a szondázott mátrixot közvetlenül egyszerű bilineáris interpolációval lehet mintavételezni a szondázott pontok közötti Z-értékek meghatározásához, a háló sűrűségének növelése érdekében gyakran hasznos további pontokat interpolálni fejlettebb interpolációs algoritmusokkal. Ezek az algoritmusok görbületet adnak a hálóhoz, megkísérelve szimulálni a meder anyagi tulajdonságait. A Bed Mesh ehhez Lagrange- és bikubikus interpolációt kínál.
ru: Хотя для определения Z-величин между точками зондирования можно напрямую использовать матрицу зондирования с помощью простой билинейной интерполяции, часто бывает полезно интерполировать дополнительные точки с помощью более сложных алгоритмов интерполяции для увеличения плотности сетки. Эти алгоритмы добавляют кривизну в сетку, пытаясь имитировать свойства материала постели. В Bed Mesh для этого используются алгоритмы интерполяции Лагранжа и бикубической интерполяции.

source: Generally the default values for these options are sufficient, in fact the default value of 5mm for the `move_check_distance` may be overkill. However an advanced user may wish to experiment with these options in an effort to squeeze out the optimal first layer.
hu: Általában az alapértelmezett értékek elegendőek ezekhez az opciókhoz, sőt, a `move_check_distance` alapértelmezett 5 mm-es értéke túlzás lehet. Egy haladó felhasználó azonban kísérletezhet ezekkel az opciókkal, hogy megpróbálja kiszorítani az optimális első réteget.
ru: Как правило, значений по умолчанию для этих параметров достаточно, а значение по умолчанию 5 мм для `move_check_distance` может оказаться излишним. Однако опытный пользователь может захотеть поэкспериментировать с этими параметрами, пытаясь выжать оптимальный первый слой.

source: `fade_target: 0` *Default Value: The average Z value of the mesh* The `fade_target` can be thought of as an additional Z offset applied to the entire bed after fade completes. Generally speaking we would like this value to be 0, however there are circumstances where it should not be. For example, lets assume your homing position on the bed is an outlier, its .2 mm lower than the average probed height of the bed. If the `fade_target` is 0, fade will shrink the print by an average of .2 mm across the bed. By setting the `fade_target` to .2, the homed area will expand by .2 mm, however, the rest of the bed will be accurately sized. Generally its a good idea to leave `fade_target` out of the configuration so the average height of the mesh is used, however it may be desirable to manually adjust the fade target if one wants to print on a specific portion of the bed.
hu: `fade_target: 0` *Alapértelmezett érték: A háló átlagos Z-értéke* A `fade_target` úgy tekinthető, mint egy további Z-eltolás, amelyet a teljes ágyra alkalmaznak a fade befejezése után. Általánosságban azt szeretnénk, ha ez az érték 0 lenne, azonban vannak olyan körülmények, amikor ez nem kell, hogy így legyen. Tegyük fel például, hogy az ágyon a kezdőpont pozíciója egy kiugró érték, amely 0,2 mm-rel alacsonyabb, mint az ágy átlagos mért magassága. Ha a `fade_target` értéke 0, akkor a fade átlagosan 0,2 mm-rel zsugorítja a nyomtatást az ágyon. Ha a `fade_target` értéket .2-re állítja, a homed terület .2 mm-rel fog tágulni, azonban az ágy többi része pontosan lesz mérve. Általában jó ötlet a `fade_target` elhagyása a konfigurációból, így a háló átlagos magassága kerül felhasználásra, azonban kívánatos lehet a fade target kézi beállítása, ha az ágy egy bizonyos részére szeretnénk nyomtatni.
ru: `fade_target: 0` *Значение по умолчанию: Среднее значение Z сетки* Значение `fade_target` можно рассматривать как дополнительное смещение Z, применяемое ко всему слою после завершения затухания. Вообще говоря, мы хотели бы, чтобы это значение было равно 0, однако есть обстоятельства, при которых оно не должно быть таким. Например, предположим, что ваше положение самонаведения на кровати - это выброс, оно на 0,2 мм ниже, чем средняя измеренная высота кровати. Если `fade_target` равно 0, fade уменьшит отпечаток в среднем на .2 мм по всей станине. Если задать `fade_target` равным .2, то область, в которую попадает отпечаток, расширится на .2 мм, однако остальная часть ложа будет иметь точные размеры. Обычно рекомендуется не задавать `fade_target` в конфигурации, чтобы использовалась средняя высота сетки, однако может быть желательно вручную настроить цель затухания, если требуется печать на определенной части ложа.

source: It should be noted that each time a BED_MESH_CALIBRATE occurs, the current state is automatically saved to the *default* profile. The *default* profile can be removed as follows:
hu: Meg kell jegyezni, hogy minden alkalommal, amikor egy BED_MESH_CALIBRATE történik, az aktuális állapot automatikusan elmentésre kerül az *alapértelmezett* profilba. Az *alapértelmezett* profil a következőképpen távolítható el:
ru: Следует отметить, что каждый раз, когда происходит BED_MESH_CALIBRATE, текущее состояние автоматически сохраняется в профиль *по умолчанию*. Профиль *по умолчанию* можно удалить следующим образом:

source: Configuring the zero reference position
hu: A nulla referenciapozíció beállítása
ru: Настройка нулевого опорного положения

source: Many probes are susceptible to "drift", ie: inaccuracies in probing introduced by heat or interference. This can make calculating the probe's z-offset challenging, particularly at different bed temperatures. As such, some printers use an endstop for homing the Z axis and a probe for calibrating the mesh. In this configuration it is possible offset the mesh so that the (X, Y) `reference position` applies zero adjustment. The `reference postion` should be the location on the bed where a [Z_ENDSTOP_CALIBRATE](./Manual_Level#calibrating-a-z-endstop) paper test is performed. The bed_mesh module provides the `zero_reference_position` option for specifying this coordinate:
hu: Sok szonda hajlamos a "driftre", azaz: a hő vagy interferencia által okozott pontatlanságokra. Ez kihívássá teheti a szonda Z-eltolásának kiszámítását, különösen különböző ágyhőmérsékleteken. Ezért egyes nyomtatók a Z tengely beállításához végállást, a háló kalibrálásához pedig szondát használnak. Ebben a konfigurációban lehetséges a háló eltolása úgy, hogy az (X, Y) `referenciapozíció` nullpontbeállításra vonatkozik. A `referenciapozíciónak` az ágyon annak a helynek kell lennie, ahol a [Z_ENDSTOP_CALIBRATE](./Manual_Level#calibrating-a-z-endstop) papírtesztet végzik. A bed_mesh modul biztosítja a `zero_reference_position` opciót e koordináta megadásához:

source: `zero_reference_position: ` *Default Value: None (disabled)* The `zero_reference_position` expects an (X, Y) coordinate matching that of the `reference position` described above. If the coordinate lies within the mesh then the mesh will be offset so the reference position applies zero adjustment. If the coordinate lies outside of the mesh then the coordinate will be probed after calibration, with the resulting z-value used as the z-offset. Note that this coordinate must NOT be in a location specified as a `faulty_region` if a probe is necessary.
hu: `zero_reference_position: ` *Alapértelmezett érték: A `zero_reference_position` egy olyan (X, Y) koordinátát vár el, amely megfelel a fent leírt `reference position` koordinátának. Ha a koordináta a hálóban van, akkor a háló eltolódik, így a referenciapozíció nulla korrekciót alkalmaz. Ha a koordináta a hálón kívül esik, akkor a koordinátát a kalibrálás után meg kell vizsgálni, és az így kapott Z-értéket kell Z-eltolásként használni. Vedd figyelembe, hogy ez a koordináta NEM lehet olyan helyen, amelyet `faulty_region`-ként határoztak meg, ahol mérésre van szükség.
ru: `zero_reference_position: ` *Значение по умолчанию: None (отключено)* Функция `zero_reference_position` ожидает координату (X, Y), совпадающую с координатой `reference position`, описанной выше. Если координата находится внутри сетки, то сетка будет смещена, так что к опорной позиции будет применена нулевая корректировка. Если координата лежит вне сетки, то она будет измерена после калибровки, а полученное значение z будет использовано в качестве z-смещения. Обратите внимание, что эта координата НЕ должна находиться в месте, указанном как `faulty_region`, если необходимо выполнить зондирование.

source: The deprecated relative_reference_index
hu: Az elavult relative_reference_index
ru: Устаревший индекс relative_reference_index

source: Existing configurations using the `relative_reference_index` option must be updated to use the `zero_reference_position`. The response to the [BED_MESH_OUTPUT PGP=1](#output) gcode command will include the (X, Y) coordinate associated with the index; this position may be used as the value for the `zero_reference_position`. The output will look similar to the following:
hu: A `relative_reference_index` opciót használó meglévő konfigurációkat frissíteni kell a `zero_reference_position` használatához. A [BED_MESH_OUTPUT PGP=1](#output) G-kód parancsra adott válasz tartalmazza az indexhez tartozó (X, Y) koordinátát; ez a pozíció használható a `zero_reference_position` értékeként. A kimenet az alábbiakhoz hasonlóan fog kinézni:
ru: Существующие конфигурации, использующие опцию `relative_reference_index`, должны быть обновлены для использования `zero_reference_position`. Ответ на команду [BED_MESH_OUTPUT PGP=1](#output) gcode будет включать координату (X, Y), связанную с индексом; эта позиция может быть использована в качестве значения для `нулевой позиции_ссылки`. Вывод будет выглядеть следующим образом:

source: // bed_mesh: generated points // Index | Tool Adjusted | Probe // 0 | (1.0, 1.0) | (24.0, 6.0) // 1 | (36.7, 1.0) | (59.7, 6.0) // 2 | (72.3, 1.0) | (95.3, 6.0) // 3 | (108.0, 1.0) | (131.0, 6.0) ... (additional generated points) // bed_mesh: relative_reference_index 24 is (131.5, 108.0)
hu: // bed_mesh: generált pontok // Index | Szerszámbeállítás | Szonda // 0 | (1.0, 1.0) | (24.0, 6.0) // 1 | (36.7, 1.0) | (59.7, 6.0) // 2 | (72.3, 1.0) | (95.3, 6.0) // 3 | (108.0, 1.0) | (131.0, 6.0) ... (további generált pontok) // bed_mesh: relative_reference_index 24 is (131.5, 108.0)

source: *Note: The above output is also printed in `klippy.log` during initialization.*
hu: *Figyelem: A fenti kimenet az inicializálás során a `klippy.log`-ban is megjelenik.*
ru: *Примечание: Вышеприведенный вывод также выводится в `klippy.log` во время инициализации.*

source: Using the example above we see that the `relative_reference_index` is printed along with its coordinate. Thus the `zero_reference_position` is `131.5, 108`.
hu: A fenti példa alapján láthatjuk, hogy a `relative_reference_index` a koordinátával együtt kerül kiírásra. Így a `zero_reference_position` a `131.5, 108`.
ru: На примере выше мы видим, что `относительный_индекс_ссылки` выводится вместе с его координатой. Таким образом, `нулевая_позиция_ссылки` равна `131.5, 108`.

source: Adaptive Meshes
hu: Adaptív hálók
ru: Адаптивные сетки
