Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: hu, ru

source: Adaptive bed meshing is a way to speed up the bed mesh generation by only probing the area of the bed used by the objects being printed. When used, the method will automatically adjust the mesh parameters based on the area occupied by the defined print objects.
hu: Az adaptív ágyrácsozás egy olyan módszer, amely felgyorsítja az ágyrács generálását azáltal, hogy csak az ágynak a nyomtatandó tárgyak által használt területét vizsgálja. Használatakor a módszer automatikusan beállítja a háló paramétereit a meghatározott nyomtatási objektumok által elfoglalt terület alapján.
ru: Адаптивное зацепление станины - это способ ускорить генерацию сетки станины, используя только область станины, занятую печатаемыми объектами. При использовании этого метода параметры сетки автоматически настраиваются в зависимости от площади, занимаемой заданными объектами печати.

source: The adapted mesh area will be computed from the area defined by the boundaries of all the defined print objects so it covers every object, including any margins defined in the configuration. After the area is computed, the number of probe points will be scaled down based on the ratio of the default mesh area and the adapted mesh area. To illustrate this consider the following example:
hu: Az adaptált háló területe az összes meghatározott nyomtatási objektum határai által meghatározott területből kerül kiszámításra, így minden objektumot lefed, beleértve a konfigurációban meghatározott margókat is. A terület kiszámítása után a mérőpontok száma az alapértelmezett hálóterület és az adaptált hálóterület aránya alapján lesz kicsinyítve. Ennek szemléltetésére nézd meg a következő példát:
ru: Адаптированная область сетки будет вычислена из области, определенной границами всех определенных объектов печати, так что она охватывает все объекты, включая любые поля, определенные в конфигурации. После вычисления области количество точек зондирования будет уменьшено на основе соотношения площади сетки по умолчанию и адаптированной площади сетки. Для иллюстрации этого рассмотрим следующий пример:

source: For a 150mmx150mm bed with `mesh_min` set to `25,25` and `mesh_max` set to `125,125`, the default mesh area is a 100mmx100mm square. An adapted mesh area of `50,50` means a ratio of `0.5x0.5` between the adapted area and default mesh area.
hu: Egy 150mm x 150mm-es ágy esetében, ahol a "mesh_min" értéke "25,25" és a "mesh_max" értéke "125,125", az alapértelmezett hálóterület egy 100mm x 100mm-es négyzet. Az `50,50` adaptált hálóterület azt jelenti, hogy az adaptált terület és az alapértelmezett hálóterület közötti arány `0,5x0,5`.
ru: Для кровати 150x150 мм с `mesh_min`, установленной на `25,25`, и `mesh_max`, установленной на `125,125`, площадь сетки по умолчанию составляет квадрат 100 ммx100 мм. Адаптированная площадь сетки `50,50` означает соотношение `0,5x0,5` между адаптированной площадью и площадью сетки по умолчанию.

source: If the `bed_mesh` configuration specified `probe_count` as `7x7`, the adapted bed mesh will use 4x4 probe points (7 * 0.5 rounded up).
hu: Ha a `bed_mesh` konfigurációban a `probe_count` értéke `7x7`, akkor az adaptív ágyháló 4x4 próbapontot fog használni (7 * 0,5 felfelé kerekítve).
ru: Если в конфигурации `bed_mesh` указано `probe_count` как `7x7`, то адаптированная сетка кровати будет использовать 4x4 точки зондирования (7 * 0.5 с округлением вверх).

source: `adaptive_margin` *Default Value: 0* Margin (in mm) to add around the area of the bed used by the defined objects. The diagram below shows the adapted bed mesh area with an `adaptive_margin` of 5mm. The adapted mesh area (area in green) is computed as the used bed area (area in blue) plus the defined margin.
hu: `adaptive_margin` *Alapértelmezett érték: 0* Az ágy meghatározott objektumok által használt területe köré hozzáadandó margó (mm-ben). Az alábbi ábra az adaptív ágy hálóterületét mutatja, ha az `adaptive_margin` értéke 5 mm. Az adaptív hálóterület (zöld színű terület) a használt ágyterület (kék színű terület) és a meghatározott margó összegeként kerül kiszámításra.
ru: `adaptive_margin` *Значение по умолчанию: 0* Граница (в мм) для добавления вокруг области кровати, используемой определенными объектами. На рисунке ниже показана адаптированная область сетки кровати с `adaptive_margin` в 5 мм. Адаптированная площадь сетки (площадь, выделенная зеленым цветом) рассчитывается как используемая площадь ложа (площадь, выделенная синим цветом) плюс определенная маржа.

source: By nature, adaptive bed meshes use the objects defined by the Gcode file being printed. Therefore, it is expected that each Gcode file will generate a mesh that probes a different area of the print bed. Therefore, adapted bed meshes should not be re-used. The expectation is that a new mesh will be generated for each print if adaptive meshing is used.
hu: Az adaptív ágyrácsok természetüknél fogva a nyomtatás alatt álló G-Kód fájlban meghatározott objektumokat használják. Ezért várható, hogy minden egyes G-Kód fájl olyan hálót generál, amely a nyomtatóágy különböző területét vizsgálja. Ezért az adaptív ágyhálót nem szabad újra felhasználni. Az adaptív hálózás használata esetén elvárás, hogy minden egyes nyomtatáshoz új hálót generáljon.
ru: По своей природе адаптивные сетки печатной основы используют объекты, определенные файлом Gcode, на котором выполняется печать. Поэтому ожидается, что каждый Gcode-файл будет генерировать сетку, которая будет охватывать разные области печатного слоя. Поэтому адаптированные сетки станины не следует использовать повторно. При использовании адаптивного зацепления предполагается, что для каждой печати будет создаваться новая сетка.

source: It is also important to consider that adaptive bed meshing is best used on machines that can normally probe the entire bed and achieve a maximum variance less than or equal to 1 layer height. Machines with mechanical issues that a full bed mesh normally compensates for may have undesirable results when attempting print moves **outside** of the probed area. If a full bed mesh has a variance greater than 1 layer height, caution must be taken when using adaptive bed meshes and attempting print moves outside of the meshed area.
hu: Azt is fontos figyelembe venni, hogy az adaptív ágyhálózást olyan gépeken lehet a legjobban alkalmazni, amelyek általában a teljes ágyat meg tudják tapogatni, és 1 rétegmagasságnál kisebb vagy azzal egyenlő maximális eltérést érnek el. Az olyan mechanikai problémákkal küzdő gépek, amelyeket a teljes ágyháló általában kompenzál, nemkívánatos eredményeket hozhatnak, amikor a nyomtatási mozgásokat a szondázott területen **kívül** próbálják végrehajtani. Ha a teljes ágyháló eltérése nagyobb, mint 1 rétegmagasság, akkor óvatosan kell eljárni, amikor adaptív ágyhálót használunk, és a hálózott területen kívüli nyomtatási mozgásokat kísérelünk meg.
ru: Также важно учитывать, что адаптивное зацепление ложа лучше всего использовать на машинах, которые могут нормально прощупать все ложе и достичь максимального отклонения менее или равного 1 высоте слоя. Машины с механическими проблемами, которые обычно компенсируются полной сеткой станины, могут получить нежелательные результаты при попытке перемещения печати **за пределами** зоны зондирования. Если полная сетка кровати имеет дисперсию более 1 высоты слоя, необходимо соблюдать осторожность при использовании адаптивных сеток кровати и попытках перемещения печати за пределы зоны сетки.

source: This is useful for printers with multiple independent extruders, as an offset is necessary to produce correct Z adjustment after a tool change. Offsets should be specified relative to the primary extruder. That is, a positive X offset should be specified if the secondary extruder is mounted to the right of the primary extruder, a positive Y offset should be specified if the secondary extruder is mounted "behind" the primary extruder, and a positive ZFADE offset should be specified if the secondary extruder's nozzle is above the primary extruder's.
hu: Ez több független extruderrel rendelkező nyomtatóknál hasznos, mivel a szerszámcsere utáni helyes Z-beállításhoz szükség van egy eltolásra. Az eltolásokat az elsődleges extruderhez képest kell megadni. Vagyis pozitív X eltolást kell megadni, ha a másodlagos extruder az elsődleges extruder jobb oldalán van felszerelve, pozitív Y eltolást kell megadni, ha a másodlagos extruder az elsődleges extruder "mögött" van felszerelve, és pozitív ZFADE eltolást kell megadni, ha a másodlagos extruder fúvókája az elsődleges extruder fúvókája felett van.
ru: Это полезно для принтеров с несколькими независимыми экструдерами, поскольку смещение необходимо для правильной регулировки Z после смены инструмента. Смещение следует указывать относительно первичного экструдера. То есть положительное смещение по X должно быть указано, если вторичный экструдер установлен справа от первичного, положительное смещение по Y должно быть указано, если вторичный экструдер установлен "позади" первичного, и положительное смещение по ZFADE должно быть указано, если сопло вторичного экструдера находится над соплом первичного экструдера.

source: Note that a ZFADE offset does *NOT* directly apply additional adjustment. It is intended to compensate for a `gcode offset` when [mesh fade](#mesh-fade) is enabled. For example, if a secondary extruder is higher than the primary and needs a negative gcode offset, ie: `SET_GCODE_OFFSET Z=-.2`, it can be accounted for in `bed_mesh` with `BED_MESH_OFFSET ZFADE=.2`.
hu: Vedd figyelembe, hogy a ZFADE eltolás *NEM* alkalmaz közvetlenül további beállításokat. Ez a `gcode offset` kompenzálására szolgál, amikor a [mesh fade](#mesh-fade) engedélyezve van. Például, ha egy másodlagos extruder magasabb, mint az elsődleges, és negatív G-Kód eltolásra van szüksége, azaz: `SET_GCODE_OFFSET Z=-.2`, azt a `bed_mesh`-ben a `BED_MESH_OFFSET ZFADE=.2`-vel lehet figyelembe venni.
ru: Обратите внимание, что смещение ZFADE *НЕ* непосредственно применяет дополнительную корректировку. Оно предназначено для компенсации `смещения gcode` при включении [mesh fade](#mesh-fade). Например, если вторичный экструдер расположен выше основного и ему требуется отрицательное смещение gcode, т.е. `SET_GCODE_OFFSET Z=-.2`, это может быть учтено в `bed_mesh` с `BED_MESH_OFFSET ZFADE=.2`.

source: `mesh_max: 240, 198` *Required* The probed coordinate farthest from the origin. This is not necessarily the last point probed, as the probing process occurs in a zig-zag fashion. As with `mesh_min`, this coordinate is relative to the probe's location.
hu: `mesh_max: 240, 198` *Ajánlott* Az origótól legtávolabb eső koordináta. Ez nem feltétlenül az utolsó mért pont, mivel a mérés cikcakkos módon történik. A `mesh_min` koordinátához hasonlóan ez a koordináta is a szonda helyéhez képest relatív.
ru: `mesh_max: 240, 198` *Обязательно* Самая удаленная от начала координата. Это не обязательно последняя точка, так как процесс зондирования происходит зигзагообразно. Как и в случае с `mesh_min`, эта координата является относительной по отношению к местоположению зонда.

source: Surface Scans
hu: Felületi mérések
ru: Сканирование поверхности

source: Some probes, such as the [Eddy Current Probe](./Eddy_Probe.md), are capable of "scanning" the surface of the bed. That is, these probes can sample a mesh without lifting the tool between samples. To activate scanning mode, the `METHOD=scan` or `METHOD=rapid_scan` probe parameter should be passed in the `BED_MESH_CALIBRATE` gcode command.
hu: Egyes szondák, mint például az [Örvényáramú szonda](./Eddy_Probe.md), képesek az ágy felületének "letapogatására". Azaz ezek a szondák anélkül képesek háló mintát készíteni, hogy a fejet a minták között felemelnék. A pásztázó üzemmód aktiválásához a `METHOD=scan` vagy `METHOD=rapid_scan` szonda paramétert kell átadni a `BED_MESH_CALIBRATE` G-kód parancsban.
ru: Некоторые датчики, например [Eddy Current Probe](./Eddy_Probe.md), способны "сканировать" поверхность станины. То есть эти зонды могут брать пробы сетки, не поднимая инструмент между пробами. Чтобы активировать режим сканирования, в gcode-команде `BED_MESH_CALIBRATE` следует передать параметр зонда `METHOD=scan` или `METHOD=rapid_scan`.

source: Scan Height
hu: Mérési magasság
ru: Высота сканирования

source: The scan height is set by the `horizontal_move_z` option in `[bed_mesh]`. In addition it can be supplied with the `BED_MESH_CALIBRATE` gcode command via the `HORIZONTAL_MOVE_Z` parameter.
hu: A pásztázási magasságot a `[bed_mesh]-ben a `horizontal_move_z` opció határozza meg. Ezenkívül a `BED_MESH_CALIBRATE` G-kód parancs a `HORIZONTAL_MOVE_Z` paraméteren keresztül is megadható.
ru: Высота сканирования задается параметром `horizontal_move_z` в `[bed_mesh]`. Кроме того, она может быть задана командой gcode `BED_MESH_CALIBRATE` через параметр `HORIZONTAL_MOVE_Z`.

source: The scan height must be sufficiently low to avoid scanning errors. Typically a height of 2mm (ie: `HORIZONTAL_MOVE_Z=2`) should work well, presuming that the probe is mounted correctly.
hu: A mérési magasságnak kellően alacsonynak kell lennie a beolvasási hibák elkerülése érdekében. Általában 2 mm-es magasság (azaz: `HORIZONTAL_MOVE_Z=2`) jól működik, feltéve, hogy a szonda megfelelően van felszerelve.
ru: Высота сканирования должна быть достаточно низкой, чтобы избежать ошибок сканирования. Обычно высота в 2 мм (т.е. `HORIZONTAL_MOVE_Z=2`) должна работать хорошо, при условии, что датчик установлен правильно.

source: It should be noted that if the probe is more than 4mm above the surface then the results will be invalid. Thus, scanning is not possible on beds with severe surface deviation or beds with extreme tilt that hasn't been corrected.
hu: Meg kell jegyezni, hogy ha a szonda több mint 4 mm-rel a felszín felett van, akkor az eredmények érvénytelenek lesznek. Így a mérés nem lehetséges olyan ágyaknál, ahol a felület nagymértékben eltérő vagy extrém dőlésszögű, amelyeket nem korrigáltak.
ru: Следует отметить, что если зонд находится на высоте более 4 мм от поверхности, результаты будут недействительными. Таким образом, сканирование невозможно на кроватях с сильным отклонением поверхности или на кроватях с сильным наклоном, который не был исправлен.

source: Rapid (Continuous) Scanning
hu: Gyors (folyamatos) mérés
ru: Быстрое (непрерывное) сканирование

source: When performing a `rapid_scan` one should keep in mind that the results will have some amount of error. This error should be low enough to be useful on large print areas with reasonably thick layer heights. Some probes may be more prone to error than others.
hu: A `rapid_scan` elvégzésekor szem előtt kell tartani, hogy az eredmények némi hibával fognak rendelkezni. Ennek a hibának elég alacsonynak kell lennie ahhoz, hogy nagy nyomtatási területeken, viszonylag vastag rétegmagassággal hasznos legyen. Egyes szondák hajlamosabbak lehetnek a hibára, mint mások.
ru: При выполнении `быстрого_сканирования` следует учитывать, что результаты будут иметь некоторую погрешность. Эта погрешность должна быть достаточно низкой, чтобы быть полезной для больших областей печати с достаточно большой высотой слоя. Некоторые датчики могут быть более склонны к ошибкам, чем другие.

source: It is not recommended that rapid mode be used to scan a "dense" mesh. Some of the error introduced during a rapid scan may be gaussian noise from the sensor, and a dense mesh will reflect this noise (ie: there will be peaks and valleys).
hu: Nem ajánlott a gyors üzemmód használata "sűrű" háló beolvasására. A gyors pásztázás során keletkező hiba egy része az érzékelő gauss-zajából származhat, és a sűrű háló ezt a zajt fogja tükrözni (azaz: lesznek csúcsok és völgyek).
ru: Не рекомендуется использовать быстрый режим для сканирования "плотной" сетки. Часть ошибки, вносимой при быстром сканировании, может быть гауссовым шумом от датчика, и плотная сетка будет отражать этот шум (т. е. будут пики и долины).

source: Bed Mesh will attempt to optimize the travel path to provide the best possible result based on the configuration. This includes avoiding faulty regions when collecting samples and "overshooting" the mesh when changing direction. This overshoot improves sampling at the edges of a mesh, however it requires that the mesh be configured in a way that allows the tool to travel outside of the mesh.
hu: Az Ágy háló megpróbálja optimalizálni az útvonalat, hogy a konfiguráció alapján a lehető legjobb eredményt érje el. Ez magában foglalja a hibás régiók elkerülését a minták gyűjtésekor és a háló "túllövését" irányváltáskor. Ez a túllövés javítja a mintavételt a háló széleinél, azonban megköveteli, hogy a hálót úgy konfigurálják, hogy a szerszám a hálón kívülre kerüljön.
ru: Bed Mesh попытается оптимизировать траекторию движения, чтобы обеспечить наилучший результат в зависимости от конфигурации. Это включает в себя избегание дефектных областей при сборе образцов и "проскакивание" сетки при изменении направления. Такой пролет улучшает отбор проб на краях сетки, однако для этого необходимо, чтобы сетка была настроена таким образом, чтобы инструмент мог перемещаться за ее пределы.

source: `scan_overshoot` *Default Value: 0 (disabled)* The maximum amount of travel (in mm) available outside of the mesh. For rectangular beds this applies to travel on the X axis, and for round beds it applies to the entire radius. The tool must be able to travel the amount specified outside of the mesh. This value is used to optimize the travel path when performing a "rapid scan". The minimum value that may be specified is 1. The default is no overshoot.
hu: `scan_overshoot` *Alapértelmezett érték: 0 (letiltva)* A hálón kívül rendelkezésre álló maximális elmozdulás (mm-ben). Téglalap alakú ágyak esetén ez az X tengelyen történő mozgásra vonatkozik, kerek ágyak esetén pedig a teljes sugárra. A fejnek képesnek kell lennie a megadott mértékű mozgásra a hálómezőn kívül. Ez az érték a "gyors mérés" végrehajtása során a mozgási útvonal optimalizálására szolgál. A minimálisan megadható érték 1. Az alapértelmezett érték a túllövés hiánya.
ru: `scan_overshoot` *Значение по умолчанию: 0 (отключено)* Максимальная величина перемещения (в мм), доступная за пределами сетки. Для прямоугольных станин это значение относится к перемещению по оси X, а для круглых станин - по всему радиусу. Инструмент должен иметь возможность перемещаться на указанную величину за пределами сетки. Это значение используется для оптимизации траектории движения при выполнении "быстрого сканирования". Минимальное значение, которое может быть указано, - 1. По умолчанию проскакивание отсутствует.

source: If no scan overshoot is configured then travel path optimization will not be applied to changes in direction.
hu: Ha nincs beállítva mérési túllövés, akkor az útvonal-optimalizálás nem kerül alkalmazásra az irányváltozásokkor.
ru: Если не настроено превышение сканирования, то оптимизация траектории движения не будет применяться при изменении направления.

source: `BED_MESH_CALIBRATE PROFILE=<name> METHOD=[manual | automatic | scan | rapid_scan] \ [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=[0|1] \ [ADAPTIVE_MARGIN=<value>]` *Default Profile: default* *Default Method: automatic if a probe is detected, otherwise manual* *Default Adaptive: 0* *Default Adaptive Margin: 0*
hu: `BED_MESH_CALIBRATE PROFILE=<name> METHOD=[manual | automatic | scan | rapid_scan] \ [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=[0|1] \ [ADAPTIVE_MARGIN=<value>]` *Alapértelmezett profil: alapértelmezett* *Alapértelmezett módszer: automatikus, ha szondát észlel, egyébként manuális* *Alapértelmezett adaptív: 0* *Alapértelmezett adaptív margó: 0*
ru: `BED_MESH_CALIBRATE PROFILE=<имя> METHOD=[ ручное | автоматическое | сканирование | rapid_scan] \ [<probe_parameter>=<значение>] [<mesh_parameter>=<значение>] [ADAPTIVE=[0|1] \ [ADAPTIVE_MARGIN=<значение>]` * Профиль по умолчанию: по умолчанию* * Метод по умолчанию: автоматический, если обнаружен зонд, иначе ручной* * Адаптивный по умолчанию: 0* * Адаптивный маржа по умолчанию: 0*

source: The mesh will be saved into a profile specified by the `PROFILE` parameter, or `default` if unspecified. The `METHOD` parameter takes one of the following values:
hu: A háló a `PROFILE` paraméter által megadott profilba lesz mentve, vagy a `default`, ha nincs megadva. A `METHOD` paraméter a következő értékek egyikét veszi fel:
ru: Сетка будет сохранена в профиль, указанный параметром `ПРОФИЛЬ`, или `по умолчанию`, если он не указан. Параметр `МЕТОД` принимает одно из следующих значений:

source: `METHOD=manual`: enables manual probing using the nozzle and the paper test
hu: `METHOD=manual`: lehetővé teszi a kézi mérést a fúvókával és a papírlappal
ru: `METHOD=manual`: включает ручное зондирование с помощью насадки и бумажного теста

source: `METHOD=automatic`: Automatic (standard) probing. This is the default.
hu: `METHOD=automatic`: Automatikus (szabvány) mérés. Ez az alapértelmezett.
ru: `METHOD=автоматический`: Автоматическое (стандартное) зондирование. Используется по умолчанию.

source: `METHOD=scan`: Enables surface scanning. The tool will pause over each position to collect a sample.
hu: `METHOD=scan`: Engedélyezi a felületi mérést. A fej minden egyes pozíció felett megáll, hogy mérést végezzen.
ru: `METHOD=scan`: Включает сканирование поверхности. Инструмент будет останавливаться на каждой позиции, чтобы собрать образец.

source: `METHOD=rapid_scan`: Enables continuous surface scanning.
hu: `METHOD=rapid_scan`: Engedélyezi a folyamatos felületi mérést.
ru: `METHOD=rapid_scan`: Включает непрерывное сканирование поверхности.

source: XY positions are automatically adjusted to include the X and/or Y offsets when a probing method other than `manual` is selected.
hu: Az XY pozíciók automatikusan beállítódnak az X és Y eltolások figyelembevételével, ha a `kézi`-től eltérő mérési módszert választunk.
ru: Позиции XY автоматически корректируются с учетом смещений X и/или Y, если выбран метод зондирования, отличный от `ручного`.

source: Bed Mesh Webhooks APIs
hu: Ágy háló Webhooks API-k
ru: API-интерфейсы Bed Mesh Webhooks

source: Dumping mesh data
hu: Hálóadatok kiürítése
ru: Выгрузка данных о сетке

source: Dumps the configuration and state for the current mesh and all saved profiles.
hu: Kitölti az aktuális háló és az összes mentett profil konfigurációját és állapotát.

source: The `dump_mesh` endpoint takes one optional parameter, `mesh_args`. This parameter must be an object, where the keys and values are parameters available to [BED_MESH_CALIBRATE](#bed_mesh_calibrate). This will update the mesh configuration and probe points using the supplied parameters prior to returning the result. It is recommended to omit mesh parameters unless it is desired to visualize the probe points and/or travel path before performing `BED_MESH_CALIBRATE`.
hu: A `dump_mesh` végpontnak egy opcionális paramétere van, a `mesh_args`. Ennek a paraméternek egy objektumnak kell lennie, ahol a kulcsok és az értékek a [BED_MESH_CALIBRATE](#bed_mesh_calibrate) számára elérhető paraméterek. Ez frissíti a háló konfigurációját és a mérési pontokat a megadott paraméterek segítségével, mielőtt visszaküldi az eredményt. A hálóparaméterek elhagyása ajánlott, kivéve, ha a `BED_MESH_CALIBRATE` végrehajtása előtt a mérési pontokat és/vagy a haladási útvonalat kívánod megjeleníteni.

source: Visualization and analysis
hu: Vizualizáció és elemzés
ru: Визуализация и анализ
