Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Level.po
Languages: bg, pl, ta, uk

source: If one always prints on a particular tape or printing surface then one may perform the paper test with that tape/surface in place. However, note that tape itself has a thickness and different tapes (or any other printing surface) will impact Z measurements. Be sure to rerun the paper test to measure each type of surface that is in use.
bg: Ако винаги се печата върху определена лента или повърхност за печат, може да се извърши тест на хартията с тази лента/повърхност на място. Все пак имайте предвид, че самата лента има дебелина и различните ленти (или всяка друга печатаща повърхност) ще повлияят на измерванията на Z. Не забравяйте да повторите теста на хартията, за да измерите всеки тип използвана повърхност.
pl: Jeśli ktoś zawsze drukuje na konkretnej taśmie lub powierzchni do drukowania, może wykonać test papieru z tą taśmą/powierzchnią na miejscu. Należy jednak pamiętać, że sama taśma ma grubość, a różne taśmy (lub jakakolwiek inna powierzchnia do drukowania) będą miały wpływ na pomiary Z. Należy ponownie wykonać test papieru, aby zmierzyć każdy rodzaj używanej powierzchni.
ta: ஒருவர் எப்போதும் ஒரு குறிப்பிட்ட நாடா அல்லது அச்சிடும் மேற்பரப்பில் அச்சிட்டால், ஒருவர் அந்த டேப்/மேற்பரப்புடன் காகித சோதனையை செய்யலாம். இருப்பினும், டேப்பில் ஒரு தடிமன் உள்ளது மற்றும் வெவ்வேறு நாடாக்கள் (அல்லது வேறு எந்த அச்சிடும் மேற்பரப்பும்) சட் அளவீடுகளை பாதிக்கும் என்பதை நினைவில் கொள்க. பயன்பாட்டில் உள்ள ஒவ்வொரு வகை மேற்பரப்பையும் அளவிட காகித சோதனையை மீண்டும் இயக்க மறக்காதீர்கள்.
uk: Якщо завжди друкувати на певній стрічці чи поверхні для друку, можна виконати перевірку паперу з цією стрічкою/поверхнею на місці. Однак зауважте, що сама стрічка має товщину, і різні стрічки (або будь-яка інша поверхня для друку) впливатимуть на вимірювання Z. Обов’язково повторіть перевірку паперу, щоб виміряти кожен тип поверхні, яка використовується.

source: When the nozzle is heated, its position (relative to the bed) changes due to thermal expansion. This thermal expansion is typically around a 100 microns, which is about the same thickness as a typical piece of printer paper. The exact amount of thermal expansion isn't crucial, just as the exact thickness of the paper isn't crucial. Start with the assumption that the two are equal (see below for a method of determining the difference between the two distances).
bg: Когато дюзата се нагрява, нейното положение (спрямо леглото) се променя поради топлинно разширение. Това топлинно разширение обикновено е около 100 микрона, което е приблизително толкова, колкото е дебелината на типичен лист хартия за принтер. Точният размер на термичното разширение не е от решаващо значение, както не е от решаващо значение и точната дебелина на хартията. Започнете с предположението, че двете са равни (вижте по-долу метода за определяне на разликата между двете разстояния).
pl: Gdy dysza jest podgrzewana, jej położenie (względem stołu) zmienia się z powodu rozszerzalności cieplnej. Ta rozszerzalność cieplna wynosi zazwyczaj około 100 mikronów, co odpowiada grubości typowego kawałka papieru do drukarki. Dokładna wartość rozszerzalności cieplnej nie jest kluczowa, tak jak dokładna grubość papieru nie jest kluczowa. Zacznij od założenia, że te dwie wartości są równe (patrz poniżej, aby poznać metodę określania różnicy między tymi dwiema odległościami).
ta: முனை சூடாகும்போது, வெப்ப விரிவாக்கம் காரணமாக அதன் நிலை (படுக்கையுடன் தொடர்புடையது) மாறுகிறது. இந்த வெப்ப விரிவாக்கம் பொதுவாக 100 மைக்ரான்களைச் சுற்றி உள்ளது, இது ஒரு பொதுவான அச்சுப்பொறி காகிதத்தின் அதே தடிமன் கொண்டது. காகிதத்தின் சரியான தடிமன் முக்கியமல்ல என்பதால், வெப்ப விரிவாக்கத்தின் சரியான அளவு முக்கியமானதல்ல. இரண்டும் சமமானவை என்ற அனுமானத்துடன் தொடங்கவும் (இரண்டு தூரங்களுக்கிடையிலான வேறுபாட்டை தீர்மானிக்கும் முறைக்கு கீழே காண்க).
uk: При нагріванні насадки її положення (відносно ложа) змінюється за рахунок теплового розширення. Це теплове розширення зазвичай становить близько 100 мікрон, що приблизно дорівнює товщині типового шматка паперу для принтера. Точна величина теплового розширення не має вирішального значення, як і точна товщина паперу не має вирішального значення. Почніть із припущення, що ці дві відстані рівні (див. нижче спосіб визначення різниці між двома відстанями).

source: After successfully performing bed leveling, one may go on to calculate a more precise value for the combined impact of "thermal expansion", "thickness of the paper", and "amount of friction felt during the paper test".
bg: След успешното изравняване на леглото може да се премине към изчисляване на по-точна стойност за комбинираното въздействие на "топлинното разширение", "дебелината на хартията" и "степента на триене, усетена по време на изпитването на хартията".
pl: Po pomyślnym przeprowadzeniu poziomowania stołu można przystąpić do obliczenia dokładniejszej wartości łącznego wpływu "rozszerzalności cieplnej", "grubości papieru" i "ilości tarcia odczuwalnego podczas testu papieru".
ta: படுக்கை சமநிலையை வெற்றிகரமாகச் செய்தபின், "வெப்ப விரிவாக்கம்", "காகிதத்தின் தடிமன்" மற்றும் "காகித சோதனையின் போது உணரப்பட்ட உராய்வின் அளவு" ஆகியவற்றின் ஒருங்கிணைந்த தாக்கத்திற்கு மிகவும் துல்லியமான மதிப்பைக் கணக்கிடலாம்.
uk: Після успішного вирівнювання ліжка можна перейти до розрахунку більш точного значення сумарного впливу «теплового розширення», «товщини паперу» та «кількості тертя, яке відчувається під час випробування паперу».
