Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Benchmarks.po
Languages: ta

source: This document describes Klipper benchmarks.
ta: இந்த ஆவணம் கிளிப்பர் வரையறைகளை விவரிக்கிறது.

source: Micro-controller Benchmarks
ta: மைக்ரோ-கண்ட்ரோலர் வரையறைகள்

source: This section describes the mechanism used to generate the Klipper micro-controller step rate benchmarks.
ta: கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் படி வீத வரையறைகளை உருவாக்க பயன்படும் பொறிமுறையை இந்த பிரிவு விவரிக்கிறது.

source: The primary goal of the benchmarks is to provide a consistent mechanism for measuring the impact of coding changes within the software. A secondary goal is to provide high-level metrics for comparing the performance between chips and between software platforms.
ta: மென்பொருளுக்குள் குறியீட்டு மாற்றங்களின் தாக்கத்தை அளவிடுவதற்கான ஒரு நிலையான பொறிமுறையை வழங்குவதே வரையறைகளின் முதன்மை குறிக்கோள். சில்லுகள் மற்றும் மென்பொருள் தளங்களுக்கு இடையில் செயல்திறனை ஒப்பிடுவதற்கான உயர் மட்ட அளவீடுகளை வழங்குவதே இரண்டாம் நிலை குறிக்கோள்.

source: The step rate benchmark is designed to find the maximum stepping rate that the hardware and software can reach. This benchmark stepping rate is not achievable in day-to-day use as Klipper needs to perform other tasks (eg, mcu/host communication, temperature reading, endstop checking) in any real-world usage.
ta: வன்பொருள் மற்றும் மென்பொருள் அடையக்கூடிய அதிகபட்ச படிநிலை விகிதத்தைக் கண்டறிய படி வீத அளவுகோல் வடிவமைக்கப்பட்டுள்ளது. எந்தவொரு நிச உலக பயன்பாட்டிலும் கிளிப்பர் பிற பணிகளை (எ.கா., எம்.சி.யு/ஓச்ட் செய்தி தொடர்பு, வெப்பநிலை வாசிப்பு, எண்ட்ச்டாப் சோதனை) செய்ய வேண்டியிருப்பதால் இந்த பெஞ்ச்மார்க் படிநிலை விகிதம் அன்றாட பயன்பாட்டில் அடைய முடியாது.

source: In general, the pins for the benchmark tests are chosen to flash LEDs or other innocuous pins. **Always verify that it is safe to drive the configured pins prior to running a benchmark.** It is not recommended to drive an actual stepper during a benchmark.
ta: பொதுவாக, பெஞ்ச்மார்க் சோதனைகளுக்கான ஊசிகள் ஃபிளாச் எல்.ஈ.டிக்கள் அல்லது பிற தீங்கற்ற ஊசிகளுக்கு தேர்ந்தெடுக்கப்படுகின்றன. ** ஒரு அளவுகோலை இயக்குவதற்கு முன்பு கட்டமைக்கப்பட்ட ஊசிகளை ஓட்டுவது பாதுகாப்பானது என்பதை எப்போதும் சரிபார்க்கவும். ** ஒரு அளவுகோலின் போது உண்மையான ச்டெப்பரை இயக்க பரிந்துரைக்கப்படவில்லை.

source: Step rate benchmark test
ta: படி வீத அளவுகோல் சோதனை

source: The above tests three steppers simultaneously stepping. If running the above results in a "Rescheduled timer in the past" or "Stepper too far in past" error then it indicates the `ticks` parameter is too low (it results in a stepping rate that is too fast). The goal is to find the lowest setting of the ticks parameter that reliably results in a successful completion of the test. It should be possible to bisect the ticks parameter until a stable value is found.
ta: மேலே உள்ள மூன்று ச்டெப்பர்கள் ஒரே நேரத்தில் அடியெடுத்து வைக்கின்றன. மேற்கண்ட முடிவுகளை "கடந்த காலத்தில் மறுசீரமைக்கப்பட்ட டைமரில்" அல்லது "கடந்த காலங்களில் ச்டெப்பர்" பிழையில் இயக்கினால், அது `உண்ணி` அளவுரு மிகக் குறைவாக இருப்பதைக் குறிக்கிறது (இது ஒரு படி விகிதத்தில் மிக வேகமாக இருக்கும்). சோதனையை வெற்றிகரமாக முடிக்க நம்பத்தகுந்த வகையில் முடிவடையும் உண்ணி அளவுருவின் மிகக் குறைந்த அமைப்பைக் கண்டுபிடிப்பதே குறிக்கோள். நிலையான மதிப்பு காணப்படும் வரை உண்ணி அளவுருவை பிளவுபடுத்த முடியும்.

source: On a failure, one can copy-and-paste the following to clear the error in preparation for the next test:
ta: தோல்வியில், அடுத்த சோதனைக்கான தயாரிப்பில் பிழையை அழிக்க ஒருவர் பின்வருவனவற்றை நகலெடுத்து ஒட்டலாம்:

source: AVR step rate benchmark
ta: ஏ.வி.ஆர் படி வீத அளவுகோல்

source: The following configuration sequence is used on AVR chips:
ta: ஏ.வி.ஆர் சில்லுகளில் பின்வரும் உள்ளமைவு வரிசை பயன்படுத்தப்படுகிறது:

source: avr
ta: ஏ.வி.ஆர்

source: ticks
ta: உண்ணி

source: 1 stepper
ta: 1 ச்டெப்பர்

source: 3 stepper
ta: 3 ச்டெப்பர்

source: Arduino Due step rate benchmark
ta: Arduino காரணமாக படி வீத அளவுகோல்

source: The following configuration sequence is used on the Due:
ta: பின்வரும் உள்ளமைவு வரிசை வரவிருப்பதில் பயன்படுத்தப்படுகிறது:

source: Duet Maestro step rate benchmark
ta: டூயட் மேச்ட்ரோ படி வீத அளவுகோல்

source: The following configuration sequence is used on the Duet Maestro:
ta: டூயட் மேச்ட்ரோவில் பின்வரும் உள்ளமைவு வரிசை பயன்படுத்தப்படுகிறது:

source: Duet Wifi step rate benchmark
ta: டூயட் வைஃபை படி வீத அளவுகோல்

source: The following configuration sequence is used on the Duet Wifi:
ta: டூயட் வைஃபை மீது பின்வரும் உள்ளமைவு வரிசை பயன்படுத்தப்படுகிறது:

source: Beaglebone PRU step rate benchmark
ta: பீகல்போன் ப்ரூ படி வீத அளவுகோல்

source: The following configuration sequence is used on the PRU:
ta: PRU இல் பின்வரும் உள்ளமைவு வரிசை பயன்படுத்தப்படுகிறது:

source: pru
ta: ப்ரூ

source: STM32F042 step rate benchmark
ta: STM32F042 படி வீத அளவுகோல்

source: The following configuration sequence is used on the STM32F042:
ta: பின்வரும் உள்ளமைவு வரிசை STM32F042 இல் பயன்படுத்தப்படுகிறது:

source: STM32F103 step rate benchmark
ta: STM32F103 படி வீத அளவுகோல்

source: The following configuration sequence is used on the STM32F103:
ta: பின்வரும் உள்ளமைவு வரிசை STM32F103 இல் பயன்படுத்தப்படுகிறது:

source: STM32F4 step rate benchmark
ta: STM32F4 படி வீத அளவுகோல்

source: The following configuration sequence is used on the STM32F4:
ta: பின்வரும் உள்ளமைவு வரிசை STM32F4 இல் பயன்படுத்தப்படுகிறது:

source: stm32f407
ta: நான் 407 கேட்பேன்

source: LPC176x step rate benchmark
ta: எல்பிசி 176 ஃச் படி வீத அளவுகோல்

source: The following configuration sequence is used on the LPC176x:
ta: பின்வரும் உள்ளமைவு வரிசை LPC176X இல் பயன்படுத்தப்படுகிறது:

source: lpc1768
ta: எல்பிசி 1768

source: lpc1769
ta: எல்பிசி 1769

source: SAMD21 step rate benchmark
ta: SAMD21 படி வீத அளவுகோல்

source: The following configuration sequence is used on the SAMD21:
ta: பின்வரும் உள்ளமைவு வரிசை SAMD21 இல் பயன்படுத்தப்படுகிறது:

source: SAMD51 step rate benchmark
ta: SAMD51 படி வீத அளவுகோல்

source: The following configuration sequence is used on the SAMD51:
ta: பின்வரும் உள்ளமைவு வரிசை SAMD51 இல் பயன்படுத்தப்படுகிறது:

source: 1 stepper (200Mhz)
ta: 1 ச்டெப்பர் (200 மெகா எர்ட்ச்)

source: 3 stepper (200Mhz)
ta: 3 ச்டெப்பர் (200 மெகா எர்ட்ச்)

source: Linux MCU step rate benchmark
ta: லினக்ச் எம்.சி.யு படி வீத அளவுகோல்

source: The following configuration sequence is used on a Raspberry Pi:
ta: ராச்பெர்ரி பையில் பின்வரும் உள்ளமைவு வரிசை பயன்படுத்தப்படுகிறது:

source: Linux (RPi3)
ta: லினக்ச் (RPI3)

source: Command dispatch benchmark
ta: கட்டளை அனுப்பும் அளவுகோல்

source: When the test completes, determine the difference between the clocks reported in the two "uptime" response messages. The total number of commands per second is then `100000 * mcu_frequency / clock_diff`.
ta: சோதனை முடிந்ததும், இரண்டு "கூடுதல் நேரம்" மறுமொழி செய்திகளில் தெரிவிக்கப்பட்ட கடிகாரங்களுக்கிடையிலான வேறுபாட்டை தீர்மானிக்கவும். நொடிக்கு மொத்த கட்டளைகளின் எண்ணிக்கை பின்னர் `100000 * MCU_FREQUENCY / COCROM_DIFF`.

source: Note that this test may saturate the USB/CPU capacity of a Raspberry Pi. If running on a Raspberry Pi, Beaglebone, or similar host computer then increase the delay (eg, `DELAY {clock + 20*freq} get_uptime`). Where applicable, the benchmarks below are with console.py running on a desktop class machine with the device connected via a high-speed hub.
ta: இந்த சோதனை ஒரு ராச்பெர்ரி பைவின் யூ.எச்.பி/சிபியு திறனை நிறைவு செய்யலாம் என்பதை நினைவில் கொள்க. ராச்பெர்ரி பை, பீகல்போன் அல்லது ஒத்த புரவலன் கணினியில் இயங்கினால், தாமதத்தை அதிகரிக்கவும் (எ.கா., `தாமதம் {கடிகாரம் + 20*ஃப்ரீக்} get_uptime`). பொருந்தக்கூடிய இடங்களில், கீழேயுள்ள வரையறைகள் கன்சோல்.பி உடன் டெச்க்டாப் வகுப்பு கணினியில் இயங்கும் சாதனத்துடன் அதிவேக மையத்தின் வழியாக இணைக்கப்பட்டுள்ளன.

source: Rate
ta: விகிதம்

source: Build
ta: உருவாக்கு

source: Build compiler
ta: கம்பைலரை உருவாக்குங்கள்

source: 18K
ta: 18 கே

source: arm-none-eabi-gcc (GNU Tools 7-2018-q3-update) 7.3.1
ta: ARM-NONE-EABI-GCC (GNU கருவிகள் 7-2018-Q3-UPDATE) 7.3.1

source: atmega2560 (serial)
ta: Atmega2560 (சீரியல்)

source: 23K
ta: பசி

source: avr-gcc (GCC) 4.8.1
ta: ஏ.வி.ஆர்-சி.சி.சி (சி.சி.சி) 4.8.1

source: sam3x8e (serial)
ta: sam3x8e (சீரியல்)

source: arm-none-eabi-gcc (Fedora 7.1.0-5.fc27) 7.1.0
ta: ARM-NONE-EABI-GCC (ஃபெடோரா 7.1.0-5.FC27) 7.1.0

source: 75K
ta: உங்கள் கொள்ளை

source: avr-gcc (GCC) 5.4.0
ta: ஏ.வி.ஆர்-சி.சி.சி (சி.சி.சி) 5.4.0

source: 223K
ta: உங்கள் கீழே

source: arm-none-eabi-gcc (Fedora 7.4.0-1.fc30) 7.4.0
ta: ARM-NONE-EABI-GCC (ஃபெடோரா 7.4.0-1.FC30) 7.4.0

source: pru (shared memory)
ta: ப்ரூ (பகிரப்பட்ட நினைவகம்)

source: 260K
ta: 260 கே

source: pru-gcc (GCC) 8.0.0 20170530 (experimental)
ta: ப்ரூ-சி.சி.சி (சி.சி.சி) 8.0.0 20170530 (சோதனை)

source: 355K
ta: உங்கள்

source: 418K
ta: 418 கே

source: lpc1768 (USB)
ta: எல்பிசி 1768 (யூ.எச்.பி)

source: 534K
ta: 534 கே

source: lpc1769 (USB)
ta: எல்பிசி 1769 (யூ.எச்.பி)

source: 628K
ta: 628 கே

source: sam4s8c (USB)
ta: SAM4S8C (யூ.எச்.பி)

source: 650K
ta: 650 கே

source: 864K
ta: 864 கே

source: 870K
ta: 870 கே

source: Host Benchmarks
ta: புரவலன் வரையறைகள்

source: SET start_clock {clock+freq} SET ticks 1000 reset_step_clock oid=0 clock={start_clock} set_next_step_dir oid=0 dir=0 queue_step oid=0 interval={ticks} count=60000 add=0 set_next_step_dir oid=0 dir=1 queue_step oid=0 interval=3000 count=1 add=0 reset_step_clock oid=1 clock={start_clock} set_next_step_dir oid=1 dir=0 queue_step oid=1 interval={ticks} count=60000 add=0 set_next_step_dir oid=1 dir=1 queue_step oid=1 interval=3000 count=1 add=0 reset_step_clock oid=2 clock={start_clock} set_next_step_dir oid=2 dir=0 queue_step oid=2 interval={ticks} count=60000 add=0 set_next_step_dir oid=2 dir=1 queue_step oid=2 interval=3000 count=1 add=0
ta: START_CLOCK {CLACK+FREQ} உண்ணி 1000 ஐ அமைக்கவும் Reset_step_clock oid = 0 கடிகாரம் = {start_clock} set_next_step_dir oid = 0 அடைவு = 0 queue_step oid = 0 இடைவெளி = {ticks} எண்ணிக்கை = 60000 சேர் = 0 set_next_step_dir oid = 0 அடைவு = 1 queue_step oid = 0 இடைவெளி = 3000 எண்ணிக்கை = 1 கூட்டு = 0 Reset_step_clock oid = 1 கடிகாரம் = {start_clock} set_next_step_dir oid = 1 அடைவு = 0 queue_step oid = 1 இடைவெளி = {ticks} எண்ணிக்கை = 60000 சேர் = 0 set_next_step_dir oid = 1 அடைவு = 1 queue_step oid = 1 இடைவெளி = 3000 எண்ணிக்கை = 1 கூட்டு = 0 Reset_step_clock oid = 2 கடிகாரம் = {start_clock} set_next_step_dir oid = 2 அடைவு = 0 queue_step oid = 2 இடைவெளி = {ticks} எண்ணிக்கை = 60000 சேர் = 0 set_next_step_dir oid = 2 அடைவு = 1 queue_step oid = 2 இடைவெளி = 3000 எண்ணிக்கை = 1 கூட்டு = 0

source: ECHO Test result is: {"%.0fK" % (3. * freq / ticks / 1000.)}
ta: எதிரொலி சோதனை முடிவு: {" % .0fk" % (3. * Freq / decks / 1000.)}

source: DELAY {clock + 2*freq} get_uptime FLOOD 100000 0.0 debug_nop get_uptime
ta: நேரந்தவறுகை {கடிகாரம் + 2*ஃப்ரீக்} get_uptime வெள்ளம் 100000 0.0 பிழைத்திருத்தம்_நாப் get_uptime

source: time ~/klippy-env/bin/python ./klippy/klippy.py config/example-cartesian.cfg -i something_complex.gcode -o /dev/null -d out/klipper.dict
ta: நேரம் ~/klippy -env/bin/python.

source: RP2040 step rate benchmark
ta: RP2040 படி வீத அளவுகோல்

source: The following configuration sequence is used on the RP2040:
ta: பின்வரும் உள்ளமைவு வரிசை RP2040 இல் பயன்படுத்தப்படுகிறது:

source: rp2040 (USB)
ta: RP2040 (யூ.எச்.பி)

source: 873K
ta: நீங்கள்

source: c5667193
ta: மீட்டமை 193

source: arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0
ta: ARM-NONE-EABI-GCC (ஃபெடோரா 10.2.0-4.FC34) 10.2.0

source: Benchmarks
ta: வரையறைகள்

source: The test is performed using the console.py tool (described in <Debugging.md>). The micro-controller is configured for the particular hardware platform (see below) and then the following is cut-and-paste into the console.py terminal window:
ta: சோதனை Console.py கருவியைப் பயன்படுத்தி செய்யப்படுகிறது (<பிழைத்திருத்தம். Md> இல் விவரிக்கப்பட்டுள்ளது). மைக்ரோ-கண்ட்ரோலர் குறிப்பிட்ட வன்பொருள் தளத்திற்காக கட்டமைக்கப்பட்டுள்ளது (கீழே காண்க) பின்னர் பின்வருபவை கன்சோலில் வெட்டப்பட்ட மற்றும் ஒட்டுதல்.

source: The command dispatch benchmark tests how many "dummy" commands the micro-controller can process. It is primarily a test of the hardware communication mechanism. The test is run using the console.py tool (described in <Debugging.md>). The following is cut-and-paste into the console.py terminal window:
ta: மைக்ரோ-கன்ட்ரோலர் செயலாக்கக்கூடிய எத்தனை "போலி" கட்டளையிடுகிறது என்பதை கட்டளை அனுப்பும் பெஞ்ச்மார்க் சோதிக்கிறது. இது முதன்மையாக வன்பொருள் தொடர்பு பொறிமுறையின் சோதனை. சோதனை Console.py கருவியைப் பயன்படுத்தி இயக்கப்படுகிறது (<பிழைத்திருத்தம். Md> இல் விவரிக்கப்பட்டுள்ளது). பின்வருபவை கன்சோல்.பி முனைய சாளரத்தில் வெட்டு மற்றும் ஒட்டுதல்:

source: It is possible to run timing tests on the host software using the "batch mode" processing mechanism (described in <Debugging.md>). This is typically done by choosing a large and complex G-Code file and timing how long it takes for the host software to process it. For example:
ta: "தொகுதி பயன்முறை" செயலாக்க பொறிமுறையைப் பயன்படுத்தி புரவலன் மென்பொருளில் நேர சோதனைகளை இயக்க முடியும் (<பிழைத்திருத்தத்தில் விவரிக்கப்பட்டுள்ளது). இது பொதுவாக ஒரு பெரிய மற்றும் சிக்கலான சி-குறியீட்டு கோப்பைத் தேர்ந்தெடுப்பதன் மூலமும், புரவலன் மென்பொருளை செயலாக்க எவ்வளவு நேரம் ஆகும் என்பதை நேரம் செய்வதன் மூலமும் செய்யப்படுகிறது. உதாரணமாக:

source: To obtain the single stepper benchmarks, the same configuration sequence is used, but only the first block of the above test is cut-and-paste into the console.py window.
ta: ஒற்றை ச்டெப்பர் வரையறைகளைப் பெற, அதே உள்ளமைவு வரிசை பயன்படுத்தப்படுகிறது, ஆனால் மேலே உள்ள சோதனையின் முதல் தொகுதி மட்டுமே கன்சோல்.பை சாளரத்தில் வெட்டப்பட்டு ஒட்டுகிறது.

source: The benchmarks are run with parameters suitable for TMC Drivers. For micro-controllers that support `STEPPER_BOTH_EDGE=1` (as reported in the `MCU config` line when console.py first starts) use `step_pulse_duration=0` and `invert_step=-1` to enable optimized stepping on both edges of the step pulse. For other micro-controllers use a `step_pulse_duration` corresponding to 100ns.
ta: டி.எம்.சி டிரைவர்களுக்கு ஏற்ற அளவுருக்கள் மூலம் வரையறைகள் இயக்கப்படுகின்றன. `Stepper_both_edge = 1` (கன்சோல்.பை முதலில் தொடங்கும் போது` MCU கட்டமைப்பு` வரியில் தெரிவிக்கப்பட்டுள்ளபடி) ஆதரிக்கும் மைக்ரோ-கன்ட்ரோலர்களுக்கு `Step_pulse_duration = 0` மற்றும்` Invert_step = -1` ஆகியவற்றைப் பயன்படுத்தவும் படி துடிப்பு. பிற மைக்ரோ-கன்ட்ரோலர்களுக்கு 100ns உடன் தொடர்புடைய `Step_pulse_duration` ஐப் பயன்படுத்தவும்.

source: allocate_oids count=3 config_stepper oid=0 step_pin=PA5 dir_pin=PA4 invert_step=0 step_pulse_ticks=32 config_stepper oid=1 step_pin=PA3 dir_pin=PA2 invert_step=0 step_pulse_ticks=32 config_stepper oid=2 step_pin=PC7 dir_pin=PC6 invert_step=0 step_pulse_ticks=32 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pa5 dir_pin = pa4 invert_step = 0 step_pules_ticks = 32 config_stepper oid = 1 step_pin = pa3 dir_pin = pa2 invert_step = 0 step_pules_ticks = 32 config_stepper oid = 2 step_pin = pc7 dir_pin = pc6 invert_step = 0 step_pules_ticks = 32 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `avr-gcc (GCC) 5.4.0`. Both the 16Mhz and 20Mhz tests were run using simulavr configured for an atmega644p (previous tests have confirmed simulavr results match tests on both a 16Mhz at90usb and a 16Mhz atmega2560).
ta: சி.சி.சி பதிப்பு `ஏ.வி.ஆர்-சி.சி.சி (சி.சி.சி) 5.4.0` உடன்` 59314D99` இல் சோதனை கடைசியாக இயக்கப்பட்டது. 16 மெகா எர்ட்ச் மற்றும் 20 மெகா எர்ட்ச் சோதனைகள் இரண்டும் ATMEGA644P க்காக கட்டமைக்கப்பட்ட சிமுலாவ்ஆரைப் பயன்படுத்தி இயக்கப்பட்டன (முந்தைய சோதனைகள் 16 மெகா எர்ட்ச் AT90USB மற்றும் 16 மெகா எர்ட்ச் Atmega2560 இரண்டிலும் சிமுலாவர் முடிவுகள் போட்டி சோதனைகளை உறுதிப்படுத்தியுள்ளன.

source: allocate_oids count=3 config_stepper oid=0 step_pin=PB27 dir_pin=PA21 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PB26 dir_pin=PC30 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PA21 dir_pin=PC30 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pb27 dir_pin = pa21 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pb26 dir_pin = pc30 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pa21 dir_pin = pc30 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0`.
ta: இந்த சோதனை கடைசியாக GCC பதிப்பு `ARM-NONE-EABI-GCC (ஃபெடோரா 10.2.0-4.FC34) 10.2.0` உடன்` 59314D99` இல் இயக்கப்பட்டது.

source: allocate_oids count=3 config_stepper oid=0 step_pin=PC26 dir_pin=PC18 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PC26 dir_pin=PA8 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PC26 dir_pin=PB4 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pc26 dir_pin = pc18 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pc26 dir_pin = pa8 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pc26 dir_pin = pb4 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: allocate_oids count=3 config_stepper oid=0 step_pin=PD6 dir_pin=PD11 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PD7 dir_pin=PD12 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PD8 dir_pin=PD13 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pd6 dir_pin = pd11 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pd7 dir_pin = pd12 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pd8 dir_pin = pd13 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `gcc version 10.3.1 20210621 (release) (GNU Arm Embedded Toolchain 10.3-2021.07)`.
ta: சி.சி.சி பதிப்பு `சி.சி.சி பதிப்பு 10.3.1 20210621 (வெளியீடு) (குனு கை உட்பொதிக்கப்பட்ட கருவித்தொகுப்பு 10.3-2021.07)` உடன் சோதனை `59314D99` இல் கடைசியாக இயக்கப்பட்டது.

source: allocate_oids count=3 config_stepper oid=0 step_pin=gpio0_23 dir_pin=gpio1_12 invert_step=0 step_pulse_ticks=20 config_stepper oid=1 step_pin=gpio1_15 dir_pin=gpio0_26 invert_step=0 step_pulse_ticks=20 config_stepper oid=2 step_pin=gpio0_22 dir_pin=gpio2_1 invert_step=0 step_pulse_ticks=20 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = gpio0_23 dir_pin = gpio1_12 invert_step = 0 step_pulse_ticks = 20 config_stepper oid = 1 step_pin = gpio1_15 dir_pin = gpio0_26 invert_step = 0 step_pulse_ticks = 20 config_stepper oid = 2 step_pin = gpio0_22 dir_pin = gpio2_1 invert_step = 0 step_pules_ticks = 20 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `pru-gcc (GCC) 8.0.0 20170530 (experimental)`.
ta: இந்த சோதனை கடைசியாக GCC பதிப்பு `PRU-GCC (GCC) 8.0.0 20170530 (சோதனை)` உடன் `59314D99` இல் இயக்கப்பட்டது.

source: allocate_oids count=3 config_stepper oid=0 step_pin=PA1 dir_pin=PA2 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PA3 dir_pin=PA2 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PB8 dir_pin=PA2 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pa1 dir_pin = pa2 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pa3 dir_pin = pa2 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pb8 dir_pin = pa2 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: allocate_oids count=3 config_stepper oid=0 step_pin=PC13 dir_pin=PB5 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PB3 dir_pin=PB6 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PA4 dir_pin=PB7 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pc13 dir_pin = pb5 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pb3 dir_pin = pb6 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pa4 dir_pin = pb7 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: allocate_oids count=3 config_stepper oid=0 step_pin=PA5 dir_pin=PB5 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PB2 dir_pin=PB6 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PB3 dir_pin=PB7 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pa5 dir_pin = pb5 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pb2 dir_pin = pb6 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pb3 dir_pin = pb7 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0`. The STM32F407 results were obtained by running an STM32F407 binary on an STM32F446 (and thus using a 168Mhz clock).
ta: இந்த சோதனை கடைசியாக GCC பதிப்பு `ARM-NONE-EABI-GCC (ஃபெடோரா 10.2.0-4.FC34) 10.2.0` உடன்` 59314D99` இல் இயக்கப்பட்டது. STM32F407 முடிவுகள் STM32F407 பைனரியை ஒரு STM32F446 இல் இயக்குவதன் மூலம் பெறப்பட்டன (இதனால் 168MHz கடிகாரத்தைப் பயன்படுத்துகிறது).

source: allocate_oids count=3 config_stepper oid=0 step_pin=P1.20 dir_pin=P1.18 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=P1.21 dir_pin=P1.18 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=P1.23 dir_pin=P1.18 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = p1.20 dir_pin = p1.18 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = p1.21 dir_pin = p1.18 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = p1.23 dir_pin = p1.18 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0`. The 120Mhz LPC1769 results were obtained by overclocking an LPC1768 to 120Mhz.
ta: இந்த சோதனை கடைசியாக GCC பதிப்பு `ARM-NONE-EABI-GCC (ஃபெடோரா 10.2.0-4.FC34) 10.2.0` உடன்` 59314D99` இல் இயக்கப்பட்டது. 120 மெகா எர்ட்ச் எல்பிசி 1769 முடிவுகள் எல்பிசி 1768 ஐ 120 மெகா எர்ட்ச் வரை ஓவர்லாக் செய்வதன் மூலம் பெறப்பட்டன.

source: allocate_oids count=3 config_stepper oid=0 step_pin=PA27 dir_pin=PA20 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PB3 dir_pin=PA21 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PA17 dir_pin=PA21 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pa27 dir_pin = pa20 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pb3 dir_pin = pa21 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pa17 dir_pin = pa21 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0` on a SAMD21G18 micro-controller.
ta: இந்த சோதனை கடைசியாக GCC பதிப்பு `ARM-NONE-EABI-GCC (ஃபெடோரா 10.2.0-4.FC34) 10.2.0` உடன் ஒரு SAMD21G18 மைக்ரோ-கான்ட்ரோலரில் கமிட்` 59314D99` இல் இயக்கப்பட்டது.
