Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Benchmarks.po
Languages: ta

source: allocate_oids count=3 config_stepper oid=0 step_pin=PA22 dir_pin=PA20 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PA22 dir_pin=PA21 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PA22 dir_pin=PA19 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pa22 dir_pin = pa20 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pa22 dir_pin = pa21 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pa22 dir_pin = pa19 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0` on a SAMD51J19A micro-controller.
ta: GCC பதிப்பு `ARM-NONE-EABI-GCC (ஃபெடோரா 10.2.0-4.FC34) 10.2.0` உடன் ஒரு SAMD51J19A மைக்ரோ-கான்ட்ரோலரில் 10.2.0` உடன் இந்த சோதனை கடைசியாக இயக்கப்பட்டது.

source: allocate_oids count=3 config_stepper oid=0 step_pin=gpio25 dir_pin=gpio3 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=gpio26 dir_pin=gpio4 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=gpio27 dir_pin=gpio5 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = gpio25 dir_pin = gpio3 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = gpio26 dir_pin = gpio4 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = gpio27 dir_pin = gpio5 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0` on a Raspberry Pi Pico board.
ta: ராச்பெர்ரி பை பைக்கோ போர்டில் சி.சி.சி பதிப்பு `ஆர்ம்-நோன்-ஈபி-சி.சி.சி (ஃபெடோரா 10.2.0-4.FC34) 10.2.0` உடன்` 59314D99` இல் சோதனை கடைசியாக இயக்கப்பட்டது.

source: allocate_oids count=3 config_stepper oid=0 step_pin=gpio2 dir_pin=gpio3 invert_step=0 step_pulse_ticks=5 config_stepper oid=1 step_pin=gpio4 dir_pin=gpio5 invert_step=0 step_pulse_ticks=5 config_stepper oid=2 step_pin=gpio6 dir_pin=gpio17 invert_step=0 step_pulse_ticks=5 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = gpio2 dir_pin = gpio3 invert_step = 0 step_pules_ticks = 5 config_stepper oid = 1 step_pin = gpio4 dir_pin = gpio5 invert_step = 0 step_pules_ticks = 5 config_stepper oid = 2 step_pin = gpio6 dir_pin = gpio17 invert_step = 0 step_pules_ticks = 5 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `59314d99` with gcc version `gcc (Raspbian 8.3.0-6+rpi1) 8.3.0` on a Raspberry Pi 3 (revision a02082). It was difficult to get stable results in this benchmark.
ta: சி.சி.சி பதிப்பு `சி.சி.சி (ராச்பியன் 8.3.0-6+ஆர்.பி.ஐ 1) 8.3.0` உடன் ராச்பெர்ரி பை 3 (திருத்தம் A02082) உடன் இந்த சோதனை கடைசியாக இயக்கப்பட்டது. இந்த அளவுகோலில் நிலையான முடிவுகளைப் பெறுவது கடினம்.

source: To produce the benchmarks found in the [Features](Features.md) document, the total number of steps per second is calculated by multiplying the number of active steppers with the nominal mcu frequency and dividing by the final ticks parameter. The results are rounded to the nearest K. For example, with three active steppers:
ta: [அம்சங்கள்] (அம்சங்கள்] (அம்சங்கள். முடிவுகள் அருகிலுள்ள கே. க்கு வட்டமானவை. எடுத்துக்காட்டாக, மூன்று செயலில் உள்ள ச்டெப்பர்களுடன்:

source: STM32G0B1 step rate benchmark
ta: STM32G0B1 படி வீத அளவுகோல்

source: The following configuration sequence is used on the STM32G0B1:
ta: பின்வரும் உள்ளமைவு வரிசை STM32G0B1 இல் பயன்படுத்தப்படுகிறது:

source: allocate_oids count=3 config_stepper oid=0 step_pin=PB13 dir_pin=PB12 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PB10 dir_pin=PB2 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PB0 dir_pin=PC5 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pb13 dir_pin = pb12 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pb10 dir_pin = pb2 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pb0 dir_pin = pc5 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `247cd753` with gcc version `arm-none-eabi-gcc (Fedora 10.2.0-4.fc34) 10.2.0`.
ta: இந்த சோதனை கடைசியாக GCC பதிப்பு `ARM-NONE-EABI-GCC (ஃபெடோரா 10.2.0-4.FC34) 10.2.0` உடன்` 247 சிடி 753` இல் இயக்கப்பட்டது.

source: STM32H7 step rate benchmark
ta: STM32H7 படி வீத அளவுகோல்

source: The following configuration sequence is used on a STM32H743VIT6:
ta: பின்வரும் உள்ளமைவு வரிசை STM32H743VIT6 இல் பயன்படுத்தப்படுகிறது:

source: allocate_oids count=3 config_stepper oid=0 step_pin=PD4 dir_pin=PD3 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PA15 dir_pin=PA8 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PE2 dir_pin=PE3 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pd4 dir_pin = pd3 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pa15 dir_pin = pa8 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pe2 dir_pin = pe3 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `00191b5c` with gcc version `arm-none-eabi-gcc (15:8-2019-q3-1+b1) 8.3.1 20190703 (release) [gcc-8-branch revision 273027]`.
ta: இந்த சோதனை கடைசியாக சி.சி.சி பதிப்பு `ஆர்ம்-நோன்-ஈபி-சி.சி.சி (15: 8-2019-Q3-1+பி 1) 8.3.1 20190703 (வெளியீடு) [சி.சி.சி -8-பிராஞ்ச் திருத்தம் 273027] `.

source: stm32h7
ta: நான் கேட்பேன்

source: AR100 step rate benchmark
ta: AR100 படி வீத அளவுகோல்

source: The following configuration sequence is used on AR100 CPU (Allwinner A64):
ta: பின்வரும் உள்ளமைவு வரிசை AR100 சிபியு இல் பயன்படுத்தப்படுகிறது (ALLWINNER A64):

source: allocate_oids count=3 config_stepper oid=0 step_pin=PL10 dir_pin=PE14 invert_step=-1 step_pulse_ticks=0 config_stepper oid=1 step_pin=PL11 dir_pin=PE15 invert_step=-1 step_pulse_ticks=0 config_stepper oid=2 step_pin=PL12 dir_pin=PE16 invert_step=-1 step_pulse_ticks=0 finalize_config crc=0
ta: ஒதுக்கீடு_யிட்ச் எண்ணிக்கை = 3 config_stepper oid = 0 step_pin = pl10 dir_pin = pe14 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 1 step_pin = pl11 dir_pin = pe15 invert_step = -1 step_pules_ticks = 0 config_stepper oid = 2 step_pin = pl12 dir_pin = pe16 invert_step = -1 step_pules_ticks = 0 இறுதி_கான்ஃபிக் சி.ஆர்.சி = 0

source: The test was last run on commit `08d037c6` with gcc version `or1k-linux-musl-gcc (GCC) 9.2.0` on an Allwinner A64-H micro-controller.
ta: ஆலைனர் A64-H மைக்ரோ-கான்ட்ரோலரில் GCC பதிப்பு `OR1K-LINUX-MUSL-GCC (GCC) 9.2.0` உடன்` 08D037C6` இல் சோதனை கடைசியாக இயக்கப்பட்டது.

source: ar100 (serial)
ta: AR100 (சீரியல்)

source: 138K
ta: 138 கே
