Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bootloaders.po
Languages: ta, uk

source: As with the STM32F1, the STM32F4 uses the hid-flash tool to upload binaries to the MCU. See the instructions above for details on how to build and use hid-flash.
ta: STM32F1 ஐப் போலவே, STM32F4 MCU இல் பைனரிகளைப் பதிவேற்ற HID FLASH கருவியைப் பயன்படுத்துகிறது. HID-FLASH ஐ எவ்வாறு உருவாக்குவது மற்றும் பயன்படுத்துவது என்பது குறித்த விவரங்களுக்கு மேலே உள்ள வழிமுறைகளைப் பார்க்கவும்.
uk: У STM32F1 STM32F4 використовується інструмент для завантаження бункерів до MCU. Див. інструкції, описані вище для деталей, як побудувати і використовувати hid-flash.

source: It may be necessary to manually enter the bootloader, this can be done by setting "boot 0" low, "boot 1" high and plugging in the device. After programming is complete unplug the device and set "boot 1" back to low so the application will be loaded.
ta: துவக்க ஏற்றியை கைமுறையாக உள்ளிடுவது அவசியமாக இருக்கலாம், இதை "துவக்க 0" குறைந்த, "துவக்க 1" உயர் அமைப்பதன் மூலமும் சாதனத்தில் செருகுவதன் மூலமும் செய்ய முடியும். நிரலாக்கமானது சாதனத்தை அவிழ்த்துவிட்டு, "துவக்க 1" ஐ மீண்டும் குறைவாக அமைக்கவும், எனவே பயன்பாடு ஏற்றப்படும்.
uk: Може знадобитися вручну ввести завантажувача, це може бути зроблено за допомогою налаштування "завантаження 0" низький, "завантаження 1" високий і роз'єм в пристрої. Після програмування завершено розгорнути пристрій і встановити "завантажити 1" назад до низького, тому додаток буде завантажено.

source: LPC176x micro-controllers (Smoothieboards)
ta: எல்பிசி 1768 மைக்ரோகண்ட்ரோலர் (ச்மூத்த்போர்டு)
uk: LPC176x мікроконтролери (Smoothieboards)

source: Running OpenOCD on the Raspberry PI
ta: ராச்பெர்ரி பையில் ஓபன்ஓக்ட் இயங்குகிறது
uk: Запуск OpenOCD на Малини Пі

source: OpenOCD is a software package that can perform low-level chip flashing and debugging. It can use the GPIO pins on a Raspberry Pi to communicate with a variety of ARM chips.
ta: OpenOCD என்பது ஒரு மென்பொருள் தொகுப்பாகும், இது குறைந்த அளவிலான சிப் ஒளிரும் மற்றும் பிழைத்திருத்தத்தை செய்ய முடியும். இது பலவிதமான கை சில்லுகளுடன் தொடர்பு கொள்ள ராச்பெர்ரி பையில் GPIO ஊசிகளைப் பயன்படுத்தலாம்.
uk: OpenOCD - це програмний пакет, який може виконати низькорівневе чіп-флешинг і відключення. Він може використовувати штифти GPIO на Raspberry Pi для спілкування з різними чіпами ARM.

source: Begin by downloading and compiling the software (each step may take several minutes and the "make" step may take 30+ minutes):
ta: மென்பொருளைப் பதிவிறக்கம் செய்து தொகுத்தல் மூலம் தொடங்கவும் (ஒவ்வொரு அடியும் பல நிமிடங்கள் ஆகலாம், மேலும் "மேக்" படி 30+ நிமிடங்கள் ஆகலாம்):
uk: Починайте завантажувати та компілювати програмне забезпечення (навчальний крок може зайняти кілька хвилин і «зробити» крок може зайняти 30+ хвилин):

source: Configure OpenOCD
ta: OpenOCD ஐ உள்ளமைக்கவும்
uk: Налаштування OpenOCD

source: Create an OpenOCD config file:
ta: OpenOCD கட்டமைப்பு கோப்பை உருவாக்கவும்:
uk: Створіть файл налаштування OpenOCD:

source: Use a config similar to the following:
ta: பின்வருவனவற்றைப் போன்ற ஒரு உள்ளமைவைப் பயன்படுத்தவும்:
uk: Використовуйте конфігурацію, схожу на наступне:

source: Wire the Raspberry Pi to the target chip
ta: ராச்பெர்ரி பை இலக்கு சிப்பிற்கு கம்பி
uk: Провід Малини Пі до цільового чіпа

source: Poweroff both the the Raspberry Pi and the target chip before wiring! Verify the target chip uses 3.3V prior to connecting to a Raspberry Pi!
ta: வயரிங் முன் ராச்பெர்ரி பை மற்றும் இலக்கு சிப் இரண்டையும் பவர்ஆஃப்! ராச்பெர்ரி பைவுடன் இணைப்பதற்கு முன் இலக்கு சிப் 3.3V ஐப் பயன்படுத்துகிறது என்பதை சரிபார்க்கவும்!
uk: Poweroff як малиновий Пі і цільовий чіп перед сережкою! Перевірити цільовий чіп використовує 3.3V перед підключенням до Raspberry Pi!

source: Connect GND, SWDCLK, SWDIO, and RST on the target chip to GND, GPIO25, GPIO24, and GPIO18 respectively on the Raspberry Pi.
ta: ராச்பெர்ரி பை மீது முறையே சி.என்.டி, சி.பி.ஐ.ஓ 25, சி.பி.ஐ.ஓ 24 மற்றும் சி.பி.ஐ.ஓ 18 உடன் இலக்கு சிப்பில் சி.என்.டி, எச்.டபிள்யூ.டி.சி.எல், எச்.டபிள்யூ.டி.ஐ.ஓ மற்றும் ஆர்.எச்.டி ஆகியவற்றை இணைக்கவும்.
uk: Підключіть GND, SWDCLK, SWDIO та RST на цільовому чіпі до GND, GPIO25, GPIO24 та GPIO18 відповідно до Raspberry Pi.

source: Then power up the Raspberry Pi and provide power to the target chip.
ta: பின்னர் ராச்பெர்ரி பைவை இயக்கி, இலக்கு சிப்பிற்கு சக்தியை வழங்கவும்.
uk: Потім живлення Малини Пі і забезпечити живлення до цільового чіпа.

source: Run OpenOCD
ta: OpenOCD ஐ இயக்கவும்
uk: Завантажити OpenOCD

source: Run OpenOCD:
ta: OpenOCD ஐ இயக்கவும்:
uk: Запуск OpenOCD:

source: The above should cause OpenOCD to emit some text messages and then wait (it should not immediately return to the Unix shell prompt). If OpenOCD exits on its own or if it continues to emit text messages then double check the wiring.
ta: மேலே உள்ளவை OpenOCD சில குறுஞ்செய்திகளை வெளியிட்டு பின்னர் காத்திருக்க வேண்டும் (அது உடனடியாக யூனிக்ச் செல் வரியில் திரும்பக்கூடாது). OpenOCD அதன் சொந்தமாக வெளியேறினால் அல்லது அது தொடர்ந்து குறுஞ்செய்திகளை வெளியிட்டால், வயரிங் இருமுறை சரிபார்க்கவும்.
uk: Визначені вище повинні викликати OpenOCD, щоб випромінювати деякі текстові повідомлення, а потім чекати (не варто негайно повернутися до командного рядка Unix). Якщо виходи OpenOCD самостійно або якщо він продовжує випромінювати текстові повідомлення, то подвійний перевірте проводку.

source: Once OpenOCD is running and is stable, one can send it commands via telnet. Open another ssh session and run the following:
ta: OpenOCD இயங்கும் மற்றும் நிலையானதாக இருந்தால், ஒருவர் அதை டெல்நெட் வழியாக கட்டளைகளை அனுப்பலாம். மற்றொரு பாஓடு அமர்வைத் திறந்து பின்வருவனவற்றை இயக்கவும்:
uk: Після того, як OpenOCD працює і стабільний, ви можете відправити його команди через телнет. Відкрийте чергову сш-сесію і запустіть наступне:

source: (One can exit telnet by pressing ctrl+] and then running the "quit" command.)
ta: (Ctrl+] ஐ அழுத்துவதன் மூலம் ஒருவர் டெல்நெட்டிலிருந்து வெளியேறலாம், பின்னர் "வெளியேறு" கட்டளையை இயக்கலாம்.)
uk: (Одно може вийти телнет, натиснувши ctrl+), а потім запустити команду "кинути".)

source: OpenOCD and gdb
ta: OpenOCD மற்றும் GDB
uk: OpenOCD і gdb

source: It is possible to use OpenOCD with gdb to debug Klipper. The following commands assume one is running gdb on a desktop class machine.
ta: கிளிப்பரை பிழைத்திருத்த சி.டி.பி உடன் ஓபன்ஓசிடியைப் பயன்படுத்த முடியும். ஒருவர் டெச்க்டாப் வகுப்பு கணினியில் GDB ஐ இயக்குகிறார் என்று பின்வரும் கட்டளைகள் கருதுகின்றன.
uk: Можливе використання OpenOCD з gdb до debug Klipper. Наступні команди припускають один біговий диск на машині настільного класу.

source: Add the following to the OpenOCD config file:
ta: OpenOCD கட்டமைப்பு கோப்பில் பின்வருவனவற்றைச் சேர்க்கவும்:
uk: Додайте наступний файл налаштування OpenOCD:

source: Restart OpenOCD on the Raspberry Pi and then run the following Unix command on the desktop machine:
ta: ராச்பெர்ரி பை மீது OpenOCD ஐ மறுதொடக்கம் செய்து, பின்னர் டெச்க்டாப் கணினியில் பின்வரும் யூனிக்ச் கட்டளையை இயக்கவும்:
uk: Перезапустіть OpenOCD на Raspberry Pi, а потім запустіть команду Unix на настільній машині:

source: Within gdb run:
ta: GDB ரன்னுக்குள்:
uk: В рамках gdb запуску:

source: (Replace "octopi" with the host name of the Raspberry Pi.) Once gdb is running it is possible to set breakpoints and to inspect registers.
ta: (Replace "octopi" with the விருந்தோம்பி பெயர் of the புற்றுப்பழம் Pi.) Once gdb is running it is possible பெறுநர் கணம் breakpoints and பெறுநர் inspect registers.
uk: (Replace "octopi" з ім'ям хостів Малина Пі.) Після того, як gdb працює, можна встановити точки розбиття і перевіряти реєстри.

source: Bootloaders
ta: துவக்க ஏற்றிகள்
uk: Завантажувачі

source: In general, the Arduino project is a good reference for bootloaders and flashing procedures on the 8-bit Atmel Atmega micro-controllers. In particular, the "boards.txt" file: <https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt> is a useful reference.
ta: பொதுவாக, 8-பிட் அட்மெல் அட்மகா மைக்ரோ-கன்ட்ரோலர்களில் துவக்க ஏற்றிகள் மற்றும் ஒளிரும் நடைமுறைகளுக்கு ARDUINO திட்டம் ஒரு நல்ல குறிப்பு ஆகும். குறிப்பாக, "போர்டுகள்.
uk: В цілому, проект Arduino є гарним довідником для завантажувачів і миготливих процедур на мікроконтролерах 8-bit Atmel Atmega. Зокрема, файл "boards.txt": <https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt> є корисним посиланням.

source: The Teensy++ device from pjrc.com comes with a proprietary bootloader. It requires a custom flashing tool from <https://github.com/PaulStoffregen/teensy_loader_cli>. One can flash an application with it using something like:
ta: Pjrc.com இலிருந்து டீன் ஏச் ++ சாதனம் தனியுரிம துவக்க ஏற்றி மூலம் வருகிறது. இதற்கு <https://github.com/paulstoffregen/teensy_loader_cli> இலிருந்து தனிப்பயன் ஒளிரும் கருவி தேவைப்படுகிறது. இதுபோன்ற ஒன்றைப் பயன்படுத்தி ஒரு பயன்பாட்டை ஒளிரச் செய்யலாம்:
uk: Пристрій Teensy++ від pjrc.com поставляється з фірмовим завантажувачем. Для користувача миготливий інструмент від <https://github.com/PaulStoffregen/teensy_loader_cli>. За допомогою чогось іншого можна записати:

source: The code at <https://github.com/shumatech/BOSSA> can be used to program the SAM3. It is recommended to use version 1.9 or later.
ta: <https://github.com/shumatech/bossa> இல் உள்ள குறியீட்டை SAM3 ஐ நிரல் செய்ய பயன்படுத்தலாம். பதிப்பு 1.9 அல்லது அதற்குப் பிறகு பயன்படுத்த பரிந்துரைக்கப்படுகிறது.
uk: Код <https://github.com/shumatech/BOSSA> може бути використаний для програми SAM3. Рекомендується використовувати версію 1.9 або пізніше.

source: The code at <https://github.com/shumatech/BOSSA> can be used to program the SAM4. It is necessary to use version `1.8.0` or higher.
ta: <https://github.com/shumatech/bossa> இல் உள்ள குறியீட்டை SAM4 ஐ நிரல் செய்ய பயன்படுத்தலாம். `1.8.0` அல்லது அதற்கு மேற்பட்ட பதிப்பைப் பயன்படுத்துவது தேவை.
uk: Код <https://github.com/shumatech/BOSSA> може використовуватися для програми SAM4. Потрібно використовувати версію `1.8.0` або вище.

source: Obtain a bootloader - several bootloaders are available from <https://github.com/adafruit/uf2-samdx1/releases/latest>. For example:
ta: ஒரு துவக்க ஏற்றியைப் பெறுங்கள் - பல துவக்க ஏற்றிகள் <https://github.com/adafruit/uf2-samdx1/releases/latest> இலிருந்து கிடைக்கின்றன. உதாரணமாக:
uk: Зберігати завантажувач - кілька завантажувальних навантажувачів доступні з <https://github.com/adafruit/uf2-samdx1/ релізів/latest>. Наприклад:

source: The "stm32duino" project has a USB capable bootloader - see: <https://github.com/rogerclarkmelbourne/STM32duino-bootloader>
ta: "STM32Duino" திட்டத்தில் யூ.எச்.பி திறன் கொண்ட துவக்க ஏற்றி உள்ளது - காண்க: <https://github.com/rogerclarkmelbourne/stm32duino-bootloader>
uk: Проект "stm32duino" має USB-розвантажувач, який здатний завантажити - див. <https://github.com/rogerclarkmelbourne/STM32duino-loadloader>

source: This document does not describe the method to flash a bootloader itself - see: <http://smoothieware.org/flashing-the-bootloader> for further information on that topic.
ta: இந்த ஆவணம் ஒரு துவக்க ஏற்றியை ஒளிரச் செய்வதற்கான முறையை விவரிக்கவில்லை-காண்க: <http://smoothieware.org/flashing-the-bootloader> அந்த தலைப்பில் மேலதிக தகவல்களுக்கு.
uk: Цей документ не описує метод, щоб спалахувати себе завантажувача - див. <http://smoothieware.org/flashing-the-bootloader> для подальшої інформації про цю тему.

source: It is common for Smoothieboards to come with a bootloader from: <https://github.com/triffid/LPC17xx-DFU-Bootloader>. When using this bootloader the application must be compiled with a start address of 16KiB. The easiest way to flash an application with this bootloader is to copy the application file (eg, `out/klipper.bin`) to a file named `firmware.bin` on an SD card, and then to reboot the micro-controller with that SD card.
ta: மிருதுவான போர்டுகள் ஒரு துவக்க ஏற்றியுடன் வருவது பொதுவானது: <https://github.com/triffid/lpc17xx-dfu-bootloader>. இந்த துவக்க ஏற்றியைப் பயன்படுத்தும் போது பயன்பாடு 16KIB இன் தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும். இந்த துவக்க ஏற்றி மூலம் ஒரு பயன்பாட்டை ஒளிரச் செய்வதற்கான எளிதான வழி, பயன்பாட்டு கோப்பை (எ.கா., `அவுட்/கிளிப்பர்.பின்`) ஒரு எச்டி கார்டில்` ஃபார்ம்வேர்.பின்` என்ற கோப்பில் நகலெடுக்கவும், பின்னர் மைக்ரோ-கன்ட்ரோலரை மீண்டும் துவக்கவும் அந்த எச்டி அட்டை.
uk: Це звичайний для смузібордів, які приходять з завантажувачем з: <https://github.com/triffid/LPC17x-DFU-Bootloader>. При використанні цього завантажувача програма повинна бути складена з стартовою адресою 16KiB. Найпростіший спосіб спалахувати додаток з цим завантаженням для копіювання файлу програми (наприклад, `out/klipper.bin`) до файлу, названого `firmware.bin` на SD-карті, а потім перезавантажити мікроконтролер з цією SD-картою.

source: This section describes how one can install and launch OpenOCD. It is derived from the instructions at: <https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>
ta: OpenOCD ஐ எவ்வாறு நிறுவலாம் மற்றும் தொடங்கலாம் என்பதை இந்த பிரிவு விவரிக்கிறது. இது அறிவுறுத்தல்களிலிருந்து பெறப்பட்டது: <https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi-pi>
uk: Цей розділ описує, як можна встановити та запустити OpenOCD. <https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>

source: Note that if one is using a Raspberry Pi for the 3.3V serial, the stm32flash protocol uses a serial parity mode which the Raspberry Pi's "mini UART" does not support. See <https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts> for details on enabling the full uart on the Raspberry Pi GPIO pins.
ta: 3.3 வி சீரியலுக்கு ஒருவர் ராச்பெர்ரி பி.ஐ.யைப் பயன்படுத்துகிறார் என்றால், எச்.டி.எம் 32 ஃப்ளாச் நெறிமுறை ஒரு தொடர் சமநிலை பயன்முறையைப் பயன்படுத்துகிறது, இது ராச்பெர்ரி பியின் "மினி யுஆர்ட்" ஆதரிக்காது. ராச்பெர்ரி பை சி.பி.ஐ.ஓ ஊசிகளில் முழு யுஆர்ட்டை இயக்குவது குறித்த விவரங்களுக்கு <https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts> ஐப் பார்க்கவும்.
uk: Зверніть увагу, що якщо один використовує Raspberry Pi для серії 3.3V, протокол Stm32flash використовує режим серійного парі, який Raspberry Pi's "mini UART" не підтримує. Див. <https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts> для деталей, що дозволяє повною мірою на Raspberry Pi GPIO шпильки.

source: The [HID bootloader](https://github.com/Serasidis/STM32_HID_Bootloader) is a compact, driverless bootloader capable of flashing over USB. Also available is a [fork with builds specific to the SKR Mini E3 1.2](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest).
ta: [HID BOOTLOADER] (https://github.com/serasidis/stm32_hid_bootloader) என்பது யூ.எச்.பி மீது ஒளிரும் திறன் கொண்ட ஒரு சிறிய, இயக்கி இல்லாத துவக்க ஏற்றி ஆகும். [எச்.கே.ஆர் மினி இ 3 1.2] (https://github.com/arksine/STM32_HID_BOOTLOADER/RELEASES/LATEST) க்கு குறிப்பிட்ட கட்டமைப்பைக் கொண்ட முட்கரண்டி).
uk: The [HID Bootloader](https://github.com/Serasidis/STM32_HID_Bootloader) є компактним, без водіям завантажувача, здатний перемикатися USB. Також доступний [fork з побудовою специфіки SKR Mini E3 1.2](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest).

source: STM32F103/STM32F072 with MSC bootloader
ta: MSC துவக்க ஏற்றி உடன் STM32F103/STM32F072
uk: STM32F103/STM32F072 з завантаженням MSC

source: The [MSC bootloader](https://github.com/Telekatz/MSC-stm32f103-bootloader) is a driverless bootloader capable of flashing over USB.
ta: [MSC துவக்க ஏற்றி] (https://github.com/telekatz/msc-stm32f103-bootloader) என்பது யூ.எச்.பி மீது ஒளிரும் திறன் கொண்ட இயக்கி இல்லாத துவக்க ஏற்றி ஆகும்.
uk: [MSC bootloader](https://github.com/Telekatz/MSC-stm32f103-завантажувач) є бездротовим завантажувачем, здатним спалахувати над USB.

source: For STM32F072 boards it is also possible to flash the bootloader over USB (via DFU) with something like:
ta: STM32F072 பலகைகளுக்கு யூ.எச்.பி (டி.எஃப்.யூ வழியாக) மீது துவக்க ஏற்றியை ஒளிரச் செய்யலாம்:
uk: Для дощок STM32F072 також можна мити завантажувач над USB (через DFU) з чимось схожим:

source: This bootloader uses 8KiB or 16KiB of flash space, see description of the bootloader (the application must be compiled with with the corresponding starting address).
ta: இந்த துவக்க ஏற்றி 8 கிப் அல்லது 16 கிப் ஃபிளாச் இடத்தைப் பயன்படுத்துகிறது, துவக்க ஏற்றியின் விளக்கத்தைப் பார்க்கவும் (பயன்பாடு தொடர்புடைய தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும்).
uk: Цей завантажувач використовує 8KiB або 16KiB флеш-простору, див. опис завантажувача (додаток необхідно скомпільувати з відповідною стартовою адресою).

source: The bootloader can be activated by pressing the reset button of the board twice. As soon as the bootloader is activated, the board appears as a USB flash drive onto which the klipper.bin file can be copied.
ta: பலகையின் மீட்டமைப்பு பொத்தானை இரண்டு முறை அழுத்துவதன் மூலம் துவக்க ஏற்றி செயல்படுத்தப்படலாம். துவக்க ஏற்றி செயல்படுத்தப்பட்டவுடன், பலகை யூ.எச்.பி ஃபிளாச் டிரைவாக தோன்றும், அதில் klipper.bin கோப்பை நகலெடுக்க முடியும்.
uk: Завантажувач може бути активований, натиснувши кнопку скидання дошки двічі. Як тільки активується завантажувач, дошка з'являється як флеш-накопичувач USB, на який файл klipper.bin можна копіювати.

source: The STM32F103 devices have a ROM that can flash a bootloader or application via 3.3V serial. Typically one would wire the PA10 (MCU Rx) and PA9 (MCU Tx) pins to a 3.3V UART adapter. To access the ROM, one should connect the "boot 0" pin to high and "boot 1" pin to low, and then reset the device. The "stm32flash" package can then be used to flash the device using something like:
ta: STM32F103 சாதனங்களில் ஒரு ரோம் உள்ளது, இது ஒரு துவக்க ஏற்றி அல்லது பயன்பாட்டை 3.3V சீரியல் வழியாக ஒளிரச் செய்யலாம். பொதுவாக ஒருவர் PA10 (MCU RX) மற்றும் PA9 (MCU TX) ஊசிகளை 3.3V UART அடாப்டருக்கு கம்பி செய்வார். ROM ஐ அணுக, ஒருவர் "பூட் 0" முள் உயரமாகவும், "துவக்க 1" முள் குறைவாகவும், பின்னர் சாதனத்தை மீட்டமைக்க வேண்டும். "STM32flash" தொகுப்பு பின்னர் சாதனத்தை ஒளிரச் செய்ய பயன்படுத்தப்படலாம்:
uk: Пристрої STM32F103 мають ROM, які можуть спалахувати завантажувач або додаток через 3.3V серійний. Зазвичай одна б проводила PA10 (MCU Rx) і PA9 (MCU Tx) шпильки до адаптера 3.3V UART. Щоб отримати доступ до ROM, слід підключити "завантажити 0" шпильку до високих і "завантажити 1" шпильку до низьких, а потім скидати пристрій. Пакет "stm32flash" може бути використаний для того, щоб заблокувати пристрій за допомогою чогось:

source: STM32F103/STM32F0x2 with CanBoot bootloader
ta: CANBOOT BOOTHLOADER உடன் STM32F103/STM32F0X2
uk: STM32F103/STM32F0x2 з завантажувачем CanBoot

source: The [CanBoot](https://github.com/Arksine/CanBoot) bootloader provides an option for uploading Klipper firmware over the CANBUS. The bootloader itself is derived from Klipper's source code. Currently CanBoot supports the STM32F103, STM32F042, and STM32F072 models.
ta: [Canboot] (https://github.com/arksine/canboot) பூட்லோடர் கான்பச் மீது கிளிப்பர் ஃபார்ம்வேரைப் பதிவேற்றுவதற்கான விருப்பத்தை வழங்குகிறது. துவக்க ஏற்றி கிளிப்பரின் மூலக் குறியீட்டிலிருந்து பெறப்பட்டது. தற்போது கான்பூட் STM32F103, STM32F042 மற்றும் STM32F072 மாதிரிகளை ஆதரிக்கிறது.
uk: [CanBoot](https://github.com/Arksine/CanBoot) bootloader забезпечує можливість завантаження прошивки Klipper над CANBUS. Сам завантажувач виходить з коду джерела Klipper. Сьогодні CanBoot підтримує моделі STM32F103, STM32F042 та STM32F072.

source: The first time CanBoot has been flashed it should detect that no application is present and enter the bootloader. If this doesn't occur it is possible to enter the bootloader by pressing the reset button twice in succession.
ta: முதல் முறையாக கான்பூட் ஒளிரும் போது, எந்த பயன்பாடும் இல்லை என்பதைக் கண்டறிந்து துவக்க ஏற்றியை உள்ளிட வேண்டும். இது நிகழவில்லை என்றால், மீட்டமை பொத்தானை இரண்டு முறை அடுத்தடுத்து அழுத்துவதன் மூலம் துவக்க ஏற்றியை உள்ளிட முடியும்.
uk: У перший раз CanBoot був спалахований, він повинен виявити, що немає програми присутні і ввести завантажувач. Якщо це не відбувається, можна ввести завантажувача, натиснувши кнопку скидання двічі у спадку.

source: The `flash_can.py` utility supplied in the `lib/canboot` folder may be used to upload Klipper firmware. The device UUID is necessary to flash. If you do not have a UUID it is possible to query nodes currently running the bootloader:
ta: கிளிப்பர் ஃபார்ம்வேரைப் பதிவேற்ற `லிப்/கான்பூட்` கோப்புறையில் வழங்கப்பட்ட` ஃப்ளாச்_கான்.பை` பயன்பாடு பயன்படுத்தப்படலாம். ஃபிளாச் செய்ய சாதனம் UUID தேவை. உங்களிடம் UUID இல்லையென்றால், தற்போது துவக்க ஏற்றியை இயக்கும் முனைகளை வினவ முடியும்:
uk: `flash_can.py` утиліта поставляється в папці `lib/canboot` може бути використана для завантаження прошивки Klipper. Пристрої UUID необхідно спалахувати. Якщо ви не маєте UUID, це можливо для запиту вузлів, які наразі працюють завантажувачем:

source: This will return UUIDs for all connected nodes not currently assigned a UUID. This should include all nodes currently in the bootloader.
ta: இது தற்போது UUID ஒதுக்கப்படாத அனைத்து இணைக்கப்பட்ட முனைகளுக்கும் UUID களைத் தரும். இது தற்போது துவக்க ஏற்றியில் உள்ள அனைத்து முனைகளையும் கொண்டிருக்க வேண்டும்.
uk: Це поверне UUIDs для всіх підключених вузлів, які не призначають UUID. Це повинно включати всі вузли в даний час в завантажувачі.

source: Once you have a UUID, you may upload firmware with following command:
ta: உங்களிடம் UUID கிடைத்ததும், பின்வரும் கட்டளையுடன் ஃபார்ம்வேரை பதிவேற்றலாம்:
uk: Після того, як у вас є UUID, ви можете завантажити прошивку з наступним командуванням:

source: Where `aabbccddeeff` is replaced by your UUID. Note that the `-i` and `-f` options may be omitted, they default to `can0` and `~/klipper/out/klipper.bin` respectively.
ta: `Aabbccddeeff` உங்கள் UUID ஆல் மாற்றப்படுகிறது. `-I` மற்றும்` -f` விருப்பங்கள் தவிர்க்கப்படலாம் என்பதை நினைவில் கொள்க, அவை முறையே `can0` மற்றும்` ~/klipper/out/klipper.bin` க்கு இயல்புநிலையாக இருக்கும்.
uk: Де ` aabbccddeeff` замінено на UUID. Зверніть увагу, що параметри `-i` та `-f` можуть бути використані, вони за замовчуванням `can0` та ` ~/klipper/out/klipper.bin` відповідно.

source: When building Klipper for use with CanBoot, select the 8 KiB Bootloader option.
ta: கான்பூட் உடன் பயன்படுத்த கிளிப்பரை உருவாக்கும்போது, 8 KIB துவக்க ஏற்றி விருப்பத்தைத் தேர்ந்தெடுக்கவும்.
uk: При побудові Кліппера для використання з CanBoot виберіть варіант завантаження 8 KiB.

source: For generic STM32F103 boards such as the blue pill it is possible to flash the bootloader via 3.3V serial using stm32flash as noted in the stm32duino section above, substituting the file name for the desired hid bootloader binary (ie: hid_generic_pc13.bin for the blue pill).
ta: நீல மாத்திரை போன்ற பொதுவான STM32F103 பலகைகளுக்கு, மேலே உள்ள STM32Duino பிரிவில் குறிப்பிடப்பட்டுள்ளபடி STM32flash ஐப் பயன்படுத்தி 3.3V சீரியல் வழியாக துவக்க ஏற்றியை ஒளிரச் செய்ய முடியும், விரும்பிய HID துவக்க ஏற்றி பைனரிக்கு (IE: HID_GENERIC_PC13.Bin க்கு கோப்பு பெயரை மாற்றுகிறது. ).
uk: Для генеричних щитів STM32F103, таких як синя таблетка, можливо, мити завантажувач через 3.3V серійний за допомогою stm32flash, як зазначено в розділі stm32duino вище, підкреслюючи назву файлу для бажаного ходового завантажувача бінарними (тобто: hid_generic_pc13.bin для синього стовпа).
