Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bootloaders.po
Languages: ta, uk

source: This document provides information on common bootloaders found on micro-controllers that Klipper supports.
ta: இந்த ஆவணம் கிளிப்பர் ஆதரிக்கும் மைக்ரோகண்ட்ரோலர்களில் காணப்படும் பொதுவான துவக்க ஏற்றி பற்றிய தகவல்களை வழங்குகிறது.
uk: Цей документ надає інформацію про загальні завантажувачі, знайдені на мікроконтролерах, які підтримують Klipper.

source: The bootloader is 3rd-party software that runs on the micro-controller when it is first powered on. It is typically used to flash a new application (eg, Klipper) to the micro-controller without requiring specialized hardware. Unfortunately, there is no industry wide standard for flashing a micro-controller, nor is there a standard bootloader that works across all micro-controllers. Worse, it is common for each bootloader to require a different set of steps to flash an application.
ta: துவக்க ஏற்றி 3 வது தரப்பு மென்பொருளாகும், இது முதலில் இயக்கப்படும் போது மைக்ரோ-கன்ட்ரோலரில் இயங்குகிறது. சிறப்பு வன்பொருள் தேவையில்லாமல் மைக்ரோ-கன்ட்ரோலருக்கு ஒரு புதிய பயன்பாட்டை (எ.கா., கிளிப்பர்) ஒளிரச் செய்ய இது பொதுவாகப் பயன்படுத்தப்படுகிறது. துரதிர்ச்டவசமாக, மைக்ரோ-கன்ட்ரோலரை ஒளிரச் செய்வதற்கு தொழில் பரந்த தரநிலை இல்லை, அல்லது அனைத்து மைக்ரோ-கன்ட்ரோலர்களிலும் செயல்படும் ஒரு நிலையான துவக்க ஏற்றி இல்லை. மோசமான சேதி என்னவென்றால், ஒவ்வொரு துவக்க ஏற்றுதலுக்கும் ஒரு பயன்பாட்டை ஒளிரச் செய்ய வெவ்வேறு படிகள் தேவைப்படுவது பொதுவானது.
uk: Завантажувач - це 3-стороннє програмне забезпечення, яке працює на мікроконтролері, коли він спочатку працює. Зазвичай використовується для спалаху нової програми (наприклад, Klipper) до мікроконтролера без необхідності спеціалізованого обладнання. На жаль, не існує галузевого широкого стандарту для миття мікроконтролера, а не є стандартним завантажувачем, який працює по всій мікроконтролерах. Похиліть, це поширений для кожного завантажувача, щоб зажадати інший набір кроків, щоб флеш додаток.

source: If one can flash a bootloader to a micro-controller then one can generally also use that mechanism to flash an application, but care should be taken when doing this as one may inadvertently remove the bootloader. In contrast, a bootloader will generally only permit a user to flash an application. It is therefore recommended to use a bootloader to flash an application where possible.
ta: ஒரு துவக்க ஏற்றியை ஒரு மைக்ரோ-கன்ட்ரோலருக்கு ஒளிரச் செய்ய முடிந்தால், பொதுவாக ஒரு பயன்பாட்டை ஒளிரச் செய்ய அந்த பொறிமுறையையும் பயன்படுத்தலாம், ஆனால் இதைச் செய்யும்போது கவனக்குறைவாக துவக்க ஏற்றியை அகற்றலாம். இதற்கு நேர்மாறாக, ஒரு துவக்க ஏற்றி பொதுவாக ஒரு பயனரை ஒரு பயன்பாட்டை ஒளிரச் செய்ய மட்டுமே அனுமதிக்கும். எனவே ஒரு பயன்பாட்டை சாத்தியமான இடங்களில் ஒளிரச் செய்ய துவக்க ஏற்றி பயன்படுத்த பரிந்துரைக்கப்படுகிறது.
uk: Якщо один може спалахти завантажувача до мікроконтролера, то можна, як правило, використовувати цей механізм, щоб спалахувати додаток, але обережно слід приймати при виконанні цього, як один може неперевершено видалити завантажувач. На відміну від того, що завантажувач, як правило, дозволить користувачу зафіксувати додаток. Таким чином, рекомендується використовувати завантажувач для миття програми.

source: This document attempts to describe common bootloaders, the steps needed to flash a bootloader, and the steps needed to flash an application. This document is not an authoritative reference; it is intended as a collection of useful information that the Klipper developers have accumulated.
ta: இந்த ஆவணம் பொதுவான துவக்க ஏற்றிகள், துவக்க ஏற்றியை ஒளிரச் செய்ய தேவையான படிகள் மற்றும் ஒரு பயன்பாட்டை ஒளிரச் செய்ய தேவையான படிகளை விவரிக்க முயற்சிக்கிறது. இந்த ஆவணம் அதிகாரப்பூர்வ குறிப்பு அல்ல; கிளிப்பர் உருவாக்குபவர்கள் குவித்த பயனுள்ள தகவல்களின் தொகுப்பாக இது கருதப்படுகிறது.
uk: Цей документ намагається описати загальні завантажувачі, кроки, необхідні для спалаху завантажувача, і кроки, необхідні для спалаху програми. Цей документ не є авторським довідником; він призначений для збору корисної інформації, яку накопичили розробники Klipper.

source: AVR micro-controllers
ta: ஏ.வி.ஆர் மைக்ரோ-கன்ட்ரோலர்கள்
uk: Мікроконтролери AVR

source: To flash a bootloader itself, the AVR chips require an external hardware flashing tool (which communicates with the chip using SPI). This tool can be purchased (for example, do a web search for "avr isp", "arduino isp", or "usb tiny isp"). It is also possible to use another Arduino or Raspberry Pi to flash an AVR bootloader (for example, do a web search for "program an avr using raspberry pi"). The examples below are written assuming an "AVR ISP Mk2" type device is in use.
ta: ஒரு துவக்க ஏற்றியை ஒளிரச் செய்ய, ஏ.வி.ஆர் சில்லுகளுக்கு வெளிப்புற வன்பொருள் ஒளிரும் கருவி தேவைப்படுகிறது (இது SPI ஐப் பயன்படுத்தி சிப்புடன் தொடர்பு கொள்கிறது). இந்த கருவியை வாங்கலாம் (எடுத்துக்காட்டாக, "ஏ.வி.ஆர் ஐ.எச்.பி", "ஆர்டுயினோ ஐ.எச்.பி" அல்லது "யூ.எச்.பி டைனி ஐ.எச்.பி" க்கான வலைத் தேடலைச் செய்யுங்கள்). ஏ.வி.ஆர் துவக்க ஏற்றியை ஒளிரச் செய்ய மற்றொரு அர்டுயினோ அல்லது ராச்பெர்ரி பைவைப் பயன்படுத்தவும் முடியும் (எடுத்துக்காட்டாக, "ராச்பெர்ரி பை பயன்படுத்தி ஏ.வி.ஆர் நிரல்" என்பதற்கான வலைத் தேடலைச் செய்யுங்கள்). கீழே உள்ள எடுத்துக்காட்டுகள் "ஏ.வி.ஆர் ஐ.எச்.பி எம்.கே 2" வகை சாதனம் பயன்பாட்டில் இருப்பதாகக் கருதி எழுதப்பட்டுள்ளன.
uk: Для того, щоб спалахувати себе завантажувача, чіпси AVR вимагають зовнішнього обладнання, що блимає інструмент (який спілкується з чіпом за допомогою SPI). Цей інструмент може бути придбаний (наприклад, зробити веб-пошук для "avr isp", "arduino isp", або "usb tiny isp"). Також можна використовувати ще один Arduino або Малиновий Пі, щоб спалахувати AVR завантажувач (наприклад, зробити пошук для "програми avr за допомогою малинового пі"). Приклади нижче писуються, що припустимо пристрій типу "AVR ISP Mk2" у використанні.

source: The "avrdude" program is the most common tool used to flash atmega chips (both bootloader flashing and application flashing).
ta: "அவ்ர்தூட்" நிரல் என்பது ஆட்மெகா சில்லுகளை ஒளிரச் செய்யப் பயன்படுத்தப்படும் மிகவும் பொதுவான கருவியாகும் (துவக்க ஏற்றி ஒளிரும் மற்றும் பயன்பாட்டு ஒளிரும் இரண்டும்).
uk: Програма "avrdude" є найбільш поширеним інструментом, який використовується для флеш-пам'яті atmega.

source: Atmega2560
uk: Атмега2560

source: This chip is typically found in the "Arduino Mega" and is very common in 3d printer boards.
ta: இந்த சிப் பொதுவாக "அர்டுயினோ மெகா" இல் காணப்படுகிறது மற்றும் 3D அச்சுப்பொறி பலகைகளில் மிகவும் பொதுவானது.
uk: Цей чіп, як правило, знаходиться в "Arduino Mega" і дуже поширений в 3d друкованих плат.

source: To flash the bootloader itself use something like:
ta: துவக்க ஏற்றி ஃபிளாச் செய்ய இதுபோன்ற ஒன்றைப் பயன்படுத்துங்கள்:
uk: Для миття завантажувача використовуйте щось схоже:

source: To flash an application use something like:
ta: ஒரு பயன்பாட்டை ஒளிரச் செய்ய இதுபோன்ற ஒன்றைப் பயன்படுத்தவும்:
uk: Для спалаху програми використовуйте щось схоже:

source: Atmega1280
uk: Атмега1280

source: This chip is typically found in earlier versions of the "Arduino Mega".
ta: இந்த சிப் பொதுவாக "அர்டுயினோ மெகா" இன் முந்தைய பதிப்புகளில் காணப்படுகிறது.
uk: Цей чіп зазвичай зустрічається в попередніх версіях "Ардуіно Мега".

source: Atmega1284p
uk: Атмега1284p

source: This chip is commonly found in "Melzi" style 3d printer boards.
ta: இந்த சிப் பொதுவாக "மெல்சி" பாணி 3D அச்சுப்பொறி பலகைகளில் காணப்படுகிறது.
uk: Цей чіп зазвичай знаходиться в стилі "Melzi" 3d принтер дошки.

source: Note that a number of "Melzi" style boards come preloaded with a bootloader that uses a baud rate of 57600. In this case, to flash an application use something like this instead:
ta: 57600 என்ற பாட் வீதத்தைப் பயன்படுத்தும் துவக்க ஏற்றி மூலம் பல "மெல்சி" பாணி பலகைகள் முன்பே ஏற்றப்பட்டுள்ளன என்பதை நினைவில் கொள்க. இந்த விசயத்தில், ஒரு பயன்பாட்டை ஒளிரச் செய்ய இதுபோன்ற ஒன்றைப் பயன்படுத்தவும்:
uk: Зауважте, що кількість дошок стилю «Мельці» прийшло попередньо завантажене завантажувачем, який використовує приманку 57600. У цьому випадку, щоб спалахувати додаток, використовуйте щось, як це замість:

source: At90usb1286
uk: Напляскване1286

source: This document does not cover the method to flash a bootloader to the At90usb1286 nor does it cover general application flashing to this device.
ta: இந்த ஆவணம் AT90USB1286 க்கு ஒரு துவக்க ஏற்றியை ஒளிரச் செய்வதற்கான முறையை மறைக்காது அல்லது இந்த சாதனத்திற்கு பொதுவான பயன்பாட்டை ஒளிரச் செய்யாது.
uk: Цей документ не охоплює метод, щоб мити завантажувач до At90usb1286, а не охоплює загальний додаток, що миготливий до цього пристрою.

source: Atmega168
uk: Атмега168

source: The atmega168 has limited flash space. If using a bootloader, it is recommended to use the Optiboot bootloader. To flash that bootloader use something like:
ta: ATMEGA168 வரையறுக்கப்பட்ட ஃபிளாச் இடத்தைக் கொண்டுள்ளது. துவக்க ஏற்றி பயன்படுத்தினால், ஆப்டிபூட் துவக்க ஏற்றி பயன்படுத்த பரிந்துரைக்கப்படுகிறது. அந்த துவக்க ஏற்றி போன்ற ஒன்றைப் பயன்படுத்துங்கள்:
uk: Atmega168 має обмежений простір спалаху. При використанні завантажувача рекомендується використовувати завантажувач Optiboot. Для спалаху, який завантажувач використовує щось схоже:

source: To flash an application via the Optiboot bootloader use something like:
ta: ஆப்டிபூட் துவக்க ஏற்றி வழியாக ஒரு பயன்பாட்டை ஒளிரச் செய்ய இதுபோன்ற ஒன்றைப் பயன்படுத்தவும்:
uk: Для того, щоб мити додаток за допомогою Optibootloader використовуйте щось схоже:

source: SAM3 micro-controllers (Arduino Due)
ta: SAM3 மைக்ரோ-கன்ட்ரோலர்கள் (Arduino காரணமாக)
uk: Мікроконтролери SAM3 (Arduino Due)

source: It is not common to use a bootloader with the SAM3 mcu. The chip itself has a ROM that allows the flash to be programmed from 3.3V serial port or from USB.
ta: SAM3 MCU உடன் துவக்க ஏற்றி பயன்படுத்துவது பொதுவானதல்ல. சிப்பில் ஒரு ரோம் உள்ளது, இது ஃபிளாச் 3.3 வி சீரியல் போர்ட்டிலிருந்து அல்லது யூ.எச்.பி.
uk: Незвичайно використовувати завантажувач з SAM3 mcu. Сама чіп має ROM, що дозволяє спалаху програмувати з 3.3V серійного порту або з USB.

source: To enable the ROM, the "erase" pin is held high during a reset, which erases the flash contents, and causes the ROM to run. On an Arduino Due, this sequence can be accomplished by setting a baud rate of 1200 on the "programming usb port" (the USB port closest to the power supply).
ta: ROM ஐ இயக்க, மீட்டமைப்பின் போது "அழித்தல்" முள் அதிகமாக உள்ளது, இது ஃபிளாச் உள்ளடக்கங்களை அழிக்கிறது, மேலும் ரோம் இயங்குகிறது. ஒரு ஆர்டுயினோவில், "புரோகிராமிங் யூ.எச்.பி துறைமுகம்" (மின்சார விநியோகத்திற்கு மிக நெருக்கமான யூ.எச்.பி போர்ட்) இல் 1200 என்ற பாட் வீதத்தை அமைப்பதன் மூலம் இந்த வரிசையை நிறைவேற்ற முடியும்.
uk: Для того, щоб увімкнути ROM, штифт "запаювання" проводиться високою під час скидання, яка стирає вміст спалаху, і викликає ROM для запуску. На Arduino Due, цей послідовність може бути виконана шляхом встановлення швидкості шнура 1200 на "програмування USB-порту" (порт USB, найближчий до джерела живлення).

source: SAM4 micro-controllers (Duet Wifi)
ta: SAM4S மைக்ரோகண்ட்ரோலர் (டூயட் வைஃபை)
uk: Мікроконтролери SAM4 (Duet Wifi)

source: It is not common to use a bootloader with the SAM4 mcu. The chip itself has a ROM that allows the flash to be programmed from 3.3V serial port or from USB.
ta: SAM4 MCU உடன் துவக்க ஏற்றி பயன்படுத்துவது பொதுவானதல்ல. சிப்பில் ஒரு ரோம் உள்ளது, இது ஃபிளாச் 3.3 வி சீரியல் போர்ட்டிலிருந்து அல்லது யூ.எச்.பி.
uk: Незвичайно використовувати завантажувач SAM4 mcu. Сама чіп має ROM, що дозволяє спалаху програмувати з 3.3V серійного порту або з USB.

source: To enable the ROM, the "erase" pin is held high during a reset, which erases the flash contents, and causes the ROM to run.
ta: ROM ஐ இயக்க, மீட்டமைப்பின் போது "அழித்தல்" முள் அதிகமாக உள்ளது, இது ஃபிளாச் உள்ளடக்கங்களை அழிக்கிறது, மேலும் ரோம் இயங்குகிறது.
uk: Для того, щоб увімкнути ROM, штифт "запаювання" проводиться високою під час скидання, яка стирає вміст спалаху, і викликає ROM для запуску.

source: SAMD21 micro-controllers (Arduino Zero)
ta: SAMD21 மைக்ரோ-கன்ட்ரோலர்கள் (ஆர்டுயினோ சீரோ)
uk: Мікроконтролери SAMD21 (Arduino Zero)

source: The SAMD21 bootloader is flashed via the ARM Serial Wire Debug (SWD) interface. This is commonly done with a dedicated SWD hardware dongle. Alternatively, one can use a [Raspberry Pi with OpenOCD](#running-openocd-on-the-raspberry-pi).
ta: SAMD21 துவக்க ஏற்றி கை சீரியல் கம்பி பிழைத்திருத்த (SWD) இடைமுகம் வழியாக ஒளிரும். இது பொதுவாக ஒரு பிரத்யேக SWD வன்பொருள் டாங்கிள் மூலம் செய்யப்படுகிறது. மாற்றாக, ஒருவர் [ஓபன்ஓசிடி உடன் ராச்பெர்ரி பை] (#ரன்னிங்-ஓபெனோக்ட்-ஆன்-தி-ராச்பெர்ரி-பிஐ) பயன்படுத்தலாம்.
uk: Завантажувач SAMD21 прошивається через інтерфейс ARM Serial Wire Debug (SWD). Зазвичай це робиться за допомогою спеціального апаратного ключа SWD. Крім того, можна використовувати [Raspberry Pi з OpenOCD](#running-openocd-on-the-raspberry-pi).

source: To flash a bootloader with OpenOCD use the following chip config:
ta: OpenOCD உடன் துவக்க ஏற்றி ஒளிரச் செய்ய பின்வரும் சிப் உள்ளமைவைப் பயன்படுத்தவும்:
uk: Для миття завантажувача з OpenOCD використовуйте такі налаштування чіпа:

source: Obtain a bootloader - for example:
ta: ஒரு துவக்க ஏற்றியைப் பெறுங்கள் - எடுத்துக்காட்டாக:
uk: Зберігайте завантажувач - наприклад:

source: Flash with OpenOCD commands similar to:
ta: ஓபன்ஓசிடி கட்டளைகளுடன் ஃபிளாச் இதுபோன்றது:
uk: Флеш з командами OpenOCD аналогічно:

source: The most common bootloader on the SAMD21 is the one found on the "Arduino Zero". It uses an 8KiB bootloader (the application must be compiled with a start address of 8KiB). One can enter this bootloader by double clicking the reset button. To flash an application use something like:
ta: SAMD21 இல் மிகவும் பொதுவான துவக்க ஏற்றி "Arduino பூச்சியத்தில்" காணப்படுகிறது. இது 8kib துவக்க ஏற்றி பயன்படுத்துகிறது (பயன்பாடு 8kib இன் தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும்). மீட்டமை பொத்தானை இருமுறை சொடுக்கு செய்வதன் மூலம் இந்த துவக்க ஏற்றியை உள்ளிடலாம். ஒரு பயன்பாட்டை ஒளிரச் செய்ய இதுபோன்ற ஒன்றைப் பயன்படுத்தவும்:
uk: Найпоширеніший завантажувач на SAMD21 є одним, знайденим на "Arduino Zero". Він використовує завантажувач 8KiB (додаток необхідно скомпільувати за допомогою стартової адреси 8KiB). Один може ввести цей завантажувач двічі натиснувши кнопку скидання. Для спалаху програми використовуйте щось схоже:

source: In contrast, the "Arduino M0" uses a 16KiB bootloader (the application must be compiled with a start address of 16KiB). To flash an application on this bootloader, reset the micro-controller and run the flash command within the first few seconds of boot - something like:
ta: இதற்கு நேர்மாறாக, "Arduino M0" 16kib துவக்க ஏற்றியைப் பயன்படுத்துகிறது (பயன்பாடு 16kib இன் தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும்). இந்த துவக்க ஏற்றியில் ஒரு பயன்பாட்டை ஒளிரச் செய்ய, மைக்ரோ -கன்ட்ரோலரை மீட்டமைத்து, துவக்கத்தின் முதல் சில நொடிகளில் ஃபிளாச் கட்டளையை இயக்கவும் - இது போன்றது:
uk: На відміну від "Arduino M0" використовує 16KiB завантажувач (додаток необхідно скомпільувати з стартовою адресою 16KiB). Для того, щоб мити додаток на цьому завантажувачі, скидайте мікроконтролер і запустіть флеш-команду протягом перших декількох секунд завантаження - щось схоже:

source: SAMD51 micro-controllers (Adafruit Metro-M4 and similar)
ta: SAMD51 மைக்ரோ-கன்ட்ரோலர்கள் (அடாஃப்ரூட் மெட்ரோ-எம் 4 மற்றும் ஒத்த)
uk: Мікроконтролери SAMD51 (Adafruit Metro-M4)

source: Like the SAMD21, the SAMD51 bootloader is flashed via the ARM Serial Wire Debug (SWD) interface. To flash a bootloader with [OpenOCD on a Raspberry Pi](#running-openocd-on-the-raspberry-pi) use the following chip config:
ta: SAMD21 ஐப் போலவே, SAMD51 துவக்க ஏற்றி கை சீரியல் கம்பி பிழைத்திருத்த (SWD) இடைமுகம் வழியாக ஒளிரும். [ராச்பெர்ரி பை மீது ஓபன்ஓசிடி] (#ரன்னிங்-ஓபெனோக்ட்-ஆன்-தி-ராச்பெர்ரி-பிஐ) உடன் ஒரு துவக்க ஏற்றியை ஒளிரச் செய்ய பின்வரும் சிப் கட்டமைப்பைப் பயன்படுத்தவும்:
uk: Як і SAMD21, завантажувач SAMD51 миготливий через інтерфейс ARM Serial Wire Debug (SWD). Для миття завантажувача з [OpenOCD на Малина Пі](#running-openocd-on-the-raspberry-pi) використовуйте наступне налаштування чіпа:

source: The SAMD51 uses a 16KiB bootloader (the application must be compiled with a start address of 16KiB). To flash an application use something like:
ta: SAMD51 16KIB துவக்க ஏற்றியைப் பயன்படுத்துகிறது (பயன்பாடு 16KIB இன் தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும்). ஒரு பயன்பாட்டை ஒளிரச் செய்ய இதுபோன்ற ஒன்றைப் பயன்படுத்தவும்:
uk: SAMD51 використовує 16KiB завантажувач (додаток необхідно скомпільувати з стартовою адресою 16KiB). Для спалаху програми використовуйте щось схоже:

source: STM32F103 micro-controllers (Blue Pill devices)
ta: STM32F103 மைக்ரோ-கன்ட்ரோலர்கள் (நீல மாத்திரை சாதனங்கள்)
uk: Мікроконтролери STM32F103 (синій підвіконня)

source: After flashing, set both "boot 0" and "boot 1" back to low so that future resets boot from flash.
ta: ஒளிரும் பிறகு, "பூட் 0" மற்றும் "துவக்க 1" இரண்டையும் குறைவாக அமைக்கவும், இதனால் எதிர்காலம் ஃப்ளாச் மூலம் துவக்கத்தை மீட்டமைக்கிறது.
uk: Після того, як миготливий, встановити як "завантажити 0" і "завантажити 1" назад до низького, так що майбутні скидки завантаження з флешки.

source: STM32F103 with stm32duino bootloader
ta: STM32F103 STM32Duino Boottloader உடன்
uk: STM32F103 з стем32дуіно завантажувачем

source: This bootloader can be flashed via 3.3V serial with something like:
ta: இந்த துவக்க ஏற்றி 3.3 வி சீரியல் வழியாக இதுபோன்ற ஒன்றைக் கொண்டிருக்கலாம்:
uk: Цей завантажувач може бути спалахований через 3.3V серійно з чимось схожим:

source: This bootloader uses 8KiB of flash space (the application must be compiled with a start address of 8KiB). Flash an application with something like:
ta: இந்த துவக்க ஏற்றி 8 கிப் ஃபிளாச் இடத்தைப் பயன்படுத்துகிறது (பயன்பாடு 8KIB இன் தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும்). போன்ற ஒரு பயன்பாட்டை ஒளிரச் செய்யுங்கள்:
uk: Цей завантажувач використовує 8KiB флеш-простору (додаток необхідно скомпільувати з стартовою адресою 8KiB). Захопити додаток з чимось схожим:

source: The bootloader typically runs for only a short period after boot. It may be necessary to time the above command so that it runs while the bootloader is still active (the bootloader will flash a board led while it is running). Alternatively, set the "boot 0" pin to low and "boot 1" pin to high to stay in the bootloader after a reset.
ta: துவக்க ஏற்றி பொதுவாக துவக்கத்திற்குப் பிறகு ஒரு குறுகிய காலத்திற்கு மட்டுமே இயங்கும். மேலே உள்ள கட்டளையை நேரம் செய்ய வேண்டியது தேவை, இதனால் துவக்க ஏற்றி இன்னும் செயலில் இருக்கும்போது அது இயங்கும் (துவக்க ஏற்றி இயங்கும் போது ஒரு போர்டு எல்.ஈ.டி ஒளிரும்). மாற்றாக, மீட்டமைக்கப்பட்ட பிறகு துவக்க ஏற்றியில் தங்குவதற்கு "பூட் 0" முள் குறைவாகவும், "துவக்க 1" முள் உயரமாகவும் அமைக்கவும்.
uk: Завантажувач зазвичай працює лише за короткий період після завантаження. Це може бути необхідно, щоб час вище команд, так що він працює в той час як завантажувач все ще активний (завантажувач буде спалахувати дошку під керівництвом, поки він працює). Крім того, встановіть "завантажити 0" шпильку на низький і "завантажити 1" шпильку для високого перебування в завантажувачі після скидання.

source: STM32F103 with HID bootloader
ta: HID துவக்க ஏற்றியுடன் STM32F103
uk: STM32F103 з HID завантажувачем

source: It is not possible to use stm32flash for the SKR Mini E3 as the boot0 pin is tied directly to ground and not broken out via header pins. It is recommended to use a STLink V2 with STM32Cubeprogrammer to flash the bootloader. If you don't have access to a STLink it is also possible to use a [Raspberry Pi and OpenOCD](#running-openocd-on-the-raspberry-pi) with the following chip config:
ta: SKR மினி E3 க்கு STM32flash ஐப் பயன்படுத்த முடியாது, ஏனெனில் பூட் 0 முள் நேரடியாக தரையில் பிணைக்கப்பட்டுள்ளது மற்றும் தலைப்பு ஊசிகள் வழியாக உடைக்கப்படவில்லை. துவக்க ஏற்றியை ஒளிரச் செய்ய STM32CubeProgrammer உடன் STLINK V2 ஐப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது. உங்களுக்கு ஒரு ச்ட்லிங்க் அணுகல் இல்லையென்றால், பின்வரும் சிப் உள்ளமைவுடன் ஒரு [ராச்பெர்ரி பை மற்றும் ஓபன்ஓசிடி] (#ரன்னிங்-ஓபெனோக்ட்-ஆன்-தி-ராச்பெர்ரி-பிஐ) பயன்படுத்தவும் முடியும்:
uk: Неможливо використовувати stm32flash для SKR Mini E3, оскільки штифт boot0 прив’язаний безпосередньо до землі, а не роз’єднаний через контакти роз’єму. Рекомендується використовувати STLink V2 із STM32Cubeprogrammer для прошивки завантажувача. Якщо у вас немає доступу до STLink, також можна використовувати [Raspberry Pi та OpenOCD](#running-openocd-on-the-raspberry-pi) із такою конфігурацією чіпа:

source: If you wish you can make a backup of the current flash with the following command. Note that it may take some time to complete:
ta: நீங்கள் விரும்பினால், தற்போதைய ஃபிளாச் பின்வரும் கட்டளையுடன் காப்புப்பிரதி எடுக்கலாம். முடிக்க சிறிது நேரம் ஆகலாம் என்பதை நினைவில் கொள்க:
uk: Якщо ви хочете зробити резервну копію поточного спалаху з наступним командуванням. Зверніть увагу, що це може зайняти час для завершення:

source: finally, you can flash with commands similar to:
ta: இறுதியாக, நீங்கள் ஒத்த கட்டளைகளுடன் ஒளிரலாம்:
uk: нарешті, ви можете спалахувати з командами, такими як:

source: NOTES:
ta: குறிப்புகள்:
uk: УВАГА:

source: The example above erases the chip then programs the bootloader. Regardless of the method chosen to flash it is recommended to erase the chip prior to flashing.
ta: மேலே உள்ள எடுத்துக்காட்டு சிப்பை அழிக்கிறது, பின்னர் துவக்க ஏற்றியை நிரல் செய்கிறது. ஃபிளாச் செய்ய தேர்ந்தெடுக்கப்பட்ட முறையைப் பொருட்படுத்தாமல், ஒளிரும் முன் சிப்பை அழிக்க பரிந்துரைக்கப்படுகிறது.
uk: Приклад вище стирання чіпа потім програми завантажувача. Незалежно від способу, обраного для спалаху, рекомендується витирати чіп до спалаху.

source: Prior flashing the SKR Mini E3 with this bootloader you should be aware that you will no longer be able to update firmware via the sdcard.
ta: இந்த துவக்க ஏற்றி மூலம் எச்.கே.ஆர் மினி இ 3 ஐ ஒளிரச் செய்வதற்கு முன், நீங்கள் இனி எச்.டி.கார்டு வழியாக ஃபார்ம்வேரைப் புதுப்பிக்க முடியாது என்பதை நீங்கள் அறிந்திருக்க வேண்டும்.
uk: Перед тим, як миготливий SKR Mini E3 з цим завантаженням ви повинні знати, що ви більше не зможете оновити прошивку через sdcard.

source: This bootloader requires 2KiB of flash space (the application must be compiled with a start address of 2KiB).
ta: இந்த துவக்க ஏற்றிக்கு 2 கிப் ஃபிளாச் இடம் தேவைப்படுகிறது (பயன்பாடு 2KIB இன் தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும்).
uk: Цей завантажувач вимагає 2KiB флеш-простору (додаток необхідно скомпільувати з стартовою адресою 2KiB).

source: The hid-flash program is used to upload a binary to the bootloader. You can install this software with the following commands:
ta: துவக்க ஏற்றிக்கு பைனரியைப் பதிவேற்ற HID FLASH நிரல் பயன்படுத்தப்படுகிறது. இந்த மென்பொருளை பின்வரும் கட்டளைகளுடன் நிறுவலாம்:
uk: Програма hid-flash використовується для завантаження бінарних навантажувач. Ви можете встановити це програмне забезпечення за допомогою наступних команд:

source: If the bootloader is running you can flash with something like:
ta: துவக்க ஏற்றி இயங்கினால், நீங்கள் போன்ற ஒன்றைக் கொண்டு ஒளிரலாம்:
uk: Якщо ви завантажувач працюєте, ви можете спалахувати з чимось схожим:

source: alternatively, you can use `make flash` to flash klipper directly:
ta: மாற்றாக, கிளிப்பரை நேரடியாக ஃபிளாச் செய்ய `மேக் ஃப்ளாச்` ஐப் பயன்படுத்தலாம்:
uk: ви можете використовувати `make flash` для флеш-кліппера безпосередньо:

source: OR if klipper has been previously flashed:
ta: அல்லது கிளிப்பர் முன்பு ஒளிரப்பட்டிருந்தால்:
uk: А якщо клиппер раніше спалахнув:

source: STM32F4 micro-controllers (SKR Pro 1.1)
ta: STM32F4 மைக்ரோ-கன்ட்ரோலர்கள் (SKR PRO 1.1)
uk: Мікроконтролери STM32F4 (SKR Pro 1.1)

source: This bootloader requires 16Kib of flash space on the STM32F4 (the application must be compiled with a start address of 16KiB).
ta: இந்த துவக்க ஏற்றிக்கு STM32F4 இல் 16 கிப் ஃபிளாச் இடம் தேவைப்படுகிறது (பயன்பாடு 16KIB இன் தொடக்க முகவரியுடன் தொகுக்கப்பட வேண்டும்).
uk: Цей завантажувач вимагає 16Kib флеш-простору на STM32F4 (додаток необхідно скомпільувати з стартовою адресою 16KiB).
