Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bootloaders.po
Languages: ta, uk

source: It may be necessary to manually enter the bootloader, this can be done by setting "boot 0" low and "boot 1" high. On the SKR Mini E3 "Boot 1" is not available, so it may be done by setting pin PA2 low if you flashed "hid_btt_skr_mini_e3.bin". This pin is labeled "TX0" on the TFT header in the SKR Mini E3's "PIN" document. There is a ground pin next to PA2 which you can use to pull PA2 low.
ta: துவக்க ஏற்றியை கைமுறையாக உள்ளிடுவது அவசியமாக இருக்கலாம், இதை "பூட் 0" குறைந்த மற்றும் "துவக்க 1" உயர் அமைப்பதன் மூலம் இதைச் செய்யலாம். எச்.கே.ஆர் மினி இ 3 "பூட் 1" இல் கிடைக்கவில்லை, எனவே நீங்கள் "HID_BTT_SKR_MINI_E3.BIN" இந்த முள் எச்.கே.ஆர் மினி இ 3 இன் "முள்" ஆவணத்தில் டிஎஃப்டி தலைப்பில் "டிஎக்ச் 0" என்று பெயரிடப்பட்டுள்ளது. PA2 க்கு அடுத்ததாக ஒரு தரை முள் உள்ளது, இது PA2 ஐ குறைவாக இழுக்க பயன்படுத்தலாம்.
uk: Може знадобитися вручну ввести завантажувач, це можна зробити за допомогою установки "завантаження 0" низькою і "завантаження 1" висока. На SKR Mini E3 "Ботт 1" не доступний, тому це може бути зроблено шляхом налаштування шпильки PA2 низькою, якщо ви спалахнули "hid_btt_skr_mini_e3.bin". Цей шпилька позначений "TX0" на заголовку TFT у документі SKR Mini E3. Є заземний шпилька поруч з PA2, який можна використовувати для витягування PA2 низькою.

source: It is possible to flash the bootloader via 3.3V serial using stm32flash as noted in the stm32duino section above, substituting the file name for the desired MSC bootloader binary (ie: MSCboot-Bluepill.bin for the blue pill).
ta: மேலே உள்ள STM32Duino பிரிவில் குறிப்பிடப்பட்டுள்ளபடி STM32Flash ஐப் பயன்படுத்தி 3.3V சீரியல் வழியாக துவக்க ஏற்றியை ஒளிரச் செய்ய முடியும், விரும்பிய MSC துவக்க ஏற்றி பைனரியின் கோப்பு பெயரை மாற்றுகிறது (அதாவது நீல மாத்திரைக்கு MSCBOOT-BLUEPILL.BIN).
uk: Можливо, мити завантажувач за допомогою 3.3V серійного за допомогою stm32flash, як зазначено в розділі stm32duino вище, підстановивши назву файлу для потрібного MSC завантажувача бінарного (тобто: MSCboot-Bluepill.bin для синього стовпа).

source: It is recommended to use a ST-Link Programmer to flash CanBoot, however it should be possible to flash using `stm32flash` on STM32F103 devices, and `dfu-util` on STM32F042/STM32F072 devices. See the previous sections in this document for instructions on these flashing methods, substituting `canboot.bin` for the file name where appropriate. The CanBoot repository linked above provides instructions for building the bootloader.
ta: கேன்பூட்டை ஃபிளாச் செய்ய எச்.டி-லிங்க் புரோகிராமரைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது, இருப்பினும் எச்.டி.எம் 32 எஃப் 103 சாதனங்களில் `எச்.டி.எம் 32 ஃப்ளாச்` ஐப் பயன்படுத்தி ஃபிளாச் செய்ய முடியும், மேலும் எச்.டி.எம் 32 எஃப் 042/எச்.டி.எம் 32 எஃப் 072 சாதனங்களில்` டி.எஃப்.யூ-யுடில்`. இந்த ஒளிரும் முறைகள் குறித்த வழிமுறைகளுக்கு இந்த ஆவணத்தில் உள்ள முந்தைய பிரிவுகளைப் பார்க்கவும், பொருத்தமான இடங்களில் கோப்பு பெயருக்கு `canboot.bin` ஐ மாற்றியமைத்தல். மேலே இணைக்கப்பட்ட கான்பூட் களஞ்சியமானது துவக்க ஏற்றியை உருவாக்குவதற்கான வழிமுறைகளை வழங்குகிறது.
uk: Рекомендується використовувати ST-Link програміст для флешки CanBoot, однак він повинен бути можливим за допомогою `stm32flash` на пристроях STM32F103, а `dfu-util` на пристроях STM32F042/STM32F072. Переглянути попередні розділи в цьому документі для інструкцій щодо цих методів миття, заміни `canboot.bin` для імені файлу, де це доречно. Репозиторій CanBoot, пов'язаний вище, надає інструкції для побудови завантажувача.

source: STM32F4 micro-controllers come equipped with a built-in system bootloader capable of flashing over USB (via DFU), 3.3V Serial, and various other methods (see STM Document AN2606 for more information). Some STM32F4 boards, such as the SKR Pro 1.1, are not able to enter the DFU bootloader. The HID bootloader is available for STM32F405/407 based boards should the user prefer flashing over USB over using the sdcard. Note that you may need to configure and build a version specific to your board, a [build for the SKR Pro 1.1 is available here](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest).
ta: STM32F4 மைக்ரோ-கன்ட்ரோலர்கள் யூ.எச்.பி (டி.எஃப்.யூ வழியாக), 3.3 வி சீரியல் மற்றும் பல்வேறு முறைகள் மீது ஒளிரும் திறன் கொண்ட உள்ளமைக்கப்பட்ட கணினி துவக்க ஏற்றி பொருத்தப்பட்டுள்ளன (மேலும் தகவலுக்கு எச்.டி.எம் ஆவணம் AN2606 ஐப் பார்க்கவும்). எச்.கே.ஆர் புரோ 1.1 போன்ற சில எச்.டி.எம் 32 எஃப் 4 பலகைகள் டி.எஃப்.யூ துவக்க ஏற்றிக்குள் நுழைய முடியாது. SDCARD ஐப் பயன்படுத்துவதை விட யூ.எச்.பி -ஐ விட பயனரை விரும்பினால், STM32F405/407 அடிப்படையிலான பலகைகளுக்கு HID துவக்க ஏற்றி கிடைக்கிறது. உங்கள் போர்டுக்கு குறிப்பிட்ட ஒரு பதிப்பை நீங்கள் உள்ளமைக்க வேண்டும் மற்றும் உருவாக்க வேண்டியிருக்கலாம் என்பதை நினைவில் கொள்க, ஒரு [SKR Pro 1.1 க்கான கட்டமைப்பானது இங்கே கிடைக்கிறது] (https://github.com/arksine/stm32_hid_bootloader/relaess/latest).
uk: Мікроконтролери STM32F4 обладнані вбудованим системним завантажувачем, здатним спалахувати над USB (через DFU), 3.3V Serial та різними способами (див. розділ STM AN2606 для отримання додаткової інформації). Деякі дошки STM32F4, такі як SKR Pro 1.1, не здатні ввести завантажувач DFU. HID Bootloader доступний для STM32F405/407 на підставі дошки повинні користувачеві віддати перевагу спалаху через USB через sdcard. Зауважте, що ви можете налаштувати і побудувати версію конкретно до вашої ради, [будування для SKR Pro 1.1 доступний тут](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest).

source: Unless your board is DFU capable the most accessible flashing method is likely via 3.3V serial, which follows the same procedure as [flashing the STM32F103 using stm32flash](#stm32f103-micro-controllers-blue-pill-devices). For example:
ta: உங்கள் போர்டு டி.எஃப்.யு திறன் கொண்டதாக இல்லாவிட்டால், மிகவும் அணுகக்கூடிய ஒளிரும் முறை 3.3 வி சீரியல் வழியாக இருக்கலாம், இது [STM32F103 ஐ ஒளிரும் STM32F103 ஐ ஒளிரச் செய்கிறது] (#STM32F103-மைக்ரோ-கன்ட்ரோலர்கள்-ப்ளூ-பில்-பங்கேற்பு) போன்ற அதே நடைமுறையைப் பின்பற்றுகிறது. உதாரணமாக:
uk: Якщо ваша дошка є DFU, можливо, найдоступніший спосіб миготіння, швидше за все, через 3.3V-серійне, що випливає з тієї ж процедури, як [розумка STM32F103 за допомогою stm32flash](#stm32f103-micro-controllers-blue-pill-devices). Наприклад:

source: SAMDC21 micro-controllers (Duet3D Toolboard 1LC)
ta: SAMDC21 மைக்ரோ-கன்ட்ரோலர்கள் (டூட் 3 டி கருவித்தலை 1 எல்.சி)
uk: Мікроконтролери SAMDC21 (Duet3D 1LC)

source: The SAMC21 is flashed via the ARM Serial Wire Debug (SWD) interface. This is commonly done with a dedicated SWD hardware dongle. Alternatively, one can use a [Raspberry Pi with OpenOCD](#running-openocd-on-the-raspberry-pi).
ta: SAMC21 கை சீரியல் கம்பி பிழைத்திருத்த (SWD) இடைமுகம் வழியாக ஒளிரும். இது பொதுவாக ஒரு பிரத்யேக SWD வன்பொருள் டாங்கிள் மூலம் செய்யப்படுகிறது. மாற்றாக, ஒருவர் [ஓபன்ஓசிடி உடன் ராச்பெர்ரி பை] (#ரன்னிங்-ஓபெனோக்ட்-ஆன்-தி-ராச்பெர்ரி-பிஐ) பயன்படுத்தலாம்.
uk: SAMC21 миготливий через інтерфейс серійного дроту ARM (SWD). Це зазвичай робиться з виділеним SWD апаратним донголом. Крім того, можна скористатися [Равесняний Пі з OpenOCD](#running-openocd-on-the-raspberry-pi).

source: When using OpenOCD with the SAMC21, extra steps must be taken to first put the chip into Cold Plugging mode if the board makes use of the SWD pins for other purposes. If using OpenOCD on a Rasberry Pi, this can be done by running the following commands before invoking OpenOCD.
ta: SAMC21 உடன் OpenOCD ஐப் பயன்படுத்தும் போது, மற்ற நோக்கங்களுக்காக SWD ஊசிகளைப் பயன்படுத்தினால், முதலில் சிப்பை குளிர் சொருகும் பயன்முறையில் வைக்க கூடுதல் படிகள் எடுக்கப்பட வேண்டும். ராச்பெர்ரி பை மீது OpenOCD ஐப் பயன்படுத்தினால், OpenOCD ஐத் தொடங்குவதற்கு முன் பின்வரும் கட்டளைகளை இயக்குவதன் மூலம் இதைச் செய்யலாம்.
uk: При використанні OpenOCD з SAMC21 додаткові кроки повинні бути прийняті, щоб спочатку покласти чіп в режим холодного роз'єму, якщо дошка використовує SWD шпильки для інших цілей. Якщо використовувати OpenOCD на Rasberry Pi, це можна зробити, використовуючи команду, перш ніж викликати OpenOCD.

source: To flash a program with OpenOCD use the following chip config:
ta: OpenOCD உடன் ஒரு நிரலை ஒளிரச் செய்ய பின்வரும் சிப் கட்டமைப்பைப் பயன்படுத்தவும்:
uk: Для спалаху програми з OpenOCD використовуйте наступні налаштування чіпа:

source: Obtain a program; for instance, klipper can be built for this chip. Flash with OpenOCD commands similar to:
ta: ஒரு நிரலைப் பெறுங்கள்; உதாரணமாக, இந்த சிப்பிற்காக கிளிப்பரை உருவாக்க முடியும். ஓபன்ஓசிடி கட்டளைகளுடன் ஃபிளாச்:
uk: Зберігати програму; наприклад, klipper може бути побудована для цього чіпа. Флеш з командами OpenOCD аналогічно:

source: You may need to hold down the reset button on the board while launching OpenOCD. It should display something like:After which you can release the reset button.
uk: Вам може знадобитися утримувати кнопку скидання на платі під час запуску OpenOCD. Має відобразитися щось на зразок: Після чого можна відпустити кнопку скидання.
