Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/CANBUS_Troubleshooting.po
Languages: ru, uk

source: It is not recommended to use a `txqueuelen` significantly larger than 128. A CAN bus running at a frequency of 1000000 will typically take around 120us to transmit a CAN packet. Thus a queue of 128 packets is likely to take around 15-20ms to drain. A substantially larger queue could cause excessive spikes in message round-trip-time which could lead to unrecoverable errors. Said another way, Klipper's application retransmit system is more robust if it does not have to wait for Linux to drain an excessively large queue of possibly stale data. This is analogous to the problem of [bufferbloat](https://en.wikipedia.org/wiki/Bufferbloat) on internet routers.
ru: Не рекомендуется использовать `txqueuelen` значительно больше 128. CAN-шине, работающей на частоте 1000000, обычно требуется около 120 с для передачи CAN-пакета. Таким образом, очередь из 128 пакетов, скорее всего, займет около 15-20 мс. Значительно большая очередь может привести к чрезмерным скачкам времени прохождения сообщений, что может привести к неустранимым ошибкам. С другой стороны, система ретрансляции приложений Klipper будет более надежной, если ей не придется ждать, пока Linux осушит слишком большую очередь, состоящую из, возможно, устаревших данных. Это аналогично проблеме [bufferbloat](https://en.wikipedia.org/wiki/Bufferbloat) на интернет-маршрутизаторах.
uk: Не рекомендується використовувати `txqueuelen` значно більше 128. автобус CAN, який працює на частоті 1000000, зазвичай займе близько 120us для передачі пакету CAN. Таким чином, черга 128 пакетів, ймовірно, займе близько 15-20 метрів для зливу. Значно більша черга може призвести до надмірних спій в повідомлення кругло-часовому режимі, що може призвести до небажаних помилок. Збережіть ще один спосіб, система переадресації програми Klipper є більш надійним, якщо вона не повинна чекати Linux, щоб злити надмірно велику чергу, можливо, застою даних. Це аналог з проблемою [bufferbloat](https://en.wikipedia.org/wiki/Bufferbloat) в маршрутизаторах Інтернету.

source: Under normal circumstances Klipper may utilize ~25 queue slots per MCU - typically only utilizing more slots during retransmits. (Specifically, the Klipper host may transmit up to 192 bytes to each Klipper MCU before receiving an acknowledgment from that MCU.) If a single CAN bus has 5 or more Klipper MCUs on it, then it might be necessary to increase the `txqueuelen` above the recommended value of 128. However, as above, care should be taken when selecting a new value to avoid excessive round-trip-time latency.
ru: В обычных условиях Klipper может использовать ~25 слотов очереди на MCU - обычно больше слотов используется только при повторной передаче. (В частности, хост Klipper может передать до 192 байт каждому MCU Klipper, прежде чем получит подтверждение от этого MCU). Если на одной шине CAN установлено 5 или более MCU Klipper, то может потребоваться увеличить `txqueuelen` выше рекомендуемого значения 128. Однако, как указано выше, при выборе нового значения следует соблюдать осторожность, чтобы избежать чрезмерных задержек при обходе.
uk: При нормальних обставинах Klipper може використовувати ~25 черги слотів для MCU - зазвичай тільки використовуючи більше слотів під час переадресації. (Своїсно, хост Кліппер може передавати до 192 байтів до кожного Кліппера МКУ перед отриманням відступу від цього МКУ.) Якщо один автобус CAN має 5 або більше Klipper MCUs на ньому, то це може знадобитися для збільшення `txqueuelen` над рекомендованою вартістю 128. Однак, як і вище, догляд слід приймати при виборі нового значення, щоб уникнути зайвої затримки часу.
