Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/CANBUS_Troubleshooting.po
Languages: ru, uk

source: CANBUS Troubleshooting
ru: Устранение неполадок CANBUS
uk: КАНБУС Виправлення несправностей

source: This document provides information on troubleshooting communication issues when using [Klipper with CAN bus](CANBUS.md).
ru: Этот документ содержит информацию об исправлении проблем соединения, при использовании шины CAN [Klipper with CAN bus](CANBUS.md).
uk: Цей документ надає інформацію про проблеми з усунення неполадок при використанні [Кліппер з автобусом CAN](CANBUS.md).

source: Verify CAN bus wiring
ru: Проверьте правильность подключения проводников шины CAN
uk: Verify CAN автобусний електропроводка

source: The first step in troubleshooting communication issues is to verify the CAN bus wiring.
ru: Первым шагом в устранении проблем со связью является проверка проводки шины CAN.
uk: Першим кроком у вирішенні проблемних питань зв'язку є перевірка проводки CAN.

source: Be sure there are exactly two 120 Ohm [terminating resistors](CANBUS.md#terminating-resistors) on the CAN bus. If the resistors are not properly installed then messages may not be able to be sent at all or the connection may have sporadic instability.
ru: Убедитесь, что на шине CAN установлено ровно два по 120 Ом [согласующих резистора](CANBUS.md#terminating-resistors). Если резисторы установлены неправильно, то сообщения могут не отправляться вообще или соединение может быть нестабильным.
uk: Переконайтеся, що на шині CAN є рівно два [термінаторні резистори](CANBUS.md#terminating-resistors) на 120 Ом. Якщо резистори не встановлено належним чином, повідомлення можуть не надсилатися взагалі, або з’єднання може мати спорадичну нестабільність.

source: The CANH and CANL bus wiring should be twisted around each other. At a minimum, the wiring should have a twist every few centimeters. Avoid twisting the CANH and CANL wiring around power wires and ensure that power wires that travel parallel to the CANH and CANL wires do not have the same amount of twists.
ru: Провода шин CANH и CANL должны быть скручены вокруг друг друга. Как минимум, проводка должна иметь скрутку через каждые несколько сантиметров. Избегайте скручивания проводов CANH и CANL вокруг силовых проводов и следите за тем, чтобы силовые провода, идущие параллельно проводам CANH и CANL, не имели одинакового количества скруток.
uk: Автопроводка CANH та CANL повинна бути перекручена між собою. На мінімумі проводка повинна мати скручування кожні кілька сантиметрів. Уникайте скручування проводів CANH і CANL навколо проводів живлення і переконайтеся, що проводи живлення, які подорожують паралельно до проводів CANH і CANL, не мають однакової кількості скручувань.

source: Verify that all plugs and wire crimps on the CAN bus wiring are fully secured. Movement of the printer toolhead may jostle the CAN bus wiring causing a bad wire crimp or unsecured plug to result in intermittent communication errors.
ru: Убедитесь, что все штекеры и обжимки проводов на шине CAN полностью закреплены. Движение инструментальной головки принтера может привести к смещению проводки шины CAN, в результате чего плохой обжим провода или незакрепленный штекер могут привести к прерывистым ошибкам связи.
uk: Перевірити, що всі штекери та дротові креветки на автобусі CAN повністю закріплюються. Рух принтера інструментголова може зануритися в проводку CAN, викликаючи поганий дротовий щіпка або непропущений штепсель, щоб призвести до переривчастих помилок зв'язку.

source: Check for incrementing bytes_invalid counter
ru: Проверка на увеличение счетчика bytes_invalid
uk: Перевірити для зняття байтів_інвалідний лічильник

source: The Klipper log file will report a `Stats` line once a second when the printer is active. These "Stats" lines will have a `bytes_invalid` counter for each micro-controller. This counter should not increment during normal printer operation (it is normal for the counter to be non-zero after a RESTART and it is not a concern if the counter increments once a month or so). If this counter increments on a CAN bus micro-controller during normal printing (it increments every few hours or more frequently) then it is an indication of a severe problem.
ru: Лог-файл Klipper будет сообщать о строке `Stats` раз в секунду, когда принтер активен. Эти строки "Stats" будут содержать счетчик `bytes_invalid` для каждого микроконтроллера. Этот счетчик не должен увеличиваться во время нормальной работы принтера (нормально, если счетчик будет ненулевым после перезагрузки, и не страшно, если счетчик будет увеличиваться раз в месяц или около того). Если этот счетчик увеличивается на микроконтроллере шины CAN во время нормальной печати (он увеличивается каждые несколько часов или чаще), это свидетельствует о серьезной проблеме.
uk: Файл журналу Klipper буде звітувати `Stats` рядок один раз, коли принтер активний. Ці лінійки «Стати» мають `байти_invalid` лічильник для кожного мікроконтролера. Цей лічильник не повинен підходити під час нормальної роботи принтера (це нормально для лічильника, щоб бути незеро після RESTART, і це не стосується, якщо протипоказання один раз на місяць або так). Якщо це протипоказання на мікроконтролері CAN на мікроконтролері CAN під час нормального друку (приблизні кожні кілька годин або частіше), то це індикація важкої проблеми.

source: Incrementing `bytes_invalid` on a CAN bus connection is a symptom of reordered messages on the CAN bus. There are two known causes of reordered messages:
ru: Увеличение `bytes_invalid` при подключении к шине CAN является симптомом неупорядоченных сообщений на шине CAN. Известны две причины возникновения неупорядоченных сообщений:
uk: Прискорення `bytes_invalid` на автобусному підключенні CAN є симптомом переадресованих повідомлень на автобусі CAN. Є два відомі причини переадресованих повідомлень:

source: Old versions of the popular candlight_firmware for USB CAN adapters had a bug that could cause reordered messages. If using a USB CAN adapter running this firmware then make sure to update to the latest firmware if incrementing `bytes_invalid` is observed.
ru: В старых версиях популярной прошивки candlight_firmware для USB CAN-адаптеров была обнаружена ошибка, которая могла привести к переупорядочиванию сообщений. Если вы используете USB CAN адаптер с этой прошивкой, то обязательно обновите ее до последней версии, если наблюдается увеличение `bytes_invalid`.
uk: Старі версії популярних адаптерів Candlight_firmware для USB CAN мали помилку, яка може викликати переадресовані повідомлення. Якщо ви використовуєте адаптер USB CAN, який працює цю прошивку, то переконайтеся, що оновлення до останньої прошивки, якщо спостерігається переробка `байтів_invalid`.

source: Some Linux kernel builds for embedded devices have been known to reorder CAN bus messages. It may be necessary to use an alternative Linux kernel or to use alternative hardware that supports mainstream Linux kernels that do not exhibit this problem.
ru: Известно, что некоторые сборки ядра Linux для встраиваемых устройств перестраивают сообщения шины CAN. Может потребоваться использование альтернативного ядра Linux или использование альтернативного оборудования, поддерживающего основные ядра Linux, в которых эта проблема не наблюдается.
uk: Деякі ядра Linux для вбудованих пристроїв були відомі для переадресації CAN автобусних повідомлень. Ви можете використовувати альтернативне ядро Linux або використовувати альтернативне обладнання, яке підтримує основні ядра Linux, які не відображають цю проблему.

source: Reordered messages is a severe problem that must be fixed. It will result in unstable behavior and can lead to confusing errors at any part of a print.
ru: Переупорядоченные сообщения - серьезная проблема, которую необходимо устранить. Она приводит к нестабильному поведению и может стать причиной ошибок на любом этапе печати.
uk: Замовлені повідомлення є важкою проблемою, яка повинна бути виправлена. Це призведе до нестійкої поведінки і може призвести до заплутування помилок в будь-якій частині друку.

source: Obtaining candump logs
ru: Получение журналов candump
uk: Зберігаючі колоди

source: The CAN bus messages sent to and from the micro-controller are handled by the Linux kernel. It is possible to capture these messages from the kernel for debugging purposes. A log of these messages may be of use in diagnostics.
ru: Сообщения шины CAN, отправляемые в микроконтроллер и из него, обрабатываются ядром Linux. Можно перехватить эти сообщения из ядра для отладки. Журнал этих сообщений может быть полезен при диагностике.
uk: Повідомлення автобуса CAN і з мікроконтролера керуються ядром Linux. Ви можете захопити ці повідомлення з ядра для розвантаження цілей. Журнал цих повідомлень може використовуватися в діагностиці.

source: The Linux [can-utils](https://github.com/linux-can/can-utils) tool provides the capture software. It is typically installed on a machine by running:
ru: Инструмент Linux [can-utils](https://github.com/linux-can/can-utils) обеспечивает программное обеспечение для захвата. Обычно она устанавливается на машину путем запуска:
uk: Інструмент Linux [can-utils](https://github.com/linux-can/can-utils) надає програмне забезпечення для захоплення. Зазвичай він встановлюється на машину за допомогою:

source: sudo apt-get update && sudo apt-get install can-utils
uk: sudo apt-get update & & sudo apt-get встановити can-utils

source: Once installed, one may obtain a capture of all CAN bus messages on an interface with the following command:
ru: После установки можно получить захват всех сообщений CAN-шины на интерфейсе с помощью следующей команды:
uk: Після встановлення, можна отримати захоплення всіх повідомлень про автобуси CAN на інтерфейсі з наступним командуванням:

source: candump -tz -Ddex can0,#FFFFFFFF > mycanlog
uk: #FFFFFFFFFFFFFFFF > Дельсаль Груп Український

source: One can view the resulting log file (`mycanlog` in the example above) to see each raw CAN bus message that was sent and received by Klipper. Understanding the content of these messages will likely require low-level knowledge of Klipper's [CANBUS protocol](CANBUS_protocol.md) and Klipper's [MCU commands](MCU_Commands.md).
ru: Можно просмотреть полученный файл журнала (`mycanlog` в примере выше), чтобы увидеть каждое необработанное сообщение CAN-шины, которое было отправлено и получено Klipper. Для понимания содержания этих сообщений, скорее всего, потребуются знания низкого уровня протокола [CANBUS](CANBUS_protocol.md) и команд [MCU](MCU_Commands.md) Klipper.
uk: Один може переглянути отриманий файл журналу (`mycanlog`, щоб побачити кожну сиру CAN автобусне повідомлення, яке було відправлено і отримано Klipper. Розуміння вмісту цих повідомлень, ймовірно, зажадає низьким рівнем знань протоколу Klipper's [CANBUS](CANBUS_protocol.md) і Klipper's [MCU команди](MCU_Commands.md).

source: Parsing Klipper messages in a candump log
ru: Разбор сообщений Klipper в журнале candump
uk: Повідомлень Кліппера в журналі кандемп

source: One may use the `parsecandump.py` tool to parse the low-level Klipper micro-controller messages contained in a candump log. Using this tool is an advanced topic that requires knowledge of Klipper [MCU commands](MCU_Commands.md). For example:
ru: Для разбора низкоуровневых сообщений микроконтроллера Klipper, содержащихся в журнале candump, можно использовать инструмент `parsecandump.py`. Использование этого инструмента является продвинутой темой, требующей знания Klipper [команд MCU](MCU_Commands.md). Например:
uk: Один може використовуватися `parsecandump.py` інструментом для запарювання низькорівневих мікроконтролерів, що містяться в кандump log. За допомогою цього інструменту є розширена тема, яка вимагає знання Klipper [MCU команди](MCU_Commands.md). Наприклад:

source: This tool produces output similar to the [parsedump tool](Debugging.md#translating-gcode-files-to-micro-controller-commands). See the documentation for that tool for information on generating the Klipper micro-controller data dictionary.
ru: Этот инструмент выдает результаты, аналогичные [инструмент parsedump](Debugging.md#translating-gcode-files-to-micro-controller-commands). Информацию о генерации словаря данных микроконтроллера Klipper см. в документации к этому инструменту.
uk: Цей інструмент виробляє вихідний, схожий на [пашний інструмент](Debugging.md#translating-gcode-files-to-micro-controller-commands). Див. документацію для отримання інформації про створення мікроконтролера Кліппера.

source: In the above example, `108` is the [CAN bus id](CANBUS_protocol.md#micro-controller-id-assignment). It is a hexadecimal number. The id `108` is assigned by Klipper to the first micro-controller. If the CAN bus has multiple micro-controllers on it, then the second micro-controller would be `10a`, the third would be `10c`, and so on.
ru: В приведенном выше примере `108` - это [идентификатор шины CAN](CANBUS_protocol.md#micro-controller-id-assignment). Это шестнадцатеричное число. Идентификатор `108` назначается Klipper первому микроконтроллеру. Если на шине CAN подключено несколько микроконтроллеров, то второй микроконтроллер будет `10a`, третий - `10c` и так далее.
uk: У наведеному вище прикладі `108` є [CAN busid](CANBUS_protocol.md#micro-controller-id-assignment). Це шістнадцяткове число. id `108` присвоєно Klipper до першого мікроконтролера. Якщо автобус CAN має декілька мікроконтролерів на ньому, то другий мікроконтролер буде `10a`, третій буде `10c` і так далі.

source: The candump log must be produced using the `-tz -Ddex` command-line arguments (for example: `candump -tz -Ddex can0,#FFFFFFFF`) in order to use the `parsecandump.py` tool.
ru: Для использования инструмента `parsecandump.py` необходимо создать журнал candump, используя аргументы командной строки `-tz -Ddex` (например: `candump -tz -Ddex can0,#FFFFFF`).
uk: Журнал може бути виготовлений за допомогою `-tz -Ddex` аргументів командного рядка (наприклад: `candump -tz -Ddex can0,#FFFFFFFFFF`) для використання `parsecandump.py`.

source: Using a logic analyzer on the canbus wiring
ru: Использование логического анализатора в проводке canbus
uk: Використання логіки аналізатора на проводці каналів

source: The [Sigrok Pulseview](https://sigrok.org/wiki/PulseView) software along with a low-cost [logic analyzer](https://en.wikipedia.org/wiki/Logic_analyzer) can be useful for diagnosing CAN bus signaling. This is an advanced topic likely only of interest to experts.
ru: Программное обеспечение [Sigrok Pulseview](https://sigrok.org/wiki/PulseView) вместе с недорогим [логическим анализатором](https://en.wikipedia.org/wiki/Logic_analyzer) может быть полезно для диагностики сигналов шины CAN. Это сложная тема, которая может быть интересна только специалистам.
uk: [Sigrok Pulseview](https://sigrok.org/wiki/PulseView) програмне забезпечення разом з низькою вартістю [логічний аналізатор](https://en.wikipedia.org/wiki/Logic_analyzer) може бути корисною для діагностики автобусів CAN. Це розширена тема, швидше за все, тільки інтерес до експертів.

source: One can often find "USB logic analyzers" for under $15 (US pricing as of 2023). These devices are often listed as "Saleae logic clones" or as "24MHz 8 channel USB logic analyzers".
ru: Часто можно найти "логические USB-анализаторы" по цене менее 15 долларов (цены в США по состоянию на 2023 год). Эти устройства часто перечисляются как "логические клоны Saleae" или как "24 МГц 8-канальные USB логические анализаторы".
uk: Часто можна знайти «УСБ-логічні аналізатори» за 15 доларів США (ВСЦ від 2023). Ці пристрої часто перераховані як "Продажі логічні клони" або як "24MHz 8 каналів USB-логічні аналізатори".

source: The above picture was taken while using Pulseview with a "Saleae clone" logic analyzer. The Sigrok and Pulseview software was installed on a desktop machine (also install the "fx2lafw" firmware if that is packaged separately). The CH0 pin on the logic analyzer was routed to the CAN Rx line, the CH1 pin was wired to the CAN Tx pin, and GND was wired to GND. Pulseview was configured to only display the D0 and D1 lines (red "probe" icon center top toolbar). The number of samples was set to 5 million (top toolbar) and the sample rate was set to 24Mhz (top toolbar). The CAN decoder was added (yellow and green "bubble icon" right top toolbar). The D0 channel was labeled as RX and set to trigger on a falling edge (click on black D0 label at left). The D1 channel was labeled as TX (click on brown D1 label at left). The CAN decoder was configured for 1Mbit rate (click on green CAN label at left). The CAN decoder was moved to the top of the display (click and drag green CAN label). Finally, the capture was started (click "Run" at top left) and a packet was transmitted on the CAN bus (`cansend can0 123#121212121212`).
ru: Приведенная выше фотография была сделана при использовании Pulseview с логическим анализатором "клон Saleae". Программное обеспечение Sigrok и Pulseview было установлено на настольном компьютере (также установите прошивку "fx2lafw", если она поставляется отдельно). Вывод CH0 логического анализатора был подключен к линии CAN Rx, вывод CH1 - к выводу CAN Tx, а GND - к GND. Программа Pulseview была настроена на отображение только линий D0 и D1 (красный значок "зонда" в центре верхней панели инструментов). Количество выборок было установлено на 5 миллионов (верхняя панель инструментов), а частота выборки - на 24 МГц (верхняя панель инструментов). Был добавлен CAN-декодер (желто-зеленый значок "пузырька" справа вверху панели инструментов). Канал D0 был помечен как RX и настроен на срабатывание по спадающему фронту импульса (нажмите на черную метку D0 слева). Канал D1 был помечен как TX (нажмите на коричневую метку D1 слева). Декодер CAN был настроен на скорость 1 Мбит (нажмите на зеленую метку CAN слева). CAN-декодер был перемещен в верхнюю часть дисплея (нажмите и перетащите зеленую метку CAN). Наконец, был запущен захват (нажмите "Run" в левом верхнем углу) и передан пакет по шине CAN (`cansend can0 123#121212121212`).
uk: Наведено вищезгадане зображення при використанні Pulseview з логікою "Saleae clone". Програма Sigrok і Pulseview була встановлена на настільній машині (також встановити прошивку "fx2lafw", якщо вона упакована окремо). Пиріг CH0 на логічному аналізаторі був маршрутизований до лінії CAN Rx, штифт CH1 проводився до шпильки CAN Tx, а ГНД проводився до GND. Імпульсний перегляд був налаштований тільки для відображення D0 і D1 ліній (червоний "пробе" іконковий центр панелі інструментів). Кількість зразків була встановлена до 5 мільйонів (під панелі інструментів) і частота зразка була встановлена до 24Mhz (під панелі інструментів). Додана декодер CAN (жовтий і зелений "чорний значок" правий верхній панелі інструментів). Канал D0 був позначений як RX і встановити, щоб запустити на падіння краю (натисніть на ярлик D0 зліва). Канал D1 був позначений як TX (клацніть на коричневому етикетці D1 зліва). CAN decoder було налаштовано на 1Mbit курс (клацніть на зелену CAN етикетку зліва). CAN decoder було переведено в верхній частині дисплея (натисніть і перетягніть зелену CAN етикетку). Нарешті, захоплення було розпочато (клацніть "Run" у верхньому лівому верхньому куті) і пакет було передано на автобусі CAN (`cansend can0 123#121212121212`).

source: The logic analyzer provides an independent tool for capturing packets and verifying bit timing.
ru: Логический анализатор представляет собой независимый инструмент для захвата пакетов и проверки временных характеристик битов.
uk: Логічний аналізатор забезпечує незалежний інструмент для захоплення пачок і перевірки термінів.

source: Use an appropriate txqueuelen setting
ru: Используйте соответствующую настройку txqueuelen
uk: Використовуйте відповідні налаштування txqueuelen

source: The Klipper code uses the Linux kernel to manage CAN bus traffic. By default, the kernel will only queue 10 CAN transmit packets. It is recommended to [configure the can0 device](CANBUS.md#host-hardware) with a `txqueuelen 128` to increase that size.
ru: Код Klipper использует ядро Linux для управления трафиком шины CAN. По умолчанию ядро ставит в очередь только 10 пакетов передачи данных CAN. Рекомендуется [сконфигурировать устройство can0](CANBUS.md#host-hardware) с `txqueuelen 128`, чтобы увеличить этот размер.
uk: Код Klipper використовує ядро Linux для управління трафіком CAN. За замовчуванням ядро буде тільки черга 10 CAN. Рекомендовано [configure the can0 device](CANBUS.md#host-hardware) з `txqueuelen 128` для збільшення цього розміру.

source: If Klipper transmits a packet and Linux has filled all of its transmit queue space then Linux will drop that packet and messages like the following will appear in the Klipper log:
ru: Если Klipper передаст пакет, а Linux заполнит все место в очереди на передачу, Linux отбросит этот пакет, и в журнале Klipper появятся сообщения, подобные следующему:
uk: Якщо Klipper передає пакет і Linux заповнить весь простір передачі, то Linux знизить цей пакет і повідомлення, як показано наступне, з'явиться в журналі Klipper:

source: Got error -1 in can write: (105)No buffer space available
uk: Got error -1 in може написати: (105)Не доступний буферний простір

source: Klipper will automatically retransmit the lost messages as part of its normal application level message retransmit system. Thus, this log message is a warning and it does not indicate an unrecoverable error.
ru: Klipper автоматически повторно передаст потерянные сообщения в рамках своей обычной системы повторной передачи сообщений на уровне приложения. Таким образом, это сообщение журнала является предупреждением и не указывает на неустранимую ошибку.
uk: Klipper автоматично перетворить втрачені повідомлення в складі системи переадресації поточного рівня програми. Таким чином, це повідомлення журналу є попередженням і він не вказує на невідновлювальну помилку.

source: If a complete CAN bus failure occurs (such as a CAN wire break) then Linux will not be able to transmit any messages on the CAN bus and it is common to find the above message in the Klipper log. In this case, the log message is a symptom of a larger problem (the inability to transmit any messages) and is not directly related to Linux `txqueuelen`.
ru: Если произойдет полный отказ шины CAN (например, обрыв провода CAN), то Linux не сможет передавать сообщения по шине CAN, и обычно в журнале Klipper появляется вышеуказанное сообщение. В этом случае сообщение в журнале является симптомом более серьезной проблемы (невозможность передачи сообщений) и не имеет прямого отношения к Linux `txqueuelen`.
uk: Якщо відбувається повна відмова автобуса CAN (наприклад, перерву дроту CAN), то Linux не зможе передавати будь-які повідомлення на автобусі CAN і є загальним, щоб знайти вище повідомлення в журналі Klipper. У цьому випадку лог-повідомлення є симптомом більшої проблеми (здатність передачі будь-яких повідомлень) і не безпосередньо пов'язана з Linux `txqueuelen`.

source: One may check the current queue size by running the Linux command `ip link show can0`. It should report a bunch of text including the snippet `qlen 128`. If one sees something like `qlen 10` then it indicates the CAN device has not been properly configured.
ru: Проверить текущий размер очереди можно, выполнив команду Linux `ip link show can0`. Она должна выдать кучу текста, включая фрагмент `qlen 128`. Если вы увидите что-то вроде `qlen 10`, это указывает на то, что CAN-устройство не было правильно сконфигурировано.
uk: Один може перевірити поточний розмір черги за допомогою команди Linux `ip посилання show can0`. Повідомляти пучок тексту, включаючи хіппе `qlen 128`. Якщо ви бачите щось схоже `qlen 10`, то це вказує на пристрій CAN не було належним чином налаштовано.
