Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Code_Overview.po
Languages: ta, uk

source: This document describes the overall code layout and major code flow of Klipper.
ta: இந்த ஆவணம் ஒட்டுமொத்த குறியீடு தளவமைப்பு மற்றும் கிளிப்பரின் முக்கிய குறியீடு ஓட்டத்தை விவரிக்கிறது.
uk: Цей документ описує загальну версію коду та основний потік кодів Klipper.

source: Directory Layout
ta: அடைவு தளவமைப்பு
uk: Каталог Layout

source: The **src/** directory contains the C source for the micro-controller code. The **src/atsam/**, **src/atsamd/**, **src/avr/**, **src/linux/**, **src/lpc176x/**, **src/pru/**, and **src/stm32/** directories contain architecture specific micro-controller code. The **src/simulator/** contains code stubs that allow the micro-controller to be test compiled on other architectures. The **src/generic/** directory contains helper code that may be useful across different architectures. The build arranges for includes of "board/somefile.h" to first look in the current architecture directory (eg, src/avr/somefile.h) and then in the generic directory (eg, src/generic/somefile.h).
ta: ** SRC/** கோப்பகத்தில் மைக்ரோ-கன்ட்ரோலர் குறியீட்டிற்கான சி மூலத்தைக் கொண்டுள்ளது. ** src/atsam/**, ** src/atsamd/**, ** src/avr/**, ** src/linux/**, ** src/lpc176x/**, ** src/ PRU/**, மற்றும் ** SRC/STM32/** கோப்பகங்கள் கட்டிடக்கலை குறிப்பிட்ட மைக்ரோ-கண்ட்ரோலர் குறியீட்டைக் கொண்டுள்ளன. ** எச்.ஆர்.சி/சிமுலேட்டர்/** குறியீடு ச்டப்களைக் கொண்டுள்ளது, இது மைக்ரோ-கன்ட்ரோலரை மற்ற கட்டமைப்புகளில் சோதிக்க அனுமதிக்கிறது. ** SRC/generic/** கோப்பகத்தில் வெவ்வேறு கட்டமைப்புகளில் பயனுள்ளதாக இருக்கும் உதவி குறியீடு உள்ளது. தற்போதைய கட்டிடக்கலை கோப்பகத்தில் (எ.கா., எச்.ஆர்.சி/ஏ.வி.ஆர்/சில ஃபைல்.எச்) மற்றும் பின்னர் பொதுவான கோப்பகத்தில் (எ.கா., எச்.ஆர்.சி/செனரிக்/சில ஃபைல்.எச்) பார்க்க "பலகை/சில ஃபைல்.எச்" அடங்கும்.
uk: Каталог **src/** містить джерело C для коду мікроконтролера. **src/atsam/**, **src/atsamd/**, **src/avr/**, **src/linux/**, **src/lpc176x/**, **src/pru/**, і **src/stm32/** каталоги містять архітектуру специфічний мікроконтролерний код. **src/simulator/** містить кодові шпильки, які дозволяють мікроконтролеру проводити тестування, зібрані на інших архітектурах. **src/generic/** каталог містить код помічника, який може бути корисний для різних архітектур. Будівля влаштовує для включає в себе "board/somefile.h" для першого погляду в поточний каталог архітектури (наприклад, src/avr/somefile.h) і потім в генеричний каталог (наприклад, src/generic/somefile.h).

source: The **klippy/** directory contains the host software. Most of the host software is written in Python, however the **klippy/chelper/** directory contains some C code helpers. The **klippy/kinematics/** directory contains the robot kinematics code. The **klippy/extras/** directory contains the host code extensible "modules".
ta: ** கிளிப்பி/** கோப்பகத்தில் புரவலன் மென்பொருள் உள்ளது. புரவலன் மென்பொருளில் பெரும்பாலானவை பைதானில் எழுதப்பட்டுள்ளன, இருப்பினும் ** கிளிப்பி/செல்பர்/** கோப்பகத்தில் சில சி குறியீடு உதவியாளர்கள் உள்ளனர். ** கிளிப்பி/இயக்கவியல்/** கோப்பகத்தில் ரோபோ இயக்கவியல் குறியீடு உள்ளது. ** கிளிப்பி/எக்ச்ட்ராச்/** கோப்பகத்தில் புரவலன் குறியீடு விரிவாக்கக்கூடிய "தொகுதிகள்" உள்ளன.
uk: Каталог **klippy/** містить програмне забезпечення хост. Більшість програмного забезпечення є письмовим на Python, проте **klippy/chelper/** каталог містить деякі C кодові помічники. **klippy/kinematics/** каталог містить код kinematics роботи. **klippy/extras/** каталог містить код хосту, що посилюється "модулі".

source: The **lib/** directory contains external 3rd-party library code that is necessary to build some targets.
ta: ** lib/** கோப்பகத்தில் வெளிப்புற 3-தரப்பு நூலகக் குறியீடு உள்ளது, இது சில இலக்குகளை உருவாக்க தேவை.
uk: **lib/** каталог містить зовнішній код бібліотеки 3rd, який необхідний для побудови деяких цілей.

source: The **config/** directory contains example printer configuration files.
ta: ** கட்டமைப்பு/** கோப்பகத்தில் எடுத்துக்காட்டு அச்சுப்பொறி உள்ளமைவு கோப்புகள் உள்ளன.
uk: **config/** каталог містить приклади файлів конфігурації принтера.

source: The **scripts/** directory contains build-time scripts useful for compiling the micro-controller code.
ta: ** ச்கிரிப்ட்கள்/** கோப்பகத்தில் மைக்ரோ-கன்ட்ரோலர் குறியீட்டை தொகுக்க பயனுள்ள கட்டட நேர ச்கிரிப்ட்கள் உள்ளன.
uk: **scripts/** каталог містить скрипти побудови часу, корисні для складання коду мікроконтролера.

source: The **test/** directory contains automated test cases.
ta: ** சோதனை/** கோப்பகத்தில் தானியங்கு சோதனை வழக்குகள் உள்ளன.
uk: **test/** каталог містить автоматизовані тестові випадки.

source: During compilation, the build may create an **out/** directory. This contains temporary build time objects. The final micro-controller object that is built is **out/klipper.elf.hex** on AVR and **out/klipper.bin** on ARM.
ta: தொகுப்பின் போது, உருவாக்கம் ஒரு ** அவுட்/** கோப்பகத்தை உருவாக்கக்கூடும். இதில் தற்காலிக உருவாக்க நேர பொருள்கள் உள்ளன. கட்டப்பட்ட இறுதி மைக்ரோ-கன்ட்ரோலர் பொருள் ஏ.வி.ஆர் மற்றும் ** அவுட்/கிளிப்பர்.பின் ** கையில் ** அவுட்/கிளிப்பர்.எக்ச் ** ஆகும்.
uk: Під час складання конструктор може створити каталог **out/**. Це містить тимчасові об'єкти часу будівництва. Остаточний об'єкт мікроконтролера, який побудований **out/klipper.elf.hex** на AVR і **out/klipper.bin** на ARM.

source: Micro-controller code flow
ta: மைக்ரோ-கண்ட்ரோலர் குறியீடு ஓட்டம்
uk: Micro-контрольний потік коду

source: Execution of the micro-controller code starts in architecture specific code (eg, **src/avr/main.c**) which ultimately calls sched_main() located in **src/sched.c**. The sched_main() code starts by running all functions that have been tagged with the DECL_INIT() macro. It then goes on to repeatedly run all functions tagged with the DECL_TASK() macro.
ta: மைக்ரோ-கன்ட்ரோலர் குறியீட்டின் செயல்பாடு கட்டமைப்பு குறிப்பிட்ட குறியீட்டில் (எ.கா., ** SRC/AVR/MAIN.C **) தொடங்குகிறது, இது இறுதியில் ** SRC/Sall.C ** இல் அமைந்துள்ள Sape_Main () ஐ அழைக்கிறது. Seplow_Init () மேக்ரோவுடன் குறிக்கப்பட்ட அனைத்து செயல்பாடுகளையும் இயக்குவதன் மூலம் Sapel_main () குறியீடு தொடங்குகிறது. இது டெக்_ டாச்க் () மேக்ரோவுடன் குறிக்கப்பட்ட அனைத்து செயல்பாடுகளையும் மீண்டும் மீண்டும் இயக்குகிறது.
uk: Виконання коду мікроконтролера починається в специфічному для архітектури коді (наприклад, **src/avr/main.c**), який зрештою викликає sched_main(), розташований у **src/sched.c**. Код sched_main() починається із запуску всіх функцій, які були позначені макросом DECL_INIT(). Потім він продовжує багаторазово запускати всі функції, позначені макросом DECL_TASK().

source: One of the main task functions is command_dispatch() located in **src/command.c**. This function is called from the board specific input/output code (eg, **src/avr/serial.c**, **src/generic/serial_irq.c**) and it runs the command functions associated with the commands found in the input stream. Command functions are declared using the DECL_COMMAND() macro (see the [protocol](Protocol.md) document for more information).
ta: ** src/command.c ** இல் அமைந்துள்ள கட்டளை_டிச்பாட்ச் () முக்கிய பணி செயல்பாடுகளில் ஒன்று. இந்த செயல்பாடு போர்டு குறிப்பிட்ட உள்ளீடு/வெளியீட்டுக் குறியீட்டிலிருந்து அழைக்கப்படுகிறது (எ.கா. உள்ளீட்டு ச்ட்ரீமில். கட்டளை செயல்பாடுகள் pect_command () மேக்ரோவைப் பயன்படுத்தி அறிவிக்கப்படுகின்றன (மேலும் தகவலுக்கு [நெறிமுறை] (நெறிமுறை. Md) ஆவணத்தைப் பார்க்கவும்).
uk: Однією з основних функцій задач є команди_dispatch() розташована в **src/command.c**. Ця функція називається з плати певним вхідним / вихідним кодом (наприклад, **src/avr/serial.c**, **src/generic/serial_irq.c**) і вона працює функції команд, пов'язані з командами, що знаходяться в вхідному струмі. Командні функції заявлені за допомогою макросису DECL_COMMAND() (див. документ [protocol](Protocol.md) для отримання додаткової інформації).

source: Timer functions are scheduled by calling sched_add_timer() (located in **src/sched.c**). The scheduler code will arrange for the given function to be called at the requested clock time. Timer interrupts are initially handled in an architecture specific interrupt handler (eg, **src/avr/timer.c**) which calls sched_timer_dispatch() located in **src/sched.c**. The timer interrupt leads to execution of schedule timer functions. Timer functions always run with interrupts disabled. The timer functions should always complete within a few micro-seconds. At completion of the timer event, the function may choose to reschedule itself.
ta: TIMER செயல்பாடுகள் Sell_add_timer () ஐ அழைப்பதன் மூலம் திட்டமிடப்பட்டுள்ளன (** src/seld.c ** இல் அமைந்துள்ளது). கோரப்பட்ட கடிகார நேரத்தில் கொடுக்கப்பட்ட செயல்பாடு அழைக்கப்படுவதற்கு திட்டமிடல் குறியீடு ஏற்பாடு செய்யும். நேரங்குறிகருவி குறுக்கீடுகள் ஆரம்பத்தில் ஒரு கட்டிடக்கலை குறிப்பிட்ட குறுக்கீடு கையாளுபவரில் கையாளப்படுகின்றன (எ.கா. நேரங்குறிகருவி குறுக்கீடு அட்டவணை நேரங்குறிகருவி செயல்பாடுகளை செயல்படுத்த வழிவகுக்கிறது. நேரங்குறிகருவி செயல்பாடுகள் எப்போதும் குறுக்கீடுகளுடன் முடக்கப்பட்டுள்ளன. நேரங்குறிகருவி செயல்பாடுகள் எப்போதும் ஒரு சில மைக்ரோ விநாடிகளுக்குள் முடிக்க வேண்டும். நேரங்குறிகருவி நிகழ்வு முடிந்ததும், செயல்பாடு தன்னை மறுபரிசீலனை செய்ய தேர்வு செய்யலாம்.
uk: Функції таймера плануються за допомогою виклику sched_add_timer() (розташовується в **src/sched.c**). Код планувальника влаштовує задану функцію, яка буде викликана за запитом час. Перервами таймера спочатку використовуються в архітектурі конкретний обробник перерву (наприклад, **src/avr/timer.c**), який викликає sched_timer_dispatch() розташований в **src/sched.c**. Перерва таймера призводить до виконання функцій таймера графіка. Функція таймера завжди працює з вимкненими відключенням. Функції таймера завжди повинні завершитися в декількох мікросекундах. На завершення події таймера функція може вибрати для перепланування себе.

source: In the event an error is detected the code can invoke shutdown() (a macro which calls sched_shutdown() located in **src/sched.c**). Invoking shutdown() causes all functions tagged with the DECL_SHUTDOWN() macro to be run. Shutdown functions always run with interrupts disabled.
ta: ஒரு பிழை கண்டறியப்பட்டால், குறியீடு பணிநிறுத்தம் () (** src/seld.c ** இல் அமைந்துள்ள Sape_Shutdown () என்று அழைக்கும் மேக்ரோ. பணிநிறுத்தம் () ஐத் தூண்டுவது டெக்_சட் பேரூர் () மேக்ரோவுடன் குறியிடப்பட்ட அனைத்து செயல்பாடுகளையும் இயக்குகிறது. பணிநிறுத்தம் செயல்பாடுகள் எப்போதும் குறுக்கீடுகளுடன் இயங்கும்.
uk: У разі виявлення помилки коду може викликати вимкнення () (а макрос, який викликає sched_shutdown(), розташованого в **src/sched.c**). Викликання вимкнення () викликає всі функції, позначені макросом DECL_SHUTDOWN() для запуску. Відключені функції завжди працюють з відключенням.

source: Much of the functionality of the micro-controller involves working with General-Purpose Input/Output pins (GPIO). In order to abstract the low-level architecture specific code from the high-level task code, all GPIO events are implemented in architecture specific wrappers (eg, **src/avr/gpio.c**). The code is compiled with gcc's "-flto -fwhole-program" optimization which does an excellent job of inlining functions across compilation units, so most of these tiny gpio functions are inlined into their callers, and there is no run-time cost to using them.
ta: மைக்ரோ-கன்ட்ரோலரின் செயல்பாட்டின் பெரும்பகுதி பொது நோக்கத்திற்கான உள்ளீடு/வெளியீட்டு ஊசிகளுடன் (சிபிஐஓ) பணியாற்றுவதை உள்ளடக்குகிறது. உயர் மட்ட பணிக் குறியீட்டிலிருந்து குறைந்த-நிலை கட்டமைப்பு குறிப்பிட்ட குறியீட்டை சுருக்கிக் கொள்வதற்காக, அனைத்து GPIO நிகழ்வுகளும் கட்டிடக்கலை குறிப்பிட்ட ரேப்பர்களில் செயல்படுத்தப்படுகின்றன (எ.கா., ** SRC/AVR/GPIO.C **). குறியீடு சி.சி.சியின் "-flto -fwhole-program" தேர்வுமுறையுடன் தொகுக்கப்பட்டுள்ளது, இது தொகுப்புக் அலகுகளில் செயல்பாடுகளைத் தூண்டுவதற்கான ஒரு சிறந்த வேலையைச் செய்கிறது, எனவே இந்த சிறிய GPIO செயல்பாடுகளில் பெரும்பாலானவை அவற்றின் அழைப்பாளர்களிடையே வைக்கப்படுகின்றன, மேலும் பயன்படுத்துவதற்கு ரன்-டைம் செலவு இல்லை அவர்கள்.
uk: Багато функціональних можливостей мікроконтролера передбачає роботу з загальноприйнятими вхідними / вихідними шпильками (GPIO). Для того, щоб абстрагувати конкретний код з високого рівня, всі події GPIO реалізовані в архітектурі конкретні обгортки (наприклад, **src/avr/gpio.c**). Код скомпільований з оптимізацією gcc's "-flto -fwhole-program", що робить відмінну роботу з нахилом функцій по частинах компіляції, тому більшість з цих крихітних функцій gpio вбудовані в своїх абонентів, і не існує постійної вартості для їх використання.

source: Klippy code overview
ta: கிளிப்பி குறியீடு கண்ணோட்டம்
uk: Огляд коду Klippy

source: The host code (Klippy) is intended to run on a low-cost computer (such as a Raspberry Pi) paired with the micro-controller. The code is primarily written in Python, however it does use CFFI to implement some functionality in C code.
ta: புரவலன் குறியீடு (கிளிப்பி) மைக்ரோ-கன்ட்ரோலருடன் சோடியாக குறைந்த விலை கணினியில் (ராச்பெர்ரி பை போன்றவை) இயக்கும் நோக்கம் கொண்டது. குறியீடு முதன்மையாக பைத்தானில் எழுதப்பட்டுள்ளது, இருப்பினும் இது சி குறியீட்டில் சில செயல்பாடுகளை செயல்படுத்த CFFI ஐப் பயன்படுத்துகிறது.
uk: Хост-код (Klippy) призначений для запуску на недорогому комп'ютері (наприклад, Raspberry Pi) з мікроконтролером. Код в першу чергу написаний на Python, проте він використовує CFFI для реалізації деяких функцій в C-коді.

source: Initial execution starts in **klippy/klippy.py**. This reads the command-line arguments, opens the printer config file, instantiates the main printer objects, and starts the serial connection. The main execution of G-code commands is in the process_commands() method in **klippy/gcode.py**. This code translates the G-code commands into printer object calls, which frequently translate the actions to commands to be executed on the micro-controller (as declared via the DECL_COMMAND macro in the micro-controller code).
ta: ஆரம்ப சாவுஒறுப்பு ** klippy/klippy.py ** இல் தொடங்குகிறது. இது கட்டளை-வரி வாதங்களைப் படிக்கிறது, அச்சுப்பொறி கட்டமைப்பு கோப்பைத் திறக்கிறது, முதன்மையான அச்சுப்பொறி பொருள்களை நிறுவுகிறது, மேலும் தொடர் இணைப்பைத் தொடங்குகிறது. சி-கோட் கட்டளைகளின் முக்கிய செயல்பாடு ** klippy/gcode.py ** இல் செயல்முறை_காமண்ட்ச் () முறையில் உள்ளது. இந்த குறியீடு சி-குறியீடு கட்டளைகளை அச்சுப்பொறி பொருள் அழைப்புகளாக மொழிபெயர்க்கிறது, இது மைக்ரோ-கன்ட்ரோலரில் செயல்படுத்தப்பட வேண்டிய கட்டளைகளுக்கு அடிக்கடி மொழிபெயர்க்கப்பட்டுள்ளது (மைக்ரோ-கன்ட்ரோலர் குறியீட்டில் டெக்_காம்மண்ட் மேக்ரோ வழியாக அறிவிக்கப்பட்டபடி).
uk: Початкове виконання починається в **klippy/klippy.py**. Цей читає аргументи командного рядка, відкриває файл налаштування принтера, миттєво отримує основні об'єкти принтера, і починає серійне підключення. Головне виконання команд G-коду в методі process_commands() в **klippy/gcode.py**. Цей код переводить команду G-коду на виклики об'єкта принтера, які часто переводять дії для команд, які будуть виконані на мікроконтролері (за заявленою через макросектор DECL_COMMAND у мікроконтролері).

source: There are four threads in the Klippy host code. The main thread handles incoming gcode commands. A second thread (which resides entirely in the **klippy/chelper/serialqueue.c** C code) handles low-level IO with the serial port. The third thread is used to process response messages from the micro-controller in the Python code (see **klippy/serialhdl.py**). The fourth thread writes debug messages to the log (see **klippy/queuelogger.py**) so that the other threads never block on log writes.
ta: கிளிப்பி புரவலன் குறியீட்டில் நான்கு நூல்கள் உள்ளன. முதன்மையான நூல் உள்வரும் GCODE கட்டளைகளை கையாளுகிறது. இரண்டாவது நூல் (இது முற்றிலும் ** கிளிப்பி/செல்பர்/சீரியால்கியூ. பைதான் குறியீட்டில் உள்ள மைக்ரோ-கன்ட்ரோலரிலிருந்து மறுமொழி செய்திகளை செயலாக்க மூன்றாவது நூல் பயன்படுத்தப்படுகிறது (பார்க்க ** கிளிப்பி/சீரியல்எச்.டி.எல்.ஒய் **). நான்காவது நூல் பிழைத்திருத்த செய்திகளை பதிவுக்கு எழுதுகிறது (** கிளிப்பி/queuealogger.py ** ஐப் பார்க்கவும்) இதனால் மற்ற நூல்கள் ஒருபோதும் பதிவு எழுதுகின்றன.
uk: Є чотири нитки в коді хости Klippy. Головні ручки з різьбленням Gcode команди. Друга нитка (який повністю переходить в **klippy/chelper/serialqueue.c** C код) ручок низького рівня IO з серійним портом. Третя нитка використовується для обробки повідомлень від мікроконтролера в Python-коді (див. **klippy/serialhdl.py**). Четверта нитка пише повідомлення про відключення до журналу (див. **klippy/queuelogger.py**), так що інші нитки ніколи не блокуються на записах журналу.

source: Code flow of a move command
ta: நகரும் கட்டளையின் குறியீடு ஓட்டம்
uk: Кодовий потік команди переміщення

source: A typical printer movement starts when a "G1" command is sent to the Klippy host and it completes when the corresponding step pulses are produced on the micro-controller. This section outlines the code flow of a typical move command. The [kinematics](Kinematics.md) document provides further information on the mechanics of moves.
ta: கிளிப்பி ஓச்டுக்கு "சி 1" கட்டளை அனுப்பப்படும்போது ஒரு பொதுவான அச்சுப்பொறி இயக்கம் தொடங்குகிறது, மேலும் மைக்ரோ-கன்ட்ரோலரில் தொடர்புடைய படி பருப்பு வகைகள் தயாரிக்கப்படும் போது அது நிறைவு செய்கிறது. இந்த பிரிவு ஒரு பொதுவான நகர்வு கட்டளையின் குறியீடு ஓட்டத்தை கோடிட்டுக் காட்டுகிறது. [இயக்கவியல்] (இயக்கவியல். எம்.டி) ஆவணம் நகர்வுகளின் இயக்கவியல் பற்றிய கூடுதல் தகவல்களை வழங்குகிறது.
uk: Типовий рух принтера починається, коли команда "G1" надходить до хосту Кліппи, і вона завершується, коли на мікроконтролері виробляють відповідні імпульси. Цей розділ визначає потік коду типової команди руху. Документ [кінематика](кінематика.md) надає подальшу інформацію про механіки рухів.

source: Processing for a move command starts in gcode.py. The goal of gcode.py is to translate G-code into internal calls. A G1 command will invoke cmd_G1() in klippy/extras/gcode_move.py. The gcode_move.py code handles changes in origin (eg, G92), changes in relative vs absolute positions (eg, G90), and unit changes (eg, F6000=100mm/s). The code path for a move is: `_process_data() -> _process_commands() -> cmd_G1()`. Ultimately the ToolHead class is invoked to execute the actual request: `cmd_G1() -> ToolHead.move()`
ta: நகரும் கட்டளைக்கான செயலாக்கம் GCODE.PY இல் தொடங்குகிறது. Gcode.py இன் குறிக்கோள் சி-குறியீட்டை உள் அழைப்புகளாக மொழிபெயர்ப்பதாகும். ஒரு ஐயா 1 கட்டளை கிளிப்பி/எக்ச்ட்ராக்கள்/gcode_move.py இல் cmd_g1 () ஐ அழைக்கும். Gcode_move.py குறியீடு தோற்றத்தில் மாற்றங்களை கையாளுகிறது (எ.கா., G92), உறவினர் Vs முழுமையான நிலைகளில் (எ.கா., G90) மாற்றங்கள் மற்றும் அலகு மாற்றங்கள் (எ.கா., F6000 = 100 மிமீ/வி). ஒரு நகர்வுக்கான குறியீடு பாதை: `_PROCESS_DATA () -> _PROCESS_COMMANDS () -> CMD_G1 ()`. இறுதியில் கருவிஎட் வகுப்பு உண்மையான கோரிக்கையை செயல்படுத்த பயன்படுத்தப்படுகிறது: `cmd_g1 () -> கருவிஎட்.மோவ் ()`
uk: Обробка для команди руху починається в gcode.py. Мета gcode. py - перевести G-код у внутрішні дзвінки. Команда G1 буде викликати cmd_G1 () в klippy/extras/gcode_move.py. Код gcode_move.py код ручить зміни походження (наприклад, G92), зміни відносно абсолютної позиції (наприклад, G90) і зміни блоків (наприклад, F6000=100mm/s). Код переходу: `_process_data() -> _process_commands() -> cmd_G1()`. У кінцевому підсумку клас ToolHead викликаний виконання фактичного запиту: ` cmd_G1 () -> ToolHead.move()`

source: ToolHead.move() creates a Move() object with the parameters of the move (in cartesian space and in units of seconds and millimeters).
ta: கருவியின் அளவுருக்கள் (கார்ட்டீசியன் இடத்திலும், விநாடிகள் மற்றும் மில்லிமீட்டர்களின் அலகுகளிலும்) ஒரு நகர்வு () பொருளை உருவாக்குகிறது.
uk: ToolHead.move() створює об'єкт Move() з параметрами руху (в карцесському просторі і в блоках секунд і міліметрів).

source: The kinematics class is given the opportunity to audit each move (`ToolHead.move() -> kin.check_move()`). The kinematics classes are located in the klippy/kinematics/ directory. The check_move() code may raise an error if the move is not valid. If check_move() completes successfully then the underlying kinematics must be able to handle the move.
ta: ஒவ்வொரு நகர்வையும் (`கருவிஎட் () -> கின்.செக்_மோவ் ()`) தணிக்கை செய்ய இயக்கவியல் வகுப்பிற்கு வாய்ப்பு வழங்கப்படுகிறது. இயக்கவியல் வகுப்புகள் கிளிப்பி/ இயக்கவியல்/ கோப்பகத்தில் அமைந்துள்ளன. நகர்வு செல்லுபடியாகாவிட்டால் Check_move () குறியீடு பிழையை எழுப்பக்கூடும். செக்_மோவ் () வெற்றிகரமாக முடிந்தால், அடிப்படை இயக்கவியல் நகர்வைக் கையாள முடியும்.
uk: Клас кінематики надається можливість аудиту кожного руху (`ToolHead.move() -> kin.check_move()`). Класи кінематики розташовані в klippy/kinematics/ каталозі. Введіть номер мобільного, який Ви вказали при укладаннi договору з банком - для ідентифікації. Якщо перевірте_move() завершується успішно, то основну кінематику необхідно мати можливість обробити рух.

source: Move.set_junction() implements the "trapezoid generator" on a move. The "trapezoid generator" breaks every move into three parts: a constant acceleration phase, followed by a constant velocity phase, followed by a constant deceleration phase. Every move contains these three phases in this order, but some phases may be of zero duration.
ta: Move.set_junction () ஒரு நகர்வில் "ட்ரெப்சாய்டு செனரேட்டரை" செயல்படுத்துகிறது. "ட்ரெப்சாய்டு செனரேட்டர்" ஒவ்வொரு அசைவையும் மூன்று பகுதிகளாக உடைக்கிறது: ஒரு நிலையான முடுக்கம் கட்டம், அதைத் தொடர்ந்து ஒரு நிலையான விரைவு கட்டம், அதைத் தொடர்ந்து ஒரு நிலையான வீழ்ச்சி கட்டம். ஒவ்வொரு நகர்விலும் இந்த வரிசையில் இந்த மூன்று கட்டங்கள் உள்ளன, ஆனால் சில கட்டங்கள் சுழிய காலமாக இருக்கலாம்.
uk: Move.set_junction() реалізує "трапецієподібний генератор" на ходу. "trapezoid генератор" розбиває кожен переїзд на три частини: постійну фазу прискорення, з подальшою стабільною швидкою фазою, з подальшою фазою декларації. Кожен перехід містить ці три фази в цьому порядку, але деякі фази можуть бути з нульової тривалості.

source: When ToolHead._process_moves() is called, everything about the move is known - its start location, its end location, its acceleration, its start/cruising/end velocity, and distance traveled during acceleration/cruising/deceleration. All the information is stored in the Move() class and is in cartesian space in units of millimeters and seconds.
ta: கருவிஎட். அனைத்து தகவல்களும் நகர்வு () வகுப்பில் சேமிக்கப்பட்டு, கார்ட்டீசியன் இடத்தில் மில்லிமீட்டர் மற்றும் விநாடிகளின் அலகுகளில் உள்ளன.
uk: Коли ToolHead._process_moves() називається, все про переміщення відомий - його розташування, його кінцеве місце розташування, його прискорення, його початок/здійснення/закінчення швидкості, а відстань, що подорожується під час прискорення/збільшення/відкриття. Вся інформація зберігається в класі Move() і знаходиться в карцесіанському просторі в підрозділах міліметрів і секунд.

source: Note that the extruder is handled in its own kinematic class: `ToolHead._process_moves() -> PrinterExtruder.move()`. Since the Move() class specifies the exact movement time and since step pulses are sent to the micro-controller with specific timing, stepper movements produced by the extruder class will be in sync with head movement even though the code is kept separate.
ta: எக்ச்ட்ரூடர் அதன் சொந்த இயக்கவியல் வகுப்பில் கையாளப்படுகிறது என்பதை நினைவில் கொள்க: `கருவிஎட். நகர்வு () வகுப்பு சரியான இயக்க நேரத்தைக் குறிப்பிடுவதால், குறிப்பிட்ட நேரத்துடன் படி பருப்பு வகைகள் மைக்ரோ-கன்ட்ரோலருக்கு அனுப்பப்படுவதால், எக்ச்ட்ரூடர் வகுப்பால் தயாரிக்கப்படும் ச்டெப்பர் இயக்கங்கள் குறியீடு தனித்தனியாக வைக்கப்பட்டிருந்தாலும் தலை இயக்கத்துடன் ஒத்திசைக்கப்படும்.
uk: Зверніть увагу, що екструдера ручається в власних kinematic класі: `ToolHead._process_moves() -> ПринтерExtruder.move()`. Так як Move() клас визначає точний час руху і так як покрокові імпульси надсилаються до мікроконтролеру з певними термінами, крокові рухи, що виробляються класом екструдера, будуть в синхронізації з рухом голови, хоча код зберігається окремо.
