Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Code_Overview.po
Languages: ta, uk

source: Implement the C stepper kinematic position functions for each stepper if they are not already available (see kin_cart.c, kin_corexy.c, and kin_delta.c in klippy/chelper/). The function should call `move_get_coord()` to convert a given move time (in seconds) to a cartesian coordinate (in millimeters), and then calculate the desired stepper position (in millimeters) from that cartesian coordinate.
ta: ஒவ்வொரு ச்டெப்பருக்கும் ஏற்கனவே கிடைக்கவில்லை என்றால் சி ச்டெப்பர் கினெமாடிக் நிலை செயல்பாடுகளை செயல்படுத்தவும் (KIN_CART.C, KIN_COREXY.C, மற்றும் KIN_DELTA.C ஐப் பார்க்கவும் கிளிப்பி/செல்/). கொடுக்கப்பட்ட நகர்வு நேரத்தை (நொடிகளில்) ஒரு கார்ட்டீசியன் ஒருங்கிணைப்புக்கு (மில்லிமீட்டரில்) மாற்ற `MOVE_GET_COORD ()` ஐ அழைக்க வேண்டும், பின்னர் அந்த கார்ட்டீசியன் ஒருங்கிணைப்பிலிருந்து விரும்பிய ச்டெப்பர் நிலையை (மில்லிமீட்டரில்) கணக்கிட வேண்டும்.
uk: Впровадити функції C stepper kinematic позицію для кожного кроку, якщо вони вже доступні (див. kin_cart.c, kin_corexy.c, kin_delta.c в klippy/chelper/). Функція повинна викликати `move_get_coord()` для перетворення заданого часу руху (в секундах) до картезійського координування (в міліметрах), а потім розрахувати бажану позицію кроку (в міліметрах) з цієї координати.

source: Implement the `calc_position()` method in the new kinematics class. This method calculates the position of the toolhead in cartesian coordinates from the position of each stepper. It does not need to be efficient as it is typically only called during homing and probing operations.
ta: புதிய இயக்கவியல் வகுப்பில் `calc_position ()` முறையை செயல்படுத்தவும். இந்த முறை ஒவ்வொரு ச்டெப்பரின் நிலையிலிருந்தும் கார்ட்டீசியன் ஆயத்தொகுதிகளில் கருவித்தடத்தின் நிலையை கணக்கிடுகிறது. இது பொதுவாக ஓமிங் மற்றும் ஆய்வு நடவடிக்கைகளின் போது மட்டுமே அழைக்கப்படுவதால் இது திறமையாக இருக்க தேவையில்லை.
uk: Впровадження `calc_position()` методу в новому класі kinematics. Цей метод розраховує позицію в карцесіанських координатах з позиції кожного кроку. Не потрібно бути ефективним, оскільки це, як правило, називається під час обробки та пробування операцій.

source: Other methods. Implement the `check_move()`, `get_status()`, `get_steppers()`, `home()`, and `set_position()` methods. These functions are typically used to provide kinematic specific checks. However, at the start of development one can use boiler-plate code here.
ta: பிற முறைகள். `Check_move ()`, `get_status ()`, `get_steppers ()`, `வீடு ()`, மற்றும் `set_position ()` முறைகளை செயல்படுத்தவும். இந்த செயல்பாடுகள் பொதுவாக இயக்கவியல் குறிப்பிட்ட காசோலைகளை வழங்க பயன்படுத்தப்படுகின்றன. இருப்பினும், வளர்ச்சியின் தொடக்கத்தில் ஒருவர் இங்கே கொதிகலன்-தட்டு குறியீட்டைப் பயன்படுத்தலாம்.
uk: Інші методи. `check_move()`, `get_status()`, `get_steppers`, `home()`, і `set_position()` Ці функції зазвичай використовуються для надання кінематичних специфічних перевірок. Однак на старті розробки можна скористатися котельно-платним кодом тут.

source: Implement test cases. Create a g-code file with a series of moves that can test important cases for the given kinematics. Follow the [debugging documentation](Debugging.md) to convert this g-code file to micro-controller commands. This is useful to exercise corner cases and to check for regressions.
ta: சோதனை வழக்குகளை செயல்படுத்தவும். கொடுக்கப்பட்ட இயக்கவியலுக்கான முக்கியமான நிகழ்வுகளை சோதிக்கக்கூடிய தொடர் நகர்வுகளுடன் சி-குறியீடு கோப்பை உருவாக்கவும். இந்த சி-குறியீட்டு கோப்பை மைக்ரோ-கன்ட்ரோலர் கட்டளைகளாக மாற்ற [பிழைத்திருத்த ஆவணங்கள்] (பிழைத்திருத்தம். எம்.டி) ஐப் பின்தொடரவும். மூலையில் வழக்குகளை உடற்பயிற்சி செய்வதற்கும் பின்னடைவுகளை சரிபார்க்கவும் இது பயனுள்ளதாக இருக்கும்.
uk: Впровадження тестових випадків. Створіть файл g-коду з рядом переходів, які можуть перевірити важливі випадки для даної кінематики. Дотримуйтесь [debugging документації](Debugging.md) для перетворення цього файлу g-коду до команди мікроконтролерів. Це корисно для здійснення кутових випадків і для перевірки регресій.

source: Porting to a new micro-controller
ta: புதிய மைக்ரோ-கன்ட்ரோலருக்கு போர்ட்டிங்
uk: Портування на новий мікроконтролер

source: This section provides some tips on porting Klipper's micro-controller code to a new architecture. This type of activity requires good knowledge of embedded development and hands-on access to the target micro-controller.
ta: இந்த பிரிவு கிளிப்பரின் மைக்ரோ-கன்ட்ரோலர் குறியீட்டை ஒரு புதிய கட்டமைப்பிற்கு போர்ட்டிங் செய்வதற்கான சில உதவிக்குறிப்புகளை வழங்குகிறது. இந்த வகை செயல்பாட்டிற்கு உட்பொதிக்கப்பட்ட வளர்ச்சி மற்றும் இலக்கு மைக்ரோ-கன்ட்ரோலருக்கு அணுகல் பற்றிய நல்ல அறிவு தேவைப்படுகிறது.
uk: Цей розділ надає деякі поради щодо портування мікроконтролера Klipper до нової архітектури. Даний вид діяльності вимагає хороших знань вбудованого розвитку і практичного доступу до цільового мікроконтролера.

source: Start by identifying any 3rd party libraries that will be used during the port. Common examples include "CMSIS" wrappers and manufacturer "HAL" libraries. All 3rd party code needs to be GNU GPLv3 compatible. The 3rd party code should be committed to the Klipper lib/ directory. Update the lib/README file with information on where and when the library was obtained. It is preferable to copy the code into the Klipper repository unchanged, but if any changes are required then those changes should be listed explicitly in the lib/README file.
ta: துறைமுகத்தின் போது பயன்படுத்தப்படும் 3 வது தரப்பு நூலகங்களை அடையாளம் காண்பதன் மூலம் தொடங்கவும். பொதுவான எடுத்துக்காட்டுகளில் "CMSIS" ரேப்பர்கள் மற்றும் உற்பத்தியாளர் "HAL" நூலகங்கள் அடங்கும். அனைத்து 3 வது தரப்பு குறியீடுகளும் குனு சி.பி.எல்.வி 3 இணக்கமாக இருக்க வேண்டும். 3 வது தரப்பு குறியீடு கிளிப்பர் லிப்/ கோப்பகத்திற்கு உறுதியளிக்க வேண்டும். நூலகம் எங்கு, எப்போது பெறப்பட்டது என்பது பற்றிய தகவலுடன் LIB/README கோப்பைப் புதுப்பிக்கவும். குறியீட்டை கிளிப்பர் களஞ்சியத்தில் மாற்றாமல் நகலெடுப்பது விரும்பத்தக்கது, ஆனால் ஏதேனும் மாற்றங்கள் தேவைப்பட்டால், அந்த மாற்றங்கள் LIB/README கோப்பில் வெளிப்படையாக பட்டியலிடப்பட வேண்டும்.
uk: Почати виявляти будь-які бібліотеки 3rd, які будуть використані під час порту. Загальні приклади включають в себе "CMSIS" обгортки і виробник "HAL" бібліотеки. Всі тристоронні коди повинні бути GNU GPLv3 сумісні. Код 3-ї партії повинен бути здійснений до каталогу Klipper lib/. Оновлення файлу lib/README з інформацією про те, де було отримано бібліотеку. Відповідність копіювання коду в репозиторію Кліппера, але якщо будь-які зміни потрібні, то ці зміни повинні бути вказані явно в файлі lib/README.

source: Create a new architecture sub-directory in the src/ directory and add initial Kconfig and Makefile support. Use the existing architectures as a guide. The src/simulator provides a basic example of a minimum starting point.
ta: எச்.ஆர்.சி/ கோப்பகத்தில் ஒரு புதிய கட்டமைப்பு துணை அடைப்பை உருவாக்கி, ஆரம்ப KCONFIG மற்றும் மேக்ஃபைல் ஆதரவைச் சேர்க்கவும். ஏற்கனவே உள்ள கட்டமைப்புகளை வழிகாட்டியாகப் பயன்படுத்தவும். எச்.ஆர்.சி/சிமுலேட்டர் குறைந்தபட்ச தொடக்க புள்ளியின் அடிப்படை உதாரணத்தை வழங்குகிறது.
uk: Створіть новий архітектурний підрозділ в каталозі src/ та додайте початкову підтримку Kconfig та Makefile. Використовуйте існуючі архітектури як довідник. Сарк/симулятор забезпечує базовий приклад мінімальної початкової точки.

source: Get familiar with the the console.py tool (as described in the [debugging document](Debugging.md)) and verify connectivity to the micro-controller with it. This tool translates the low-level micro-controller communication protocol to a human readable form.
ta: Console.py கருவியுடன் ([பிழைத்திருத்த ஆவணம்] (பிழைத்திருத்த ஆவணத்தில்) விவரிக்கப்பட்டுள்ளபடி) நன்கு அறிந்து கொள்ளுங்கள், மேலும் அதனுடன் மைக்ரோ-கன்ட்ரோலருக்கான இணைப்பை சரிபார்க்கவும். இந்த கருவி குறைந்த அளவிலான மைக்ரோ-கன்ட்ரோலர் கம்யூனிகேசன் நெறிமுறையை மனித படிக்கக்கூடிய வடிவத்திற்கு மொழிபெயர்க்கிறது.
uk: Ознайомитися з консолі. py tool (як описано в [debugging документ](Debugging.md))) і переконатися підключення до мікроконтролера з ним. Цей інструмент переводить протокол мікроконтролерів низького рівня до читабельної форми людини.

source: Create a sample Klipper config file in the config/ directory. Test the micro-controller with the main klippy.py program.
ta: கட்டமைப்பு/ கோப்பகத்தில் மாதிரி கிளிப்பர் கட்டமைப்பு கோப்பை உருவாக்கவும். மைக்ரோ-கன்ட்ரோலரை முதன்மையான klippy.py திட்டத்துடன் சோதிக்கவும்.
uk: Створіть зразок Klipper config файл у каталозі config/. Тестування мікроконтролера з основною клипкою. py програма.

source: Consider adding build test cases in the test/ directory.
ta: சோதனை/ கோப்பகத்தில் உருவாக்க சோதனை நிகழ்வுகளைச் சேர்ப்பதைக் கவனியுங்கள்.
uk: Враховуйте, додаючи приклади тестування на тест / каталог.

source: Coordinate Systems
ta: ஒருங்கிணைப்பு அமைப்புகள்
uk: Координаційні системи

source: Internally, Klipper primarily tracks the position of the toolhead in cartesian coordinates that are relative to the coordinate system specified in the config file. That is, most of the Klipper code will never experience a change in coordinate systems. If the user makes a request to change the origin (eg, a `G92` command) then that effect is obtained by translating future commands to the primary coordinate system.
ta: உள்நாட்டில், கிளிப்பர் முதன்மையாக கார்ட்டீசியன் ஆயத்தொகுதிகளில் கருவித்தடத்தின் நிலையை கண்காணிக்கிறது, அவை கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்புடன் தொடர்புடையவை. அதாவது, கிளிப்பர் குறியீட்டில் பெரும்பாலானவை ஒருபோதும் ஒருங்கிணைப்பு அமைப்புகளில் மாற்றத்தை அனுபவிக்காது. தோற்றத்தை மாற்ற பயனர் ஒரு கோரிக்கையைச் செய்தால் (எ.கா., ஒரு `சி 92` கட்டளை) பின்னர் எதிர்கால கட்டளைகளை முதன்மை ஒருங்கிணைப்பு அமைப்புக்கு மொழிபெயர்ப்பதன் மூலம் அந்த விளைவு பெறப்படுகிறது.
uk: Внутрішньо, Klipper в першу чергу відстежує позицію в рядках інструментів, які відносяться до координаційної системи, зазначеної в файлі конфігурації. Це, більшість кодів Klipper ніколи не відчувають зміни в координатних системах. Якщо користувач робить запит на зміну походження (наприклад, `G92` команди), то цей ефект отримується шляхом перетягування майбутніх команд до початкової координаційної системи.

source: However, in some cases it is useful to obtain the toolhead position in some other coordinate system and Klipper has several tools to facilitate that. This can be seen by running the GET_POSITION command. For example:
ta: இருப்பினும், சில சந்தர்ப்பங்களில், வேறு சில ஒருங்கிணைப்பு அமைப்பில் கருவித் தலை நிலையைப் பெறுவது பயனுள்ளதாக இருக்கும், மேலும் அதை எளிதாக்க கிளிப்பருக்கு பல கருவிகள் உள்ளன. Get_position கட்டளையை இயக்குவதன் மூலம் இதைக் காணலாம். உதாரணமாக:
uk: Тим не менш, в деяких випадках корисно отримати позицію інструментального головка в деяких інших координатних системах і Klipper має кілька інструментів для полегшення цього. Це можна побачити за допомогою команди GET_SETTING. Наприклад:

source: The "stepper" position (`stepper.get_commanded_position()`) is the position of the given stepper as tracked by the kinematics code. This generally corresponds to the position (in mm) of the carriage along its rail, relative to the position_endstop specified in the config file. (Some kinematics track stepper positions in radians instead of millimeters.) If the robot is in motion when the query is issued then the reported value includes moves buffered on the micro-controller, but does not include moves on the look-ahead queue. One may use the `toolhead.flush_step_generation()` or `toolhead.wait_moves()` calls to fully flush the look-ahead and step generation code.
ta: "ச்டெப்பர்" நிலை (`stepper.get_commanded_position ()`) என்பது இயக்கவியல் குறியீட்டால் கண்காணிக்கப்பட்டபடி கொடுக்கப்பட்ட ச்டெப்பரின் நிலை. இது பொதுவாக அதன் ரயிலில் உள்ள வண்டியின் நிலைக்கு (மிமீ) ஒத்திருக்கிறது, இது கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள நிலை_எண்ட்ச்டாப்புடன் ஒப்பிடும்போது. . ஒருவர் `கருவிஎட்.
uk: Положення «Степпер» (`Степпер.get_commanded_position()`) є позицією даної крокової стрілки як відстежується кодом кінематики. Це, як правило, відповідає позиції (в мм) перевезення по її рейки, відносно позиції_endstop, зазначеного в файлі конфігурації. (Симові Кінематики крокової позиції в ради замість міліметрів.) Якщо робот перебуває в русі, коли запит видається, то вказана вартість включає переміщення на мікроконтролері, але не включає в себе переміщення по черзі. Один може використовуватися `toolhead.flush_step_генерація()` або `toolhead.wait_moves()` виклики, щоб повністю почистити зовнішній вигляд і покроковий код генерації.

source: The "kinematic" position (`kin.calc_position()`) is the cartesian position of the toolhead as derived from "stepper" positions and is relative to the coordinate system specified in the config file. This may differ from the requested cartesian position due to the granularity of the stepper motors. If the robot is in motion when the "stepper" positions are taken then the reported value includes moves buffered on the micro-controller, but does not include moves on the look-ahead queue. One may use the `toolhead.flush_step_generation()` or `toolhead.wait_moves()` calls to fully flush the look-ahead and step generation code.
ta: "கினெமாடிக்" நிலை (`KIN.Calc_Position ()`) என்பது "ச்டெப்பர்" நிலைகளிலிருந்து பெறப்பட்ட கருவியின் கார்ட்டீசியன் நிலையாகும், மேலும் இது கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்புடன் தொடர்புடையது. ச்டெப்பர் மோட்டார்சின் கிரானுலாரிட்டி காரணமாக இது கோரப்பட்ட கார்ட்டீசியன் நிலையில் இருந்து வேறுபடலாம். "ச்டெப்பர்" நிலைகள் எடுக்கப்படும்போது ரோபோ இயக்கத்தில் இருந்தால், அறிக்கையிடப்பட்ட மதிப்பில் மைக்ரோ-கன்ட்ரோலரில் இடையகப்படுத்தப்பட்ட நகர்வுகள் அடங்கும், ஆனால் தோற்றமளிக்கும் வரிசையில் நகர்வுகள் இல்லை. ஒருவர் `கருவிஎட்.
uk: Позиція "кінематичний" (`kin.calc_position()`) є карцеезіанською позицією інструментарію, отриманою з позицій "степпер" і є відносно координаційної системи, зазначеної в файлі конфігурації. Це може відрізнятися від запитуваного каресянського положення через гранульацію крокових двигунів. Якщо робот перебуває в русі, коли позиції «степпера» беруться тоді, вказане значення включає переміщення, що переміщуються на мікроконтролері, але не включає в себе переміщення по черзі. Один може використовуватися `toolhead.flush_step_генерація()` або `toolhead.wait_moves()` виклики, щоб повністю почистити зовнішній вигляд і покроковий код генерації.

source: The "toolhead" position (`toolhead.get_position()`) is the last requested position of the toolhead in cartesian coordinates relative to the coordinate system specified in the config file. If the robot is in motion when the query is issued then the reported value includes all requested moves (even those in buffers waiting to be issued to the stepper motor drivers).
ta: "கருவிஎட்" நிலை (`கருவிஎட். வினவல் வழங்கப்படும் போது ரோபோ இயக்கத்தில் இருந்தால், அறிக்கையிடப்பட்ட மதிப்பில் கோரப்பட்ட அனைத்து நகர்வுகளும் அடங்கும் (ச்டெப்பர் மின்னோடி டிரைவர்களுக்கு வழங்க காத்திருக்கும் இடையகங்களில் உள்ளவர்கள் கூட).
uk: Позиція "toolhead" (`toolhead.get_position()`) є останнім запитуваним положенням панелі інструментів в карцесіанських координатах відносно координаційної системи, зазначеної в файлі конфігурації. Якщо робот перебуває в русі, коли запит буде видана інформація, вказана вартість включає в себе всі необхідні переходи (навіть ті, хто очікується, що видається на крокові двигуни).

source: The "gcode" position is the last requested position from a `G1` (or `G0`) command in cartesian coordinates relative to the coordinate system specified in the config file. This may differ from the "toolhead" position if a g-code transformation (eg, bed_mesh, bed_tilt, skew_correction) is in effect. This may differ from the actual coordinates specified in the last `G1` command if the g-code origin has been changed (eg, `G92`, `SET_GCODE_OFFSET`, `M221`). The `M114` command (`gcode_move.get_status()['gcode_position']`) will report the last g-code position relative to the current g-code coordinate system.
ta: கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்புடன் தொடர்புடைய கார்ட்டீசியன் ஆயத்தொகுதிகளில் `சி 1` (அல்லது` ஐயா 0`) கட்டளையிலிருந்து கடைசியாகக் கோரப்பட்ட நிலை "சி.சி.ஓ.டி" நிலை. சி-குறியீடு மாற்றம் (எ.கா., படுக்கை_மெச், படுக்கை_பில்ட், ச்கீ_க்யூரெக்சன்) நடைமுறையில் இருந்தால் இது "கருவிஎட்" நிலையிலிருந்து வேறுபடலாம். சி-குறியீட்டு தோற்றம் மாற்றப்பட்டிருந்தால் (எ.கா., `சி 92`,` செட்_சி கோட்_ஓஃப்செட்`, `எம் 221`) கடந்த` ஐயா 1 கட்டளையில் குறிப்பிடப்பட்டுள்ள உண்மையான ஆயங்களிலிருந்து இது வேறுபடலாம். `M114` கட்டளை (` gcode_move.get_status () ['gcode_position'] `)`) தற்போதைய சி-குறியீடு ஒருங்கிணைப்பு அமைப்புடன் தொடர்புடைய கடைசி சி-குறியீடு நிலையைப் புகாரளிக்கும்.
uk: Позиція "gcode" - це остання запитувана позиція з `G1` (або `G0`) в картопесійських координатах відносно координаційної системи, зазначеної в файлі конфігурації. Це може відрізнятися від положення "toolhead" якщо виконується перетворення g-коду (наприклад, ліжко_mesh, ліжко_tilt, skew_correction). Це може відрізнятися від фактичних координат, зазначених в останні `G1` команди, якщо джерело g-коду було змінено (наприклад, `G92`, `SET_GCODE_OFFSET`, `M221`). `M114` команда (`gcode_move.get_status()['gcode_position']`) повідомить про позицію останнього g-коду відносно поточного g-коду координатної системи.

source: The "gcode base" is the location of the g-code origin in cartesian coordinates relative to the coordinate system specified in the config file. Commands such as `G92`, `SET_GCODE_OFFSET`, and `M221` alter this value.
ta: "GCODE BASE" என்பது கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்புடன் தொடர்புடைய கார்ட்டீசியன் ஆயத்தொகுதிகளில் சி-கோட் தோற்றத்தின் இருப்பிடமாகும். `G92`,` set_gcode_offset`, மற்றும் `M221` போன்ற கட்டளைகள் இந்த மதிப்பை மாற்றுகின்றன.
uk: "Gcode base" є розташуванням походження g-коду в карцесіанських координатах відносно координаційної системи, зазначеної в файлі конфігурації. Команди, такі як `G92`, `SET_GCODE_OFFSET`, і `M221` змініть цей значення.

source: The "gcode homing" is the location to use for the g-code origin (in cartesian coordinates relative to the coordinate system specified in the config file) after a `G28` home command. The `SET_GCODE_OFFSET` command can alter this value.
ta: `சி 28` முகப்பு கட்டளைக்குப் பிறகு சி-கோட் தோற்றத்திற்கு (கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்புடன் தொடர்புடைய கார்ட்டீசியன் ஆயத்தொகுதிகளில்) பயன்படுத்த வேண்டிய இடம்" GCODE HOMING "ஆகும். `Set_gcode_offset` கட்டளை இந்த மதிப்பை மாற்றும்.
uk: "gcode homing" - це місце для використання для походження g-коду (в карцесіанських координатах відносно координаційної системи, зазначеної в файлі конфігурації) після `G28` домашнього командування. `SET_GCODE_OFFSET` команда може змінити це значення.

source: Time
ta: நேரம்
uk: час

source: Fundamental to the operation of Klipper is the handling of clocks, times, and timestamps. Klipper executes actions on the printer by scheduling events to occur in the near future. For example, to turn on a fan, the code might schedule a change to a GPIO pin in a 100ms. It is rare for the code to attempt to take an instantaneous action. Thus, the handling of time within Klipper is critical to correct operation.
ta: கிளிப்பரின் செயல்பாட்டிற்கு அடிப்படையானது கடிகாரங்கள், நேரங்கள் மற்றும் நேர முத்திரைகளை கையாள்வதாகும். எதிர்காலத்தில் நிகழும் நிகழ்வுகளை திட்டமிடுவதன் மூலம் கிளிப்பர் அச்சுப்பொறியில் செயல்களைச் செயல்படுத்துகிறார். எடுத்துக்காட்டாக, விசிறியை இயக்க, குறியீடு 100 மீட்டரில் ஒரு GPIO முள் மாற்றத்தை திட்டமிடலாம். குறியீடு உடனடி நடவடிக்கை எடுக்க முயற்சிப்பது அரிது. எனவே, கிளிப்பருக்குள் நேரத்தைக் கையாள்வது செயல்பாட்டை சரிசெய்ய முக்கியமானது.
uk: Фундаментально до роботи Кліппера – обробка годинників, часів та часових апаратів. Кліппер виконує дії на принтері шляхом планування подій, що відбуваються в найближчому майбутньому. Наприклад, для включення вентилятора, код може запланувати зміни до GPIO шпильки в 100 м. Для того, щоб прийняти миттєву дію. Таким чином, обробка часу в Klipper має вирішальне значення для коректної роботи.

source: There are three types of times tracked internally in the Klipper host software:
ta: கிளிப்பர் புரவலன் மென்பொருளில் உள்நாட்டில் மூன்று வகையான நேரங்கள் கண்காணிக்கப்படுகின்றன:
uk: Є три типи разів відстежуються внутрішньо в програмному забезпеченні Klipper:

source: System time. The system time uses the system's monotonic clock - it is a floating point number stored as seconds and it is (generally) relative to when the host computer was last started. System times have limited use in the software - they are primarily used when interacting with the operating system. Within the host code, system times are frequently stored in variables named *eventtime* or *curtime*.
ta: கணினி நேரம். கணினி நேரம் கணினியின் மோனோடோனிக் கடிகாரத்தைப் பயன்படுத்துகிறது - இது ஒரு மிதக்கும் புள்ளி எண் விநாடிகளாக சேமிக்கப்படுகிறது, மேலும் இது புரவலன் கணினி கடைசியாக தொடங்கப்பட்டபோது (பொதுவாக) தொடர்புடையது. கணினி நேரங்கள் மென்பொருளில் மட்டுப்படுத்தப்பட்ட பயன்பாட்டைக் கொண்டுள்ளன - அவை இயக்க முறைமையுடன் தொடர்பு கொள்ளும்போது முதன்மையாகப் பயன்படுத்தப்படுகின்றன. புரவலன் குறியீட்டிற்குள், கணினி நேரங்கள் அடிக்கடி *நிகழ்வு நேரம் *அல்லது *CURIME *என்ற பெயரிடப்பட்ட மாறிகளில் சேமிக்கப்படுகின்றன.
uk: Час роботи Час системи використовує монотонний годинник системи - це плаваючий номер точки, що зберігається в секундах і він (рідко) відносно, коли запущений комп'ютер. Терміни системи мають обмежене використання в програмному забезпеченні - вони в першу чергу використовуються при взаємодії з операційною системою. В рамках хост-коду, час системи часто зберігаються в змінних названих *eventtime* або *curtime*.

source: Print time. The print time is synchronized to the main micro-controller clock (the micro-controller defined in the "[mcu]" config section). It is a floating point number stored as seconds and is relative to when the main mcu was last restarted. It is possible to convert from a "print time" to the main micro-controller's hardware clock by multiplying the print time by the mcu's statically configured frequency rate. The high-level host code uses print times to calculate almost all physical actions (eg, head movement, heater changes, etc.). Within the host code, print times are generally stored in variables named *print_time* or *move_time*.
ta: நேரம் அச்சிடுக. அச்சு நேரம் முதன்மையான மைக்ரோ-கன்ட்ரோலர் கடிகாரத்துடன் ஒத்திசைக்கப்படுகிறது ("[MCU]" கட்டமைப்பு பிரிவில் வரையறுக்கப்பட்ட மைக்ரோ-கட்டுப்பாட்டு). இது ஒரு மிதக்கும் புள்ளி எண் விநாடிகளாக சேமிக்கப்படுகிறது மற்றும் முதன்மையான எம்.சி.யு கடைசியாக மறுதொடக்கம் செய்யப்பட்டபோது தொடர்புடையது. MCU இன் நிலையான கட்டமைக்கப்பட்ட அதிர்வெண் வீதத்தால் அச்சு நேரத்தை பெருக்கி "அச்சு நேரத்திலிருந்து" முதன்மையான மைக்ரோ-கன்ட்ரோலரின் வன்பொருள் கடிகாரத்திற்கு மாற்ற முடியும். உயர் மட்ட புரவலன் குறியீடு கிட்டத்தட்ட எல்லா உடல் செயல்களையும் (எ.கா., தலை இயக்கம், ஈட்டர் மாற்றங்கள் போன்றவை) கணக்கிட அச்சு நேரங்களைப் பயன்படுத்துகிறது. புரவலன் குறியீட்டிற்குள், அச்சு நேரங்கள் பொதுவாக *print_time *அல்லது *move_time *என்ற பெயரில் உள்ள மாறிகளில் சேமிக்கப்படுகின்றன.
uk: Час друку. Час друку синхронізується до основного годинника мікроконтролера (мікроконтролер, визначеного в розділі налаштування "[mcu]). Це плаваючий номер точки, який зберігається в секундах і є відносно того, коли основний маку був останній перезавантажений. Перетворення з "передруку часу" до основних апаратних годинників мікроконтролера шляхом збільшення часу друку статично налаштованої частоти. Високотехнологічний хост-код використовує час друку, щоб розрахувати практично всі фізичні дії (наприклад, рух голови, зміни обігрівача і т.д.). В рамках хост-коду, час друку зазвичай зберігаються в змінних значеннях *print_time* або *move_time*.
