Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Code_Overview.po
Languages: ta, uk

source: After the iterative solver calculates the step times they are added to an array: `itersolve_gen_steps_range() -> stepcompress_append()` (in klippy/chelper/stepcompress.c). The array (struct stepcompress.queue) stores the corresponding micro-controller clock counter times for every step. Here the "micro-controller clock counter" value directly corresponds to the micro-controller's hardware counter - it is relative to when the micro-controller was last powered up.
ta: மறுசீரமைப்பு தீர்வி அவர்கள் ஒரு வரிசையில் சேர்க்கப்படும் படி நேரங்களைக் கணக்கிட்ட பிறகு: `itersolve_gen_steps_range () -> stepampress_append ()` (கிளிப்பி/செல்பர்/ச்டெபோகிரிபிரச்.சியில்). வரிசை (struct stretcompress.queue) ஒவ்வொரு அடியிலும் தொடர்புடைய மைக்ரோ-கன்ட்ரோலர் கடிகார எதிர் நேரங்களை சேமிக்கிறது. இங்கே "மைக்ரோ-கன்ட்ரோலர் கடிகார கவுண்டர்" மதிப்பு மைக்ரோ-கன்ட்ரோலரின் வன்பொருள் கவுண்டருக்கு நேரடியாக ஒத்திருக்கிறது-இது மைக்ரோ-கன்ட்ரோலர் கடைசியாக இயங்கும் போது தொடர்புடையது.
uk: Після того, як ітеративний розчинник обчислює час, які вони додаються в масив: `itersolve_gen_steps_range() -> stepcompress_append()` (в klippy/chelper/stepcompress.c). Широкий асортимент (struct stepcompress.queue) зберігає відповідні мікроконтролерні годинникові лічильники для кожного кроку. Тут значення «мікроконтролера годинникової лічильника» безпосередньо відповідає мікроконтролювальному лічильнику мікроконтролерів - це відносно того, коли мікроконтролер був прослужений.

source: The next major step is to compress the steps: `stepcompress_flush() -> compress_bisect_add()` (in klippy/chelper/stepcompress.c). This code generates and encodes a series of micro-controller "queue_step" commands that correspond to the list of stepper step times built in the previous stage. These "queue_step" commands are then queued, prioritized, and sent to the micro-controller (via stepcompress.c:steppersync and serialqueue.c:serialqueue).
ta: அடுத்த முக்கிய படி படிகளை சுருக்க வேண்டும்: `StepCompress_flush () -> சுருக்க_பிசெக்ட்_ஏடி ()` (கிளிப்பி/செல்ஃபர்/ச்டெப்அக்ரேச்.சியில்). இந்த குறியீடு முந்தைய கட்டத்தில் கட்டப்பட்ட ச்டெப்பர் படி நேரங்களின் பட்டியலுக்கு ஒத்த மைக்ரோ-கன்ட்ரோலர் "Queue_step" கட்டளைகளின் வரிசையை உருவாக்கி குறியீடாக்குகிறது. இந்த "queue_step" கட்டளைகள் பின்னர் வரிசையில் வரிசையில் நிற்கின்றன, முன்னுரிமை அளிக்கப்படுகின்றன, மேலும் மைக்ரோ-கன்ட்ரோலருக்கு அனுப்பப்படுகின்றன (StepCompress.c
uk: Наступним основним кроком є стиснення кроків: `stepcompress_flush() -> компресор_bisect_add()` (в klippy/chelper/stepcompress.c). Цей код генерує і кодує ряд мікроконтролерів "queue_step" команд, які відповідають списку крокових часів, побудованих на попередньому етапі. Ці команди "queue_step" потім чергуються, апріоризовані і надсилаються на мікроконтролер (через stepcompress.c:steppersync і серійнийqueue.c:serialqueue).

source: Processing of the queue_step commands on the micro-controller starts in src/command.c which parses the command and calls `command_queue_step()`. The command_queue_step() code (in src/stepper.c) just appends the parameters of each queue_step command to a per stepper queue. Under normal operation the queue_step command is parsed and queued at least 100ms before the time of its first step. Finally, the generation of stepper events is done in `stepper_event()`. It's called from the hardware timer interrupt at the scheduled time of the first step. The stepper_event() code generates a step pulse and then reschedules itself to run at the time of the next step pulse for the given queue_step parameters. The parameters for each queue_step command are "interval", "count", and "add". At a high-level, stepper_event() runs the following, 'count' times: `do_step(); next_wake_time = last_wake_time + interval; interval += add;`
ta: மைக்ரோ-கன்ட்ரோலரில் Queue_step கட்டளைகளை செயலாக்குவது SRC/command.c இல் தொடங்குகிறது, இது கட்டளையை பாகுபடுத்தி `கட்டளை_க்யூ_ச்டெப் ()` என்று அழைக்கிறது. கட்டளை_QUEUE_STEP () குறியீடு (Src/stepper.c இல்) ஒவ்வொரு வரிசை_ச்டெப் கட்டளையின் அளவுருக்களை ஒரு ச்டெப்பர் வரிசையில் சேர்க்கிறது. இயல்பான செயல்பாட்டின் கீழ், வரிசை_ச்டெப் கட்டளை அதன் முதல் படியின் நேரத்திற்கு முன்பே குறைந்தது 100 மீட்டர் தொலைவில் பாகுபடுத்தப்பட்டு வரிசையில் நிற்கிறது. இறுதியாக, ச்டெப்பர் நிகழ்வுகளின் தலைமுறை `ச்டெபர்_வென்ட் ()` இல் செய்யப்படுகிறது. இது முதல் படியின் திட்டமிடப்பட்ட நேரத்தில் வன்பொருள் நேரங்குறிகருவி குறுக்கீட்டிலிருந்து அழைக்கப்படுகிறது. Stepeper_event () குறியீடு ஒரு படி துடிப்பை உருவாக்குகிறது, பின்னர் கொடுக்கப்பட்ட Queue_step அளவுருக்களுக்கான அடுத்த படி துடிப்பின் நேரத்தில் இயங்க தன்னை மாற்றியமைக்கவும். ஒவ்வொரு Queue_step கட்டளைக்கும் அளவுருக்கள் "இடைவெளி", "எண்ணிக்கை" மற்றும் "சேர்". ஒரு உயர் மட்டத்தில், ச்டெப்பர்_வென்ட் () பின்வருவனவற்றை இயக்குகிறது, 'எண்ணிக்கை' நேரங்கள்: `do_step (); அடுத்த_வேக்_ நேரம் = last_wake_time + இடைவெளி; இடைவெளி += சேர்; `
uk: Обробка команд queue_step на мікроконтролері починається в src/command.c, який аналізує команду та викликає `command_queue_step()`. Код command_queue_step() (у файлі src/stepper.c) просто додає параметри кожної команди queue_step до черги кожного степера. За нормальної роботи команда queue_step аналізується та ставиться в чергу принаймні за 100 мс до моменту першого кроку. Нарешті, генерація крокових подій виконується в `stepper_event()`. Він викликається з переривання апаратного таймера в запланований час першого кроку. Код stepper_event() генерує покроковий імпульс, а потім переплановує свій запуск на момент наступного покрокового імпульсу для заданих параметрів queue_step. Параметрами для кожної команди queue_step є «interval», «count» і «add». На високому рівні stepper_event() запускає таку кількість разів: `do_step(); наступний_час_пробудження = час_останнього_пробудження + інтервал; інтервал += додати;`

source: The above may seem like a lot of complexity to execute a movement. However, the only really interesting parts are in the ToolHead and kinematic classes. It's this part of the code which specifies the movements and their timings. The remaining parts of the processing is mostly just communication and plumbing.
ta: மேற்கூறியவை ஒரு இயக்கத்தை செயல்படுத்த நிறைய சிக்கலானதாகத் தோன்றலாம். இருப்பினும், மிகவும் சுவையான பகுதிகள் கருவியின் தலை மற்றும் இயக்கவியல் வகுப்புகளில் உள்ளன. இது குறியீட்டின் இந்த பகுதியாகும், இது இயக்கங்கள் மற்றும் அவற்றின் நேரங்களைக் குறிப்பிடுகிறது. செயலாக்கத்தின் மீதமுள்ள பகுதிகள் பெரும்பாலும் தொடர்பு மற்றும் பிளம்பிங் ஆகும்.
uk: Здавалося б, дуже багато складнощів виконувати рух. Проте, в інструментальних заняттях є тільки цікаві частини. Це частина коду, який визначає рухи та їх терміни. Решта частини обробки в основному просто зв'язок і сантехніка.

source: Adding a host module
ta: புரவலன் தொகுதியைச் சேர்ப்பது
uk: Додавання модуля

source: The Klippy host code has a dynamic module loading capability. If a config section named "[my_module]" is found in the printer config file then the software will automatically attempt to load the python module klippy/extras/my_module.py . This module system is the preferred method for adding new functionality to Klipper.
ta: கிளிப்பி புரவலன் குறியீடு ஒரு மாறும் தொகுதி ஏற்றுதல் திறனைக் கொண்டுள்ளது. அச்சுப்பொறி கட்டமைப்பு கோப்பில் "[My_Module]" என்ற பெயரிடப்பட்ட ஒரு கட்டமைப்பு பிரிவு காணப்பட்டால், மென்பொருள் தானாகவே பைதான் தொகுதி கிளிப்பி/எக்ச்ட்ராக்கள்/my_module.py ஐ ஏற்ற முயற்சிக்கும். இந்த தொகுதி அமைப்பு கிளிப்பருக்கு புதிய செயல்பாட்டைச் சேர்ப்பதற்கான விருப்பமான முறையாகும்.
uk: Код Klippy має динамічну можливість завантаження модуля. Якщо в розділі «конфігурація» зазначено «my_module» в файлі налаштування принтера, то програмне забезпечення автоматично намагатиметься завантажити модуль python klippy/extras/my_module.py . Ця система модуля є кращим методом для додавання нових функцій до Klipper.

source: The easiest way to add a new module is to use an existing module as a reference - see **klippy/extras/servo.py** as an example.
ta: புதிய தொகுதியைச் சேர்ப்பதற்கான எளிதான வழி, ஏற்கனவே உள்ள தொகுதியை ஒரு குறிப்பாகப் பயன்படுத்துவது - ** கிளிப்பி/எக்ச்ட்ராச்/சர்வோ.பை ** ஐப் பார்க்கவும்.
uk: Найпростіший спосіб додати новий модуль для використання існуючого модуля як посилання - див. **klippy/extras/servo.py** як приклад.

source: The following may also be useful:
ta: பின்வருவனையும் பயனுள்ளதாக இருக்கும்:
uk: Також можна скористатися:

source: Execution of the module starts in the module level `load_config()` function (for config sections of the form [my_module]) or in `load_config_prefix()` (for config sections of the form [my_module my_name]). This function is passed a "config" object and it must return a new "printer object" associated with the given config section.
ta: தொகுதியின் செயல்பாடு `load_config ()` செயல்பாடு (வடிவத்தின் கட்டமைப்பு பிரிவுகளுக்கு [my_module]) அல்லது `load_config_prefix ()` (வடிவத்தின் கட்டமைப்பு பிரிவுகளுக்கு [my_module my_name]) தொடங்குகிறது. இந்த செயல்பாடு ஒரு "கட்டமைப்பு" பொருளை அனுப்பியுள்ளது, மேலும் இது கொடுக்கப்பட்ட கட்டமைப்பு பிரிவுடன் தொடர்புடைய புதிய "அச்சுப்பொறி பொருளை" திருப்பித் தர வேண்டும்.
uk: Виконання модуля починається в рівні модуля `load_config()` функції (для розділів налаштувань форми [my_module]) або в `load_config_prefix()` (для розділів налаштування форми [my_module my_name]). Ця функція передається об'єктом "config" і вона повинна повернути новий об'єкт "printer", пов'язаний з заданим розділом конфігурації.

source: During the process of instantiating a new printer object, the config object can be used to read parameters from the given config section. This is done using `config.get()`, `config.getfloat()`, `config.getint()`, etc. methods. Be sure to read all values from the config during the construction of the printer object - if the user specifies a config parameter that is not read during this phase then it will be assumed it is a typo in the config and an error will be raised.
ta: புதிய அச்சுப்பொறி பொருளை நிறுவும் செயல்பாட்டின் போது, கொடுக்கப்பட்ட கட்டமைப்பு பிரிவில் இருந்து அளவுருக்களைப் படிக்க கட்டமைப்பு பொருள் பயன்படுத்தப்படலாம். இது `config.get ()`, `config.getfloat ()`, `config.getint ()`, முதலியன முறைகளைப் பயன்படுத்தி செய்யப்படுகிறது. அச்சுப்பொறி பொருளின் கட்டுமானத்தின் போது உள்ளமைவிலிருந்து அனைத்து மதிப்புகளையும் படிக்க மறக்காதீர்கள் - இந்த கட்டத்தில் படிக்காத ஒரு கட்டமைப்பு அளவுருவை பயனர் குறிப்பிடினால், அது கட்டமைப்பில் ஒரு எழுத்துப்பிழை என்று கருதப்படும், மேலும் பிழை உயர்த்தப்படும்.
uk: Під час процесу миттєвого використання нового об'єкту принтера, об'єкт налаштування може бути використаний для зчитування параметрів з вказаного розділу налаштування. `config.get()`, `config.getfloat()`, `config.getint()` і т.д. методи. Обов'язково прочитайте всі значення з конфігурації під час побудови об'єкта принтера - якщо користувач визначає параметр налаштування, який не прочитаний під час цієї фази, то він буде запропоновано, це типо в конфігурації і помилка буде піднятися.

source: Use the `config.get_printer()` method to obtain a reference to the main "printer" class. This "printer" class stores references to all the "printer objects" that have been instantiated. Use the `printer.lookup_object()` method to find references to other printer objects. Almost all functionality (even core kinematic modules) are encapsulated in one of these printer objects. Note, though, that when a new module is instantiated, not all other printer objects will have been instantiated. The "gcode" and "pins" modules will always be available, but for other modules it is a good idea to defer the lookup.
ta: முதன்மையான "அச்சுப்பொறி" வகுப்பைப் பெற `config.get_printer ()` முறையைப் பயன்படுத்தவும். இந்த "அச்சுப்பொறி" வகுப்பு உடனடிப்படுத்தப்பட்ட அனைத்து "அச்சுப்பொறி பொருள்களையும்" குறிப்புகளை சேமிக்கிறது. பிற அச்சுப்பொறி பொருள்களுக்கான குறிப்புகளைக் கண்டறிய `printor.lookup_object ()` முறையைப் பயன்படுத்தவும். ஏறக்குறைய அனைத்து செயல்பாடுகளும் (முக்கிய இயக்கவியல் தொகுதிகள் கூட) இந்த அச்சுப்பொறி பொருள்களில் ஒன்றில் இணைக்கப்பட்டுள்ளன. இருப்பினும், ஒரு புதிய தொகுதி உடனடிப்படுத்தப்படும்போது, மற்ற எல்லா அச்சுப்பொறி பொருள்களும் உடனடிப்படுத்தப்படாது என்பதை நினைவில் கொள்க. "GCODE" மற்றும் "ஊசிகள்" தொகுதிகள் எப்போதும் கிடைக்கும், ஆனால் மற்ற தொகுதிகளுக்கு இது தேடலை ஒத்திவைப்பது நல்லது.
uk: Використовуйте метод `config.get_printer()` для отримання посилання на основний клас «принтер». Цей клас "принтер" зберігає посилання на всі "принтери об'єктів", які були миттєві. Використовуйте метод `printer.lookup_object()` для пошуку посилань на інші об'єкти принтера. Практично всі функціональні можливості (навіть основні кінематичними модулями) закріплюються в одному з цих об'єктів принтера. Зауважте, що коли новий модуль миттєвий, не всі інші об'єкти принтера будуть миттєві. Модуль "gcode" і "pins" завжди буде доступний, але для інших модулів це хороша ідея для видалення зовнішнього вигляду.

source: Register event handlers using the `printer.register_event_handler()` method if the code needs to be called during "events" raised by other printer objects. Each event name is a string, and by convention it is the name of the main source module that raises the event along with a short name for the action that is occurring (eg, "klippy:connect"). The parameters passed to each event handler are specific to the given event (as are exception handling and execution context). Two common startup events are:
ta: `அச்சுப்பொறி. ஒவ்வொரு நிகழ்வு பெயரும் ஒரு சரம், மற்றும் மாநாட்டின் மூலம் இது முக்கிய மூல தொகுதியின் பெயர், இது நிகழ்வை எழுப்பும் செயலுக்கு ஒரு குறுகிய பெயருடன் எழுப்புகிறது (எ.கா., "கிளிப்பி: இணைப்பு"). ஒவ்வொரு நிகழ்வு கையாளுபவருக்கும் அனுப்பப்பட்ட அளவுருக்கள் கொடுக்கப்பட்ட நிகழ்வுக்கு குறிப்பிட்டவை (விதிவிலக்கு கையாளுதல் மற்றும் செயல்படுத்தல் சூழல் போன்றவை). இரண்டு பொதுவான தொடக்க நிகழ்வுகள்:
uk: Зареєструвати обробники подій за допомогою `printer.register_event_handler()` метод, якщо код повинен бути викликаний під час "подруги" підняті іншими об'єктами принтера. Кожна назва події - рядок, а за конвенцією - це ім'я головного модуля джерела, який піднімає захід разом з коротким ім'ям для дії, що відбувається (наприклад, "кліпп:зв'язок"). Параметри, що надходять до кожного обробника події, є специфічними для даного заходу (в залежності від умов обробки та виконання). Два спільних стартапів:

source: klippy:connect - This event is generated after all printer objects are instantiated. It is commonly used to lookup other printer objects, to verify config settings, and to perform an initial "handshake" with printer hardware.
ta: கிளிப்பி: இணைப்பு - அனைத்து அச்சுப்பொறி பொருள்களும் உடனடிப்படுத்தப்பட்ட பிறகு இந்த நிகழ்வு உருவாக்கப்படுகிறது. இது பொதுவாக மற்ற அச்சுப்பொறி பொருள்களைத் தேடுவதற்கும், கட்டமைப்பு அமைப்புகளை சரிபார்க்கவும், அச்சுப்பொறி வன்பொருளுடன் ஆரம்ப "ஏண்ட்சேக்" செய்யவும் பயன்படுத்தப்படுகிறது.
uk: klippy:connect – ця подія генерується після створення екземплярів усіх об’єктів принтера. Він зазвичай використовується для пошуку інших об’єктів принтера, перевірки налаштувань конфігурації та виконання початкового «рукостискання» з обладнанням принтера.

source: klippy:ready - This event is generated after all connect handlers have completed successfully. It indicates the printer is transitioning to a state ready to handle normal operations. Do not raise an error in this callback.
ta: கிளிப்பி: ஆயத்தம் - அனைத்து இணைப்பு கையாளுபவர்களும் வெற்றிகரமாக முடிந்தபின் இந்த நிகழ்வு உருவாக்கப்படுகிறது. அச்சுப்பொறி சாதாரண செயல்பாடுகளைக் கையாளத் தயாராக இருக்கும் மாநிலத்திற்கு மாறுவதைக் குறிக்கிறது. இந்த அழைப்பில் பிழையை எழுப்ப வேண்டாம்.
uk: klippy:читати - Цей захід генерується після того, як всі обробники з'єднуються успішно. Він вказує на те, що принтер переходить в стан, який готовий обробляти нормальні операції. Не підняти помилку в цьому зворотному зв'язку.

source: If there is an error in the user's config, be sure to raise it during the `load_config()` or "connect event" phases. Use either `raise config.error("my error")` or `raise printer.config_error("my error")` to report the error.
ta: பயனரின் உள்ளமைவில் பிழை இருந்தால், `load_config ()` அல்லது "நிகழ்வு நிகழ்வு" கட்டங்களின் போது அதை உயர்த்த மறக்காதீர்கள். பிழையைப் புகாரளிக்க `config.error (" எனது பிழை ")` அல்லது `printur.config_error (" எனது பிழை ") ஐ உயர்த்தவும்.
uk: Якщо є помилка в налаштуваннях користувача, обов'язково підніміть його під час `load_config()` або "повідомлення" фази. Використовуйте або `raise config.error("my error")` або ` растровий принтер.config_error("my error")` для повідомлення про помилку.

source: Use the "pins" module to configure a pin on a micro-controller. This is typically done with something similar to `printer.lookup_object("pins").setup_pin("pwm", config.get("my_pin"))`. The returned object can then be commanded at run-time.
ta: மைக்ரோ-கன்ட்ரோலரில் ஒரு முள் கட்டமைக்க "பின்ச்" தொகுதியைப் பயன்படுத்தவும். இது பொதுவாக `அச்சுப்பொறி.லூக்அப்_ஆப்செக்ட் (" ஊசிகள் ") போன்றவற்றுடன் செய்யப்படுகிறது. Setup_pin (" PWM ", config.get (" my_pin "))`. திரும்பிய பொருளை பின்னர் ரன்-டைமில் கட்டளையிடலாம்.
uk: Використовуйте модуль "pins" для налаштування шпильки на мікроконтролері. Це, як правило, зроблено з чимось схожий на `printer.lookup_object("pins").setup_pin("pwm", config.get("my_pin")`. Повернутий об'єкт можна замовити в режимі run-time.

source: If the module needs access to system timing or external file descriptors then use `printer.get_reactor()` to obtain access to the global "event reactor" class. This reactor class allows one to schedule timers, wait for input on file descriptors, and to "sleep" the host code.
ta: தொகுதிக்கு கணினி நேரம் அல்லது வெளிப்புற கோப்பு விளக்கங்களுக்கான அணுகல் தேவைப்பட்டால், உலகளாவிய "நிகழ்வு உலை" வகுப்பிற்கான அணுகலைப் பெற `அச்சுப்பொறி. இந்த உலை வகுப்பு ஒருவர் டைமர்களை திட்டமிடவும், கோப்பு விளக்கங்களில் உள்ளீட்டிற்காக காத்திருக்கவும், புரவலன் குறியீட்டை "தூங்கவும்" அனுமதிக்கிறது.
uk: Якщо модуль потребує доступу до системних послідовників або зовнішніх дескрипторів файлів, то скористайтеся `printer.get_reactor()` для отримання доступу до глобального класу «event реактор». Цей клас реактора дозволяє одночасно планувати таймери, чекаючи введення на декриптах файлів, а також до "завантажити" хост-коду.

source: Do not use global variables. All state should be stored in the printer object returned from the `load_config()` function. This is important as otherwise the RESTART command may not perform as expected. Also, for similar reasons, if any external files (or sockets) are opened then be sure to register a "klippy:disconnect" event handler and close them from that callback.
ta: உலகளாவிய மாறிகள் பயன்படுத்த வேண்டாம். அனைத்து மாநிலங்களும் `load_config ()` செயல்பாட்டிலிருந்து திரும்பிய அச்சுப்பொறி பொருளில் சேமிக்கப்பட வேண்டும். மறுதொடக்கம் கட்டளை எதிர்பார்த்தபடி செயல்படாது என்பதால் இது முக்கியமானது. மேலும், இதே போன்ற காரணங்களுக்காக, ஏதேனும் வெளிப்புற கோப்புகள் (அல்லது சாக்கெட்டுகள்) திறக்கப்பட்டால், "கிளிப்பி: துண்டிக்கவும்" நிகழ்வு கையாளுதலை பதிவுசெய்து அவற்றை அந்த அழைப்பிலிருந்து மூடு.
uk: Не використовуйте глобальні змінні. Весь стан слід зберігати в об'єкті принтера, що повертається з функції `load_config()`. Це важливо в іншому випадку команда RESTART не може виконуватися як очікується. Також, з аналогічних причин, якщо відкриті будь-які зовнішні файли (або розетки), то обов'язково зареєструйте "кліппи:роз'єднання" обробника події і закрийте їх з цього зворотного зв'язку.

source: Avoid accessing the internal member variables (or calling methods that start with an underscore) of other printer objects. Observing this convention makes it easier to manage future changes.
ta: பிற அச்சுப்பொறி பொருள்களின் உள் உறுப்பினர் மாறிகள் (அல்லது அடிக்கோடிட்டுக் கொண்டு தொடங்கும் அழைப்பு முறைகள்) அணுகுவதைத் தவிர்க்கவும். இந்த மாநாட்டைக் கவனிப்பது எதிர்கால மாற்றங்களை நிர்வகிப்பதை எளிதாக்குகிறது.
uk: Уникайте доступу до внутрішніх змінних користувачів (або викличних методів, які починаються з нуля) інших об'єктів принтера. Спостереження цієї конвенції полегшує управління майбутніми змінами.

source: If submitting the module for inclusion in the main Klipper code, be sure to place a copyright notice at the top of the module. See the existing modules for the preferred format.
ta: முதன்மையான கிளிப்பர் குறியீட்டில் சேர்ப்பதற்கான தொகுதியை சமர்ப்பித்தால், பதிப்புரிமை அறிவிப்பை தொகுதியின் மேலே வைக்க மறக்காதீர்கள். விருப்பமான வடிவமைப்பிற்கு இருக்கும் தொகுதிக்கூறுகளைப் பார்க்கவும்.
uk: Якщо ви подаєте модуль для включення в основний код Кліппера, обов'язково встановіть повідомлення про авторське право у верхній частині модуля. Переглянути існуючі модулі для бажаного формату.

source: Adding new kinematics
ta: புதிய இயக்கவியலைச் சேர்ப்பது
uk: Додавання нової кінематики

source: This section provides some tips on adding support to Klipper for additional types of printer kinematics. This type of activity requires excellent understanding of the math formulas for the target kinematics. It also requires software development skills - though one should only need to update the host software.
ta: கூடுதல் வகை அச்சுப்பொறி இயக்கவியலுக்கு கிளிப்பருக்கு ஆதரவைச் சேர்ப்பதற்கான சில உதவிக்குறிப்புகளை இந்த பிரிவு வழங்குகிறது. இந்த வகை செயல்பாட்டிற்கு இலக்கு இயக்கவியலுக்கான கணித சூத்திரங்களைப் பற்றிய சிறந்த புரிதல் தேவைப்படுகிறது. இதற்கு மென்பொருள் மேம்பாட்டு திறன்களும் தேவைப்படுகின்றன - இருப்பினும் ஒருவர் புரவலன் மென்பொருளை மட்டுமே புதுப்பிக்க வேண்டும்.
uk: Цей розділ надає деякі поради щодо додавання підтримки Klipper для додаткових типів принтерів kinematics. Цей тип діяльності вимагає відмінного розуміння математичних формул для цільової кінематики. Також потрібна навички розробки програмного забезпечення - хоча потрібно лише оновити програмне забезпечення.

source: Useful steps:
ta: பயனுள்ள படிகள்:
uk: Корисні кроки:

source: Start by studying the "[code flow of a move](#code-flow-of-a-move-command)" section and the [Kinematics document](Kinematics.md).
ta: "[ஒரு நகர்வின் குறியீடு ஓட்டம்] (#குறியீடு-ஃப்ளோ-ஆஃப்-ஏ-மூவ்-கமாண்ட்)" பிரிவு மற்றும் [இயக்கவியல் ஆவணம்] (Kinematics.md) ஆகியவற்றைப் படிப்பதன் மூலம் தொடங்கவும்.
uk: Почати навчати "[кодовий потік руху](#code-flow-of-a-move-command)" секція та [Кіноматика документа](Kinematics.md).

source: Review the existing kinematic classes in the klippy/kinematics/ directory. The kinematic classes are tasked with converting a move in cartesian coordinates to the movement on each stepper. One should be able to copy one of these files as a starting point.
ta: கிளிப்பி/ இயக்கவியல்/ கோப்பகத்தில் இருக்கும் இயக்கவியல் வகுப்புகளை மதிப்பாய்வு செய்யவும். கார்ட்டீசியன் ஆயத்தொலைவுகளில் ஒரு நகர்வை ஒவ்வொரு ச்டெப்பரிலும் இயக்கத்திற்கு மாற்றும் பணியில் ஈடுபடுகிறது. இந்த கோப்புகளில் ஒன்றை ஒரு தொடக்க புள்ளியாக ஒருவர் நகலெடுக்க முடியும்.
uk: Огляд існуючих кінематичних класів в klippy/kinematics/ каталог. Кінематичні класи виконуються з перетворенням руху в картопезькі координати руху на кожному степпері. Ви можете копіювати один з цих файлів як початкова точка.
