Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Code_Overview.po
Languages: ta, uk

source: Klipper uses an [iterative solver](https://en.wikipedia.org/wiki/Root-finding_algorithm) to generate the step times for each stepper. For efficiency reasons, the stepper pulse times are generated in C code. The moves are first placed on a "trapezoid motion queue": `ToolHead._process_moves() -> trapq_append()` (in klippy/chelper/trapq.c). The step times are then generated: `ToolHead._process_moves() -> ToolHead._advance_move_time() -> ToolHead._advance_flush_time() -> MCU_Stepper.generate_steps() -> itersolve_generate_steps() -> itersolve_gen_steps_range()` (in klippy/chelper/itersolve.c). The goal of the iterative solver is to find step times given a function that calculates a stepper position from a time. This is done by repeatedly "guessing" various times until the stepper position formula returns the desired position of the next step on the stepper. The feedback produced from each guess is used to improve future guesses so that the process rapidly converges to the desired time. The kinematic stepper position formulas are located in the klippy/chelper/ directory (eg, kin_cart.c, kin_corexy.c, kin_delta.c, kin_extruder.c).
ta: ஒவ்வொரு ச்டெப்பருக்கும் படி நேரங்களை உருவாக்க கிளிப்பர் ஒரு [மறுசீரமைப்பு தீர்வி] (https://en.wikipedia.org/wiki/root-finding_algorithm) ஐப் பயன்படுத்துகிறார். செயல்திறன் காரணங்களுக்காக, ச்டெப்பர் துடிப்பு நேரங்கள் சி குறியீட்டில் உருவாக்கப்படுகின்றன. நகர்வுகள் முதலில் "ட்ரெப்சாய்டு மோசன் வரிசையில்" வைக்கப்பட்டுள்ளன: `கருவித்தொகுப்பு. படி நேரங்கள் பின்னர் உருவாக்கப்படுகின்றன: `கருவிஎட். /itersolve.c). ஒரு காலத்திலிருந்து ஒரு ச்டெப்பர் நிலையை கணக்கிடும் ஒரு செயல்பாட்டைக் கொடுக்கப்பட்ட படி நேரங்களைக் கண்டுபிடிப்பதே மறு செய்கை தீர்வின் குறிக்கோள். ச்டெப்பர் நிலை தேற்றம் ச்டெப்பரில் அடுத்த கட்டத்தின் விரும்பிய நிலையை திரும்பும் வரை பல்வேறு முறை மீண்டும் மீண்டும் "யூகிப்பதன்" மூலம் இது செய்யப்படுகிறது. ஒவ்வொரு யூகத்திலிருந்தும் தயாரிக்கப்படும் பின்னூட்டங்கள் எதிர்கால யூகங்களை மேம்படுத்த பயன்படுகின்றன, இதனால் செயல்முறை விரைவாக விரும்பிய நேரத்திற்கு மாறுகிறது. கினெமாடிக் ச்டெப்பர் நிலை சூத்திரங்கள் கிளிப்பி/ செல்பர்/ கோப்பகத்தில் அமைந்துள்ளன (எ.கா.
uk: Klipper використовує [інеративний розчинник](https://en.wikipedia.org/wiki/Root-finding_algorithm) для створення кроку для кожного кроку. З точки зору ефективності генеруються імпульси крокової залози в C-коді. Переходи спочатку розміщені на "trapezoid чергу руху": `ToolHead._process_moves() -> трапеція ` (в klippy/chelper/trapq.c). `ToolHead._process_moves() -> JavaScript licenses API Веб-сайт Go1.13.8 до JavaScript licenses API Веб-сайт Go1.13.8 -> MCU_Stepper.generate_steps() -> itersolve_generate_steps() -> itersolve_gen_steps_range()` (в klippy/chelper/itersolve.c). Мета ітеративного розчинника полягає в тому, щоб знайти покрокові терміни, враховуючи функцію, яка обчислює позицію крокової від часу. Це робиться багаторазово "чуття" в різні часи до моменту отримання крокової позиції формула повертає бажане положення наступного кроку на степпері. Зворотній зв'язок, виготовлений з кожного вагітна, використовується для поліпшення майбутніх вгадок, щоб процес швидко зважився до бажаного часу. Формули позиції кінематичних степперів розташовані в каталозі klippy/chelper/ (наприклад, kin_cart.c, kin_corexy.c, kin_delta.c, kin_extruder.c).
