Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Code_Overview.po
Languages: ta, uk

source: MCU clock. This is the hardware clock counter on each micro-controller. It is stored as an integer and its update rate is relative to the frequency of the given micro-controller. The host software translates its internal times to clocks before transmission to the mcu. The mcu code only ever tracks time in clock ticks. Within the host code, clock values are tracked as 64bit integers, while the mcu code uses 32bit integers. Within the host code, clocks are generally stored in variables with names containing *clock* or *ticks*.
ta: MCU கடிகாரம். இது ஒவ்வொரு மைக்ரோ-கன்ட்ரோலரின் வன்பொருள் கடிகார கவுண்டராகும். இது ஒரு முழு எண்ணாக சேமிக்கப்படுகிறது மற்றும் அதன் புதுப்பிப்பு வீதம் கொடுக்கப்பட்ட மைக்ரோ-கன்ட்ரோலரின் அதிர்வெண்ணுடன் தொடர்புடையது. புரவலன் மென்பொருள் அதன் உள் நேரங்களை MCU க்கு அனுப்புவதற்கு முன் கடிகாரங்களுக்கு மொழிபெயர்க்கிறது. எம்.சி.யு குறியீடு கடிகார உண்ணியில் மட்டுமே நேரத்தைக் கண்காணிக்கிறது. புரவலன் குறியீட்டிற்குள், கடிகார மதிப்புகள் 64 பிட் முழு எண்களாக கண்காணிக்கப்படுகின்றன, அதே நேரத்தில் MCU குறியீடு 32 பிட் முழு எண்களைப் பயன்படுத்துகிறது. புரவலன் குறியீட்டிற்குள், கடிகாரங்கள் பொதுவாக *கடிகாரம் *அல்லது *உண்ணி *கொண்ட பெயர்களுடன் மாறிகளில் சேமிக்கப்படுகின்றன.
uk: MCU годинник. Це апаратний годинниковий лічильник на кожному мікроконтролері. Він зберігається як ціле і його рівень оновлення відносно частоти заданої мікроконтролера. Програмне забезпечення хосту переводить свої внутрішні часи до годинників до передачі в маку. Код mcu тільки коли-небудь відстежує час в годинникових клітках. У коді хосту, значення годинників відстежуються як 64bit цілих, тоді як код mcu використовує 32bit цілих чисел. У коді хосту, годинники зазвичай зберігаються у змінних з іменами, що містяться *clock* або *ticks*.

source: Conversion between the different time formats is primarily implemented in the **klippy/clocksync.py** code.
ta: வெவ்வேறு நேர வடிவங்களுக்கிடையேயான மாற்றம் முதன்மையாக ** கிளிப்பி/கடிகார்சின்க் ** குறியீட்டில் செயல்படுத்தப்படுகிறது.
uk: Перетворення між різними форматами часу в першу чергу виконується в **klippy/clocksync.py** код.

source: Some things to be aware of when reviewing the code:
ta: குறியீட்டை மதிப்பாய்வு செய்யும் போது விழிப்புடன் இருக்க வேண்டிய சில விசயங்கள்:
uk: Деякі речі, які слід знати при перегляді коду:

source: 32bit and 64bit clocks: To reduce bandwidth and to improve micro-controller efficiency, clocks on the micro-controller are tracked as 32bit integers. When comparing two clocks in the mcu code, the `timer_is_before()` function must always be used to ensure integer rollovers are handled properly. The host software converts 32bit clocks to 64bit clocks by appending the high-order bits from the last mcu timestamp it has received - no message from the mcu is ever more than 2^31 clock ticks in the future or past so this conversion is never ambiguous. The host converts from 64bit clocks to 32bit clocks by simply truncating the high-order bits. To ensure there is no ambiguity in this conversion, the **klippy/chelper/serialqueue.c** code will buffer messages until they are within 2^31 clock ticks of their target time.
ta: 32 பிட் மற்றும் 64 பிட் கடிகாரங்கள்: அலைவரிசையைக் குறைப்பதற்கும் மைக்ரோ-கன்ட்ரோலர் செயல்திறனை மேம்படுத்துவதற்கும், மைக்ரோ-கன்ட்ரோலரில் உள்ள கடிகாரங்கள் 32 பிட் முழு எண்களாகக் கண்காணிக்கப்படுகின்றன. MCU குறியீட்டில் இரண்டு கடிகாரங்களை ஒப்பிடும்போது, `Timer_is_before ()` செயல்பாடு எப்போதும் முழு எண் ரோல்ஓவர்கள் சரியாக கையாளப்படுவதை உறுதிப்படுத்த பயன்படுத்தப்பட வேண்டும். புரவலன் மென்பொருள் 32 பிட் கடிகாரங்களை 64 பிட் கடிகாரங்களாக மாற்றுகிறது, இது பெற்ற கடைசி MCU நேர முத்திரையிலிருந்து உயர் -வரிசை பிட்களைச் சேர்ப்பதன் மூலம் - MCU இலிருந்து எந்த செய்தியும் எதிர்காலத்தில் அல்லது கடந்த காலங்களில் 2^31 கடிகார உண்ணிக்கு மேல் இல்லை, எனவே இந்த மாற்றம் ஒருபோதும் தெளிவற்றதல்ல . புரவலன் 64 பிட் கடிகாரங்களிலிருந்து 32 பிட் கடிகாரங்களாக மாற்றுகிறது. இந்த மாற்றத்தில் தெளிவற்ற தன்மை இல்லை என்பதை உறுதிப்படுத்த, ** கிளிப்பி/செல்பர்/சீரியால்கியூ.
uk: 32bit і 64bit годинники: Щоб зменшити пропускну здатність і поліпшити ефективність мікроконтролерів, годинники на мікроконтролерах відстежуються як 32bit цілих чисел. Якщо порівняти два годинники в коді mcu, то `timer_is_before()` функція завжди повинна бути використана для забезпечення цілих валків, які обробляються належним чином. Програмне забезпечення host перетворює 32bit годинники до 64bit годинники, застосувавши біти високого замовлення з останнього mcu timestamp він отримав - не повідомлення від mcu коли-небудь більше 2^31 годинникових кліщів в майбутньому або минулому, так що ця конвертація ніколи не є однозначним. Ведуться перетворення з 64bit годинників до 32bit годинників, просто розкручування висотних біт. Для забезпечення неоднозначності в цьому перетворенні, **klippy/chelper/serialqueue.c** код буде буферні повідомлення до тих пір, поки вони знаходяться в 2^31 годинникових клітках їх цільового часу.

source: Multiple micro-controllers: The host software supports using multiple micro-controllers on a single printer. In this case, the "MCU clock" of each micro-controller is tracked separately. The clocksync.py code handles clock drift between micro-controllers by modifying the way it converts from "print time" to "MCU clock". On secondary mcus, the mcu frequency that is used in this conversion is regularly updated to account for measured drift.
ta: பல மைக்ரோ-கன்ட்ரோலர்கள்: ஒற்றை அச்சுப்பொறியில் பல மைக்ரோ-கன்ட்ரோலர்களைப் பயன்படுத்தி புரவலன் மென்பொருள் ஆதரிக்கிறது. இந்த வழக்கில், ஒவ்வொரு மைக்ரோ-கன்ட்ரோலரின் "MCU கடிகாரமும்" தனித்தனியாக கண்காணிக்கப்படுகிறது. CrockSync.py குறியீடு மைக்ரோ-கன்ட்ரோலர்களிடையே கடிகார சறுக்கலை "அச்சு நேரத்திலிருந்து" முதல் "MCU கடிகாரம்" ஆக மாற்றும் முறையை மாற்றியமைப்பதன் மூலம் கையாளுகிறது. இரண்டாம் நிலை MCU களில், இந்த மாற்றத்தில் பயன்படுத்தப்படும் MCU அதிர்வெண் அளவிடப்பட்ட சறுக்கலுக்கான கணக்கில் தொடர்ந்து புதுப்பிக்கப்படுகிறது.
uk: Кілька мікроконтролерів: Програма містить декілька мікроконтролерів на одному принтері. У цьому випадку «МКУ годинник» кожного мікроконтролера відстежується окремо. За годинникsync.py код ручить годинниковий дрейф між мікроконтролерами, змінивши спосіб, він перетворюється з "передрукувати час" в "MCU годинник". На вторинному скосі частота МКУ, яка використовується в цьому перетворенні, регулярно оновлюється до облікового запису для вимірюваного дрейфу.

source: Send: GET_POSITION Recv: // mcu: stepper_a:-2060 stepper_b:-1169 stepper_c:-1613 Recv: // stepper: stepper_a:457.254159 stepper_b:466.085669 stepper_c:465.382132 Recv: // kinematic: X:8.339144 Y:-3.131558 Z:233.347121 Recv: // toolhead: X:8.338078 Y:-3.123175 Z:233.347878 E:0.000000 Recv: // gcode: X:8.338078 Y:-3.123175 Z:233.347878 E:0.000000 Recv: // gcode base: X:0.000000 Y:0.000000 Z:0.000000 E:0.000000 Recv: // gcode homing: X:0.000000 Y:0.000000 Z:0.000000
ta: அனுப்பு: get_position Recv: // mcu: stepper_a: -2060 STEPPER_B: -1169 STEPPER_C: -1613 Recv: // ச்டெப்பர்: ச்டெப்பர்_ஏ: 457.254159 ச்டெபர்_பி: 466.085669 ச்டெப்பர்_சி: 465.382132 Recv: // ginematic: x: 8.339144 y: -3.131558 z: 233.347121 Recv: // கருவிஎட்: x: 8.338078 y: -3.123175 Z: 233.347878 E: 0.000000 Recv: // gcode: x: 8.338078 y: -3.123175 Z: 233.347878 E: 0.000000 Recv: // gcode அடிப்படை: x: 0.000000 y: 0.000000 z: 0.000000 e: 0.000000 Recv: // gcode homing: x: 0.000000 y: 0.000000 z: 0.000000
uk: Надіслати: GET_SETTING Recv: // mcu: stepper_a:-2060 stepper_b:-1169 stepper_c:-1613 Recv: // stepper_a:457.254159 stepper_b:466.085669 stepper_c:465.382132 Рев: // kinematic: X:8.339144 Y:-3.131558 Z:233.347121 Рев: // Ключниця: X:8.338078 Y:-3.123175 З:233.347878 E:0.000000 Рев: // gcode: X:8.338078 Y:-3.123175 З:233.347878 E:0.000000 Реквізити: // gcode base: X:0.000000 Y:0.000000 Z:0.000000 E:0.000000 Recv: // gcode кодування: кс:0.000000 Y:0.000000 Z:0.000000

source: Code overview
ta: குறியீடு கண்ணோட்டம்
uk: Огляд коду

source: The "mcu" position (`stepper.get_mcu_position()` in the code) is the total number of steps the micro-controller has issued in a positive direction minus the number of steps issued in a negative direction since the micro-controller was last reset. If the robot is in motion when the query is issued then the reported value includes moves buffered on the micro-controller, but does not include moves on the look-ahead queue.
ta: "MCU" நிலை (`stepper.get_mcu_position ()` குறியீட்டில்) என்பது மைக்ரோ-கன்ட்ரோலர் நேர்மறையான திசையில் வெளியிட்டுள்ள மொத்த படிகளின் எண்ணிக்கையாகும் மீட்டமை. வினவல் வழங்கப்படும்போது ரோபோ இயக்கத்தில் இருந்தால், அறிக்கையிடப்பட்ட மதிப்பில் மைக்ரோ-கன்ட்ரோலரில் இடையகப்படுத்தப்பட்ட நகர்வுகள் அடங்கும், ஆனால் தோற்றமளிக்கும் வரிசையில் நகர்வுகள் இல்லை.
uk: Позиція "mcu" (`stepper.get_mcu_position()` в коді) є загальною кількістю кроків, що мікроконтролер видано в позитивному напрямку, мінус кількість кроків, виданих в негативному напрямку, оскільки мікроконтролер був останній скидання. Якщо робот перебуває в русі, коли запит видається, то вказана вартість включає переміщення на мікроконтролері, але не включає в себе переміщення по черзі.

source: Add support for timer dispatch from hardware interrupts. See Klipper [commit 970831ee](https://github.com/Klipper3d/klipper/commit/970831ee0d3b91897196e92270d98b2a3067427f) as an example of steps 1-5 done for the LPC176x architecture.
ta: வன்பொருள் குறுக்கீடுகளிலிருந்து நேரங்குறிகருவி அனுப்புவதற்கு ஆதரவைச் சேர்க்கவும். கிளிப்பர் [970831EE] (https://github.com/klipper3d/klipper/commit/970831e0d3b91896e92270d98b2a3067427f) ஐக் காண்க 1-5 ஆர்கிடர் 1-5 க்கான எடுத்துக்காட்டு.
uk: Додайте підтримку відправлення таймера з апаратних переривань. Дивитися Кліппер [commit 970831ee](https://github.com/Klipper3d/klipper/commit/970831ee0d3b91897196e92270d98b2a3067427f) як приклад кроків 1-5 зроблено для архітектури LPC176x.

source: Bring up basic GPIO input and output support. See Klipper [commit c78b9076](https://github.com/Klipper3d/klipper/commit/c78b90767f19c9e8510c3155b89fb7ad64ca3c54) as an example of this.
ta: அடிப்படை GPIO உள்ளீடு மற்றும் வெளியீட்டு ஆதரவைக் கொண்டு வாருங்கள். இதற்கு ஒரு எடுத்துக்காட்டு என்று கிளிப்பர் [commance c78b9076] (https://github.com/klipper3d/klipper/commit/c78b90767f19e8510c315fb7ad64ca54 ஐக் காண்க).
uk: Придбати базовий вхід GPIO і вихідний супровід. Див Klipper [commit c78b9076](https://github.com/Klipper3d/klipper/commit/c78b90767f19c9e8510c3155b89fb7ad64ca3c54) як приклад цього.

source: Bring up additional peripherals - for example see Klipper commit [65613aed](https://github.com/Klipper3d/klipper/commit/65613aeddfb9ef86905cb1dade9e773a02ef3c27), [c812a40a](https://github.com/Klipper3d/klipper/commit/c812a40a3782415e454b04bf7bd2158a6f0ec8b5), and [c381d03a](https://github.com/Klipper3d/klipper/commit/c381d03aad5c3ee761169b7c7bced519cc14da29).
ta: கூடுதல் சாதனங்களைக் கொண்டு வாருங்கள் - எடுத்துக்காட்டாக கிளிப்பர் கமிட் [65613AED] (https://github.com/klipper3d/klipper/commit/65613aeddfb9ef86905cb1dade9e9a02ef3c27) PER/COMM/C812A40A3782415E454B04BF7BD2158A6F0EC8B5 .
uk: Викличте додаткові периферійні пристрої - наприклад, див. Klipper commit [65613aed](https://github.com/Klipper3d/klipper/commit/65613aeddfb9ef86905cb1dade9e773a02ef3c27), [c812a40a](https://github.com/Klipper3d/klipper/commit/c812a40a3782415e454b04bf7bd2158a6f0ec8b5) і [c381d03a](https://github.com/Klipper3d/klipper/commit/c381d03aad5c3ee761169b7c7bced519cc14da29).

source: If the printer object defines a `get_status()` method then the module can export [status information](Status_Reference.md) via [macros](Command_Templates.md) and via the [API Server](API_Server.md). The `get_status()` method must return a Python dictionary with keys that are strings and values that are integers, floats, strings, lists, dictionaries, True, False, or None. Tuples (and named tuples) may also be used (these appear as lists when accessed via the API Server). Lists and dictionaries that are exported must be treated as "immutable" - if their contents change then a new object must be returned from `get_status()`, otherwise the API Server will not detect those changes.
ta: அச்சுப்பொறி பொருள் `get_status ()` முறையை வரையறுத்தால், தொகுதி [மேக்ரோச்] (கட்டளை_டெம்ப்ளேட்ச்.எம்டி) மற்றும் [API சேவையகம்] (API_SERVER.MD) வழியாக [நிலை தகவல்] (நிலை_ரொசெரன்ச்.எம்டி) ஏற்றுமதி செய்யலாம். `Get_status ()` முறை எண்கள், மிதவைகள், சரங்கள், பட்டியல்கள், அகராதிகள், உண்மை, பொய் அல்லது எதுவுமில்லை என்று சரங்கள் மற்றும் மதிப்புகள் கொண்ட விசைகள் கொண்ட பைதான் அகராதியை திருப்பித் தர வேண்டும். டூப்பிள்ச் (மற்றும் பெயரிடப்பட்ட டூப்பிள்ச்) பயன்படுத்தப்படலாம் (ஏபிஐ சேவையகம் வழியாக அணுகும்போது இவை பட்டியல்களாகத் தோன்றும்). ஏற்றுமதி செய்யப்படும் பட்டியல்கள் மற்றும் அகராதிகள் "மாறாதவை" என்று கருதப்பட வேண்டும் - அவற்றின் உள்ளடக்கங்கள் மாறினால், ஒரு புதிய பொருள் `Get_status ()` இலிருந்து திருப்பித் தரப்பட வேண்டும், இல்லையெனில் பநிஇ சேவையகம் அந்த மாற்றங்களைக் கண்டறியாது.
uk: Якщо об'єкт принтера визначає `get_status()` метод потім модуль може експортувати [статус інформації](Status_Reference.md) через [macros](Command_Templates.md) і через [API Server](API_Server.md). `get_status()` метод повинен повернути словник Python з ключами, які є рядками і значеннями, які є цілими, плавлення, рядки, списки, словники, Правда, False або None. Також можуть використовуватися тюпли (і іменовані шрифти). Переліки та словники, які експортуються, повинні бути оброблені як "імітовані" - якщо їх зміни вмісту, то новий об'єкт повинен бути повернений з `get_status()`, інакше сервер API не виявить ці зміни.

source: It is recommended to assign a value to all member variables in the Python constructor of Python classes. (And therefore avoid utilizing Python's ability to dynamically create new member variables.)
ta: பைதான் வகுப்புகளின் பைதான் கட்டமைப்பாளரில் உள்ள அனைத்து உறுப்பினர் மாறிகளுக்கும் ஒரு மதிப்பை ஒதுக்க பரிந்துரைக்கப்படுகிறது. (எனவே புதிய உறுப்பினர் மாறிகள் மாறும் வகையில் பைத்தானின் திறனைப் பயன்படுத்துவதைத் தவிர்க்கவும்.)
uk: Рекомендовано призначити значення для всіх змінних користувачів у конструкторі Python. (Таким чином, уникнення здатності Python до динамічного створення змінних користувачів.)

source: If a Python variable is to store a floating point value then it is recommended to always assign and manipulate that variable with floating point constants (and never use integer constants). For example, prefer `self.speed = 1.` over `self.speed = 1`, and prefer `self.speed = 2. * x` over `self.speed = 2 * x`. Consistent use of floating point values can avoid hard to debug quirks in Python type conversions.
ta: ஒரு பைதான் மாறி ஒரு மிதக்கும் புள்ளி மதிப்பை சேமிக்க வேண்டும் என்றால், அந்த மாறியை மிதக்கும் புள்ளி மாறிலிகளுடன் எப்போதும் ஒதுக்கவும் கையாளவும் பரிந்துரைக்கப்படுகிறது (மற்றும் ஒருபோதும் முழு எண் மாறிலிகளைப் பயன்படுத்த வேண்டாம்). எடுத்துக்காட்டாக, `self.speed = 1.` ஐ விட` self.speed = 1` ஐ விரும்புங்கள், மேலும் `self.speed = 2 ஐ விரும்புங்கள். * X` over` self.speed = 2 * x`. மிதக்கும் புள்ளி மதிப்புகளின் நிலையான பயன்பாடு பைதான் வகை மாற்றங்களில் க்யூர்க்சை பிழைத்திருத்துவது கடினம்.
uk: Якщо змінна Python полягає в тому, щоб зберігати значення точки плавлення, то рекомендується завжди призначити і маніпулювати, що змінна з плаваючою точкою константи (і ніколи не використовувати цілі константи). Наприклад, воліє `self.speed = 1` над `self.speed = 1`, і воліє `self.speed = 2. * x` над `self.speed = 2 * x`. Консистентне використання значень точки плавлення може уникнути важко дебвугових кіл у перетвореннях типу Python.

source: The first main coding task is to bring up communication support to the target board. This is the most difficult step in a new port. Once basic communication is working, the remaining steps tend to be much easier. It is typical to use a UART type serial device during initial development as these types of hardware devices are generally easier to enable and control. During this phase, make liberal use of helper code from the src/generic/ directory (check how src/simulator/Makefile includes the generic C code into the build). It is also necessary to define timer_read_time() (which returns the current system clock) in this phase, but it is not necessary to fully support timer irq handling.
ta: முதல் முக்கிய குறியீட்டு பணி இலக்கு வாரியத்திற்கு தகவல்தொடர்பு ஆதரவை கொண்டு வருவதாகும். புதிய துறைமுகத்தில் இது மிகவும் கடினமான படியாகும். அடிப்படை தொடர்பு செயல்பட்டவுடன், மீதமுள்ள படிகள் மிகவும் எளிதாக இருக்கும். ஆரம்ப வளர்ச்சியின் போது UART வகை தொடர் சாதனத்தைப் பயன்படுத்துவது பொதுவானது, ஏனெனில் இந்த வகையான வன்பொருள் சாதனங்கள் பொதுவாக செயல்படுத்தவும் கட்டுப்படுத்தவும் எளிதானவை. இந்த கட்டத்தின் போது, எச்.ஆர்.சி/பொதுவான/கோப்பகத்திலிருந்து உதவி குறியீட்டை தாராளமாகப் பயன்படுத்துங்கள் (எச்.ஆர்.சி/சிமுலேட்டர்/மேக்ஃபைல் எவ்வாறு பொதுவான சி குறியீட்டை உருவாக்குகிறது என்பதைச் சரிபார்க்கவும்). இந்த கட்டத்தில் Timer_read_time () (இது தற்போதைய கணினி கடிகாரத்தை வழங்குகிறது) வரையறுப்பதும் தேவை, ஆனால் நேரங்குறிகருவி IRQ கையாளுதலை முழுமையாக ஆதரிக்க வேண்டிய அவசியமில்லை.
uk: Перше основне завдання кодування - довести підтримку зв'язку на цільову дошку. Це найскладніший крок у новому порту. Після того, як основне спілкування працює, інші кроки, як правило, набагато простіше. Призначений для використання серійного пристрою типу UART під час початкового розвитку, оскільки ці види апаратних пристроїв, як правило, простіше увімкнути та контролювати. Під час цієї фази ліберал може використовувати код помічника з src/generic/ каталогу (перевірити, як src/simulator/Makefile включає загальний код C в структуру). Також необхідно визначити таймер_read_time() (який повертає поточний системний годинник) в цій фазі, але не потрібно повністю підтримувати часову обробку.

source: Additional coding tips:
ta: கூடுதல் குறியீட்டு உதவிக்குறிப்புகள்:
uk: Додаткові поради кодування:

source: Avoid using "C bitfields" to access IO registers; prefer direct read and write operations of 32bit, 16bit, or 8bit integers. The C language specifications don't clearly specify how the compiler must implement C bitfields (eg, endianness, and bit layout), and it's difficult to determine what IO operations will occur on a C bitfield read or write.
ta: IO பதிவேடுகளை அணுக "சி பிட்ஃபீல்ட்ச்" பயன்படுத்துவதைத் தவிர்க்கவும்; 32 பிட், 16 பிட் அல்லது 8 பிட் எண்களின் நேரடி வாசிப்பு மற்றும் எழுத செயல்பாடுகளை விரும்புங்கள். சி பிட்ஃபீல்ட்களை (எ.கா., எண்டியன்னச் மற்றும் பிட் தளவமைப்பு) எவ்வாறு செயல்படுத்த வேண்டும் என்பதை சி மொழி விவரக்குறிப்புகள் தெளிவாகக் குறிப்பிடவில்லை, மேலும் சி பிட்ஃபீல்ட் வாசிப்பு அல்லது எழுதுவதில் ஐ.ஓ செயல்பாடுகள் என்ன நிகழும் என்பதை தீர்மானிப்பது கடினம்.
uk: Уникайте використання "C bitfields" для доступу до реєстрів IO; віддайте перевагу прямій зчитування та писати операції 32bit, 16bit, або 8bit цілих. Технічні характеристики C не вказують на те, як компілятор повинен реалізувати C bitfields (наприклад, endianness, і трохи макетування), і важко визначити, які операції IO відбуваються на бітфілді або писати.

source: Prefer writing explicit values to IO registers instead of using read-modify-write operations. That is, if updating a field in an IO register where the other fields have known values, then it is preferable to explicitly write the full contents of the register. Explicit writes produce code that is smaller, faster, and easier to debug.
ta: வாசிப்பு-மாடிஃபை-ரைட் செயல்பாடுகளைப் பயன்படுத்துவதற்குப் பதிலாக IO பதிவேடுகளுக்கு வெளிப்படையான மதிப்புகளை எழுத விரும்புங்கள். அதாவது, மற்ற புலங்கள் அறிந்த மதிப்புகளைக் கொண்ட ஒரு IO பதிவேட்டில் ஒரு புலத்தைப் புதுப்பித்தால், பதிவின் முழு உள்ளடக்கங்களையும் வெளிப்படையாக எழுதுவது விரும்பத்தக்கது. சிறிய, வேகமான மற்றும் பிழைத்திருத்தத்திற்கு எளிதான குறியீட்டை வெளிப்படையான எழுதுகிறது.
uk: Надання чітких значень для реєстрів IO замість використання чит-модіфікованих операцій. Це, якщо оновлення поля в реєстрі IO, де інші поля мають відомі значення, то бажано явно писати повний вміст реєстру. Очікується записувати код, який менший, швидше, і простіше відхиляти.

source: Task, init, and command functions always run with interrupts enabled (however, they can temporarily disable interrupts if needed). These functions should avoid long pauses, delays, or do work that lasts a significant time. (Long delays in these "task" functions result in scheduling jitter for other "tasks" - delays over 100us may become noticeable, delays over 500us may result in command retransmissions, delays over 100ms may result in watchdog reboots.) These functions schedule work at specific times by scheduling timers.
ta: பணி, init மற்றும் கட்டளை செயல்பாடுகள் எப்போதும் இயக்கப்பட்ட குறுக்கீடுகளுடன் இயங்குகின்றன (இருப்பினும், தேவைப்பட்டால் அவை தற்காலிகமாக குறுக்கீடுகளை முடக்கலாம்). இந்த செயல்பாடுகள் நீண்ட இடைநிறுத்தங்கள், தாமதங்கள் அல்லது குறிப்பிடத்தக்க நேரம் நீடிக்கும் வேலைகளைத் தவிர்க்க வேண்டும். . டைமர்களை திட்டமிடுவதன் மூலம் குறிப்பிட்ட நேரங்கள்.
uk: Завдання, ідентифікувати, і командні функції завжди працюють з перервами, ввімкненими (як правило, вони можуть тимчасово відключати перерву, якщо це необхідно). Ці функції повинні уникати довгих паузи, затримок або зробити роботу, яка триває значного часу. (Довге затримки в цих функціях "таск" призводить до спланування Джиттера для інших "тасків" - затримок понад 100us може стати помітними, затримки більше 500us може призвести до введення командних ретрансмісій, затримки понад 100 м може призвести до перезавантаження годинника.) Ці функції працюють за певними часами.

source: The ToolHead class (in toolhead.py) handles "look-ahead" and tracks the timing of printing actions. The main codepath for a move is: `ToolHead.move() -> LookAheadQueue.add_move() -> LookAheadQueue.flush() -> Move.set_junction() -> ToolHead._process_moves()`.
ta: கருவிஎச் வகுப்பு (கருவியில்) "தோற்றத்தை" கையாளுகிறது மற்றும் அச்சிடும் செயல்களின் நேரத்தைக் கண்காணிக்கிறது. ஒரு நகர்வுக்கான முக்கிய குறியீட்டு முறை: `கருவிஎட்.
uk: Клас ToolHead (в інструментальномуголові.py) ручок "look-ahead" і відстежує термін дії друку. Головний кодпат для переміщення: `ToolHead.move() до Посилання до LookAheadQueue.flush() -> Move.set_junction() до ToolHead._process_moves()`.

source: LookAheadQueue.add_move() places the move object on the "look-ahead" queue.
ta: Lookaheadqueue.add_move () நகரும் பொருளை "தோற்றமளிக்கும்" வரிசையில் வைக்கிறது.
uk: LookAheadQueue.add_move() розміщує об'єкт переходу на чергу "look-ahead".

source: LookAheadQueue.flush() determines the start and end velocities of each move.
ta: Lookaheadqueue.flush () ஒவ்வொரு நகர்வின் தொடக்க மற்றும் இறுதி வேகங்களை தீர்மானிக்கிறது.
uk: LookAheadQueue.flush() визначає початок та кінцеві значення кожного руху.
