Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Command_Templates.po
Languages: ru, ta, uk

source: Delayed Gcodes
ru: Задержанные G-коды
ta: தாமதமான GCODES
uk: Випробувано Gcodes

source: The [delayed_gcode] configuration option can be used to execute a delayed gcode sequence:
ru: Опция конфигурации [delayed_gcode] может использоваться для выполнения последовательности gcode с задержкой:
ta: தாமதமாக GCODE வரிசையை இயக்க [தாமதமான_சி கோட்] உள்ளமைவு விருப்பத்தைப் பயன்படுத்தலாம்:
uk: Параметри конфігурації [delayed_gcode] можна використовувати для виконання послідовності затримки gcode:

source: When the `load_filament` macro above executes, it will display a "Load Complete!" message after the extrusion is finished. The last line of gcode enables the "clear_display" delayed_gcode, set to execute in 10 seconds.
ru: При выполнении макроса `load_filament` на экране появится сообщение "Load Complete!" после завершения экструзии. Последняя строка gcode включает отложенный_gcode "clear_display", настроенный на выполнение через 10 секунд.
ta: மேலே உள்ள `load_filament` மேக்ரோவை இயக்கும்போது, அது" சுமை முழுமையானது! " வெளியேற்றம் முடிந்ததும் செய்தி. GCODE இன் கடைசி வரி "CLEAR_DISPLAY" தாமதமான_கோடை செயல்படுத்துகிறது, இது 10 வினாடிகளில் இயக்க அமைக்கப்பட்டுள்ளது.
uk: Коли `load_filament` макро вище виконань, він буде відображати повідомлення "Завантажити повну!" після завершення екструзії. Остання лінія gcode дозволяє "clear_display" затримувати_gcode, встановити для виконання за 10 секунд.

source: The `initial_duration` config option can be set to execute the delayed_gcode on printer startup. The countdown begins when the printer enters the "ready" state. For example, the below delayed_gcode will execute 5 seconds after the printer is ready, initializing the display with a "Welcome!" message:
ru: Опция конфигурации `initial_duration` может быть установлена для выполнения delayed_gcode при запуске принтера. Отсчет времени начинается, когда принтер переходит в состояние "готов". Например, приведенный ниже код delayed_gcode будет выполнен через 5 секунд после готовности принтера, инициализируя дисплей сообщением " Добро пожаловать!":
ta: அச்சுப்பொறி தொடக்கத்தில் தாமதமான_கோடை இயக்க `தொடக்க_டூரேசன்` கட்டமைப்பு விருப்பத்தை அமைக்கலாம். அச்சுப்பொறி "தயாராக" நிலைக்குள் நுழையும் போது கவுண்டன் தொடங்குகிறது. எடுத்துக்காட்டாக, அச்சுப்பொறி தயாரான 5 வினாடிகளுக்கு கீழே உள்ள தாமதமான_சி கோட் இயக்கும், காட்சியை "வரவேற்பு!" செய்தி:
uk: `initial_duration` параметр налаштування може бути встановлений для виконання затриманого_gcode на принтері. Відлік починається, коли принтер надходить в стан "читця". Наприклад, нижче затриманий_gcode буде виконувати 5 секунд після того, як принтер готовий, ініціалізація дисплея з повідомленням "Welcome!":

source: Its possible for a delayed gcode to repeat by updating itself in the gcode option:
ru: Отложенный gcode может повториться, обновившись в опции gcode:
ta: தாமதமான GCODE GCODE விருப்பத்தில் தன்னை புதுப்பிப்பதன் மூலம் மீண்டும் செய்ய முடியும்:
uk: Його можливо для затримки gcode для повторення шляхом оновлення параметра gcode:

source: The above delayed_gcode will send "// Extruder Temp: [ex0_temp]" to Octoprint every 2 seconds. This can be canceled with the following gcode:
ru: Приведенный выше код delayed_gcode будет отправлять Octoprint сообщение "// Extruder Temp: [ex0_temp]" каждые 2 секунды. Это можно отменить с помощью следующего gcode:
ta: மேலே உள்ள தாமதமான_சி கோட் ஒவ்வொரு 2 விநாடிகளிலும் ஆக்டோப்ரின்ட்டுக்கு "// எக்ச்ட்ரூடர் தற்காலிக: [EX0_TEMP]" ஐ அனுப்பும். பின்வரும் GCODE உடன் இதை ரத்து செய்யலாம்:
uk: Над затримкою_gcode надішлемо "// Extruder Temp: [ex0_temp]" до Octoprint кожні 2 секунди. Це може бути скасовано з наступним gcode:

source: Menu templates
ru: Шаблоны меню
ta: பட்டி வார்ப்புருக்கள்
uk: Шаблони меню

source: If a [display config section](Config_Reference.md#display) is enabled, then it is possible to customize the menu with [menu](Config_Reference.md#menu) config sections.
ru: Если включен раздел конфигурации [дисплей](Config_Reference.md#display)], то можно настроить меню с помощью разделов конфигурации [меню](Config_Reference.md#menu).
ta: ஒரு [காட்சி கட்டமைப்பு பிரிவு] (config_reference.md#காட்சி) இயக்கப்பட்டிருந்தால், [மெனு] (config_reference.md#மெனு) கட்டமைப்பு பிரிவுகளுடன் மெனுவைத் தனிப்பயனாக்க முடியும்.
uk: Якщо [розділ конфігурації дисплея](Config_Reference.md#display) увімкнено, то можна налаштувати меню за допомогою розділів конфігурації [меню](Config_Reference.md#menu).

source: The following read-only attributes are available in menu templates:
ru: В шаблонах меню доступны следующие атрибуты, доступные только для чтения:
ta: பின்வரும் வாசிப்பு மட்டும் பண்புக்கூறுகள் பட்டியல் வார்ப்புருக்களில் கிடைக்கின்றன:
uk: У шаблонах меню доступні наступні атрибути:

source: `menu.width` - element width (number of display columns)
ru: `menu.width` - ширина элемента (количество отображаемых колонок)
ta: `மெனு. அகலம்` - உறுப்பு அகலம் (காட்சி நெடுவரிசைகளின் எண்ணிக்கை)
uk: `menu.width` - ширина елемента (номер стовпчиків відображення)

source: `menu.ns` - element namespace
ru: `menu.ns` - пространство имен элемента
ta: `மெனு..என்.எச்` - உறுப்பு பெயர்வெளி
uk: `menu.ns` - простір назв елемента

source: `menu.event` - name of the event that triggered the script
ru: `menu.event` - имя события, вызвавшего скрипт
ta: `மெனு.வென்ட்` - ச்கிரிப்டைத் தூண்டிய நிகழ்வின் பெயர்
uk: `menu.event` - назва події, яка запустив сценарій

source: `menu.input` - input value, only available in input script context
ru: `menu.input` - значение ввода, доступно только в контексте сценария ввода
ta: `மெனு.
uk: `menu.input` - значення вводу, доступна тільки в контексті скрипта введення

source: The following actions are available in menu templates:
ru: В шаблонах меню доступны следующие действия:
ta: பின்வரும் செயல்கள் பட்டியல் வார்ப்புருக்களில் கிடைக்கின்றன:
uk: У шаблонах меню доступні наступні дії:

source: `menu.back(force, update)`: will execute menu back command, optional boolean parameters `<force>` and `<update>`.
ru: `menu.back(force, update)`: выполнит команду возврата к меню, необязательные булевы параметры `<force>` и `<update>`.
ta: `மெனு.
uk: `menu.back(сила, оновлення)`: буде виконувати команду меню, додаткові параметри болеан `<force>` і `<update>`.

source: When `<force>` is set True then it will also stop editing. Default value is False.
ru: Если для `<force>` установлено значение True, то редактирование также будет остановлено. Значение по умолчанию - False.
ta: `<forse>` உண்மையாக அமைக்கப்பட்டால், அது திருத்துவதையும் நிறுத்திவிடும். இயல்புநிலை மதிப்பு தவறானது.
uk: Коли `<force>` встановлюється Далі він також зупинить редагування. За замовчуванням значення False.

source: When `<update>` is set False then parent container items are not updated. Default value is True.
ru: Если значение `<обновить>` установлено Ложь, то элементы родительского контейнера не обновляются. Значение по умолчанию - Истина.
ta: `<apdate>` தவறானது அமைக்கப்படும்போது, பெற்றோர் கொள்கலன் உருப்படிகள் புதுப்பிக்கப்படாது. இயல்புநிலை மதிப்பு உண்மை.
uk: Коли `<update>` встановлюється False потім батьківські контейнерні елементи не оновлено. Ім'я користувача.

source: `menu.exit(force)` - will execute menu exit command, optional boolean parameter `<force>` default value False.
ru: `menu.exit(force)` - выполнит команду выхода из меню, необязательный булевский параметр `<force>` по умолчанию имеет значение Ложь.
ta: `மெனு.
uk: `menu.exit(force)` - виконувати команду виходу меню, додатковий параметр boolean `<force>` значення за замовчуванням False.

source: Save Variables to disk
ru: Сохранить переменные на диске
ta: மாறிகளை வட்டில் சேமிக்கவும்
uk: Збережіть Варіабельні диски

source: If a [save_variables config section](Config_Reference.md#save_variables) has been enabled, `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>` can be used to save the variable to disk so that it can be used across restarts. All stored variables are loaded into the `printer.save_variables.variables` dict at startup and can be used in gcode macros. to avoid overly long lines you can add the following at the top of the macro:
ru: Если включен раздел конфигурации [save_variables](Config_Reference.md#save_variables), то `SAVE_VARIABLE VARIABLE=<имя> VALUE=<значение>` можно использовать для сохранения переменной на диск, чтобы ее можно было использовать при перезапуске. Все сохраненные переменные при запуске загружаются в дикту `printer.save_variables.variables` и могут быть использованы в макросах gcode. Чтобы избежать слишком длинных строк, можно добавить в начало макроса следующее:
ta: [Save_variables கட்டமைப்பு பிரிவு] (config_reference.md#save_variables) இயக்கப்பட்டிருந்தால், `save_variable மாறி = <aname> மதிப்பு = <மதிப்பு>` மாறியை வட்டில் சேமிக்க பயன்படுத்தலாம், இதனால் மறுதொடக்கங்கள் முழுவதும் பயன்படுத்தப்படலாம். சேமிக்கப்பட்ட அனைத்து மாறிகள் தொடக்கத்தில் `அச்சுப்பொறி.சேவ்_வார்பிள்கள். அதிகப்படியான நீண்ட வரிகளைத் தவிர்க்க நீங்கள் பின்வருவனவற்றை மேக்ரோவின் மேற்புறத்தில் சேர்க்கலாம்:
uk: Якщо ввімкнено розділ конфігурації [save_variables](Config_Reference.md#save_variables), `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>` можна використовувати для збереження змінної диску, щоб його можна використовувати у перезавантаженнях. Всі збережені змінні навантажуються в `printer.save_variables.variables` dict при запуску і може бути використаний в gcode макрос. Щоб уникнути зайвих довгих ліній можна додати наступні вгорі макроси:

source: As an example, it could be used to save the state of 2-in-1-out hotend and when starting a print ensure that the active extruder is used, instead of T0:
ru: Например, его можно использовать для сохранения состояния хотэнда 2-in-1-out и при запуске печати убедиться, что используется активный экструдер, а не T0:
ta: உதாரணமாக, இது 2-இன் -1-அவுட் ஆட்எண்டின் நிலையைச் சேமிக்கப் பயன்படுகிறது, மேலும் ஒரு அச்சைத் தொடங்கும்போது, T0 க்கு பதிலாக செயலில் எக்ச்ட்ரூடர் பயன்படுத்தப்படுவதை உறுதிசெய்க:
uk: Як приклад, його можна використовувати для збереження стану 2-в-1-вихідного гарячика і при запуску друку, що використовується активний екструдера, замість T0:

source: [gcode_macro blink_led] gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
uk: [gcode_macro blink_led] гкод: СЕТ_ПІН ПІН=my_led VALUE=1 Г4 П2000 СЕТ_ПІН ПІН=my_led VALUE=0

source: [gcode_macro blink_led] description: Blink my_led one time gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
ru: [gcode_macro blink_led] описание: Blink my_led one time gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
uk: [gcode_macro blink_led] опис: Blink my_led раз гкод: СЕТ_ПІН ПІН=my_led VALUE=1 Г4 П2000 СЕТ_ПІН ПІН=my_led VALUE=0

source: [gcode_macro MOVE_UP] gcode: SAVE_GCODE_STATE NAME=my_move_up_state G91 G1 Z10 F300 RESTORE_GCODE_STATE NAME=my_move_up_state
uk: [gcode_macro MOVE_UP] гкод: SAVE_GCODE_STATE NAME=my_move_up_state Г91 Г1 З10 Ф300 РЕСТОР_GCODE_STATE NAME=my_move_up_state

source: [gcode_macro SET_PERCENT] gcode: M117 Now at { params.VALUE|float * 100 }%
ru: [gcode_macro SET_PERCENT] gcode: M117 Теперь при { params.VALUE|float * 100 }%
uk: [gcode_macro SET_PERCENT] гкод: М117 Тепер в { парам. VALUE Товарів у наявності: 100

source: [gcode_macro SET_BED_TEMPERATURE] gcode: {% set bed_temp = params.TEMPERATURE|default(40)|float %} M140 S{bed_temp}
uk: [gcode_macro SET_BED_TEMPERATURE] гкод: {% встановити ліжко_temp = парам. ТЕМПЕРАТУРА ВИСТАВКИ (40) АДРЕСА %} М140 S{bed_temp}

source: [gcode_macro slow_fan] gcode: M106 S{ printer.fan.speed * 0.9 * 255}
uk: [gcode_macro повільно_fan] гкод: M106 S{ принтер.fan.speed * 0.9 * 255}

source: [gcode_macro QUERY_HTU21D] gcode: {% set sensor = printer["htu21d my_sensor"] %} M117 Temp:{sensor.temperature} Humidity:{sensor.humidity}
uk: [gcode_macro QUERY_HTU21D] гкод: {% встановлений датчик = принтер["htu21d my_sensor"] %} М117 Темп: КСНУМКС Вологість:{sensor.humidity}

source: [gcode_macro start_probe] variable_bed_temp: 0 gcode: # Save target temperature to bed_temp variable SET_GCODE_VARIABLE MACRO=start_probe VARIABLE=bed_temp VALUE={printer.heater_bed.target} # Disable bed heater M140 # Perform probe PROBE # Call finish_probe macro at completion of probe finish_probe [gcode_macro finish_probe] gcode: # Restore temperature M140 S{printer["gcode_macro start_probe"].bed_temp}
ru: [gcode_macro start_probe] variable_bed_temp: 0 gcode: # Сохранить целевую температуру в переменной bed_temp SET_GCODE_VARIABLE MACRO=start_probe VARIABLE=bed_temp VALUE={printer.heater_bed.target} # Отключить нагреватель кровати M140 # Выполнить зондирование PROBE # Вызов макроса finish_probe по завершении зондирования finish_probe [gcode_macro finish_probe] gcode: # Восстановление температуры M140 S{printer["gcode_macro start_probe"].bed_temp}
uk: [gcode_macro start_probe] JavaScript licenses API Веб-сайт Go1.13.8 гкод: # Збережіть цільову температуру в ліжко_temp змінна SET_GCODE_VARIABLE MACRO=start_probe VARIABLE=bed_temp VALUE={printer.heater_bed.target} # Вимкнений обігрівач М140 # Виконувати зонд ПРОБЛЕ # Call end_probe макроси при завершенні зонду JavaScript licenses API Веб-сайт [gcode_macro end_probe] гкод: # Температура відновлення M140 S{printer["gcode_macro start_probe"]. ліжко_temp}

source: [delayed_gcode clear_display] gcode: M117 [gcode_macro load_filament] gcode: G91 G1 E50 G90 M400 M117 Load Complete! UPDATE_DELAYED_GCODE ID=clear_display DURATION=10
ru: [delayed_gcode clear_display] gcode: M117 [gcode_macro load_filament] gcode: G91 G1 E50 G90 M400 Загрузка M117 завершена! UPDATE_DELAYED_GCODE ID=clear_display DURATION=10
uk: [delayed_gcode clear_display] гкод: М117 [gcode_macro load_filament] гкод: Г91 Г1 Е50 Г90 М400 M117 Навантаження завершено! ОНОВЛЕННЯ_DELAYED_GCODE Ім'я користувача ДЮРАЦІЯ=10

source: [delayed_gcode welcome] initial_duration: 5. gcode: M117 Welcome!
ru: [delayed_gcode welcome] initial_duration: 5. gcode: M117 Добро пожаловать!
uk: [вітаємо з відкладеним_gcode] початкова_тривалість: 5. gcode: M117 Ласкаво просимо!

source: [delayed_gcode report_temp] initial_duration: 2. gcode: {action_respond_info("Extruder Temp: %.1f" % (printer.extruder0.temperature))} UPDATE_DELAYED_GCODE ID=report_temp DURATION=2
uk: [delayed_gcode report_temp] початковий_duration: 2,2 км гкод: {action_respond_info("Extruder Temp: %.1f" % (printer.extruder0. Температура) ОНОВЛЕННЯ_DELAYED_GCODE ID=report_temp ДЮРАЦІЯ=2

source: UPDATE_DELAYED_GCODE ID=report_temp DURATION=0
uk: ОНОВЛЕННЯ_DELAYED_GCODE ID=report_temp ДЮРАЦІЯ=0

source: {% set svv = printer.save_variables.variables %}
uk: {% встановити svv = принтер.save_variables.variables %}

source: [gcode_macro T1] gcode: ACTIVATE_EXTRUDER extruder=extruder1 SAVE_VARIABLE VARIABLE=currentextruder VALUE='"extruder1"' [gcode_macro T0] gcode: ACTIVATE_EXTRUDER extruder=extruder SAVE_VARIABLE VARIABLE=currentextruder VALUE='"extruder"' [gcode_macro START_GCODE] gcode: {% set svv = printer.save_variables.variables %} ACTIVATE_EXTRUDER extruder={svv.currentextruder}
uk: [gcode_macro T1] гкод: ACTIVATE_EXTRUDER extruder=extruder1 SAVE_VARIABLE VARIABLE=currentextruder VALUE="extruder1" Р [gcode_macro T0] гкод: ACTIVATE_EXTRUDER JavaScript licenses API Веб-сайт Go1.13.8 SAVE_VARIABLE VARIABLE=currentextruder VALUE='"extruder" Р [gcode_macro START_GCODE] гкод: {% встановити svv = принтер.save_variables.variables %} ACTIVATE_EXTRUDER extruder={svvv.currentextruder}

source: Commands templates
ru: Шаблоны команд
ta: வார்ப்புருக்கள் கட்டளையிடுகின்றன
uk: Шаблони команд

source: The "rawparams" variable
ru: Переменная "rawparams"
ta: "ராவபரம்ச்" மாறி
uk: Змінна "rawparams"

source: The full unparsed parameters for the running macro can be access via the `rawparams` pseudo-variable.
ru: Доступ к полным непарсированным параметрам запущенного макроса можно получить через псевдопеременную `rawparams`.
ta: இயங்கும் மேக்ரோவுக்கான முழு ஒப்பிடமுடியாத அளவுருக்கள் `ராவபரம்கள்` போலி-மாறி வழியாக அணுகலாம்.
uk: Повні непаровані параметри для запуску макросу можна отримати за допомогою `rawparams` псевдоваріативно.

source: [gcode_macro clean_nozzle] gcode: {% set wipe_count = 8 %} SAVE_GCODE_STATE NAME=clean_nozzle_state G90 G0 Z15 F300 {% for wipe in range(wipe_count) %} {% for coordinate in [(275, 4),(235, 4)] %} G0 X{coordinate[0]} Y{coordinate[1] + 0.25 * wipe} Z9.7 F12000 {% endfor %} {% endfor %} RESTORE_GCODE_STATE NAME=clean_nozzle_state
ru: [gcode_macro cleanan_nozzle] gcode: {% set wipe_count = 8 %} SAVE_GCODE_STATE NAME=clean_nozzle_state G90 G0 Z15 F300 {% for wipe in range(wipe_count) %} {% for coordinate in [(275, 4),(235, 4)] %} G0 X{координата[0]} Y{координата[1] + 0.25 * wipe} Z9.7 F12000 {% endfor %} {% endfor %} RESTORE_GCODE_STATE NAME=clean_nozzle_state
uk: [gcode_macro clean_nozzle] гкод: 0 товар(ов) - 0.00 р. SAVE_GCODE_STATE NAME=clean_nozzle_state Г90 Г0 З15 Ф300 {% для протирати в діапазоні(wipe_count) %} {% за координацію [(275, 4),(235, 4)] %} G0 X{координат[0]} Y{координат }} + 0.25 * знищити} Z9.7 F12000 0 товар(ов) - 0.00 € 0 товар(ов) - 0.00 € РЕСТОР_GCODE_STATE NAME=clean_nozzle_state

source: The terminal will display the description when you use the `HELP` command or the autocomplete function.
ru: Терминал отобразит описание, когда вы воспользуетесь командой `HELP` или функцией автозаполнения.
ta: நீங்கள் `உதவி` கட்டளை அல்லது தன்னியக்கவியல் செயல்பாட்டைப் பயன்படுத்தும்போது முனையம் விளக்கத்தைக் காண்பிக்கும்.
uk: Термінал буде відображати опис, коли ви використовуєте команду `HELP` або функцію автоматичного завершення.

source: Note that this will include any comments that were part of the original command.
ru: Обратите внимание, что при этом будут включены все комментарии, которые были частью исходной команды.
ta: அசல் கட்டளையின் ஒரு பகுதியாக இருந்த எந்த கருத்துகளும் இதில் அடங்கும் என்பதை நினைவில் கொள்க.
uk: Зверніть увагу, що це буде містити будь-які коментарі, які були частиною оригінальної команди.

source: See the [sample-macros.cfg](../config/sample-macros.cfg) file for an example showing how to override the `M117` command using `rawparams`.
ru: Смотрите файл [sample-macros.cfg](../config/sample-macros.cfg) для примера, показывающего, как переопределить команду `M117` с помощью `rawparams`.
ta: `ராவபரம்கள்` ஐப் பயன்படுத்தி` M117` கட்டளையை எவ்வாறு மேலெழுதுவது என்பதைக் காட்டும் எடுத்துக்காட்டுக்கு [மாதிரி-macros.cfg] (../ config/salem-macros.cfg) கோப்பைப் பார்க்கவும்.
uk: Перегляньте файл [sample-macros.cfg](../config/sample-macros.cfg) для прикладу, у якому показано, як замінити команду `M117` за допомогою `rawparams`.

source: G-Code Macro Naming
ru: Названия макросов G-Кода
ta: சி-கோட் மேக்ரோ பெயரிடுதல்
