Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: es, ta, uk

source: This document covers recent software changes to the config file that are not backwards compatible. It is a good idea to review this document when upgrading the Klipper software.
es: Este documento cubre los cambios recientes al software en el archivo de configuración que no son compatible con previas versiones. Es una buena idea revisar este documento cuando se vaya a actualizar el software de Klipper.
ta: இந்த ஆவணம் பின்னோக்கி இணக்கமாக இல்லாத கட்டமைப்பு கோப்பில் அண்மைக் கால மென்பொருள் மாற்றங்களை உள்ளடக்கியது. கிளிப்பர் மென்பொருளை மேம்படுத்தும்போது இந்த ஆவணத்தை மதிப்பாய்வு செய்வது நல்லது.
uk: Цей документ охоплює останні зміни програмного забезпечення у файлі конфігурації, які не є зворотно сумісними. Бажано переглянути цей документ під час оновлення програмного забезпечення Klipper.

source: All dates in this document are approximate.
es: Todas las fechas en este archivo son aproximadas.
ta: இந்த ஆவணத்தில் உள்ள அனைத்து தேதிகளும் தோராயமானவை.
uk: Усі дати в цьому документі є приблизними.

source: Changes
es: Cambios
ta: மாற்றங்கள்
uk: Зміни

source: 20210612: The `pid_integral_max` config option in heater and temperature_fan sections is deprecated. The option will be removed in the near future.
es: 20210612: El parámetro de configuración `pid_integral_max` en las secciones (heater) y (temperature_fan) están en desuso. Este parámetro será eliminado próximamente.
ta: 20210612: ஈட்டர் மற்றும் வெப்பநிலை_பான் பிரிவுகளில் `PID_INTEGRAL_MAX` கட்டமைப்பு விருப்பம் நீக்கப்பட்டது. இந்த விருப்பம் எதிர்காலத்தில் அகற்றப்படும்.
uk: 20210612: Параметр конфігурації `pid_integral_max` у розділах heater і temperature_fan застарів. Опція буде видалена найближчим часом.

source: 20210430: The SET_VELOCITY_LIMIT (and M204) command may now set a velocity, acceleration, and square_corner_velocity larger than the specified values in the config file.
es: 20210430: El comando SET_VELOCITY_LIMIT (y M204) puede que no establezcan una velocidad, aceleración y square_corner_velocity más grande que la especificada en los valores del archivo de configuración.
ta: 20210430: set_velocity_limit (மற்றும் M204) கட்டளை இப்போது கட்டமைப்பு கோப்பில் குறிப்பிட்ட மதிப்புகளை விட பெரிய விரைவு, முடுக்கம் மற்றும் சதுர_கார்னர்_வெலோசிட்டி ஆகியவற்றை அமைக்கலாம்.
uk: 20210430: команда SET_VELOCITY_LIMIT (та M204) тепер може встановлювати швидкість, прискорення та квадратну_кутову_швидкість, більші за вказані значення у файлі конфігурації.

source: 20210325: Support for the `pin_map` config option is deprecated. Use the [sample-aliases.cfg](../config/sample-aliases.cfg) file to translate to the actual micro-controller pin names. The `pin_map` config option will be removed in the near future.
es: 20210325: El parámetro de configuración `pin_map`está en desuso. Use el archivo [sample-aliases.cfg](../config/sample-aliases.cfg) para traducir a los nombres actuales de los pines del microcontrolador. El parámetro de configuración `pin_map` será eliminado próximamente.
ta: 20210325: `பின்_மாப்` கட்டமைப்பு விருப்பத்திற்கான உதவி நீக்கப்பட்டது. உண்மையான மைக்ரோ-கன்ட்ரோலர் முள் பெயர்களுக்கு மொழிபெயர்க்க [salem-aliases.cfg] (../ config/shalm-aliases.cfg) கோப்பைப் பயன்படுத்தவும். `பின்_மாப்` கட்டமைப்பு விருப்பம் எதிர்காலத்தில் அகற்றப்படும்.
uk: 20210325: підтримка параметра конфігурації `pin_map` застаріла. Використовуйте файл [sample-aliases.cfg](../config/sample-aliases.cfg) для перекладу на фактичні назви контактів мікроконтролера. Параметр конфігурації `pin_map` буде видалено найближчим часом.

source: 20210313: Klipper's support for micro-controllers that communicate with CAN bus has changed. If using CAN bus then all micro-controllers must be reflashed and the [Klipper configuration must be updated](CANBUS.md).
es: 20210313: El soporte de Klipper para microcontroladores que se comunican con un bus CAN ha cambiado. Si se usa el bus CAN, todos los microcontroladores deben ser reprogramados y la [configuración de Klipper debe ser actualizada](CANBUS.md).
ta: 20210313: கேன் பச்சுடன் தொடர்பு கொள்ளும் மைக்ரோ-கன்ட்ரோலர்களுக்கு கிளிப்பரின் உதவி மாறிவிட்டது. CAN பச் பயன்படுத்தினால், அனைத்து மைக்ரோ-கன்ட்ரோலர்களும் மறுசீரமைக்கப்பட வேண்டும், மேலும் [கிளிப்பர் உள்ளமைவு புதுப்பிக்கப்பட வேண்டும்] (Canbus.md).
uk: 20210313: змінено підтримку Klipper для мікроконтролерів, які взаємодіють із шиною CAN. Якщо використовується шина CAN, усі мікроконтролери необхідно оновити та [конфігурацію Klipper необхідно оновити](CANBUS.md).

source: 20210310: The TMC2660 default for driver_SFILT has been changed from 1 to 0.
es: 20210310: La configuración por defecto de TMC2660 para el controlador driver_SFILT ha sido cambiada de 1 a 0.
ta: 20210310: டிரைவர்_பில்ட்டுக்கான டிஎம்சி 2660 இயல்புநிலை 1 முதல் 0 வரை மாற்றப்பட்டுள்ளது.
uk: 20210310: значення TMC2660 за умовчанням для driver_SFILT змінено з 1 на 0.

source: 20210227: TMC stepper motor drivers in UART or SPI mode are now queried once per second whenever they are enabled - if the driver can not be contacted or if the driver reports an error, then Klipper will transition to a shutdown state.
es: 20210227: Los controladores del motor paso a paso TMC en modos UART o SPI ahora son añadidos a la cola una vez por segundo cuando son activados · si no se puede establecer comunicación con el controlador o si éste reporta un error, Klipper cambiará a un estado de apagado.
ta: 20210227: யுஆர்டி அல்லது எச்பிஐ பயன்முறையில் உள்ள டிஎம்சி ச்டெப்பர் மின்னோடி இயக்கிகள் இப்போது இயக்கப்பட்ட போதெல்லாம் நொடிக்கு ஒரு முறை வினவப்பட்டுள்ளன - ஓட்டுநரைத் தொடர்பு கொள்ள முடியாவிட்டால் அல்லது ஓட்டுநர் பிழையைப் புகாரளித்தால், கிளிப்பர் பணிநிறுத்தம் நிலைக்கு மாறுவார்.
uk: 20210227: драйвери крокового двигуна TMC у режимі UART або SPI тепер запитуються раз на секунду щоразу, коли їх увімкнено. Якщо з драйвером неможливо зв’язатися або якщо драйвер повідомляє про помилку, Klipper перейде в стан вимкнення.

source: 20210219: The `rpi_temperature` module has been renamed to `temperature_host`. Replace any occurrences of `sensor_type: rpi_temperature` with `sensor_type: temperature_host`. The path to the temperature file may be specified in the `sensor_path` config variable. The `rpi_temperature` name is deprecated and will be removed in the near future.
es: 20210219: El módulo `rpi_temperature` ha sido renombrado como `temperature_host`. Sustituya cualquier definición declarada como `sensor_type: rpi_temperature` por `sensor_type: temperature_host`. La ruta al archivo de configuración de temperatura puede ser especificada en la variable de configuración `sensor_path`. El nombre del módulo `rpi_temperature` está en desuso y será eliminado próximamente.
ta: 20210219: `rpi_temperature` தொகுதி` வெப்பநிலை_ஓச்ட்` என மறுபெயரிடப்பட்டுள்ளது. `சென்சார்_ டைப்: rpi_temperature` இன் ஏதேனும் நிகழ்வுகளை` சென்சார்_ டைப்: வெப்பநிலை_ஓச்ட்` உடன் மாற்றவும். வெப்பநிலை கோப்பிற்கான பாதை `சென்சார்_பாத்` கட்டமைப்பு மாறியில் குறிப்பிடப்படலாம். `Rpi_temperature` பெயர் நீக்கப்பட்டு எதிர்காலத்தில் அகற்றப்படும்.
uk: 20210219: модуль `rpi_temperature` було перейменовано на `temperature_host`. Замініть будь-які випадки "sensor_type: rpi_temperature" на "sensor_type: temperature_host". Шлях до файлу температури можна вказати в конфігураційній змінній `sensor_path`. Назва `rpi_temperature` застаріла та буде видалена найближчим часом.

source: 20210201: The `TEST_RESONANCES` command will now disable input shaping if it was previously enabled (and re-enable it after the test). In order to override this behavior and keep the input shaping enabled, one can pass an additional parameter `INPUT_SHAPING=1` to the command.
es: 20210201: El comando `TEST_RESONANCES` ahora deshabilitará la configuración de entrada si ha sido previamente habilitada (y reestablézcala despues de la prueba). Para sobreescribir el método y mantener la configuración de entrada activada, puede añadir un parámetro adicional declarado como `INPUT_SHAPING=1` al comando.
ta: 20210201: `டெச்ட்_ரெசோனன்ச்` கட்டளை முன்னர் இயக்கப்பட்டிருந்தால் உள்ளீட்டு வடிவமைப்பை இப்போது முடக்கிவிடும் (மற்றும் சோதனைக்குப் பிறகு அதை மீண்டும் இயக்கவும்). இந்த நடத்தையை மேலெழுதவும், உள்ளீட்டு வடிவமைப்பை இயக்கவும் வைத்திருக்க, ஒருவர் கூடுதல் அளவுருவை `உள்ளீடு_சேப்பிங் = 1` கட்டளைக்கு அனுப்பலாம்.
uk: 20210201: команда `TEST_RESONANCES` тепер вимкне формування вхідних даних, якщо воно було ввімкнено раніше (і знову ввімкне його після тесту). Щоб перевизначити цю поведінку та зберегти форму введення ввімкненою, можна передати команді додатковий параметр `INPUT_SHAPING=1`.

source: 20210201: The `ACCELEROMETER_MEASURE` command will now append the name of the accelerometer chip to the output file name if the chip was given a name in the corresponding adxl345 section of the printer.cfg.
es: 20210201: El comando `ACCELEROMETER_MEASURE` ahora añadira el nombre del chip del acelerómetro al nombre del archivo de salida si el chip fue nombrado en la sección correspondiente del archivo printer.cfg adxl345.
ta: 20210201: `முடுக்கமானி_மீசூர்` கட்டளை இப்போது அச்சுப்பொறியின் தொடர்புடைய ADXL345 பிரிவில் சிப்புக்கு ஒரு பெயர் வழங்கப்பட்டால், முடுக்கமானி சிப்பின் பெயரை வெளியீட்டு கோப்பு பெயருடன் சேர்க்கும்.
uk: 20210201: команда `ACCELEROMETER_MEASURE` тепер додаватиме назву чіпа акселерометра до назви вихідного файлу, якщо чіпу було дано ім’я у відповідному розділі adxl345 файлу printer.cfg.

source: 20201222: The `step_distance` setting in the stepper config sections is deprecated. It is advised to update the config to use the [`rotation_distance`](Rotation_Distance.md) setting. Support for `step_distance` will be removed in the near future.
es: 20201222: El parámetro de configuración `step_distance` en la sección de configuración del motor paso a paso esta en desuso. Se aconseja que se actualize la configuración para usar el parámetro [`Rotation_distance`](Rotation_Distance.md). La asistencia con el parámetro `step_distance` sera discontinuada en el futuro cercano.
ta: 20201222: ச்டெப்பர் கட்டமைப்பு பிரிவுகளில் `STEP_DISTANCE` அமைப்பு நீக்கப்பட்டது. [`சுழற்சி_டிச்டன்ச்`] (சுழற்சி_டிச்டன்ச்.எம்டி) அமைப்பைப் பயன்படுத்த கட்டமைப்பைப் புதுப்பிக்க அறிவுறுத்தப்படுகிறது. `Step_distance` க்கான உதவி எதிர்காலத்தில் அகற்றப்படும்.
uk: 20201222: Параметр `step_distance` у розділах конфігурації степера застарів. Рекомендується оновити конфігурацію, щоб використовувати налаштування [`rotation_distance`](Rotation_Distance.md). Підтримку `step_distance` буде вилучено найближчим часом.

source: 20201218: The `endstop_phase` setting in the endstop_phase module has been replaced with `trigger_phase`. If using the endstop phases module then it will be necessary to convert to [`rotation_distance`](Rotation_Distance.md) and recalibrate any endstop phases by running the ENDSTOP_PHASE_CALIBRATE command.
es: 20201218: El parámetro `endstop_phase` en el módulo endstop_phase a sido reemplazado con `trigger_phase`. Si se esta usando el módulo de fases del mecanismo de final de carrera va a ser necesario convertir a [`rotation_distance`](Rotation_Distance.md) y volver a calibrar cualquier fase del mecanismo de final de carrera usando el comando ENDSTOP_PHASE_CALIBRATE.
ta: 20201218: EndStop_Phase தொகுதியில் `EndStop_Phase` அமைப்பு` Trigger_Phase` உடன் மாற்றப்பட்டுள்ளது. எண்ட்ச்டாப் கட்ட தொகுதிகள் தொகுதியைப் பயன்படுத்தினால், [`சுழற்சி_டிச்டன்ச்`] (சுழற்சி_டிச்டன்ச்.
uk: 20201218: параметр endstop_phase у модулі endstop_phase замінено на trigger_phase. Якщо використовується модуль фаз кінцевої зупинки, тоді потрібно буде перетворити на [`rotation_distance`](Rotation_Distance.md) і повторно відкалібрувати будь-які фази кінцевої зупинки, виконавши команду ENDSTOP_PHASE_CALIBRATE.

source: 20201218: Rotary delta and polar printers must now specify a `gear_ratio` for their rotary steppers, and they may no longer specify a `step_distance` parameter. See the [config reference](Config_Reference.md#stepper) for the format of the new gear_ratio paramter.
es: 20201218: Las impresoras delta y polar ahora necesitan especificar un `gear_ratio` para sus mecanismos de paso a paso rotativo y ya no pueden especificar un parámetro de `step_distance`. Vea el [config reference](Config_Reference.md#stepper) para el formato del nuevo parámetro gear_ratio.
ta: 20201218: ரோட்டரி டெல்டா மற்றும் துருவ அச்சுப்பொறிகள் இப்போது தங்கள் ரோட்டரி ச்டெப்பர்களுக்காக `கியர்_ராட்டியோ` ஐக் குறிப்பிட வேண்டும், மேலும் அவை இனி` படி_டெச்டன்ச்` அளவுருவைக் குறிப்பிடாது. புதிய கியர்_ராட்டியோ அளவுருவின் வடிவமைப்பிற்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#ச்டெப்பர்) ஐப் பார்க்கவும்.
uk: 20201218: Ротаційні дельта- та полярні принтери тепер повинні вказувати `gear_ratio` для своїх обертових крокових кроків, і вони більше не можуть вказувати параметр `step_distance`. Формат нового параметра gear_ratio див. у [довідці конфігурації](Config_Reference.md#stepper).

source: 20201213: It is not valid to specify a Z "position_endstop" when using "probe:z_virtual_endstop". An error will now be raised if a Z "position_endstop" is specified with "probe:z_virtual_endstop". Remove the Z "position_endstop" definition to fix the error.
es: 20201213: No es válido especificar un "position_endstop" Z al usar "probe:z_virtual_endstop". Un error aparecerá de ahora en adelante si se especifica un "position_endstop" Z con "probe:z_virtual_endstop". Remueva la definición de "position_endstop" Z para arreglar el error.
ta: 20201213: "ஆய்வு: z_virtual_endstop" ஐப் பயன்படுத்தும் போது ஒரு சட் "pasition_endstop" ஐக் குறிப்பிடுவது செல்லுபடியாகாது. ஒரு சட் "pasition_endstop" "ஆய்வு: Z_Virtual_endstop" உடன் குறிப்பிடப்பட்டால் பிழை இப்போது உயர்த்தப்படும். பிழையை சரிசெய்ய சட் "pasition_endstop" வரையறையை அகற்று.
uk: 20201213: Неможливо вказати Z "position_endstop" під час використання "probe:z_virtual_endstop". Тепер виникне помилка, якщо Z "position_endstop" указано з "probe:z_virtual_endstop". Видаліть визначення Z "position_endstop", щоб виправити помилку.

source: 20201120: The `[board_pins]` config section now specifies the mcu name in an explicit `mcu:` parameter. If using board_pins for a secondary mcu, then the config must be updated to specify that name. See the [config reference](Config_Reference.md#board_pins) for further details.
es: 20201120: La sección de configuración de `[board_pins]` ahora especifica el nombre del microcontrolador ("mcu") en un parámetro explícito `mcu:`. Si esta usando board_pins para un mcu secundario, entonces tendrá que actualizar la configuración para especificar ese nombre. Vea [config reference](Config_Reference.md#board_pins) para más detalles.
ta: 20201120: `[போர்டு_பின்ச்]` கட்டமைப்பு பிரிவு இப்போது MCU பெயரை வெளிப்படையான `MCU:` அளவுருவில் குறிப்பிடுகிறது. இரண்டாம் நிலை MCU க்கு போர்டு_பின்களைப் பயன்படுத்தினால், அந்த பெயரைக் குறிப்பிட கட்டமைப்பு புதுப்பிக்கப்பட வேண்டும். மேலும் விவரங்களுக்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#board_pins) ஐப் பார்க்கவும்.
uk: 20201120: розділ конфігурації `[board_pins]` тепер визначає назву mcu в явному параметрі `mcu:`. Якщо board_pins використовується для вторинного мікроконтролера, необхідно оновити конфігурацію, щоб указати це ім’я. Дивіться [довідку конфігурації](Config_Reference.md#board_pins), щоб отримати додаткові відомості.

source: 20201112: The time reported by `print_stats.print_duration` has changed. The duration prior to the first detected extrusion is now excluded.
es: 20201112: El tiempo reportado por `print_stats.print_duration` ha cambiado. El tiempo que ha transcurrido antes de la primera extrusión está ahora excluido.
ta: 20201112: `print_stats.print_duration` ஆல் அறிவிக்கப்பட்ட நேரம் மாறிவிட்டது. முதலில் கண்டறியப்பட்ட வெளியேற்றத்திற்கு முந்தைய காலம் இப்போது விலக்கப்பட்டுள்ளது.
uk: 20201112: час, який повідомляє `print_stats.print_duration`, змінено. Тривалість до першої виявленої екструзії тепер виключена.

source: 20201029: The neopixel `color_order_GRB` config option has been removed. If necessary, update the config to set the new `color_order` option to RGB, GRB, RGBW, or GRBW.
es: 20201029: Se ha removido la opción de configuración del neopixel `color_order_GRB`. Si es necesario, actualice la configuración para establecer la nueva opción de `color_order` a RGB, GRB, RGBW, o GRBW.
ta: 20201029: நியோபிக்சல் `color_order_grb` கட்டமைப்பு விருப்பம் அகற்றப்பட்டது. தேவைப்பட்டால், புதிய `color_order` விருப்பத்தை RGB, GRB, RGBW அல்லது GRBW க்கு அமைக்க கட்டமைப்பைப் புதுப்பிக்கவும்.
uk: 20201029: опцію конфігурації neopixel `color_order_GRB` було видалено. Якщо необхідно, оновіть конфігурацію, щоб встановити новий параметр `color_order` на RGB, GRB, RGBW або GRBW.

source: 20201029: The serial option in the mcu config section no longer defaults to /dev/ttyS0. In the rare situation where /dev/ttyS0 is the desired serial port, it must be specified explicitly.
es: 20201029: La opción serial en la sección de configuración del microcontrolador ("mcu") dejo de ser predeterminada a el valor /dev/ttyS0. En la rara situación donde /dev/ttyS0 es el puerto serial deseado, debe de especificarse explícitamente.
ta: 20201029: MCU கட்டமைப்பு பிரிவில் உள்ள தொடர் விருப்பம் இனி /dev /ttys0 க்கு இயல்புநிலையாக இல்லை. /Dev /ttys0 விரும்பிய சீரியல் போர்ட்டாக இருக்கும் அரிதான சூழ்நிலையில், அது வெளிப்படையாக குறிப்பிடப்பட வேண்டும்.
uk: 20201029: Параметр послідовного порту в розділі конфігурації mcu більше не використовується за замовчуванням /dev/ttyS0. У тих рідкісних ситуаціях, коли /dev/ttyS0 є потрібним послідовним портом, його потрібно вказати явно.

source: 20201020: Klipper v0.9.0 released.
es: 20201020: La version v0.9.0 de Klipper salió.
ta: 20201020: வெட்டுக்கள் V0.9.0 வெளியிடப்பட்டது.
uk: 20201020: Випущено Klipper v0.9.0.

source: 20200902: The RTD resistance-to-temperature calculation for MAX31865 converters has been corrected to not read low. If you are using such a device, you should recalibrate your print temperature and PID settings.
es: 20200902: El cálculo de la proporción de la resistencia a la temperatura de los detectores de temperatura de la resistencia (RTD) para los convertidores MAX31865 ha sido corregido para no leer bajo. Si está usando este tipo de dispositivo, debería volver a calibrar la temperature de impresión y la configuración de los controladores proporcional-integral-derivativa (PID).
ta: 20200902: MAX31865 மாற்றிகளுக்கான ஆர்டிடி எதிர்ப்பு-வெப்பநிலை கணக்கீடு குறைவாக படிக்காமல் சரி செய்யப்பட்டது. நீங்கள் அத்தகைய சாதனத்தைப் பயன்படுத்துகிறீர்கள் என்றால், உங்கள் அச்சு வெப்பநிலை மற்றும் பிஐடி அமைப்புகளை மறுபரிசீலனை செய்ய வேண்டும்.
uk: 20200902: Розрахунок опору термометра RTD для перетворювачів MAX31865 виправлено, щоб не зчитувати низький рівень. Якщо ви використовуєте такий пристрій, вам слід повторно відкалібрувати температуру друку та параметри PID.

source: 20200816: The gcode macro `printer.gcode` object has been renamed to `printer.gcode_move`. Several undocumented variables in `printer.toolhead` and `printer.gcode` have been removed. See docs/Command_Templates.md for a list of available template variables.
es: 20200816: El objeto del macro de gcode `printer.gcode` ha sido renombrado a `printer.gcode_move`. Se han removido diversas variables indocumentadas en `printer.toolhear` y `printer.gcode`. Vea docs/Command_Templates.md para una lista de las variables disponibles en las plantillas.
ta: 20200816: GCODE குறுநிரல் `prinatur.gcode` பொருள்` prinated.gcode_move` என மறுபெயரிடப்பட்டுள்ளது. `அச்சுப்பொறி. கிடைக்கக்கூடிய வார்ப்புரு மாறிகளின் பட்டியலுக்கு டாக்ச்/கட்டளை_டெம்ப்ளேட்ச்.எம்டியைப் பார்க்கவும்.
uk: 20200816: об’єкт макросу gcode `printer.gcode` було перейменовано на `printer.gcode_move`. Кілька недокументованих змінних у `printer.toolhead` і `printer.gcode` було видалено. Перегляньте docs/Command_Templates.md, щоб отримати список доступних змінних шаблону.

source: 20200816: The gcode macro "action_" system has changed. Replace any calls to `printer.gcode.action_emergency_stop()` with `action_emergency_stop()`, `printer.gcode.action_respond_info()` with `action_respond_info()`, and `printer.gcode.action_respond_error()` with `action_raise_error()`.
es: 20200816: El sistema del macro gcode "action_" ha cambiado. Reemplace cualquier llamada a `printer.gcode.action_emergency_stop()` con `action_emergency_stop()`, `printer.gcode.action_respond_info()` con `action_respond_info()`, y `printer.gcode.action_respond_error()` con `action_raise_error()`.
ta: 20200816: GCODE மேக்ரோ "ACTION_" அமைப்பு மாறிவிட்டது. எந்தவொரு அழைப்பையும் `அச்சுப்பொறி. ) `.
uk: 20200816: систему gcode макросу "action_" змінено. Замініть будь-які виклики `printer.gcode.action_emergency_stop()` на `action_emergency_stop()`, `printer.gcode.action_respond_info()` на `action_respond_info()`, а `printer.gcode.action_respond_error()` на `action_raise_error() )`.

source: 20200809: The menu system has been rewritten. If the menu has been customized then it will be necessary to update to the new configuration. See config/example-menu.cfg for configuration details and see klippy/extras/display/menu.cfg for examples.
es: 20200809: El sistema de menús se reescribió. Si el menú se ha personalizado entonces será necesario actualizarlo a la nueva configuración. Vea detalles de la configuración en config/example-menu.cfg y vea ejemplos en klippy/extras/display/menu.cfg.
ta: 20200809: பட்டியல் அமைப்பு மீண்டும் எழுதப்பட்டுள்ளது. பட்டியல் தனிப்பயனாக்கப்பட்டிருந்தால், புதிய உள்ளமைவுக்கு புதுப்பிக்க வேண்டியது தேவை. உள்ளமைவு விவரங்களுக்கு config/example-menu.cfg ஐப் பார்க்கவும், எடுத்துக்காட்டுகளுக்கு கிளிப்பி/கூடுதல்/காட்சி/மெனு.
uk: 20200809: систему меню було переписано. Якщо меню було налаштовано, необхідно оновити його до нової конфігурації. Перегляньте config/example-menu.cfg для деталей конфігурації та див. klippy/extras/display/menu.cfg для прикладів.

source: 20200731: The behavior of the `progress` attribute reported by the `virtual_sdcard` printer object has changed. Progress is no longer reset to 0 when a print is paused. It will now always report progress based on the internal file position, or 0 if no file is currently loaded.
es: 20200731: El comportamiento del atributo `progress` reportado por el objeto de la impresora `virtual_sdcard` ha cambiado. El progreso ya no reinicia a 0 cuando se pausa una impresión. Ahora, el progreso se reportará basado en la posición dentro del archivo o 0 cuando no hay un archivo cargado.
ta: 20200731: `மெய்நிகர்_ச்ட்கார்ட்` அச்சுப்பொறி பொருளால் அறிவிக்கப்பட்ட` முன்னேற்றம்` பண்புக்கூறின் நடத்தை மாறிவிட்டது. அச்சு இடைநிறுத்தப்படும்போது முன்னேற்றம் இனி 0 ஆக மீட்டமைக்கப்படாது. இது இப்போது உள் கோப்பு நிலையின் அடிப்படையில் முன்னேற்றத்தைப் புகாரளிக்கும், அல்லது எந்த கோப்பும் தற்போது ஏற்றப்படாவிட்டால் 0.
uk: 20200731: Поведінка атрибута `progress`, про яку повідомляє об’єкт принтера `virtual_sdcard`, змінилася. Перебіг більше не скидається до 0, коли друк призупинено. Тепер він завжди повідомлятиме про прогрес на основі внутрішньої позиції файлу або 0, якщо файл наразі не завантажено.

source: 20200725: The servo `enable` config parameter and the SET_SERVO `ENABLE` parameter have been removed. Update any macros to use `SET_SERVO SERVO=my_servo WIDTH=0` to disable a servo.
es: 20200725: El parámetro de configuración del servo `enable` y el parámetro SET_SERVO `ENABLE` han sido removidos. Actualice cualquier macro con `SET_SERVO SERVO=my_servo WITDH=0`para desactivar un servo.
ta: 20200725: சர்வோ `இயக்கு` கட்டமைப்பு அளவுரு மற்றும் set_servo` இயக்கு` அளவுரு அகற்றப்பட்டுள்ளன. ஒரு சேவையை முடக்க `set_servo servo = my_servo அகலம் = 0` பயன்படுத்த எந்த மேக்ரோக்களையும் புதுப்பிக்கவும்.
uk: 20200725: Параметр конфігурації `enable` сервоприводу та параметр `ENABLE` SET_SERVO було видалено. Оновіть усі макроси, щоб використовувати `SET_SERVO SERVO=my_servo WIDTH=0`, щоб вимкнути сервопривід.
