Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: ta

source: Common bus parameters
ta: பொதுவான பச் அளவுருக்கள்

source: Common SPI settings
ta: பொதுவான SPI அமைப்புகள்

source: The following parameters are generally available for devices using an SPI bus.
ta: பின்வரும் அளவுருக்கள் பொதுவாக SPI பச்சைப் பயன்படுத்தும் சாதனங்களுக்கு கிடைக்கின்றன.

source: Common I2C settings
ta: பொதுவான I2C அமைப்புகள்

source: The following parameters are generally available for devices using an I2C bus.
ta: பின்வரும் அளவுருக்கள் பொதுவாக I2C பச்சைப் பயன்படுத்தும் சாதனங்களுக்கு கிடைக்கின்றன.

source: [duplicate_pin_override]
ta: [duplical_pin_override]

source: This tool allows a single micro-controller pin to be defined multiple times in a config file without normal error checking. This is intended for diagnostic and debugging purposes. This section is not needed where Klipper supports using the same pin multiple times, and using this override may cause confusing and unexpected results.
ta: இந்த கருவி ஒற்றை மைக்ரோ-கன்ட்ரோலர் முள் சாதாரண பிழை சரிபார்க்காமல் ஒரு கட்டமைப்பு கோப்பில் பல முறை வரையறுக்க அனுமதிக்கிறது. இது கண்டறியும் மற்றும் பிழைத்திருத்த நோக்கங்களுக்காக வடிவமைக்கப்பட்டுள்ளது. கிளிப்பர் ஒரே முள் பல முறை பயன்படுத்தி ஆதரிக்கும் இடத்தில் இந்த பிரிவு தேவையில்லை, மேலும் இந்த மேலெழுதலைப் பயன்படுத்துவது குழப்பமான மற்றும் எதிர்பாராத முடிவுகளை ஏற்படுத்தக்கூடும்.

source: SAMD SERCOM configuration to specify which pins to use on a given SERCOM. One may define any number of sections with a "samd_sercom" prefix. Each SERCOM must be configured prior to using it as SPI or I2C peripheral. Place this config section above any other section that makes use of SPI or I2C buses.
ta: கொடுக்கப்பட்ட செர்காமில் எந்த ஊசிகளைப் பயன்படுத்த வேண்டும் என்பதைக் குறிப்பிட SAMD செர்காம் உள்ளமைவு. "SAMD_SERCOM" முன்னொட்டு கொண்ட எந்தவொரு பிரிவுகளையும் ஒருவர் வரையறுக்கலாம். ஒவ்வொரு செர்காமையும் SPI அல்லது I2C புறமாகப் பயன்படுத்துவதற்கு முன்பு கட்டமைக்கப்பட வேண்டும். SPI அல்லது I2C பேருந்துகளைப் பயன்படுத்தும் வேறு எந்த பிரிவுக்கும் மேலே இந்த கட்டமைப்பு பகுதியை வைக்கவும்.

source: Configuration reference
ta: உள்ளமைவு குறிப்பு

source: Controller cooling fan (one may define any number of sections with a "controller_fan" prefix). A "controller fan" is a fan that will be enabled whenever its associated heater or its associated stepper driver is active. The fan will stop whenever an idle_timeout is reached to ensure no overheating will occur after deactivating a watched component.
ta: கட்டுப்படுத்தி குளிரூட்டும் விசிறி (ஒருவர் "கட்டுப்படுத்தி_ஃபான்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). ஒரு "கட்டுப்படுத்தி விசிறி" என்பது ஒரு சுவைஞர், அது தொடர்புடைய ஈட்டர் அல்லது அதனுடன் தொடர்புடைய ச்டெபர் டிரைவர் செயலில் இருக்கும் போதெல்லாம் இயக்கப்படும். பார்த்த ஒரு கூறுகளை செயலிழக்கச் செய்தபின் அதிக வெப்பம் ஏற்படாது என்பதை உறுதிப்படுத்த ஒரு செயலற்ற_TIMEOUT ஐ எட்டும்போதெல்லாம் விசிறி நிறுத்தப்படும்.

source: See the [rotation distance document](Rotation_Distance.md) for information on calculating the `rotation_distance` parameter. See the [Multi-MCU homing](Multi_MCU_Homing.md) document for information on homing using multiple micro-controllers.
ta: `சுழற்சி_டிச்டன்ச்` அளவுருவைக் கணக்கிடுவது பற்றிய தகவலுக்கு [சுழற்சி தூர ஆவணம்] (சுழற்சி_டிச்டன்ச்.ம்டி) ஐப் பார்க்கவும். பல மைக்ரோ-கன்ட்ரோலர்களைப் பயன்படுத்தி ஓமிங் பற்றிய தகவலுக்கு [மல்டி-எம்.சி.யு ஓமிங்] (மல்டி_எம்சி_ஓமிங்.ம்டி) ஆவணத்தைப் பார்க்கவும்.

source: Hall filament width sensor (see [Hall Filament Width Sensor](Hall_Filament_Width_Sensor.md)).
ta: ஆல் ஃபிலமென்ட் அகல சென்சார் ([ஆல் ஃபிலமென்ட் அகல சென்சார்] (ஆல்_ஃபிலமென்ட்_விட்_சென்சர்.ம்டி) ஐப் பார்க்கவும்).

source: Replicape support - see the [beaglebone guide](Beaglebone.md) and the [generic-replicape.cfg](../config/generic-replicape.cfg) file for an example.
ta: பிரதி ஆதரவு-[பீகல்போன் வழிகாட்டி] (BeagleBone.MD) மற்றும் [generic-replicape.cfg] (../ config/generic-replicape.cfg) கோப்பைப் பார்க்கவும்.

source: POLAR KINEMATICS ARE A WORK IN PROGRESS. Moves around the 0, 0 position are known to not work properly.
ta: துருவ இயக்கவியல் ஒரு வேலை முன்னேற்றத்தில் உள்ளது. 0, 0 நிலையைச் சுற்றி நகர்வுகள் சரியாக வேலை செய்யாது என்று அறியப்படுகிறது.

source: CABLE WINCH SUPPORT IS EXPERIMENTAL. Homing is not implemented on cable winch kinematics. In order to home the printer, manually send movement commands until the toolhead is at 0, 0, 0 and then issue a `G28` command.
ta: கேபிள் வின்ச் உதவி சோதனை. கேபிள் வின்ச் இயக்கவியலில் ஓமிங் செயல்படுத்தப்படவில்லை. அச்சுப்பொறியை வீட்டிற்கு கொண்டு, கருவித் தலை 0, 0, 0 வரை இருக்கும் வரை கைமுறையாக இயக்கம் கட்டளைகளை அனுப்பவும், பின்னர் `G28` கட்டளையை வழங்கவும்.

source: Where x is the 0, 0 point on the bed
ta: ஃச் என்பது படுக்கையில் 0, 0 புள்ளி

source: Safe Z homing. One may use this mechanism to home the Z axis at a specific X, Y coordinate. This is useful if the toolhead, for example has to move to the center of the bed before Z can be homed.
ta: பாதுகாப்பான சட் ஓமிங். ஒரு குறிப்பிட்ட ஃச், ஒய் ஒருங்கிணைப்பில் சட் அச்சை வீட்டிற்கு வைக்க ஒருவர் இந்த பொறிமுறையைப் பயன்படுத்தலாம். கருவி, சட் ஐ வீட்டுக்கு வருவதற்கு முன்பு படுக்கையின் மையத்திற்கு செல்ல வேண்டும் என்றால் இது பயனுள்ளதாக இருக்கும்.

source: See the [bed mesh guide](Bed_Mesh.md) and [command reference](G-Codes.md#bed_mesh) for additional information.
ta: கூடுதல் தகவலுக்கு [படுக்கை மெச் வழிகாட்டி] (BED_MESH.MD) மற்றும் [கட்டளை குறிப்பு] (G--Codes.MD#BED_MESH) ஐப் பார்க்கவும்.

source: See the [command reference](G-Codes.md#bed_tilt) for additional information.
ta: கூடுதல் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#bed_tilt) ஐப் பார்க்கவும்.

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws) and [command reference](G-Codes.md#bed_screws) for additional information.
ta: கூடுதல் தகவலுக்கு [சமநிலை வழிகாட்டி] (கையேடு_லெவல்.

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) and [command reference](G-Codes.md#screws_tilt_adjust) for additional information.
ta: கூடுதல் தகவலுக்கு [சமநிலை வழிகாட்டி] (கையேடு_லெவல்.

source: Multiple Z stepper tilt adjustment. This feature enables independent adjustment of multiple z steppers (see the "stepper_z1" section) to adjust for tilt. If this section is present then a Z_TILT_ADJUST extended [G-Code command](G-Codes.md#z_tilt) becomes available.
ta: பல சட் ச்டெப்பர் சாய்வு சரிசெய்தல். இந்த நற்பொருத்தம் சாய்வை சரிசெய்ய பல சட் ச்டெப்பர்களின் சுயாதீன சரிசெய்தலை ("ச்டெபர்_இ 1" பகுதியைப் பார்க்கவும்) செயல்படுத்துகிறது. இந்த பிரிவு இருந்தால், ஒரு z_tilt_adjust நீட்டிக்கப்பட்ட [g-code கட்டளை] (g-codes.md#z_tilt) கிடைக்கும்.

source: Printer Skew Correction. It is possible to use software to correct printer skew across 3 planes, xy, xz, yz. This is done by printing a calibration model along a plane and measuring three lengths. Due to the nature of skew correction these lengths are set via gcode. See [Skew Correction](Skew_Correction.md) and [Command Reference](G-Codes.md#skew_correction) for details.
ta: அச்சுப்பொறி வளைவு திருத்தம். XY, XZ, YZ, 3 விமானங்களில் அச்சுப்பொறி வளைவை சரிசெய்ய மென்பொருளைப் பயன்படுத்த முடியும். ஒரு விமானத்துடன் ஒரு அளவுத்திருத்த மாதிரியை அச்சிட்டு மூன்று நீளங்களை அளவிடுவதன் மூலம் இது செய்யப்படுகிறது. வளைவு திருத்தத்தின் தன்மை காரணமாக இந்த நீளங்கள் GCODE வழியாக அமைக்கப்படுகின்றன. விவரங்களுக்கு [SKEW திருத்தம்] (SKEW_CORRECTION.MD) மற்றும் [கட்டளை குறிப்பு] (G-CODES.MD#SKEW_CORRECTION) ஐப் பார்க்கவும்.

source: See the [endstop phases guide](Endstop_Phase.md) and [command reference](G-Codes.md#endstop_phase) for additional information.
ta: கூடுதல் தகவலுக்கு [எண்ட்ச்டாப் கட்ட வழிகாட்டி] (endstop_phase.md) மற்றும் [கட்டளை குறிப்பு] (g-codes.md#endstop_phase) ஐப் பார்க்கவும்.

source: Execute a gcode on a set delay. See the [command template guide](Command_Templates.md#delayed-gcodes) and [command reference](G-Codes.md#delayed_gcode) for more information.
ta: ஒரு தொகுப்பு தாமதத்தில் GCODE ஐ இயக்கவும். மேலும் தகவலுக்கு [கட்டளை வார்ப்புரு வழிகாட்டி] (Command_Templates.md#தாமதமான-GCODES) மற்றும் [கட்டளை குறிப்பு] (g-codes.md#தாமதமான_சி கோட்) ஐப் பார்க்கவும்.

source: Support saving variables to disk so that they are retained across restarts. See [command templates](Command_Templates.md#save-variables-to-disk) and [G-Code reference](G-Codes.md#save_variables) for further information.
ta: மறுதொடக்கங்களில் அவை தக்கவைக்கப்படும் வகையில் வட்டுக்கு சேமிக்கும் மாறிகள் ஆதரிக்கின்றன. மேலும் தகவலுக்கு [கட்டளை வார்ப்புருக்கள்] (கட்டளை_டெம்ப்ளேட்ச்.

source: See the [command reference](G-Codes.md#sdcard_loop) for supported commands. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin compatible M808 G-Code macro.
ta: உதவி கட்டளைகளுக்கு [கட்டளை குறிப்பு] (g-codes.md#sdcard_loop) ஐப் பார்க்கவும். மார்லின் இணக்கமான M808 G-Code மேக்ரோவுக்கு [மாதிரி-macros.cfg] (../ config/salem-macros.cfg) கோப்பைப் பார்க்கவும்.

source: Support manually moving stepper motors for diagnostic purposes. Note, using this feature may place the printer in an invalid state - see the [command reference](G-Codes.md#force_move) for important details.
ta: கண்டறியும் நோக்கங்களுக்காக ச்டெப்பர் மோட்டார்கள் கைமுறையாக நகரும் உதவி. குறிப்பு, இந்த அம்சத்தைப் பயன்படுத்துவது அச்சுப்பொறியை தவறான நிலையில் வைக்கலாம் - முக்கியமான விவரங்களுக்கு [கட்டளை குறிப்பு] (g-codes.md#force_move) ஐப் பார்க்கவும்.

source: Pause/Resume functionality with support of position capture and restore. See the [command reference](G-Codes.md#pause_resume) for more information.
ta: நிலை பிடிப்பு மற்றும் மீட்டமைப்பதன் மூலம் செயல்பாட்டை இடைநிறுத்தவும்/மீண்டும் தொடங்கவும். மேலும் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#pause_resume) ஐப் பார்க்கவும்.

source: Firmware filament retraction. This enables G10 (retract) and G11 (unretract) GCODE commands issued by many slicers. The parameters below provide startup defaults, although the values can be adjusted via the SET_RETRACTION [command](G-Codes.md#firmware_retraction)), allowing per-filament settings and runtime tuning.
ta: ஃபார்ம்வேர் ஃபிலமென்ட் திரும்பப் பெறுதல். இது பல ச்லைசர்களால் வழங்கப்பட்ட G10 (பின்வாங்கல்) மற்றும் G11 (UntRetract) GCODE கட்டளைகளை செயல்படுத்துகிறது. கீழேயுள்ள அளவுருக்கள் தொடக்க இயல்புநிலைகளை வழங்குகின்றன, இருப்பினும் மதிப்புகளை set_retraction [கட்டளை] (g-codes.md#firmware_retraction) வழியாக சரிசெய்ய முடியும், இது ஒரு பிலேமென்ட் அமைப்புகள் மற்றும் இயக்க நேர சரிப்படுத்தும் அனுமதிக்கிறது.

source: Enable the "M118" and "RESPOND" extended [commands](G-Codes.md#respond).
ta: "M118" மற்றும் "பதிலளிக்கும்" நீட்டிக்கப்பட்ட [கட்டளைகள்] (G-codes.md#பதிலளிக்கவும்) இயக்கவும்.

source: Enables [resonance compensation](Resonance_Compensation.md). Also see the [command reference](G-Codes.md#input_shaper).
ta: [அதிர்வு இழப்பீடு] (அதிர்வு_பென்சேசன். எம்.டி) இயக்குகிறது. [கட்டளை குறிப்பு] (g-codes.md#input_shaper) ஐயும் காண்க.

source: Support for ADXL345 accelerometers. This support allows one to query accelerometer measurements from the sensor. This enables an ACCELEROMETER_MEASURE command (see [G-Codes](G-Codes.md#adxl345) for more information). The default chip name is "default", but one may specify an explicit name (eg, [adxl345 my_chip_name]).
ta: ADXL345 முடுக்கமானிகளுக்கான உதவி. இந்த உதவி சென்சாரிலிருந்து முடுக்கமானி அளவீடுகளை வினவ அனுமதிக்கிறது. இது ஒரு முடுக்கமானி_மேசர் கட்டளையை செயல்படுத்துகிறது (மேலும் தகவலுக்கு [g-codes] (g-codes.md#adxl345) ஐப் பார்க்கவும்). இயல்புநிலை சிப் பெயர் "இயல்புநிலை", ஆனால் ஒருவர் வெளிப்படையான பெயரைக் குறிப்பிடலாம் (எ.கா., [ADXL345 MY_CHIP_NAME]).

source: Support for resonance testing and automatic input shaper calibration. In order to use most of the functionality of this module, additional software dependencies must be installed; refer to [Measuring Resonances](Measuring_Resonances.md) and the [command reference](G-Codes.md#resonance_tester) for more information. See the [Max smoothing](Measuring_Resonances.md#max-smoothing) section of the measuring resonances guide for more information on `max_smoothing` parameter and its use.
ta: அதிர்வு சோதனை மற்றும் தானியங்கி உள்ளீட்டு சேப்பர் அளவுத்திருத்தத்திற்கான உதவி. இந்த தொகுதியின் பெரும்பாலான செயல்பாடுகளைப் பயன்படுத்த, கூடுதல் மென்பொருள் சார்புநிலைகள் நிறுவப்பட வேண்டும்; மேலும் தகவலுக்கு [அதிர்வுகளை அளவிடுதல்] (அளவீட்டு_ரெசோனன்ச்.எம்டி) மற்றும் [கட்டளை குறிப்பு] (g-codes.md#அதிர்வு_டெச்டர்) ஐப் பார்க்கவும். `மேக்ச்_ச்மூதிங்` அளவுரு மற்றும் அதன் பயன்பாடு பற்றிய கூடுதல் தகவலுக்கு அளவீட்டு அதிர்வு வழிகாட்டியின் [அதிகபட்ச மென்மையான] (அளவீட்டு_ரெசோனன்ச்.

source: See the [command reference](G-Codes.md#extruder) for more information.
ta: மேலும் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#extruder) ஐப் பார்க்கவும்.

source: Manual steppers (one may define any number of sections with a "manual_stepper" prefix). These are steppers that are controlled by the MANUAL_STEPPER g-code command. For example: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". See [G-Codes](G-Codes.md#manual_stepper) file for a description of the MANUAL_STEPPER command. The steppers are not connected to the normal printer kinematics.
ta: கையேடு ச்டெப்பர்கள் (ஒருவர் "கையேடு_ச்டெப்பர்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). இவை கையேடு_ச்டெப்பர் சி-கோட் கட்டளையால் கட்டுப்படுத்தப்படும் ச்டெப்பர்கள். எடுத்துக்காட்டாக: "கையேடு_ச்டெப்பர் ச்டெப்பர் = மை_ச்டெப்பர் நகர்வு = 10 விரைவு = 5". கையேடு_ச்டெப்பர் கட்டளையின் விளக்கத்திற்கு [g-codes] (g-codes.md#manual_stepper) கோப்பைப் பார்க்கவும். ச்டெப்பர்கள் சாதாரண அச்சுப்பொறி இயக்கவியலுடன் இணைக்கப்படவில்லை.

source: Generic heaters (one may define any number of sections with a "heater_generic" prefix). These heaters behave similarly to standard heaters (extruders, heated beds). Use the SET_HEATER_TEMPERATURE command (see [G-Codes](G-Codes.md#heaters) for details) to set the target temperature.
ta: பொதுவான ஈட்டர்கள் (ஒருவர் "ஈட்டர்_செனெரிக்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). இந்த ஈட்டர்கள் நிலையான ஈட்டர்களைப் போலவே செயல்படுகின்றன (எக்ச்ட்ரூடர்கள், சூடான படுக்கைகள்). இலக்கு வெப்பநிலையை அமைக்க SET_HEATER_TEMPERATURE கட்டளையைப் பயன்படுத்தவும் (விவரங்களுக்கு [g-codes] (g-codes.md#ஈட்டர்கள்) ஐப் பார்க்கவும்).

source: LM75/LM75A two wire (I2C) connected temperature sensors. These sensors have a range of -55~125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers.
ta: LM75/LM75A இரண்டு கம்பி (I2C) இணைக்கப்பட்ட வெப்பநிலை சென்சார்கள். இந்த சென்சார்கள் -55 ~ 125 சி வரம்பைக் கொண்டுள்ளன, எனவே எ.கா. அறை வெப்பநிலை கண்காணிப்பு. அவை எளிய விசிறி/ஈட்டர் கன்ட்ரோலர்களாகவும் செயல்பட முடியும்.

source: See the [command reference](G-Codes.md#temperature_fan) for additional information.
ta: கூடுதல் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#வெப்பநிலை_பான்) ஐப் பார்க்கவும்.

source: Manually controlled fan (one may define any number of sections with a "fan_generic" prefix). The speed of a manually controlled fan is set with the SET_FAN_SPEED [gcode command](G-Codes.md#fan_generic).
ta: கைமுறையாக கட்டுப்படுத்தப்பட்ட விசிறி (ஒருவர் "ஃபேன்_செனெரிக்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). கைமுறையாக கட்டுப்படுத்தப்பட்ட விசிறியின் விரைவு set_fan_speed [gcode கட்டளை] (g-codes.md#fan_generic) உடன் அமைக்கப்பட்டுள்ளது.

source: Servos (one may define any number of sections with a "servo" prefix). The servos may be controlled using the SET_SERVO [g-code command](G-Codes.md#servo). For example: SET_SERVO SERVO=my_servo ANGLE=180
ta: சர்வோச் (ஒருவர் "சர்வோ" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). SEVOS ஐ set_servo [g-code கட்டளை] (g-codes.md#servo) ஐப் பயன்படுத்தி கட்டுப்படுத்தலாம். எடுத்துக்காட்டாக: set_servo servo = my_servo கோணம் = 180

source: Run-time configurable output pins (one may define any number of sections with an "output_pin" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1" type extended [g-code commands](G-Codes.md#output_pin).
ta: ரன்-டைம் கட்டமைக்கக்கூடிய வெளியீட்டு ஊசிகள் (ஒன்று "வெளியீடு_பின்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). இங்கே கட்டமைக்கப்பட்ட முள் கள் வெளியீட்டு ஊசிகளாக அமைக்கப்படும், மேலும் "Set_pin முள் = My_Pin மதிப்பு = .1" வகை நீட்டிக்கப்பட்ட [சி-குறியீட்டு கட்டளைகள்] (g- codes.md#output_pin) ஐப் பயன்படுத்தி அவற்றை ரன்-நேரத்தில் மாற்றலாம்.

source: Configuration of Trinamic stepper motor drivers in UART/SPI mode. Additional information is in the [TMC Drivers guide](TMC_Drivers.md) and in the [command reference](G-Codes.md#tmcxxxx).
ta: UART/SPI பயன்முறையில் டிரினாமிக் ச்டெப்பர் மின்னோடி இயக்கிகளின் உள்ளமைவு. கூடுதல் தகவல்கள் [TMC இயக்கிகள் வழிகாட்டி] (TMC_DRIVERS.MD) மற்றும் [கட்டளை குறிப்பு] (G-CODES.MD#TMCXXXX) இல் உள்ளன.

source: See the [command reference](G-Codes.md#filament_switch_sensor) for more information.
ta: மேலும் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#filemament_switch_sensor) ஐப் பார்க்கவும்.

source: The extruder section is used to describe the heater parameters for the nozzle hotend along with the stepper controlling the extruder. See the [command reference](G-Codes.md#extruder) for additional information. See the [pressure advance guide](Pressure_Advance.md) for information on tuning pressure advance.
ta: எக்ச்ட்ரூடரை கட்டுப்படுத்தும் ச்டெப்பருடன் முனை ஆட்எண்டிற்கான ஈட்டர் அளவுருக்களை விவரிக்க எக்ச்ட்ரூடர் பிரிவு பயன்படுத்தப்படுகிறது. கூடுதல் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#extruder) ஐப் பார்க்கவும். அழுத்தம் முன்கூட்டியே ட்யூனிங் குறித்த தகவலுக்கு [பிரசர் அட்வான்ச் கையேடு] (பிரசர்_ட்வான்ச்.எம்டி) ஐப் பார்க்கவும்.

source: PCA9632 LED support. The PCA9632 is used on the FlashForge Dreamer.
ta: PCA9632 எல்.ஈ.டி உதவி. PCA9632 ஃப்ளாச்ஃபோர்ச் ட்ரீமரில் பயன்படுத்தப்படுகிறது.

source: LEDs
ta: எல்.ஈ.டிக்கள்

source: [led]
ta: [எல்.ஈ.டி]

source: Support for LEDs (and LED strips) controlled via micro-controller PWM pins (one may define any number of sections with an "led" prefix). See the [command reference](G-Codes.md#led) for more information.
ta: மைக்ரோ-கன்ட்ரோலர் பி.டபிள்யூ.எம் ஊசிகள் வழியாக கட்டுப்படுத்தப்படும் எல்.ஈ. மேலும் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#led) ஐப் பார்க்கவும்.

source: Neopixel (aka WS2812) LED support (one may define any number of sections with a "neopixel" prefix). See the [command reference](G-Codes.md#led) for more information.
ta: நியோபிக்சல் (அக்கா WS2812) எல்.ஈ.டி உதவி (ஒருவர் "நியோபிக்சல்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). மேலும் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#led) ஐப் பார்க்கவும்.

source: Dotstar (aka APA102) LED support (one may define any number of sections with a "dotstar" prefix). See the [command reference](G-Codes.md#led) for more information.
ta: டாட்ச்டார் (AKA APA102) எல்.ஈ.டி உதவி (ஒருவர் "டாட்ச்டார்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). மேலும் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#led) ஐப் பார்க்கவும்.

source: [pca9533]
ta: [பாச்தா]

source: [pca9632]
ta: [பாச்டகா]

source: Additional servos, buttons, and other pins
ta: கூடுதல் சர்வோச், பொத்தான்கள் மற்றும் பிற ஊசிகளும்

source: Display data text "macros" (one may define any number of sections with a display_template prefix). See the [command templates](Command_Templates.md) document for information on template evaluation.
ta: தரவு உரையை "மேக்ரோச்" காண்பி (டிச்ப்ளே_டெம்ப்ளேட் முன்னொட்டு கொண்ட எந்தவொரு பிரிவுகளையும் ஒன்று வரையறுக்கலாம்). வார்ப்புரு மதிப்பீடு குறித்த தகவலுக்கு [கட்டளை வார்ப்புருக்கள்] (Command_Templates.md) ஆவணத்தைப் பார்க்கவும்.

source: This feature allows one to reduce repetitive definitions in display_data sections. One may use the builtin `render()` function in display_data sections to evaluate a template. For example, if one were to define `[display_template my_template]` then one could use `{ render('my_template') }` in a display_data section.
ta: காட்சி_டேட்டா பிரிவுகளில் மீண்டும் மீண்டும் வரையறைகளை குறைக்க இந்த நற்பொருத்தம் ஒன்றை அனுமதிக்கிறது. ஒரு வார்ப்புருவை மதிப்பிடுவதற்கு ஒருவர் டிச்ப்ளே_டேட்டா பிரிவுகளில் பில்டின் `ரெண்டர் ()` செயல்பாட்டைப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, `[display_template my_template]` என வரையறுக்க வேண்டுமானால், ஒரு காட்சி_டேட்டா பிரிவில் `{ரெண்டர் ('my_template')} veal ஐப் பயன்படுத்தலாம்.

source: This feature can also be used for continuous LED updates using the [SET_LED_TEMPLATE](G-Codes.md#set_led_template) command.
ta: [Set_led_template] (g-codes.md#set_led_template) கட்டளையைப் பயன்படுத்தி தொடர்ச்சியான எல்இடி புதுப்பிப்புகளுக்கும் இந்த நற்பொருத்தம் பயன்படுத்தப்படலாம்.

source: [angle]
ta: [கோணம்]

source: [smart_effector]
ta: [ச்மார்ட்_ஃபெக்டர்]

source: The "Smart Effector" from Duet3d implements a Z probe using a force sensor. One may define this section instead of `[probe]` to enable the Smart Effector specific features. This also enables [runtime commands](G-Codes.md#smart_effector) to adjust the parameters of the Smart Effector at run time.
ta: டூயட் 3 டி இலிருந்து "அறிவுள்ள செயல்திறன்" ஒரு படை சென்சாரைப் பயன்படுத்தி ஒரு சட் ஆய்வை செயல்படுத்துகிறது. அறிவுள்ள செயல்திறன் குறிப்பிட்ட அம்சங்களை செயல்படுத்த `[ஆய்வு]` என்பதற்கு பதிலாக இந்த பகுதியை ஒருவர் வரையறுக்கலாம். இது அறிவுள்ள செயல்திறனின் அளவுருக்களை ரன் நேரத்தில் சரிசெய்ய [இயக்க நேர கட்டளைகள்] (g-codes.md#smart_effector) ஐயும் செயல்படுத்துகிறது.

source: Note that the [linux mcu](RPi_microcontroller.md) implementation does not currently support directly connected neopixels. The current design using the Linux kernel interface does not allow this scenario because the kernel GPIO interface is not fast enough to provide the required pulse rates.
ta: . லினக்ச் கர்னல் இடைமுகத்தைப் பயன்படுத்தி தற்போதைய வடிவமைப்பு இந்த காட்சியை அனுமதிக்காது, ஏனெனில் கர்னல் சி.பி.ஐ.ஓ இடைமுகம் தேவையான துடிப்பு விகிதங்களை வழங்க போதுமானதாக இல்லை.

source: [exclude_object]
ta: [விலக்கு_ஆப்செக்ட்]

source: Enables support to exclude or cancel individual objects during the printing process.
ta: அச்சிடும் செயல்பாட்டின் போது தனிப்பட்ட பொருட்களை விலக்க அல்லது ரத்து செய்ய ஆதரவை இயக்குகிறது.

source: See the [exclude objects guide](Exclude_Object.md) and [command reference](G-Codes.md#excludeobject) for additional information. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.
ta: கூடுதல் தகவலுக்கு [Objects வழிகாட்டியை விலக்கு] (விலக்கு_OBJECT.MD) மற்றும் [கட்டளை குறிப்பு] (g-codes.md#exctudeObject) ஐப் பார்க்கவும். மார்லின்/ரெப்ராஃபர்ம்வேர் இணக்கமான எம் 486 சி-கோட் மேக்ரோவுக்கான [மாதிரி-macros.cfg] (../ config/salem-macros.cfg) கோப்பைப் பார்க்கவும்.

source: Klipper includes definitions for many types of temperature sensors. These sensors may be used in any config section that requires a temperature sensor (such as an `[extruder]` or `[heater_bed]` section).
ta: கிளிப்பர் பல வகையான வெப்பநிலை சென்சார்களுக்கான வரையறைகளை உள்ளடக்கியது. இந்த சென்சார்கள் வெப்பநிலை சென்சார் தேவைப்படும் எந்த கட்டமைப்பு பிரிவிலும் பயன்படுத்தப்படலாம் (போன்றவை `[எக்ச்ட்ரூடர்]` அல்லது `[ஈட்டர்_பெட்]` பிரிவு போன்றவை).

source: Deltesian Kinematics
ta: டெல்டீசியன் இயக்கவியல்

source: See [example-deltesian.cfg](../config/example-deltesian.cfg) for an example deltesian kinematics config file.
ta: டெல்டீசியன் இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-deltesian.cfg] (../ config/example-deltesian.cfg) ஐப் பார்க்கவும்.

source: Only parameters specific to deltesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: டெல்டீசியன் அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்க அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) ஐப் பார்க்கவும்.
