Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: es, ta, uk

source: 20190710: The z_hop option was removed from the [firmware_retract] config section. The z_hop support was incomplete and could cause incorrect behavior with several common slicers.
es: 20190710: Se removió la opción z_hop de la sección de configuración [firmware_retract]. El sostenimiento de z_hop estaba incompleto y podría causar un comportamiento incorrecto con varios cortadores comunes.
ta: 20190710: Z_HOP விருப்பம் [firmware_retract] கட்டமைப்பு பிரிவில் இருந்து அகற்றப்பட்டது. Z_HOP உதவி முழுமையடையாது மற்றும் பல பொதுவான ச்லைசர்களுடன் தவறான நடத்தையை ஏற்படுத்தக்கூடும்.
uk: 20190710: параметр z_hop був вилучений з розділу [firmware_retract]. Підтримка z_hop була неповною і може викликати неправильну поведінку з декількома загальними скибочками.

source: 20190710: The optional parameters of the PROBE_ACCURACY command have changed. It may be necessary to update any macros or scripts that use that command.
es: 20190710: Los parámetros opcionales del comando PROBE_ACCURACY han cambiado. Puede que sea necesario actualizar cualquier macro o programas que usen ese comando.
ta: 20190710: ஆய்வு_சூரசி கட்டளையின் விருப்ப அளவுருக்கள் மாறிவிட்டன. அந்த கட்டளையைப் பயன்படுத்தும் எந்த மேக்ரோக்கள் அல்லது ச்கிரிப்ட்களையும் புதுப்பிக்க வேண்டியது தேவை.
uk: 20190710: Змінено параметри команди PROBE_ACCURACY. Щоб оновити будь-які макроси або скрипти, які використовують цю команду.

source: 20190607: The "variable_X" parameters of gcode_macro (along with the VALUE parameter of SET_GCODE_VARIABLE) are now parsed as Python literals. If a value needs to be assigned a string then wrap the value in quotes so that it is evaluated as a string.
es: 20190607: Los parámetros "variable_X" de gcode_macro (junto con el parámetro VALUE de SET_GCODE_VARIABLE) ahora se analizan como literales de Python. Si es necesario asignar una cadena a un valor entonces envuelva el valor entre comillas para que se evalúe como una cadena.
ta: 20190607: GCODE_MACRO இன் "மாறி_எக்ச்" அளவுருக்கள் (SET_GCODE_VARIABLE இன் மதிப்பு அளவுருவுடன்) இப்போது பைதான் லிட்டரர்களாக பாகுபடுத்தப்பட்டுள்ளன. ஒரு மதிப்பை ஒரு சரம் ஒதுக்க வேண்டும் என்றால், மதிப்பை மேற்கோள்களில் மடிக்கவும், இதனால் அது ஒரு சரமாக மதிப்பிடப்படும்.
uk: 20190607: Параметри "variable_X" gcode_macro (хоча з параметром VALUE SET_GCODE_VARIABLE) тепер паруються як лінійки Python. Якщо значення має бути призначене рядок, а потім оберніть значення в лапках, щоб він оцінюється як рядок.

source: 20190606: The "samples", "samples_result", and "sample_retract_dist" config options have been moved to the "probe" config section. These options are no longer supported in the "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt", or "quad_gantry_level" config sections.
es: 20190606: Las siguientes opciones de configuración: "sample", "samples_result" y "sample_retract_dist", se han movido al la sección de configuración "probe". Estas opciones ya no son válidas en las siguientes secciones de configuración: "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt" o "quad__gantry_level".
ta: 20190606: "மாதிரிகள்", "மாதிரிகள்_ரெச்" மற்றும் "மாதிரி_ரெட்ராக்ட்_டிச்ட்" கட்டமைப்பு விருப்பங்கள் "ஆய்வு" கட்டமைப்பு பிரிவுக்கு நகர்த்தப்பட்டுள்ளன. இந்த விருப்பங்கள் இனி "டெல்டா_கலிப்ரேட்", "பெட்_பில்ட்", "பெட்_மெச்", "ச்க்ரூச்_பில்ட்_அட்சச்ட்", "இசட்_டில்ட்" அல்லது "குவாட்_கான்ட்ரி_லெவல்" கட்டமைப்பு பிரிவுகளில் ஆதரிக்கப்படுவதில்லை.
uk: 20190606: У розділі "Пробе" переведено параметри налаштування "пробе". Ці параметри більше не підтримуються в "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt", або "quad_gantry_level" конфігураційних розділів.

source: 20190528: The magic "status" variable in gcode_macro template evaluation has been renamed to "printer".
es: 20190528: El nombre de la variable mágica "status" en la evaluación de la plantilla gcode_macro ha cambiado a "printer".
ta: 20190528: GCODE_MACRO வார்ப்புரு மதிப்பீட்டில் மேசிக் "நிலை" மாறி "அச்சுப்பொறி" என மறுபெயரிடப்பட்டது.
uk: 20190528: Змінна магія "статус" в Gcode_macro шаблонна оцінка була перейменована в "принтер".

source: 20190520: The SET_GCODE_OFFSET command has changed; update any g-code macros accordingly. The command will no longer apply the requested offset to the next G1 command. The old behavior may be approximated by using the new "MOVE=1" parameter.
es: 20190520: El comando SET__GCODE_OFFSET ha cambiado; actualice cualquier macros de g-code como corresponde. El comando ya no aplicará el desplazamiento solicitado al siguiente comando G1. El comportamiento anterior se puede aproximar utilizando el nuevo parámetro "MOVE=1".
ta: 20190520: set_gcode_offset கட்டளை மாறிவிட்டது; அதற்கேற்ப எந்த சி-கோட் மேக்ரோக்களையும் புதுப்பிக்கவும். கட்டளை இனி கோரப்பட்ட ஆஃப்செட்டை அடுத்த ஐயா 1 கட்டளைக்கு பயன்படுத்தாது. புதிய "நகர்வு = 1" அளவுருவைப் பயன்படுத்தி பழைய நடத்தை தோராயமாக மதிப்பிடப்படலாம்.
uk: 20190520: Команда SET_GCODE_OFFSET змінилася; оновлення будь-яких макросів g-коду відповідно. Команда більше не застосуватиме запит на наступну команду G1. Стара поведінка може бути приблизена за допомогою параметра «MOVE=1».

source: 20190404: The Python host software packages were updated. Users will need to rerun the ~/klipper/scripts/install-octopi.sh script (or otherwise upgrade the python dependencies if not using a standard OctoPi installation).
es: 20190404: Se actualizaron los paquetes de software del Python host. Los usuarios deberán volver a correr el programa ~/klipper/scripts/install-octopi.sh (o actualizar la dependencias de Python si no se utiliza una instalación estándar de OctoPi).
ta: 20190404: பைதான் புரவலன் மென்பொருள் தொகுப்புகள் புதுப்பிக்கப்பட்டன. பயனர்கள் ~/klipper/scripts/install-octopi.sh ச்கிரிப்டை மீண்டும் இயக்க வேண்டும் (அல்லது நிலையான ஆக்டோபி நிறுவலைப் பயன்படுத்தாவிட்டால் பைதான் சார்புகளை மேம்படுத்தவும்).
uk: 20190404: Оновлено програмні пакети Python host. Користувачі потрібно перезапустити ~ / клапти / скрипти / встановити-octopi.sh (або іншим чином оновити залежності python, якщо не використовуючи стандарт OctoPi установки).

source: 20190404: The i2c_bus and spi_bus parameters (in various config sections) now take a bus name instead of a number.
es: 20190404: Los parámetros i2c_bus y spi_bus (en varias secciones de configuración) ahora toman un nombre de bus en lugar de un número.
ta: 20190404: I2C_BUS மற்றும் SPI_BUS அளவுருக்கள் (பல்வேறு கட்டமைப்பு பிரிவுகளில்) இப்போது ஒரு எண்ணுக்கு பதிலாக பச் பெயரை எடுத்துக்கொள்கின்றன.
uk: 20190404: Параметри i2c_bus і spi_bus (в різних розділах налаштування) тепер приймають назву автобуса замість номера.

source: 20190404: The sx1509 config parameters have changed. The 'address' parameter is now 'i2c_address' and it must be specified as a decimal number. Where 0x3E was previously used, specify 62.
es: 20190404: Los parámetros de configuración del sx1509 han cambiado. El parámetro 'address' es ahora 'i2c_address' y debe especificarse como un número decimal. Donde se haya utilizado anteriormente 0x3E, especifique 62.
ta: 20190404: SX1509 கட்டமைப்பு அளவுருக்கள் மாறிவிட்டன. 'முகவரி' அளவுரு இப்போது 'i2c_address' மற்றும் அது ஒரு தசம எண்ணாக குறிப்பிடப்பட வேண்டும். 0x3e முன்பு பயன்படுத்தப்பட்ட இடத்தில், 62 ஐக் குறிப்பிடவும்.
uk: 20190404: Змінено параметри налаштування sx1509. параметр 'address' тепер 'i2c_address' і він повинен бути вказаний як десятковий номер. Де раніше використовували 0x3E, вкажіть 62.

source: 20190328: The min_speed value in [temperature_fan] config will now be respected and the fan will always run at this speed or higher in PID mode.
es: 20190328: Ahora se respetará el valor min_speed en la configuración [temperature_fan] y el abanico siempre funcionará a esta o más alta velocidad cuando en el modo PID.
ta: 20190328: [வெப்பநிலை_பான்] கட்டமைப்பில் உள்ள மின்_ச்பீட் மதிப்பு இப்போது மதிக்கப்படும், மேலும் விசிறி எப்போதும் இந்த வேகத்தில் அல்லது பிஐடி பயன்முறையில் அதிகமாக இயங்கும்.
uk: 20190328: Мінімальне значення в [температур_фан] config тепер буде поважним і вентилятор завжди буде працювати на цій швидкості або вище в режимі PID.

source: 20190322: The default value for "driver_HEND" in [tmc2660] config sections was changed from 6 to 3. The "driver_VSENSE" field was removed (it is now automatically calculated from run_current).
es: 20190322: El valor predeterminado para el "driver_HEND" en las secciones de configuración del [tmc2660] se cambió de 6 a 3. El campo "driver_VSENSE" se eliminó (ahora se calcula automáticamente de run__current).
ta: 20190322: [TMC2660] கட்டமைப்பு பிரிவுகளில் "டிரைவர்_எண்ட்" க்கான இயல்புநிலை மதிப்பு 6 முதல் 3 வரை மாற்றப்பட்டது. "டிரைவர்_வ்சென்ச்" புலம் அகற்றப்பட்டது (இது இப்போது தானாகவே ரன்_கரண்டிலிருந்து கணக்கிடப்படுகிறது).
uk: 20190322: Значення за замовчуванням для "driver_HEND" в розділі [tmc2660] змінено з 6 до 3. Видалено поле "driver_VSENSE" (це тепер автоматично обчислюється з run_current).

source: 20190310: The [controller_fan] config section now always takes a name (such as [controller_fan my_controller_fan]).
es: 20190310: La sección de configuración del [controller_fan] ahora siempre toma un nombre (como [controller_fan my_controller_fan]).
ta: 20190310: [கட்டுப்படுத்தி_ஃபான்] கட்டமைப்பு பிரிவு இப்போது எப்போதும் ஒரு பெயரை எடுக்கும் ([கட்டுப்பாட்டாளர்_ஃபான் மை_ கன்ட்ரோலர்_ஃபான்] போன்றவை).
uk: 20190310: У розділі налаштування [controller_fan] тепер завжди є ім'я (наприклад, [controller_fan my_controller_fan]).

source: 20190308: The "driver_BLANK_TIME_SELECT" field in [tmc2130] and [tmc2208] config sections has been renamed to "driver_TBL".
es: 20190308: El campo "driver__BLANK_TIME_SELECT" en las secciones de configuración del [tmc2130] y del [tmc2208] han cambiado de nombre a "driver_TBL".
ta: 20190308: [TMC2130] மற்றும் [TMC2208] கட்டமைப்பில் உள்ள "டிரைவர்_பிளாங்க்_ டைம்_செலெக்ட்" புலம் "டிரைவர்_டிபிஎல்" என மறுபெயரிடப்பட்டது.
uk: 20190308: поле "driver_BLANK_TIME_SELECT" в [tmc2130] та [tmc2208] перейменовані на "driver_TBL".

source: 20190308: The [tmc2660] config section has changed. A new sense_resistor config parameter must now be provided. The meaning of several of the driver_XXX parameters has changed.
es: 20190308: La sección de configuración del [tmc2660] ha cambiado. Ahora se require proveer un nuevo parámetro de configuración sense__resistor. El significado de varios de los parámetros driver_XXX ha cambiado.
ta: 20190308: [TMC2660] கட்டமைப்பு பிரிவு மாறிவிட்டது. ஒரு புதிய சென்ச்_ரெசிச்டர் கட்டமைப்பு அளவுரு இப்போது வழங்கப்பட வேண்டும். பல இயக்கி_எக்ச்எக்ச் அளவுருக்களின் பொருள் மாறிவிட்டது.
uk: 20190308: Змінено розділ налаштування [tmc2660]. На даний момент необхідно надати новий параметр налаштування значення_resistor. Значення декількох драйверів_ Змінилися параметри xxx.

source: 20190228: Users of SPI or I2C on SAMD21 boards must now specify the bus pins via a [samd_sercom] config section.
es: 20190228: Los usuarios de SPI o I2C en las placas SAMD21 ahora deben especificar los pines del bus a través de una sección de configuración [samd_sercom].
ta: 20190228: SAMD21 பலகைகளில் SPI அல்லது I2C இன் பயனர்கள் இப்போது [SAMD_SERCOM] கட்டமைப்பு பிரிவு வழியாக பச் ஊசிகளைக் குறிப்பிட வேண்டும்.
uk: 20190228: Користувачі SPI або I2C на дошках SAMD21 тепер обов'язково вкажіть за допомогою розділу налаштувань [samd_sercom].

source: 20190224: The bed_shape option has been removed from bed_mesh. The radius option has been renamed to bed_radius. Users with round beds should supply the bed_radius and round_probe_count options.
es: 20190224: La opción bed_shape se eliminó de bed_mesh. El nombre de la opción del radio se cambió a bed_radius. Usuarios con camas redondas deben proveer las opciones de bed_radius y round_probe_count.
ta: 20190224: படுக்கை_மெசிலிருந்து படுக்கை_சேப் விருப்பம் அகற்றப்பட்டுள்ளது. ஆரம் விருப்பம் பெட்_ரடியச் என மறுபெயரிடப்பட்டுள்ளது. சுற்று படுக்கைகள் கொண்ட பயனர்கள் படுக்கை_ராடியச் மற்றும் ரவுண்ட்_பிரோப்_கவுண்ட் விருப்பங்களை வழங்க வேண்டும்.
uk: 20190224: Видалено варіант постільної білизни. Варіант радіусу був перейменований в ліжко_radius. Користувачі з круглими ліжками повинні поставляти ліжко_radius і round_probe_count параметри.

source: 20190107: The i2c_address parameter in the mcp4451 config section changed. This is a common setting on Smoothieboards. The new value is half the old value (88 should be changed to 44, and 90 should be changed to 45).
es: 20190107: El parámetro i2c_address en la sección de configuración del mcp4451 cambió. Este parámetro se utiliza comúnmente en Smoothieboards. El nuevo valor es la mitad del valor anterior (88 debe cambiarse a 44 y 90 debe cambiarse a 45).
ta: 20190107: MCP4451 கட்டமைப்பு பிரிவில் I2C_ADDRESS அளவுரு மாற்றப்பட்டது. ச்மூத்திபோர்டுகளில் இது ஒரு பொதுவான அமைப்பாகும். புதிய மதிப்பு பாதி பழைய மதிப்பு (88 ஐ 44 ஆக மாற்ற வேண்டும், 90 ஐ 45 ஆக மாற்ற வேண்டும்).
uk: 20190107: Змінено параметр i2c_address у розділі налаштування mcp4451. Це загальне налаштування на смузі. Нова вартість - половина старого значення (88 повинні бути змінені до 44, а 90 повинні бути змінені до 45).

source: 20181220: Klipper v0.7.0 released
es: 20181220: La versión v0.7.0 de Klipper se lanzó
ta: 20181220: வெட்டுக்கள் V0.7.0 வெளியிடப்பட்டது
uk: 20181220: Klipper v0.7.0 випущений

source: 20210703: A `samd_sercom` config section must now specify the sercom bus it is configuring via the `sercom` option.
es: 20210703: Ahora, es necesario que una sección de configuración de `samd_sercom` especifique el bus de sercom que esta configurando a través de la opción`sercom`.
ta: 20210703: ஒரு `SAMD_SERCOM` கட்டமைப்பு பிரிவு இப்போது` செர்காம்` விருப்பம் வழியாக கட்டமைக்கும் செர்காம் பச்சைக் குறிப்பிட வேண்டும்.
uk: 20210703: A `samd_sercom` конфігурація розділу повинна тепер вказати маршрут sercom, який він конфігурується через параметр `sercom`.

source: 20210720: A controller_fan section now monitors all stepper motors by default (not just the kinematic stepper motors). If the previous behavior is desired, see the `stepper` config option in the [config reference](Config_Reference.md#controller_fan).
es: 20210720: Una sección de controller_fan ahora supervisa de manera predeterminada todos los motores paso a paso (no solamente los motores paso a paso cinemáticos). Si se desea el comportamiento anterior, vea la opción de configuración `stepper` en [config reference](Config_Reference.md#controller_fan).
ta: 20210720: ஒரு கட்டுப்படுத்தி_பான் பிரிவு இப்போது அனைத்து ச்டெப்பர் மோட்டார்களையும் இயல்பாகவே கண்காணிக்கிறது (இயக்கவியல் ச்டெப்பர் மோட்டார்கள் மட்டுமல்ல). முந்தைய நடத்தை விரும்பினால், [கட்டமைப்பு குறிப்பு] (config_reference.md#controler_fan) இல் `ச்டெப்பர்` கட்டமைப்பு விருப்பத்தைப் பார்க்கவும்.
uk: 20210720: розділ контролера_fan тепер контролює всі крокові двигуни за замовчуванням (не тільки кінематичний кроковий двигун). Якщо потрібна попередня поведінка, див. `stepper` параметр налаштування в [посилання на налаштування](Config_Reference.md#controller_fan).

source: Configuration Changes
es: Cambios de Configuración
ta: உள்ளமைவு மாற்றங்கள்
uk: Зміни конфігурації

source: 20210819: In some cases, a `G28` homing move may end in a position that is nominally outside the valid movement range. In rare situations this may result in confusing "Move out of range" errors after homing. If this occurs, change your start scripts to move the toolhead to a valid position immediately after homing.
es: 20210819: En algunos casos, un movimiento de retorno a casa `G28` puede terminar en una posición que está nominalmente fuera del intervalo de movimiento válido. En raras ocasiones esto puede resultar en errores confusos de "Move out of range" depués de completar el proceso de retorno a casa. Si esto ocurre, cambie los programas de inicio para mover el cabezal a una posición válida inmediatamente después del proceso de retorno a casa.
ta: 20210819: சில சந்தர்ப்பங்களில், ஒரு `சி 28` ஓமிங் நடவடிக்கை செல்லுபடியாகும் இயக்க வரம்பிற்கு வெளியே பெயரளவில் இருக்கும் நிலையில் முடிவடையும். அரிதான சூழ்நிலைகளில், இது "வரம்பிலிருந்து வெளியேறுதல்" பிழைகள் குழப்பமடையக்கூடும். இது ஏற்பட்டால், உங்கள் தொடக்க ச்கிரிப்ட்களை மாற்றி, கருவியின் தலையை சரியான நிலைக்கு நகர்த்தவும்.
uk: 20210819: У деяких випадках, `G28` переміщення хмінгу може призвести до положення, яка номінально за межами діючого діапазону руху. У рідкісних ситуаціях це може призвести до плутанності «Зроблено з діапазону» помилок після гоління. Якщо це відбувається, змініть скрипти запуску, щоб перемістити ключ до дійсного положення відразу після гоління.

source: 20210814: The analog only pseudo-pins on the atmega168 and atmega328 have been renamed from PE0/PE1 to PE2/PE3.
es: 20210814: Los nombres de los pseudo-pines analógicos en el atmega168 y el atmega328 han cambiado de PE0/PE1 a PE2/PE3.
ta: 20210814: ATMEGA168 மற்றும் ATMEGA328 இல் உள்ள அனலாக் மட்டும் போலி-பின்ச் PE0/PE1 இலிருந்து PE2/PE3 க்கு மறுபெயரிடப்பட்டுள்ளது.
uk: 20210814: аналог тільки псевдо-піни на atmega168 і atmega328 були перейменовані з PE0/PE1 в PE2/PE3.

source: 20210903: The default [`smooth_time`](Config_Reference.md#extruder) for heaters has changed to 1 second (from 2 seconds). For most printers this will result in more stable temperature control.
es: 20210903: El [`smooth_time`](Config_Reference.md#extruder) predeterminado para los calentadores ha cambiado a 1 segundo (de 2 segundos). Para la mayoría de impresoras, esto va a resultar en un control de temperatura más estable.
ta: 20210903: ஈட்டர்களுக்கான இயல்புநிலை [`sempig_time`] (config_reference.md#எக்ச்ட்ரூடர்) 1 வினாடியாக (2 வினாடிகளில் இருந்து) மாறிவிட்டது. பெரும்பாலான அச்சுப்பொறிகளுக்கு இது மிகவும் நிலையான வெப்பநிலை கட்டுப்பாட்டை ஏற்படுத்தும்.
uk: 20210903: За замовчуванням [`smooth_time`](Config_Reference.md#extruder) для нагрівачів змінився на 1 секунду (від 2 секунд). Для більшості принтерів це призведе до більш стабільного контролю температури.

source: 20210830: The default adxl345 name is now "adxl345". The default CHIP parameter for the `ACCELEROMETER_MEASURE` and `ACCELEROMETER_QUERY` is now also "adxl345".
es: 20210830: El nombre predeterminado del adxl345 es ahora "adxl345". El parámetro CHIP predeterminado para el `ACCELEROMETER_MEASURE` y `ACCELEROMETER_QUERY` ahora también es "adxl345".
ta: 20210830: இயல்புநிலை ADXL345 பெயர் இப்போது "ADXL345". `முடுக்கமானி_மெய்சர்` மற்றும்` முடுக்கமானி_க்யூரி` ஆகியவற்றிற்கான இயல்புநிலை சிப் அளவுரு இப்போது "ADXL345" ஆகும்.
uk: 20210830: назва adxl345 за умовчанням тепер «adxl345». Параметром CHIP за замовчуванням для `ACCELEROMETER_MEASURE` і `ACCELEROMETER_QUERY` тепер також є "adxl345".

source: 20210830: The adxl345 ACCELEROMETER_MEASURE command no longer supports a RATE parameter. To alter the query rate, update the printer.cfg file and issue a RESTART command.
es: 20210830: El comando ACCELEROMETER_MEASURE del adxl345 ya no admite un parámetro RATE. Para modificar el ritmo de consultas, actualize el archivo printer.cfg y ejecute un comando RESTART.
ta: 20210830: ADXL345 முடுக்கமானி_மசர் கட்டளை இனி விகித அளவுருவை ஆதரிக்காது. வினவல் வீதத்தை மாற்ற, அச்சுப்பொறி. CFG கோப்பைப் புதுப்பித்து மறுதொடக்கம் கட்டளையை வழங்கவும்.
uk: 20210830: Adxl345 ACCELEROMETER_MEASURE Команда більше не підтримує параметр RATE. Щоб змінити швидкість запиту, оновити файл принтера.cfg і випустити команду RESTART.

source: 20210821: Several config settings in `printer.configfile.settings` will now be reported as lists instead of raw strings. If the actual raw string is desired, use `printer.configfile.config` instead.
es: 20210821: Varios parámetros de configuración en `printer.configfile.settings` ahora se informarán como listas en vez de cadenas sin procesar. Si desea la cadena sin procesar actual, use `printer.configfile.config` en su lugar.
ta: 20210821: `printel.configfile.settings` இல் பல கட்டமைப்பு அமைப்புகள் இப்போது மூல சரங்களுக்கு பதிலாக பட்டியல்களாக அறிவிக்கப்படும். உண்மையான மூல சரம் விரும்பினால், அதற்கு பதிலாக `prinate.configfile.config` ஐப் பயன்படுத்தவும்.
uk: 20210821: Кілька налаштувань конфігурації в `printer.configfile.settings` тепер буде повідомлено як списки замість сирих рядків. Якщо потрібно фактичну сиру рядок, скористайтеся `printer.configfile.config` замість.

source: 20211110: The "NTC 100K beta 3950" temperature sensor is deprecated. This sensor will be removed in the near future. Most users will find the "Generic 3950" temperature sensor more accurate. To continue to use the older (typically less accurate) definition, define a custom [thermistor](Config_Reference.md#thermistor) with `temperature1: 25`, `resistance1: 100000`, and `beta: 3950`.
es: 20211110: El sensor de temperatura "NTC 100K beta 3950" está descontinuado. Este sensor se removera en un futuro cercano. La mayoría de los usuarios encontrarán el sensor de temperatura "Generic 3950" más preciso. Para continuar usando la definición anterior (generalmente menos precisa), defina un [thermistor](Config_Reference.md#thermistor) personalizado con `temperature1: 25`, `resistance1: 100000` y `beta: 3950`.
ta: 20211110: "என்.டி.சி 100 கே பீட்டா 3950" வெப்பநிலை சென்சார் நீக்கப்பட்டது. இந்த சென்சார் எதிர்காலத்தில் அகற்றப்படும். பெரும்பாலான பயனர்கள் "பொதுவான 3950" வெப்பநிலை சென்சாரை மிகவும் துல்லியமாகக் காண்பார்கள். பழைய (பொதுவாக குறைவான துல்லியமான) வரையறையைப் பயன்படுத்த, `வெப்பநிலை 1: 25`,` எதிர்ப்பு 1: 100000`, மற்றும் `பீட்டா: 3950` உடன் தனிப்பயன் [தெர்மோச்டர்] (config_reference.md#தெர்மோச்டர்) வரையறுக்கவும்.
uk: 20211110: датчик температури "NTC 100K 3950" відхилений. Цей датчик буде видалений найближчим часом. Більшість користувачів знайдуть датчик температури "Generic 3950" більш точний. Для продовження використання старшого (типово менш точного) визначення, визначення на замовлення [thermistor](Config_Reference.md#thermistor) з ` Температурою1: 25`, `resistance1: 100000`, і `beta: 3950`.

source: 20211102: Several deprecated features have been removed. The stepper `step_distance` option has been removed (deprecated on 20201222). The `rpi_temperature` sensor alias has been removed (deprecated on 20210219). The mcu `pin_map` option has been removed (deprecated on 20210325). The gcode_macro `default_parameter_<name>` and macro access to command parameters other than via the `params` pseudo-variable has been removed (deprecated on 20210503). The heater `pid_integral_max` option has been removed (deprecated on 20210612).
es: 20211102: Se han eliminado varias funcionalidades obsoletas. La opción del motor paso a paso `step_distance` se eliminó (obsoleta en 20201222). El alias del sensor `rpi_temperature` se eliminó (obsoleto en 20210219). La opción `pin_map` del mcu se removió (obsoleta en 20210325). Se removieron el parámetro `default_parameter_<name>` del gcode_macro y el acceso de macros a parámetros de comando que no sean a través de la pseudovariable `params` (obsoletos en 20210503). La opción del calentador `pid_integral_max` se eleminó (obsoleta en 20210612).
ta: 20211102: பல நீக்கப்பட்ட நற்பொருத்தங்கள் அகற்றப்பட்டுள்ளன. ச்டெப்பர் `Step_distance` விருப்பம் அகற்றப்பட்டது (20201222 அன்று நீக்கப்பட்டது). `Rpi_temperature` சென்சார் மாற்றுப்பெயர் அகற்றப்பட்டது (20210219 அன்று நீக்கப்பட்டது). MCU `PIN_MAP` விருப்பம் அகற்றப்பட்டது (20210325 அன்று நீக்கப்பட்டது). Gcode_macro `default_parameter_ <aname>` மற்றும் `அளவுருக்கள்` போலி-வருங்கால வழியாகத் தவிர வேறு கட்டளை அளவுருக்களுக்கான மேக்ரோ அணுகல் அகற்றப்பட்டது (20210503 அன்று நீக்கப்பட்டது). ஈட்டர் `PID_INTEGRAL_MAX` விருப்பம் அகற்றப்பட்டது (20210612 அன்று நீக்கப்பட்டது).
uk: 20211102: вилучено кілька депресованих функцій. `step_distance` було видалено варіант (згідно 20201222). `rpi_температурний` Датчик псевдонімів був вилучений (депресований на 20210219). Mcu `pin_map` було видалено варіант (прийнято 20210325). Gcode_macro `default_parameter_<name>` та макродоступ до параметрів команд, крім `params` було видалено псевдоваріативний (депресовано на 20210503). Нагрівач `pid_integral_max` було видалено опцію (розраховано на 20210612).
