Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_checks.po
Languages: lt, ta

source: To calibrate the extruder, navigate to the command console and run the PID_CALIBRATE command. For example: `PID_CALIBRATE HEATER=extruder TARGET=170`
lt: Norėdami kalibruoti ekstruzerį, eikite į komandų konsolę ir paleiskite PID_CALIBRATE komandą. Pavyzdžiui: `PID_CALIBRATE HEATER=extruder TARGET=170`
ta: எக்ச்ட்ரூடரை அளவீடு செய்ய, கட்டளை கன்சோலுக்கு செல்லவும் மற்றும் PID_Calibrate கட்டளையை இயக்கவும். எடுத்துக்காட்டாக: `pid_calibrate heter = extruder target = 170`
