Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: es, ta, uk

source: 20210929: Klipper v0.10.0 released.
es: 20210929: La versión v0.10.0 de Klipper se lanzó.
ta: 20210929: வெட்டுக்கள் V0.10.0 வெளியிடப்பட்டது.
uk: 20210929: Klipper v0.10.0 випущено.

source: 20210503: The gcode_macro `default_parameter_<name>` config option is deprecated. Use the `params` pseudo-variable to access macro parameters. Other methods for accessing macro parameters will be removed in the near future. Most users can replace a `default_parameter_NAME: VALUE` config option with a line like the following in the start of the macro: ` {% set NAME = params.NAME|default(VALUE)|float %}`. See the [Command Templates document](Command_Templates.md#macro-parameters) for examples.
es: 20210503: La opción de configuración `default_parameter_<name>` del gcode_macro esta descontinuada. Use la pseudovariable `params` para accesar los parámetros de macro. Otros métodos para accessar parámetros de macro se eliminarán en el futuro cercano. La mayoría de los usuarios pueden reemplazar una opción de configuración del tipo `default_parameter_NAME: VALUE` con una linea como la siguiente al principio de un macro: ` {% set NAME = params.NAME|default(VALUE)|float %}`. Vea [Command Templates document](Command_Templates.md#macro-parameters) para ejemplos.
ta: 20210503: gcode_macro `default_parameter_ <aname>` கட்டமைப்பு விருப்பம் நீக்கப்பட்டது. மேக்ரோ அளவுருக்களை அணுக `அளவுருக்கள்` போலி-மாறி பயன்படுத்தவும். மேக்ரோ அளவுருக்களை அணுகுவதற்கான பிற முறைகள் எதிர்காலத்தில் அகற்றப்படும். பெரும்பாலான பயனர்கள் மேக்ரோவின் தொடக்கத்தில் பின்வருபவை போன்ற ஒரு வரியுடன் `Default_Parameter_name: value` கட்டமைப்பு விருப்பத்தை மாற்றலாம்:` { % கணம் பெயர் = params.name | இயல்புநிலை (மதிப்பு) | மிதவை %} `. எடுத்துக்காட்டுகளுக்கு [கட்டளை வார்ப்புருக்கள் ஆவணம்] (Command_Templates.md#மேக்ரோ-அளவுருக்கள்) ஐப் பார்க்கவும்.
uk: 20210503: Gcode_macro `default_parameter_<name>` опція налаштування розшифровується. Використовуйте `params` псевдоваріант для доступу макро параметрів. У найближчому майбутньому будуть видалені інші методи доступу до макро параметрів. Більшість користувачів можуть замінити `default_parameter_NAME: VALUE` опція налаштування з рядком, як і наступний в запуску макросу: ` {% встановити NAME = params.NAME сховище (VALUE) %}`. Дивитися [Command Шаблони документа](Command_Templates.md#macro-parameters) для прикладів.

source: 20190628: All configuration options have been removed from the [skew_correction] section. Configuration for skew_correction is now done via the SET_SKEW gcode. See [Skew Correction](Skew_Correction.md) for recommended usage.
es: 20190628: Se eliminaron todas las opciones de configuración de la sección [skew_correction]. La configuración para skew_correction ahora se realiza a través del gcode SET_SKEW. Vea [Skew Correction](Skew_Correction.md) para recomendaciones de uso.
ta: 20190628: அனைத்து உள்ளமைவு விருப்பங்களும் [SKEW_CORRECTION] பிரிவில் இருந்து அகற்றப்பட்டுள்ளன. SKEW_CORRECTION க்கான உள்ளமைவு இப்போது SET_SKEW GCODE வழியாக செய்யப்படுகிறது. பரிந்துரைக்கப்பட்ட பயன்பாட்டிற்கு [SKEW திருத்தம்] (SKEW_CORRECTION.MD) ஐப் பார்க்கவும்.
uk: 20190628: Всі варіанти конфігурації були вилучені з розділу [skew_correction]. Конфігурація для skew_correction тепер проводиться за допомогою SET_SKEW gcode. Див. [Skew Корекція](Skew_Correction.md) для рекомендованого використання.

source: 20211104: The "step pulse duration" option in "make menuconfig" has been removed. The default step duration for TMC drivers configured in UART or SPI mode is now 100ns. A new `step_pulse_duration` setting in the [stepper config section](Config_Reference.md#stepper) should be set for all steppers that need a custom pulse duration.
es: 20211104: Se eliminó la opción "step pulse duration" en "make menuconfig". La duración de paso predeterminada para los controladores TMC configurados en modo UART y SPI es ahora 100 ns. Se debe establecer una nueva configuración de `step_pulse_duration` en [stepper config section](Config_Reference.md#stepper) para todos los motores paso a paso que necesitan una duración de pulso personalizada.
ta: 20211104: "மேக் மெனுகான்ஃபிக்" இல் உள்ள "படி துடிப்பு காலம்" விருப்பம் அகற்றப்பட்டுள்ளது. UART அல்லது SPI பயன்முறையில் கட்டமைக்கப்பட்ட TMC இயக்கிகளுக்கான இயல்புநிலை படி காலம் இப்போது 100ns ஆகும். தனிப்பயன் துடிப்பு காலம் தேவைப்படும் அனைத்து ச்டெப்பர்களுக்கும் [STEPPER கட்டமைப்பு பிரிவு] (config_reference.md#ச்டெப்பர்) ஒரு புதிய `step_pulse_duration` அமைப்பு அமைக்கப்பட வேண்டும்.
uk: 20211104: параметр «тривалість покрокового імпульсу» в «make menuconfig» видалено. Стандартна тривалість кроку для драйверів TMC, налаштованих у режимі UART або SPI, тепер становить 100 нс. Нове налаштування `step_pulse_duration` у [розділі конфігурації крокового кроку](Config_Reference.md#stepper) має бути встановлено для всіх степерів, яким потрібна спеціальна тривалість імпульсу.

source: 20220116: The tmc2130, tmc2208, tmc2209, and tmc2660 `run_current` calculation code has changed. For some `run_current` settings the drivers may now be configured differently. This new configuration should be more accurate, but it may invalidate previous tmc driver tuning.
es: 20220116: El código para calcular `run_current` en los motores: tmc2130, tmc2208, tmc2209 y tmc2130 ha cambiado. Ahora, algunos parámetros de configuración de `run_current` pueden ser configurados de manera diferente. Esta nueva configuración debería ser más precisa, pero puede invalidar la afinación anterior del controlador del tmc.
ta: 20220116: TMC2130, TMC2208, TMC2209, மற்றும் TMC2660 `RUN_CURRENT` கணக்கீட்டு குறியீடு மாறிவிட்டது. சில `ரன்_கரண்ட்` அமைப்புகளுக்கு இயக்கிகள் இப்போது வித்தியாசமாக கட்டமைக்கப்படலாம். இந்த புதிய உள்ளமைவு மிகவும் துல்லியமாக இருக்க வேண்டும், ஆனால் இது முந்தைய டிஎம்சி டிரைவர் ட்யூனிங்கை செல்லாது.
uk: 20220116: Tmc2130, tmc2208, tmc2209 і tmc2660 `run_current` код розрахунку змінився. Для деяких `run_current` налаштування драйверів тепер можна налаштувати інакше. Ця нова конфігурація повинна бути більш точною, але вона може бути недійсною попередньої настройки драйвера tmc.

source: 20211230: Scripts to tune input shaper (`scripts/calibrate_shaper.py` and `scripts/graph_accelerometer.py`) were migrated to use Python3 by default. As a result, users must install Python3 versions of certain packages (e.g. `sudo apt install python3-numpy python3-matplotlib`) to continue using these scripts. For more details, refer to [Software installation](Measuring_Resonances.md#software-installation). Alternatively, users can temporarily force the execution of these scripts under Python 2 by explicitly calling Python2 interpretor in the console: `python2 ~/klipper/scripts/calibrate_shaper.py ...`
es: 20211230: Los programas (`scripts/calibrate_shaper.py` y `scripts/graph_accelerometer.py`) usados para afinar los diferentes métodos de combinar las señales de entrada con el próposito de minimizar las vibraciones causadas por el movimiento de la impresora, ("input shaping" en inglés), se migraron para usar Python3 de forma predeterminada. Como resultado, los usuarios deben instalar las versiones en Python3 de ciertos paquetes (por ejemplo, `sudo apt install python3-numpy python3-matplotlib`) para continuar usando estos programas. Para obtener más detalles consulte[Software installation](Measuring_Resonances.md#software-installation). Alternativamente, los usuarios pueden forzar temporalmente la ejecución de estos programas usando Python2 llamando explícitamente al intérprete de Python2 en la consola: `python2 ~/klipper/scripts/calibrate_shaper.py ...`.
ta: 20211230: உள்ளீட்டு வடிவத்திற்கான ச்கிரிப்ட்கள் (`ச்கிரிப்ட்கள்/அளவீடுகள்/அளவீடுகள்_சேப்பர்.பை` மற்றும்` ச்கிரிப்ட்கள்/வரைபடம்_சிலெரோமீட்டர்.பி`) முன்னிருப்பாக பைதான் 3 ஐப் பயன்படுத்த இடம்பெயர்ந்தன. இதன் விளைவாக, பயனர்கள் இந்த ச்கிரிப்ட்களைப் பயன்படுத்த தொடர்ந்து சில தொகுப்புகளின் பைதான் 3 பதிப்புகளை நிறுவ வேண்டும் (எ.கா. மேலும் விவரங்களுக்கு, [மென்பொருள் நிறுவல்] (meaturing_resonances.md#மென்பொருள்-நிறுவல்) ஐப் பார்க்கவும். மாற்றாக, பயனர்கள் இந்த ச்கிரிப்ட்களை பைதான் 2 இன் கீழ் செயல்படுத்துவதை தற்காலிகமாக கட்டாயப்படுத்தலாம்.
uk: 20211230: скрипти, щоб налаштувати формувальну форму (`scripts/calibrate_shaper.py` і `scripts/graph_accelerometer.py`) мігрували використовувати Python3 за замовчуванням. У результаті користувачі повинні встановити версії Python3 певних пакетів (наприклад, `sudo apt встановити python3-numpython3-matplotlib`) для продовження використання цих скриптів. Для отримання більш детальної інформації див. у розділі [Установка програмного забезпечення](Measuring_Resonances.md#software-installation). Крім того, користувачі можуть тимчасово змусити виконання цих сценаріїв під Python 2, явно зателефонувавши до інтерпретатора Python2 в консолі: `python2 ~/klipper/scripts/calibrate_shaper.py ...`

source: 20220210: The `SYNC_STEPPER_TO_EXTRUDER` command is deprecated; the `SET_EXTRUDER_STEP_DISTANCE` command is deprecated; the [extruder](Config_Reference.md#extruder) `shared_heater` config option is deprecated. These features will be removed in the near future. Replace `SET_EXTRUDER_STEP_DISTANCE` with `SET_EXTRUDER_ROTATION_DISTANCE`. Replace `SYNC_STEPPER_TO_EXTRUDER` with `SYNC_EXTRUDER_MOTION`. Replace extruder config sections using `shared_heater` with [extruder_stepper](Config_Reference.md#extruder_stepper) config sections and update any activation macros to use [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).
es: 20220210: El comando `SYNC_STEPPER_TO_EXTRUDER` está discontinuado; el comando `SET_EXTRUDER_STEP_DISTANCE` está discontinuado; la opción de configuración [extruder](Config_Reference.md#extruder) `shared_heater` está discontinuada. Estos atributos se eliminarán en un futuro cercano. Reemplace `SET_EXTRUDER_STEP_DISTANCE` con `SET_EXTRUDER_ROTATION_DISTANCE`. Reemplace `SYNC_STEPPER_TO_EXTRUDER` con `SYNC_EXTRUDER_MOTION`. Reemplace las secciones de configuración del extrusor que esten usando `shared_heater` con las secciones de configuración de [extruder_stepper](Config_Reference.md#extruder_stepper) y actualice cualquier macro de activación para usar [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).
ta: 20220210: `sync_stepper_to_extruder` கட்டளை நீக்கப்பட்டது; `set_extruder_step_distance` கட்டளை நீக்கப்பட்டது; [எக்ச்ட்ரூடர்] (config_reference.md#எக்ச்ட்ரூடர்) `பகிரப்பட்ட_ஈட்டர்` கட்டமைப்பு விருப்பம் நீக்கப்பட்டது. இந்த நற்பொருத்தங்கள் எதிர்காலத்தில் அகற்றப்படும். `Set_extruder_step_distance` ஐ` set_extruder_rotation_distance` உடன் மாற்றவும். `Sync_stepper_to_extruder` ஐ` sync_extruder_motion` உடன் மாற்றவும். [எக்ச்ட்ரூடர்_ச்டெப்பர்] (config_reference.md#extruder_stepper) உடன் `செரேட்_ஈட்டர்` ஐப் பயன்படுத்தி எக்ச்ட்ரூடர் கட்டமைப்பு பிரிவுகளை மாற்றி, [Sync_extruder_motion] (g-codes.md#sync_extruder_motion) பயன்படுத்த எந்த செயல்படுத்தல் மேக்ரோக்களையும் புதுப்பிக்கவும்.
uk: 20220210: The `SYNC_STEPPER_TO_EXTRUDER` команда депресована; `SET_EXTRUDER_STEP_DISTANCE` команда депресована; [extruder](Config_Reference.md#extruder) `shared_heater` опція налаштування розшифровується. Ці функції будуть видалені найближчим часом. Заміна `SET_EXTRUDER_STEP_DISTANCE` з `SET_EXTRUDER_ROTRUDER_ROTATION_DISTANCE`. `SYNC_STEPPER_TO_EXTRUDER` з `SYNC_EXTRUDER_MOTION`. Заміна розділів налаштування екструдера за допомогою `shared_heater` з [extruder_stepper](Config_Reference.md#extruder_stepper) конфігурації розділів і оновлення будь-яких активаційних макросів для використання [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).

source: 20220304: There is no longer a default for the `extruder` parameter of [extruder_stepper](Config_Reference.md#extruder_stepper) config sections. If desired, specify `extruder: extruder` explicitly to associate the stepper motor with the "extruder" motion queue at startup.
es: 20220304: Ya no hay un valor predeterminado para el parámetro `extruder` de las secciones de configuración [extruder_stepper](Config_Reference.md#extruder_stepper). Si lo desea, especifique `extruder: extruder` explícitamente para asociar el motor paso a paso con la cola de movimientos del "extrusor" durante la secuencia de inicio.
ta: 20220304: [எக்ச்ட்ரூடர்_ச்டெப்பர்] (config_reference.md#extruder_stepper) கட்டமைப்பு பிரிவுகளின் `எக்ச்ட்ரூடர்` அளவுருவுக்கு இனி இயல்புநிலை இல்லை. விரும்பினால், ச்டெப்பர் மோட்டாரை தொடக்கத்தில் "எக்ச்ட்ரூடர்" மோசன் வரிசையுடன் இணைக்க `எக்ச்ட்ரூடர்: எக்ச்ட்ரூடர்` ஐ வெளிப்படையாகக் குறிப்பிடவும்.
uk: 20220304: Існує більше за замовчуванням для параметра `extruder` параметр [extruder_stepper](Config_Reference.md#extruder_stepper) конфігураційних розділів. При бажанні уточнюйте `extruder: extruder` явно зв'язувати кроковий двигун з чергою руху "екструдера" при запуску.

source: 20220307: `M73` will no longer set print progress to 0 if `P` is missing.
es: 20220307: El `M73` ya no establecerá el progreso de la impresión a 0 si falta `P`.
ta: 20220307: `p` காணவில்லை என்றால்` M73` இனி அச்சு முன்னேற்றத்தை 0 ஆக அமைக்காது.
uk: 20220307: `M73` не буде встановлювати прогрес друку до 0, якщо `P` відсутні.

source: 20220407: The temperature_fan `pid_integral_max` config option has been removed (it was deprecated on 20210612).
es: 20220407: La opción de configuración `pid_integral_max` de temperature_fan se eliminó (fue discontinuada en 20210612).
ta: 20220407: வெப்பநிலை_பான் `PID_INTEGRAL_MAX` கட்டமைப்பு விருப்பம் அகற்றப்பட்டது (இது 20210612 அன்று நீக்கப்பட்டது).
uk: 20220407: Температурний параметр `pid_integral_max` був видалений параметр налаштування (прийнято на 20210612).

source: 20220407: The default color order for pca9632 LEDs is now "RGBW". Add an explicit `color_order: RBGW` setting to the pca9632 config section to obtain the previous behavior.
es: 20220407: El orden de color predeterminado para los LEDs del pca9632 ahora es "RGBW". Añada el parámetro explícito `color_order: RBGW` a la sección de configuración del pca9632 para obtener el comportamiento anterior.
ta: 20220407: PCA9632 LEDS க்கான இயல்புநிலை வண்ண ஆர்டர் இப்போது "RGBW" ஆகும். முந்தைய நடத்தையைப் பெறுவதற்கு வெளிப்படையான `color_order: rbgw` அமைப்பைச் சேர்க்கவும் PCA9632 கட்டமைப்பு பிரிவில்.
uk: 20220407: Замовлення за замовчуванням для pca9632 світлодіодів тепер "RGBW". Додати явну `color_order: RBGW` налаштування до розділу pca9632 для отримання попередньої поведінки.

source: 20220330: The format of the `printer.neopixel.color_data` status information for neopixel and dotstar modules has changed. The information is now stored as a list of color lists (instead of a list of dictionaries). See the [status reference](Status_Reference.md#led) for details.
es: 20220330: El formato de la información de estado del `printer.neopixel.color_data` para los módulos neopixel y dotstar ha cambiado. La información ahora se almacena como una lista de listas de colores (en lugar de una lista de diccionarios). Vea [status reference](Status_Reference.md#led) para más detalles.
ta: 20220330: நியோபிக்சல் மற்றும் டாட்ச்டார் தொகுதிகளுக்கான `அச்சுப்பொறி. செய்தி இப்போது வண்ண பட்டியல்களின் பட்டியலாக சேமிக்கப்பட்டுள்ளது (அகராதிகளின் பட்டியலுக்கு பதிலாக). விவரங்களுக்கு [நிலை குறிப்பு] (status_reference.md#led) ஐப் பார்க்கவும்.
uk: 20220330: У форматі `printer.neoпіксел.color_data` змінилася інформація про статус непікселів і dotstar. Інформація тепер зберігається в списку кольорових списків (замість списку словників). Див. [статус посилання](Status_Reference.md#led) для деталей.

source: 20220616: It was previously possible to flash an rp2040 in bootloader mode by running `make flash FLASH_DEVICE=first`. The equivalent command is now `make flash FLASH_DEVICE=2e8a:0003`.
es: 20220616: Anteriormente era posible borrar y reprogramar ("flash") el microchip rp2040 en modo de gestor de arranque ejecutando `make flash FLASH_DEVICE=first`. El comando equivalente es ahora `make flash FLASH_DEVICE=2e8a:0003`.
ta: 20220616: `ஃப்ளாச் ஃப்ளாச்_டெவிச் = முதல்` ஐ இயக்குவதன் மூலம் துவக்க ஏற்றி பயன்முறையில் ஒரு RP2040 ஐ ஒளிரச் செய்வது முன்பு சாத்தியமானது. சமமான கட்டளை இப்போது `ஃப்ளாச் ஃப்ளாச்_டெவிச் = 2e8a: 0003` ஐ உருவாக்குங்கள்.
uk: 20220616: Раніше миготливий RP2040 в режимі завантаження, працює `make flash FLASH_DEVICE=first`. При еквіваленті команди тепер `make flash FLASH_DEVICE=2e8a:0003`.

source: 20220612: The rp2040 micro-controller now has a workaround for the "rp2040-e5" USB errata. This should make initial USB connections more reliable. However, it may result in a change in behavior for the gpio15 pin. It is unlikely the gpio15 behavior change will be noticeable.
es: 20220612: El microcontrolador rp2040 ahora tiene una solución temporal para la errata del USB "rp2040-e5". Esto debería hacer que las conexiones USB iniciales sean más fiables. Sin embargo, puede resultar en un cambio en el comportamiento del pin gpio15. Es poco probable que el cambio en comportamiento del gpio15 sea notable.
ta: 20220612: RP2040 மைக்ரோ-கன்ட்ரோலர் இப்போது "RP2040-E5" USB ERRATA க்கான பணித்தொகுப்பைக் கொண்டுள்ளது. இது ஆரம்ப யூ.எச்.பி இணைப்புகளை மிகவும் நம்பகமானதாக மாற்ற வேண்டும். இருப்பினும், இது GPIO15 முள் நடத்தை மாற்றத்தை ஏற்படுத்தக்கூடும். GPIO15 நடத்தை மாற்றம் கவனிக்கத்தக்கது என்பது சாத்தியமில்லை.
uk: 20220612: Мікроконтролер rp2040 тепер має значення для "rp2040-e5" USB errata. Це повинно зробити ініціал USB з'єднання більш надійним. Однак це може призвести до зміни поведінки для штифта gpio15. Неймовірно зміна поведінки gpio15 буде помітно.

source: 20221122: Previously, with safe_z_home, it was possible that the z_hop after the g28 homing would go in the negative z direction. Now, a z_hop is performed after g28 only if it results in a positive hop, mirroring the behavior of the z_hop that occurs before the g28 homing.
es: 20221122: Anteriormente, con safe_z_home, era posible que el z_hop fuera en la dirección z negativa después del proceso de retorno a casa g28. Ahora, un z_hop solamente se realiza después del g28 cuando resulta en un brinco positivo, reflejando el comportamiento del z_hop que ocurre antes del proceso de retorno a casa g28.
ta: 20221122: முன்னர், SAFE_Z_HOME உடன், G28 HOMING க்குப் பிறகு Z_HOP எதிர்மறை சட் திசையில் செல்லக்கூடும். இப்போது, G28 க்குப் பிறகு ஒரு Z_HOP செய்யப்படுகிறது, அது ஒரு நேர்மறையான ஆப்பில் விளைகிறது என்றால் மட்டுமே, G28 ஓமிங்கிற்கு முன் நிகழும் Z_HOP இன் நடத்தையை பிரதிபலிக்கிறது.
uk: 20221122: Попередньо, з сейфом_z_home, можливо, що z_hop після того, як g28 хмінг буде йти в негативний з напряму. Тепер, z_hop виконується після g28 тільки якщо він призводить до позитивного хмелю, віддзеркаливши поведінку z_hop, що відбувається до хмінгу g28.

source: 20230201: The `[bed_mesh]` module no longer loads the `default` profile on startup. It is recommended that users who use the `default` profile add `BED_MESH_PROFILE LOAD=default` to their `START_PRINT` macro (or to their slicer's "Start G-Code" configuration when applicable).
es: 20230201: El módulo `[bed_mesh]` ya no carga el perfil `default` durante la sequencia de inicio. Se recomienda que los usuarios que utilizan el perfil `default` añadan `BED_MESH_PROFILE LOAD=default` a su macro `START_PRINT` (o a la configuración "Start G-Code" de su cortador cuando corresponda).
ta: 20230201: `[BED_MESH]` தொகுதி இனி தொடக்கத்தில் `இயல்புநிலை` சுயவிவரத்தை ஏற்றாது. `இயல்புநிலை` சுயவிவரத்தைப் பயன்படுத்தும் பயனர்கள்` BED_MESH_PROFILE LOAD = இயல்புநிலை` அவர்களின் `START_PRINT` மேக்ரோவுக்கு (அல்லது அவற்றின் ச்லைசரின்" தொடக்க சி-குறியீடு "உள்ளமைவுக்கு பொருந்தும் போது) சேர்க்க பரிந்துரைக்கப்படுகிறது.
uk: 20230201: Модуль `[bed_mesh]` не завантажує профілі `default` на старті. Рекомендується користувачам, які використовують профілі ` ` додати `BED_MESH_PROFILE LOAD=default` до їх `START_PRINT` макро (або їх конфігурацію скибки "Start G-Code".

source: 20230103: It is now possible with the flash-sdcard.sh script to flash both variants of the Bigtreetech SKR-2, STM32F407 and STM32F429. This means that the original tag of btt-skr2 now has changed to either btt-skr-2-f407 or btt-skr-2-f429.
es: 20230103: Ahora es posible utilizar el programa flash-sdcard.sh para reprogramar ambas variantes del Bigtreetech SKR-2: STM32F407 and STM32F429. Esto significa que la etiqueta original de btt-skr2 ahora ha cambiado a btt-skr-2-f407 o btt-skr-2-f429.
ta: 20230103: பிக்ட்ரீடெக் எச்.கே.ஆர் -2, எச்.டி.எம் 32 எஃப் 407 மற்றும் எச்.டி.எம் 32 எஃப் 429 ஆகியவற்றின் இரு மாறுபாடுகளையும் ஒளிரச் செய்ய ஃப்ளாச்-எச்.டி.கார்டு எச். இதன் பொருள் BTT-SKR2 இன் அசல் குறிச்சொல் இப்போது BTT-SKR-2-F407 அல்லது BTT-SKR-2-F429 என மாறிவிட்டது.
uk: 20230103: Тепер можливо з флеш-картою.sh скрипт для спалаху обох варіантів Bigtreetech SKR-2, STM32F407 і STM32F429. Це означає, що оригінальний тег btt-skr2 тепер змінився на або btt-skr-2-f407 або btt-skr-2-f429.

source: 20221128: Klipper v0.11.0 released.
es: 20221128: La versión v0.11.0 de Klipper se lanzó.
ta: 20221128: வெட்டுக்கள் V0.11.0 வெளியிடப்பட்டது.
uk: 20221128: Klipper v0.11.0 випущено.

source: 20230304: The `SET_TMC_CURRENT` command now properly adjusts the globalscaler register for drivers that have it. This removes a limitation where on tmc5160, the currents could not be raised higher with `SET_TMC_CURRENT` than the `run_current` value set in the config file. However, this has a side effect: After running `SET_TMC_CURRENT`, the stepper must be held at standstill for >130ms in case StealthChop2 is used so that the AT#1 calibration gets executed by the driver.
es: 20230304: El comando `SET_TMC_CURRENT` ahora ajusta correctamente el registro globalscaler para los controladores que lo tienen. Esto elimina una limitación de los tmc5160 donde el `SET_TMC_CURRENT`no podía aumentar las corrientes más alto que el valor de `run_current` establecido en el archivo de configuración. Sin embargo, esto tiene un efecto secundario: después de correr el `SET_TMC_CURRENT`, el motor paso a paso debe mantenerse parado durante >130 ms en caso de que se use StealthChop2 para que el controlador ejecute la calibración AT#1.
ta: 20230304: `set_tmc_current` கட்டளை இப்போது அதை வைத்திருக்கும் டிரைவர்களுக்கான குளோபல்ச்கேலர் பதிவேட்டை சரியாக சரிசெய்கிறது. இது ஒரு வரம்பை நீக்குகிறது, அங்கு TMC5160 இல், கட்டமைப்பு கோப்பில் அமைக்கப்பட்ட `ரன்_கரண்ட்` மதிப்பை விட` Set_tmc_current` உடன் நீரோட்டங்களை உயர்த்த முடியாது. இருப்பினும், இது ஒரு பக்க விளைவைக் கொண்டுள்ளது: `set_tmc_current` ஐ இயக்கிய பிறகு, ச்டெப்பப்பர் 2 ஐப் பயன்படுத்தினால், ச்டெப்பரை> 130ms க்கு நிறுத்த வேண்டும், இதனால்#1 அளவுத்திருத்தம் இயக்கி செயல்படுத்தப்படுகிறது.
uk: 20230304: The `SET_TMC_CURRENT` тепер належним чином регулює глобальний рейтинг для водіїв, які мають його. Це видаляє обмеження, де на tmc5160, струми не можуть бути збільшені вище за допомогою `SET_TMC_CURRENT`, ніж `run_current` значення, встановленого в файлі конфігурації. Однак, це має побічний ефект: Після запуску `SET_TMC_CURRENT`, stepper повинен бути проведений на стендах для >130ms у випадку, якщо StealthChop2 використовується так, щоб калібрування AT#1 була виконана водієм.

source: 20230202: The format of the `printer.screws_tilt_adjust` status information has changed. The information is now stored as a dictionary of screws with the resulting measurements. See the [status reference](Status_Reference.md#screws_tilt_adjust) for details.
es: 20230202: El formato de la información de estado `printer.screws_tilt_adjust` ha cambiado. La información se almacena ahora como un diccionario de tornillos con las medidas resultantes. Vea el [status reference](Status_Reference.md#screws_tilt_adjust) para más detalles.
ta: 20230202: `printel.screws_tilt_adjust` நிலை தகவல்களின் வடிவம் மாறிவிட்டது. இதன் விளைவாக அளவீடுகளுடன் திருகுகளின் அகராதியாக செய்தி இப்போது சேமிக்கப்படுகிறது. விவரங்களுக்கு [நிலை குறிப்பு] (status_reference.md#திருகுகள்_பில்ட்_அட்சச்ட்) ஐப் பார்க்கவும்.
uk: 20230202: Змінено формат `printer.screws_tilt_adjust`. Інформація тепер зберігається як словник шурупів з отриманими вимірами. Див. [статус посилання](Status_Reference.md#screws_tilt_adjust) для деталей.
