Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: ta

source: This document is a reference for options available in the Klipper config file.
ta: இந்த ஆவணம் கிளிப்பர் கட்டமைப்பு கோப்பில் கிடைக்கும் விருப்பங்களுக்கான குறிப்பு.

source: The descriptions in this document are formatted so that it is possible to cut-and-paste them into a printer config file. See the [installation document](Installation.md) for information on setting up Klipper and choosing an initial config file.
ta: இந்த ஆவணத்தில் உள்ள விளக்கங்கள் வடிவமைக்கப்பட்டுள்ளன, இதனால் அவற்றை அச்சுப்பொறி கட்டமைப்பு கோப்பாக வெட்டி ஒட்டலாம். கிளிப்பரை அமைத்தல் மற்றும் ஆரம்ப கட்டமைப்பு கோப்பைத் தேர்ந்தெடுப்பது பற்றிய தகவலுக்கு [நிறுவல் ஆவணம்] (நிறுவல்.எம்டி) ஐப் பார்க்கவும்.

source: Micro-controller configuration
ta: மைக்ரோ-கண்ட்ரோலர் உள்ளமைவு

source: Format of micro-controller pin names
ta: மைக்ரோ-கன்ட்ரோலர் முள் பெயர்களின் வடிவம்

source: Many config options require the name of a micro-controller pin. Klipper uses the hardware names for these pins - for example `PA4`.
ta: பல கட்டமைப்பு விருப்பங்களுக்கு மைக்ரோ-கன்ட்ரோலர் முள் பெயர் தேவைப்படுகிறது. கிளிப்பர் இந்த ஊசிகளுக்கான வன்பொருள் பெயர்களைப் பயன்படுத்துகிறார் - எடுத்துக்காட்டாக `PA4`.

source: Pin names may be preceded by `!` to indicate that a reverse polarity should be used (eg, trigger on low instead of high).
ta: ஒரு தலைகீழ் துருவமுனைப்பு பயன்படுத்தப்பட வேண்டும் என்பதைக் குறிக்க முள் பெயர்கள் `!

source: Input pins may be preceded by `^` to indicate that a hardware pull-up resistor should be enabled for the pin. If the micro-controller supports pull-down resistors then an input pin may alternatively be preceded by `~`.
ta: முள் ஒரு வன்பொருள் இழுக்கும் மின்தடை இயக்கப்பட வேண்டும் என்பதைக் குறிக்க உள்ளீட்டு ஊசிகளை `^` முன்னதாக இருக்கலாம். மைக்ரோ-கன்ட்ரோலர் புல்-டவுன் மின்தடையங்களை ஆதரித்தால், ஒரு உள்ளீட்டு முள் மாற்றாக `~` மூலம் இருக்கலாம்.

source: Note, some config sections may "create" additional pins. Where this occurs, the config section defining the pins must be listed in the config file before any sections using those pins.
ta: குறிப்பு, சில கட்டமைப்பு பிரிவுகள் கூடுதல் ஊசிகளை "உருவாக்கலாம்". இது நிகழும் இடத்தில், ஊசிகளை வரையறுக்கும் கட்டமைப்பு பிரிவு அந்த ஊசிகளைப் பயன்படுத்தும் எந்த பிரிவுகளுக்கும் முன்பு கட்டமைப்பு கோப்பில் பட்டியலிடப்பட வேண்டும்.

source: Configuration of the primary micro-controller.
ta: முதன்மை மைக்ரோ-கன்ட்ரோலரின் உள்ளமைவு.

source: Additional micro-controllers (one may define any number of sections with an "mcu" prefix). Additional micro-controllers introduce additional pins that may be configured as heaters, steppers, fans, etc.. For example, if an "[mcu extra_mcu]" section is introduced, then pins such as "extra_mcu:ar9" may then be used elsewhere in the config (where "ar9" is a hardware pin name or alias name on the given mcu).
ta: கூடுதல் மைக்ரோ-கன்ட்ரோலர்கள் (ஒருவர் "எம்.சி.யு" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). கூடுதல் மைக்ரோ-கன்ட்ரோலர்கள் கூடுதல் ஊசிகளை அறிமுகப்படுத்துகின்றன, அவை ஈட்டர்கள், ச்டெப்பர்கள், ரசிகர்கள் போன்றவை கட்டமைக்கப்படலாம். எடுத்துக்காட்டாக, ஒரு "[MCU Extral_MCU]" பிரிவு அறிமுகப்படுத்தப்பட்டால், "Extra_MCU: AR9" போன்ற ஊசிகளும் வேறு இடங்களில் பயன்படுத்தப்படலாம் கட்டமைப்பில் (அங்கு "AR9" என்பது கொடுக்கப்பட்ட MCU இல் ஒரு வன்பொருள் முள் பெயர் அல்லது மாற்றுப்பெயர் பெயர்).

source: Common kinematic settings
ta: பொதுவான இயக்கவியல் அமைப்புகள்

source: The printer section controls high level printer settings.
ta: அச்சுப்பொறி பிரிவு உயர் மட்ட அச்சுப்பொறி அமைப்புகளை கட்டுப்படுத்துகிறது.

source: Stepper motor definitions. Different printer types (as specified by the "kinematics" option in the [printer] config section) require different names for the stepper (eg, `stepper_x` vs `stepper_a`). Below are common stepper definitions.
ta: ச்டெப்பர் மின்னோடி வரையறைகள். வெவ்வேறு அச்சுப்பொறி வகைகள் ([அச்சுப்பொறி] கட்டமைப்பு பிரிவில் உள்ள "இயக்கவியல்" விருப்பத்தால் குறிப்பிடப்பட்டுள்ளபடி) ச்டெப்பருக்கு வெவ்வேறு பெயர்கள் தேவைப்படுகின்றன (எ.கா. பொதுவான ச்டெப்பர் வரையறைகள் கீழே உள்ளன.

source: Cartesian Kinematics
ta: கார்ட்டீசியன் இயக்கவியல்

source: See [example-cartesian.cfg](../config/example-cartesian.cfg) for an example cartesian kinematics config file.
ta: கார்ட்டீசியன் இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-cartesian.cfg] (../ config/example-cartesian.cfg) ஐப் பார்க்கவும்.

source: Only parameters specific to cartesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: கார்ட்டீசியன் அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) ஐப் பார்க்கவும்.

source: Linear Delta Kinematics
ta: நேரியல் டெல்டா இயக்கவியல்

source: See [example-delta.cfg](../config/example-delta.cfg) for an example linear delta kinematics config file. See the [delta calibrate guide](Delta_Calibrate.md) for information on calibration.
ta: ஒரு எடுத்துக்காட்டு நேரியல் டெல்டா இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-delta.cfg] (../ config/example-delta.cfg) ஐப் பார்க்கவும். அளவுத்திருத்தம் குறித்த தகவலுக்கு [டெல்டா அளவீடு வழிகாட்டி] (டெல்டா_கலிபிரேட். எம்.டி) ஐப் பார்க்கவும்.

source: Only parameters specific to linear delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: நேரியல் டெல்டா அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) ஐப் பார்க்கவும்.

source: CoreXY Kinematics
ta: கோர்எக்சி இயக்கவியல்

source: See [example-corexy.cfg](../config/example-corexy.cfg) for an example corexy (and h-bot) kinematics file.
ta: ஒரு எடுத்துக்காட்டு கோர்எக்சி (மற்றும் எச்-போட்) இயக்கவியல் கோப்புக்கு [எடுத்துக்காட்டு-corexy.cfg] (../ config/example corexy.cfg) ஐப் பார்க்கவும்.

source: Only parameters specific to corexy printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: கோரெக்சி அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) ஐப் பார்க்கவும்.

source: CoreXZ Kinematics
ta: Corexz இயக்கவியல்

source: See [example-corexz.cfg](../config/example-corexz.cfg) for an example corexz kinematics config file.
ta: Corexz இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு corexz.cfg] (../ config/example corexz.cfg) ஐப் பார்க்கவும்.

source: Only parameters specific to corexz printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: CorexZ அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) ஐப் பார்க்கவும்.

source: Hybrid-CoreXY Kinematics
ta: கலப்பின-கோரெக்சி இயக்கவியல்

source: See [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) for an example hybrid corexy kinematics config file.
ta: ஒரு எடுத்துக்காட்டு கலப்பின கோரெக்சி இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-கலப்பின-கோரேக்சி.சி.எஃப்.சி] (..

source: This kinematic is also known as Markforged kinematic.
ta: இந்த இயக்கவியல் மார்க்ஃபோர்டு கெய்னிமாடிக் என்றும் அழைக்கப்படுகிறது.

source: Only parameters specific to hybrid corexy printers are described here see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: கலப்பின கோரெக்சி அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன, கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) காண்க.

source: Hybrid-CoreXZ Kinematics
ta: கலப்பின-கோரெக்ச் இயக்கவியல்

source: See [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) for an example hybrid corexz kinematics config file.
ta: ஒரு எடுத்துக்காட்டு கலப்பின கோர்எக்ச்இஎச் இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-கலப்பின-கோர்எக்ச்.செக்ச்.சி.எஃப்.சி] (..

source: Polar Kinematics
ta: துருவ இயக்கவியல்

source: See [example-polar.cfg](../config/example-polar.cfg) for an example polar kinematics config file.
ta: துருவ இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-polar.cfg] (../ config/example-polar.cfg) ஐப் பார்க்கவும்.

source: Only parameters specific to polar printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: துருவ அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-சினிமா-அமைப்புகள்) ஐப் பார்க்கவும்.

source: Rotary delta Kinematics
ta: ரோட்டரி டெல்டா இயக்கவியல்

source: See [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) for an example rotary delta kinematics config file.
ta: ரோட்டரி டெல்டா இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-ரோட்டரி-டெல்டா.சிஎஃப்சி] (../ கட்டமைப்பு/எடுத்துக்காட்டு-ரோட்டரி-டெல்டா.சிஎஃப்சி) ஐப் பார்க்கவும்.

source: Only parameters specific to rotary delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: ரோட்டரி டெல்டா அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) ஐப் பார்க்கவும்.

source: ROTARY DELTA KINEMATICS ARE A WORK IN PROGRESS. Homing moves may timeout and some boundary checks are not implemented.
ta: ரோட்டரி டெல்டா இயக்கவியல் ஒரு வேலை முன்னேற்றத்தில் உள்ளது. ஓமிங் நகர்வுகள் நேரம் முடிவடையும் மற்றும் சில எல்லை சோதனைகள் செயல்படுத்தப்படவில்லை.

source: Cable winch Kinematics
ta: கேபிள் வின்ச் இயக்கவியல்

source: See the [example-winch.cfg](../config/example-winch.cfg) for an example cable winch kinematics config file.
ta: கேபிள் வின்ச் இயக்கவியல் கட்டமைப்பு கோப்புக்கு [எடுத்துக்காட்டு-winch.cfg] (../ config/example-winch.cfg) ஐப் பார்க்கவும்.

source: Only parameters specific to cable winch printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
ta: கேபிள் வின்ச் அச்சுப்பொறிகளுக்கு குறிப்பிட்ட அளவுருக்கள் மட்டுமே இங்கே விவரிக்கப்பட்டுள்ளன-கிடைக்கக்கூடிய அளவுருக்களுக்கு [பொதுவான இயக்கவியல் அமைப்புகள்] (#பொதுவான-கைமாடிக்-அமைப்புகள்) பார்க்கவும்.

source: None Kinematics
ta: இயக்கவியல் எதுவும் இல்லை

source: It is possible to define a special "none" kinematics to disable kinematic support in Klipper. This may be useful for controlling devices that are not typical 3d-printers or for debugging purposes.
ta: கிளிப்பரில் இயக்கவியல் ஆதரவை முடக்க ஒரு சிறப்பு "எதுவுமில்லை" இயக்கவியலை வரையறுக்க முடியும். வழக்கமான 3 டி-பிரிண்டர்கள் அல்ல அல்லது பிழைத்திருத்த நோக்கங்களுக்காக கட்டுப்படுத்துவதற்கு இது பயனுள்ளதாக இருக்கும்.

source: Common extruder and heated bed support
ta: பொதுவான எக்ச்ட்ரூடர் மற்றும் சூடான படுக்கை உதவி

source: The heater_bed section describes a heated bed. It uses the same heater settings described in the "extruder" section.
ta: ஈட்டர்_பெட் பிரிவு ஒரு சூடான படுக்கையை விவரிக்கிறது. இது "எக்ச்ட்ரூடர்" பிரிவில் விவரிக்கப்பட்டுள்ள அதே ஈட்டர் அமைப்புகளைப் பயன்படுத்துகிறது.

source: Bed level support
ta: படுக்கை நிலை உதவி

source: Mesh Bed Leveling. One may define a bed_mesh config section to enable move transformations that offset the z axis based on a mesh generated from probed points. When using a probe to home the z-axis, it is recommended to define a safe_z_home section in printer.cfg to home toward the center of the print area.
ta: மெச் படுக்கை சமன். ஆய்வு செய்யப்பட்ட புள்ளிகளிலிருந்து உருவாக்கப்படும் கண்ணி அடிப்படையில் சட் அச்சை ஈடுசெய்யும் நகர்வு மாற்றங்களை செயல்படுத்த ஒரு படுக்கை_மேச் கட்டமைப்பு பகுதியை ஒருவர் வரையறுக்கலாம். Z- அச்சுக்கு வீட்டிற்கு ஒரு ஆய்வைப் பயன்படுத்தும் போது, அச்சுப்பொறியில் ஒரு SAFE_Z_HOME பிரிவை வரையறுக்க பரிந்துரைக்கப்படுகிறது.

source: Visual Examples:
ta: காட்சி எடுத்துக்காட்டுகள்:

source: Bed tilt compensation. One may define a bed_tilt config section to enable move transformations that account for a tilted bed. Note that bed_mesh and bed_tilt are incompatible; both cannot be defined.
ta: படுக்கை சாய்வு இழப்பீடு. சாய்ந்த படுக்கைக்கு காரணமான மாற்றங்களை இயக்குவதற்கு ஒருவர் படுக்கை_பில்ட் கட்டமைப்பு பகுதியை வரையறுக்கலாம். BED_MESH மற்றும் BED_TILT ஆகியவை பொருந்தாது என்பதை நினைவில் கொள்க; இரண்டையும் வரையறுக்க முடியாது.

source: Tool to help adjust bed leveling screws. One may define a [bed_screws] config section to enable a BED_SCREWS_ADJUST g-code command.
ta: படுக்கை சமப்படுத்தும் திருகுகளை சரிசெய்ய உதவும் கருவி. ஒரு படுக்கை_சிறந்தம்_அட்சச்ட் சி-கோட் கட்டளையை இயக்க [BED_SCREWS] கட்டமைப்பு பகுதியை ஒருவர் வரையறுக்கலாம்.

source: [screws_tilt_adjust]
ta: [ச்க்ரூச்_பில்ட்_அட்சச்ட்]

source: Tool to help adjust bed screws tilt using Z probe. One may define a screws_tilt_adjust config section to enable a SCREWS_TILT_CALCULATE g-code command.
ta: சட் ஆய்வைப் பயன்படுத்தி படுக்கை திருகுகள் சாய்வை சரிசெய்ய உதவும் கருவி. ஒரு திருகுகள்_TILT_ADJUST கட்டமைப்பு பகுதியை ஒரு திருகுகள்_TILT_CALCULATE சி-குறியீடு கட்டளையை இயக்க ஒருவர் வரையறுக்கலாம்.

source: [quad_gantry_level]
ta: [குவாட்_கான்ட்ரி_லெவல்]

source: Moving gantry leveling using 4 independently controlled Z motors. Corrects hyperbolic parabola effects (potato chip) on moving gantry which is more flexible. WARNING: Using this on a moving bed may lead to undesirable results. If this section is present then a QUAD_GANTRY_LEVEL extended G-Code command becomes available. This routine assumes the following Z motor configuration:
ta: 4 சுயாதீனமாக கட்டுப்படுத்தப்பட்ட சட் மோட்டார்கள் பயன்படுத்தி கேன்ட்ரி சமநிலைப்படுத்துதல். அதிக நெகிழ்வான கேன்ட்ரியை நகர்த்துவதில் ஐபர்போலிக் பரபோலா விளைவுகளை (உருளைக்கிழங்கு சிப்) சரிசெய்கிறது. எச்சரிக்கை: நகரும் படுக்கையில் இதைப் பயன்படுத்துவது விரும்பத்தகாத முடிவுகளுக்கு வழிவகுக்கும். இந்த பிரிவு இருந்தால், ஒரு குவாட்_கான்ட்ரி_லெவல் நீட்டிக்கப்பட்ட சி-குறியீட்டு கட்டளை கிடைக்கும். இந்த வழக்கம் பின்வரும் சட் மின்னோடி உள்ளமைவைக் கருதுகிறது:

source: Customized homing
ta: தனிப்பயனாக்கப்பட்ட ஓமிங்

source: Homing override. One may use this mechanism to run a series of g-code commands in place of a G28 found in the normal g-code input. This may be useful on printers that require a specific procedure to home the machine.
ta: ஓமிங் மேலெழுதும். சாதாரண சி-குறியீடு உள்ளீட்டில் காணப்படும் ஐயா 28 க்கு பதிலாக சி-கோட் கட்டளைகளை இயக்க இந்த பொறிமுறையைப் பயன்படுத்தலாம். இயந்திரத்தை வீட்டிற்கு வீட்டிற்கு ஒரு குறிப்பிட்ட செயல்முறை தேவைப்படும் அச்சுப்பொறிகளுக்கு இது பயனுள்ளதாக இருக்கும்.

source: Stepper phase adjusted endstops. To use this feature, define a config section with an "endstop_phase" prefix followed by the name of the corresponding stepper config section (for example, "[endstop_phase stepper_z]"). This feature can improve the accuracy of endstop switches. Add a bare "[endstop_phase]" declaration to enable the ENDSTOP_PHASE_CALIBRATE command.
ta: ச்டெப்பர் கட்டம் சரிசெய்யப்பட்ட எண்ட்ச்டாப்ச். இந்த அம்சத்தைப் பயன்படுத்த, ஒரு "எண்ட்ச்டாப்_பேச்" முன்னொட்டுடன் ஒரு கட்டமைப்பு பகுதியை வரையறுக்கவும், அதைத் தொடர்ந்து தொடர்புடைய ச்டெப்பர் கட்டமைப்பு பிரிவின் பெயரை (எடுத்துக்காட்டாக, "[EndStop_phase Stepper_z]"). இந்த நற்பொருத்தம் எண்ட்ச்டாப் சுவிட்சுகளின் துல்லியத்தை மேம்படுத்த முடியும். Endstop_phase_calibrate கட்டளையை இயக்க ஒரு "[EndStop_Phase]" அறிவிப்பைச் சேர்க்கவும்.

source: G-Code macros and events
ta: சி-கோட் மேக்ரோக்கள் மற்றும் நிகழ்வுகள்

source: G-Code macros (one may define any number of sections with a "gcode_macro" prefix). See the [command template guide](Command_Templates.md) for more information.
ta: சி-கோட் மேக்ரோக்கள் (ஒன்று "GCODE_MACRO" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). மேலும் தகவலுக்கு [கட்டளை வார்ப்புரு வழிகாட்டி] (Command_Templates.md) ஐப் பார்க்கவும்.

source: [delayed_gcode]
ta: [தாமதமாக_சோட்]

source: Idle timeout. An idle timeout is automatically enabled - add an explicit idle_timeout config section to change the default settings.
ta: செயலற்ற நேரம் முடிந்தது. செயலற்ற நேரம் முடிந்தது தானாகவே இயக்கப்பட்டிருக்கும் - இயல்புநிலை அமைப்புகளை மாற்ற வெளிப்படையான செயலற்ற_TIMEOUT கட்டமைப்பு பகுதியைச் சேர்க்கவும்.

source: Optional G-Code features
ta: விருப்ப சி-குறியீடு நற்பொருத்தங்கள்

source: [virtual_sdcard]
ta: [மெய்நிகர்_ச்ட்கார்ட்]

source: A virtual sdcard may be useful if the host machine is not fast enough to run OctoPrint well. It allows the Klipper host software to directly print gcode files stored in a directory on the host using standard sdcard G-Code commands (eg, M24).
ta: புரவலன் இயந்திரம் ஆக்டோப்ரின்ட்டை நன்றாக இயக்க போதுமானதாக இல்லாவிட்டால் மெய்நிகர் எச்.டி.கார்டு பயனுள்ளதாக இருக்கும். நிலையான SDCARD G-Code கட்டளைகளைப் பயன்படுத்தி (எ.கா., M24) ஓச்டில் ஒரு கோப்பகத்தில் சேமிக்கப்பட்ட GCODE கோப்புகளை நேரடியாக அச்சிட கிளிப்பர் புரவலன் மென்பொருளை இது அனுமதிக்கிறது.

source: Some printers with stage-clearing features, such as a part ejector or a belt printer, can find use in looping sections of the sdcard file. (For example, to print the same part over and over, or repeat the a section of a part for a chain or other repeated pattern).
ta: ஒரு பகுதி உமிழ்ப்பான் அல்லது பெல்ட் அச்சுப்பொறி போன்ற மேடை-அழிக்கும் அம்சங்களைக் கொண்ட சில அச்சுப்பொறிகள் SDCARD கோப்பின் லூப்பிங் பிரிவுகளில் பயன்பாட்டைக் காணலாம். (எடுத்துக்காட்டாக, ஒரே பகுதியை மீண்டும் மீண்டும் அச்சிட, அல்லது ஒரு சங்கிலி அல்லது பிற தொடர்ச்சியான வடிவத்திற்கு ஒரு பகுதியின் ஒரு பகுதியை மீண்டும் செய்யவும்).

source: [force_move]
ta: [forse_move]

source: Support for gcode arc (G2/G3) commands.
ta: GCODE ARC (G2/G3) கட்டளைகளுக்கான உதவி.

source: [respond]
ta: [பதிலளிக்கவும்]

source: Resonance compensation
ta: அதிர்வு இழப்பீடு

source: [adxl345]
ta: [ADICS 45]

source: [resonance_tester]
ta: [அதிர்வு_டெச்டர்]

source: Config file helpers
ta: கோப்பு உதவியாளர்கள்

source: Board pin aliases (one may define any number of sections with a "board_pins" prefix). Use this to define aliases for the pins on a micro-controller.
ta: போர்டு முள் மாற்றுப்பெயர்கள் (ஒருவர் "போர்டு_பின்ச்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). மைக்ரோ-கன்ட்ரோலரில் ஊசிகளுக்கான மாற்றுப்பெயர்களை வரையறுக்க இதைப் பயன்படுத்தவும்.

source: [include]
ta: [சேர்க்கவும்]

source: Include file support. One may include additional config file from the main printer config file. Wildcards may also be used (eg, "configs/*.cfg").
ta: கோப்பு ஆதரவைச் சேர்க்கவும். ஒன்று முதன்மையான அச்சுப்பொறி கட்டமைப்பு கோப்பிலிருந்து கூடுதல் கட்டமைப்பு கோப்பை உள்ளடக்கியிருக்கலாம். வைல்டு கார்டுகளும் பயன்படுத்தப்படலாம் (எ.கா., "கட்டமைப்புகள்/*. சி.எஃப்.சி").

source: Bed probing hardware
ta: படுக்கை ஆய்வு வன்பொருள்

source: [probe]
ta: [ஆய்வு]

source: Z height probe. One may define this section to enable Z height probing hardware. When this section is enabled, PROBE and QUERY_PROBE extended [g-code commands](G-Codes.md#probe) become available. Also, see the [probe calibrate guide](Probe_Calibrate.md). The probe section also creates a virtual "probe:z_virtual_endstop" pin. One may set the stepper_z endstop_pin to this virtual pin on cartesian style printers that use the probe in place of a z endstop. If using "probe:z_virtual_endstop" then do not define a position_endstop in the stepper_z config section.
ta: சட் உயர ஆய்வு. சட் உயரத்தை ஆய்வு செய்யும் வன்பொருளை செயல்படுத்த ஒருவர் இந்த பகுதியை வரையறுக்கலாம். இந்த பிரிவு இயக்கப்பட்டிருக்கும் போது, ஆய்வு மற்றும் வினவல்_ப்ரோப் நீட்டிக்கப்பட்ட [சி-குறியீட்டு கட்டளைகள்] (சி-கோட்ச்.எம்டி#ஆய்வு) கிடைக்கும். மேலும், [ஆய்வு அளவீடு வழிகாட்டி] (probe_calibrate.md) ஐப் பார்க்கவும். ஆய்வு பிரிவு ஒரு மெய்நிகர் "ஆய்வு: z_virtual_endstop" முள் உருவாக்குகிறது. ஒரு சட் எண்ட்ச்டாப்பிற்கு பதிலாக ஆய்வைப் பயன்படுத்தும் கார்ட்டீசியன் பாணி அச்சுப்பொறிகளில் இந்த மெய்நிகர் முள் ச்டெப்பர்_இச் எண்ட்ச்டாப்_பினை ஒருவர் அமைக்கலாம். "ஆய்வு: z_virtual_endstop" ஐப் பயன்படுத்தினால், ச்டெப்பர்_இச் கட்டமைப்பு பிரிவில் ஒரு நிலை_இண்ட்ச்டாப்பை வரையறுக்க வேண்டாம்.

source: BLTouch probe. One may define this section (instead of a probe section) to enable a BLTouch probe. See [BL-Touch guide](BLTouch.md) and [command reference](G-Codes.md#bltouch) for further information. A virtual "probe:z_virtual_endstop" pin is also created (see the "probe" section for the details).
ta: Bltouch ஆய்வு. ஒரு BLTOUCH ஆய்வை இயக்க இந்த பகுதியை (ஆய்வு பிரிவுக்கு பதிலாக) ஒருவர் வரையறுக்கலாம். மேலும் தகவலுக்கு [bl-touch வழிகாட்டி] (bltouch.md) மற்றும் [கட்டளை குறிப்பு] (g-codes.md#bltouch) ஐப் பார்க்கவும். ஒரு மெய்நிகர் "ஆய்வு: z_virtual_endstop" முள் உருவாக்கப்பட்டுள்ளது (விவரங்களுக்கு "ஆய்வு" பகுதியைப் பார்க்கவும்).

source: Additional stepper motors and extruders
ta: கூடுதல் ச்டெப்பர் மோட்டார்கள் மற்றும் எக்ச்ட்ரூடர்கள்

source: Multi-stepper axes. On a cartesian style printer, the stepper controlling a given axis may have additional config blocks defining steppers that should be stepped in concert with the primary stepper. One may define any number of sections with a numeric suffix starting at 1 (for example, "stepper_z1", "stepper_z2", etc.).
ta: மல்டி-ச்டெப்பர் அச்சுகள். ஒரு கார்ட்டீசியன் பாணி அச்சுப்பொறியில், கொடுக்கப்பட்ட அச்சைக் கட்டுப்படுத்தும் ச்டெப்பர் ச்டெப்பர்களை வரையறுக்கும் கூடுதல் கட்டமைப்புத் தொகுதிகளைக் கொண்டிருக்கலாம், அவை முதன்மை ச்டெப்பருடன் இணைந்திருக்க வேண்டும். 1 இல் தொடங்கி ஒரு எண் பின்னொட்டுடன் எத்தனை பிரிவுகளையும் ஒருவர் வரையறுக்கலாம் (எடுத்துக்காட்டாக, "Stepeper_Z1", "Stepper_Z2", முதலியன).

source: [extruder1]
ta: [எக்ச்ட்ரூடர் 1]

source: In a multi-extruder printer add an additional extruder section for each additional extruder. The additional extruder sections should be named "extruder1", "extruder2", "extruder3", and so on. See the "extruder" section for a description of available parameters.
ta: மல்டி-எக்ச்ட்ரூடர் அச்சுப்பொறியில் ஒவ்வொரு கூடுதல் எக்ச்ட்ரூடருக்கும் கூடுதல் எக்ச்ட்ரூடர் பகுதியைச் சேர்க்கவும். கூடுதல் எக்ச்ட்ரூடர் பிரிவுகளுக்கு "எக்ச்ட்ரூடர் 1", "எக்ச்ட்ரூடர் 2", "எக்ச்ட்ரூடர் 3" மற்றும் பல பெயரிடப்பட வேண்டும். கிடைக்கக்கூடிய அளவுருக்களின் விளக்கத்திற்கு "எக்ச்ட்ரூடர்" பகுதியைப் பார்க்கவும்.

source: See [sample-multi-extruder.cfg](../config/sample-multi-extruder.cfg) for an example configuration.
ta: எடுத்துக்காட்டு உள்ளமைவுக்கு [மாதிரி-மல்டி-எக்ச்ட்ரடர்.சிஎஃப்சி] (../ கட்டமைப்பு/மாதிரி-மல்டி-எக்ச்ட்ரடர்.சி.எஃப்.சி) ஐப் பார்க்கவும்.

source: See [sample-idex.cfg](../config/sample-idex.cfg) for an example configuration.
ta: எடுத்துக்காட்டு உள்ளமைவுக்கு [salem-idex.cfg] (../ config/salem-idex.cfg) ஐப் பார்க்கவும்.

source: [extruder_stepper]
ta: [எக்ச்ட்ரூடர் ச்டெப்பர்]

source: Support for additional steppers synchronized to the movement of an extruder (one may define any number of sections with an "extruder_stepper" prefix).
ta: கூடுதல் ச்டெப்பர்களுக்கான உதவி ஒரு எக்ச்ட்ரூடரின் இயக்கத்துடன் ஒத்திசைக்கப்படுகிறது (ஒருவர் "எக்ச்ட்ரூடர்_ச்டெப்பர்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்).

source: [manual_stepper]
ta: [கையேடு_ச்டெப்பர்]

source: Custom heaters and sensors
ta: தனிப்பயன் ஈட்டர்கள் மற்றும் சென்சார்கள்

source: [verify_heater]
ta: [சரிபார்ப்பு_ஈட்டர்]

source: Heater and temperature sensor verification. Heater verification is automatically enabled for each heater that is configured on the printer. Use verify_heater sections to change the default settings.
ta: ஈட்டர் மற்றும் வெப்பநிலை சென்சார் சரிபார்ப்பு. அச்சுப்பொறியில் கட்டமைக்கப்பட்ட ஒவ்வொரு ஈட்டருக்கும் ஈட்டர் சரிபார்ப்பு தானாக இயக்கப்படும். இயல்புநிலை அமைப்புகளை மாற்ற சரிபார்ப்பு_ஈட்டர் பிரிவுகளைப் பயன்படுத்தவும்.

source: Tool to disable heaters when homing or probing an axis.
ta: ஒரு அச்சில் அல்லது ஆய்வு செய்யும் போது ஈட்டர்களை முடக்க கருவி.

source: [thermistor]
ta: [தெர்மோச்டர்]
