Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: es, ta, uk

source: 20200608: The LCD display support has changed the name of some internal "glyphs". If a custom display layout was implemented it may be necessary to update to the latest glyph names (see klippy/extras/display/display.cfg for a list of available glyphs).
es: 20200608: El grupo de sostenimiento de los visualizadores LCD ha cambiado el nombre the algunos "glifos" internos. Si se ha implementado un diseño personalizado, podría ser necesario actualizar el diseño con los nombres de glifos más recientes (vea klippy/extras/display/display.cfg para una lista de los glifos disponibles).
ta: 20200608: எல்சிடி காட்சி உதவி சில உள் "கிளிஃப்ச்" பெயரை மாற்றியுள்ளது. தனிப்பயன் காட்சி தளவமைப்பு செயல்படுத்தப்பட்டால், அண்மைக் கால கிளிஃப் பெயர்களைப் புதுப்பிக்க வேண்டியது தேவை (கிடைக்கக்கூடிய கிளிஃப்களின் பட்டியலுக்கு கிளிப்பி/எக்ச்ட்ராக்கள்/டிச்ப்ளே/டிச்ப்ளே.
uk: 20200608: підтримка РК-дисплеїв змінила назву деяких внутрішніх «гліфів». Якщо було реалізовано спеціальний макет відображення, можливо, знадобиться оновити найновіші назви гліфів (див. klippy/extras/display/display.cfg, щоб переглянути список доступних гліфів).

source: 20200606: The pin names on linux mcu have changed. Pins now have names of the form `gpiochip<chipid>/gpio<gpio>`. For gpiochip0 you can also use a short `gpio<gpio>`. For example, what was previously referred to as `P20` now becomes `gpio20` or `gpiochip0/gpio20`.
es: 20200606: Los nombres de los pines en el microcontrolador ("mcu") de linux han cambiado. Los nombres de los pines ahora tienen la forma: `gpiochip<chipid>/gpio<gpio>`. Para el gpiochip0 también puede usar la forma corta `gpio<gpio>`. Por ejemplo, a lo que previamente se refería como `P20` ahora se convierte en `gpio20` o `gpiochip0/gpio20`.
ta: 20200606: லினக்ச் எம்.சி.யுவில் உள்ள முள் பெயர்கள் மாறிவிட்டன. ஊசிகளில் இப்போது `GPIOCHIP <SIBID>/GPIO <GPIO>` வடிவத்தின் பெயர்கள் உள்ளன. GPIOCHIP0 க்கு நீங்கள் ஒரு குறுகிய `GPIO <GPIO>` ஐப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, முன்பு `பி 20` என்று குறிப்பிடப்பட்டவை இப்போது` GPIO20` அல்லது `GPIOCHIP0/GPIO20` ஆகின்றன.
uk: 20200606: назви контактів на linux mcu змінено. Піни тепер мають імена у формі `gpiochip<chipid>/gpio<gpio>`. Для gpiochip0 ви також можете використовувати короткий `gpio<gpio>`. Наприклад, те, що раніше називалося «P20», тепер стає «gpio20» або «gpiochip0/gpio20».

source: 20200603: The default 16x4 LCD layout will no longer show the estimated time remaining in a print. (Only the elapsed time will be shown.) If the old behavior is desired one can customize the menu display with that information (see the description of display_data in config/example-extras.cfg for details).
es: 20200603: El diseño predeterminado del LCD 16x4 ya no va a indicar el tiempo estimado que queda en un trabajo de impresión. (Solamente va a indicar el tiempo que a transcurrido). Si se desea el comportamiento previo se puede personalizar la pantalla del menú con esa información (vea la descripción de display_data en config/example-extras.cfg para más detalles).
ta: 20200603: இயல்புநிலை 16x4 எல்சிடி தளவமைப்பு இனி மதிப்பிடப்பட்ட நேரத்தை அச்சில் காட்டாது. .
uk: 20200603: РК-верстка за замовчуванням 16x4 більше не показує розрахунковий час, що залишився в друку. (Тільки час клацання буде показано.) Якщо стара поведінка потрібна, можна налаштувати відображення меню з цією інформацією (див. опис відображення_data в config/example-extras.cfg для деталей).

source: 20200531: The default USB vendor/product id is now 0x1d50/0x614e. These new ids are reserved for Klipper (thanks to the openmoko project). This change should not require any config changes, but the new ids may appear in system logs.
es: 20200531: El número de identificación ("id") predeterminado del vendedor/producto USB ahora es 0x1d50/0x614e. Estos nuevos números de identificación están reservados para Klipper (gracias al proyecto openmoko). Este cambio no debe requerir ningún cambio a la configuración, pero los nuevos números de identificación podrían aparecer en registro del sistema.
ta: 20200531: இயல்புநிலை யூ.எச்.பி விற்பனையாளர்/தயாரிப்பு ஐடி இப்போது 0x1D50/0x614E ஆகும். இந்த புதிய ஐடிகள் கிளிப்பருக்காக ஒதுக்கப்பட்டுள்ளன (ஓபன்மோகோ திட்டத்திற்கு நன்றி). இந்த மாற்றத்திற்கு எந்த கட்டமைப்பு மாற்றங்களும் தேவையில்லை, ஆனால் புதிய ஐடிகள் கணினி பதிவுகளில் தோன்றக்கூடும்.
uk: 20200531: За замовчуванням USB постачальник / продукт id тепер 0x1d50 / 0x614e. Ці нові кришки зарезервовані для Klipper (завдяки до проекту openmoko). Ця зміна не повинна вимагати ніяких змін налаштувань, але нові потоки можуть з'явитися в логах системи.

source: 20200524: The default value for the tmc5160 pwm_freq field is now zero (instead of one).
es: 20200524: El valor predeterminado para el campo pwm_freq del tmc5160 es ahora zero (en vez de uno).
ta: 20200524: TMC5160 PWM_FREQ புலத்திற்கான இயல்புநிலை மதிப்பு இப்போது பூச்சியமாக உள்ளது (ஒன்றுக்கு பதிலாக).
uk: 20200524: Значення за замовчуванням для tmc5160 pwm_freq поле тепер нуль (замість одного).

source: 20200425: The gcode_macro command template variable `printer.heater` was renamed to `printer.heaters`.
es: 20200425: El nombre de la variable `printer.heater` de la plantilla de comando gcode_macro se cambió a `printer.heaters`.
ta: 20200425: gcode_macro கட்டளை வார்ப்புரு மாறி `அச்சுப்பொறி.ஈட்டர்`` அச்சுப்பொறி.ஈட்டர்கள்` என மறுபெயரிடப்பட்டது.
uk: 20200425: змінна шаблона gcode_macro `printer.heater` перейменовано на `printer.heaters`.

source: 20200313: The default lcd layout for multi-extruder printers with a 16x4 screen has changed. The single extruder screen layout is now the default and it will show the currently active extruder. To use the previous display layout set "display_group: _multiextruder_16x4" in the [display] section of the printer.cfg file.
es: 20200313: El diseño predeterminado del lcd para impresoras multiextrusor con pantallas 16x4 ha cambiado. El diseño de pantalla para un solo extrusor es ahora el predeterminado y mostrará el extrusor actualmente activo. Para usar el diseño de pantalla anterior escoja "display_group:_multiextruder_16x4" en la sección [display] del archivo printer.cfg.
ta: 20200313: 16x4 திரை கொண்ட மல்டி-எக்ச்ட்ரூடர் அச்சுப்பொறிகளுக்கான இயல்புநிலை எல்சிடி தளவமைப்பு மாறிவிட்டது. ஒற்றை எக்ச்ட்ரூடர் திரை தளவமைப்பு இப்போது இயல்புநிலையாக உள்ளது, மேலும் இது தற்போது செயலில் உள்ள எக்ச்ட்ரூடரைக் காண்பிக்கும். முந்தைய காட்சி தளவமைப்பு தொகுப்பைப் பயன்படுத்த "காட்சி_ குழு: _multiextruder_16x4" அச்சுப்பொறி. Cfg கோப்பின் [காட்சி] பிரிவில்.
uk: 20200313: Зміна макета за замовчуванням для багатопрофільних принтерів з екраном 16x4. Одиночна версія екрана екструдера тепер за замовчуванням і вона покаже в даний час активний екструдера. Щоб використовувати попередній набір макетів відображення "display_group: _multiextruder_16x4" в розділі [Вибір] принтера.cfg файл.

source: 20200308: The default `__test` menu item was removed. If the config file has a custom menu then be sure to remove all references to this `__test` menu item.
es: 20200308: Se eliminó el elemento predeterminado `_test` del menú. Si el archivo de configuración contiene un menú personalizado, asegúrese de remover todas las referencias al elemento del menú `_test`.
ta: 20200308: இயல்புநிலை `__test` பட்டியல் உருப்படி அகற்றப்பட்டது. கட்டமைப்பு கோப்பில் தனிப்பயன் பட்டியல் இருந்தால், இந்த __test` பட்டியல் உருப்படி குறித்த அனைத்து குறிப்புகளையும் அகற்ற மறக்காதீர்கள்.
uk: 20200308: За замовчуванням `_test` було видалено пункт меню. Якщо файл config має користувацьке меню, то обов'язково слід видалити всі посилання на це `__test` пункт меню.

source: 20200308: The menu "deck" and "card" options were removed. To customize the layout of an lcd screen use the new display_data config sections (see config/example-extras.cfg for the details).
es: 20200308: Se eliminaron las opciones del menú "deck" y "card". Use las nuevas secciones de configuración display_data para personalizar el diseño de una pantalla lcd (vea config/example-extras.cfg para los detalles).
ta: 20200308: பட்டியல் "டெக்" மற்றும் "அட்டை" விருப்பங்கள் அகற்றப்பட்டன. எல்சிடி திரையின் தளவமைப்பைத் தனிப்பயனாக்க புதிய டிச்ப்ளே_டேட்டா கட்டமைப்பு பிரிவுகளைப் பயன்படுத்தவும் (விவரங்களுக்கு config/example-extras.cfg ஐப் பார்க்கவும்).
uk: 20200308: У меню "дек" та "картка" були видалені варіанти. Для налаштування макета екрана lcd використовуйте нові розділи налаштування даних (див. config/example-extras.cfg для деталей).

source: 20200109: The bed_mesh module now references the probe's location in for the mesh configuration. As such, some configuration options have been renamed to more accurately reflect their intended functionality. For rectangular beds, `min_point` and `max_point` have been renamed to `mesh_min` and `mesh_max` respectively. For round beds, `bed_radius` has been renamed to `mesh_radius`. A new `mesh_origin` option has also been added for round beds. Note that these changes are also incompatible with previously saved mesh profiles. If an incompatible profile is detected it will be ignored and scheduled for removal. The removal process can be completed by issuing the SAVE_CONFIG command. The user will need to re-calibrate each profile.
es: 20200109: El módulo bed_mesh ahora hace referencia a la posición de la sonda para la configuración de la malla. Por lo tanto, algunas de la opciones de configuración tienen un nuevo nombre que refleja con más exactitud su propósito. Para camas rectangulares, `min_point` y `max_point` ahora se llaman `mesh_min` y `mesh_max` respectivamente. Para camas redondas, `bed_radius` cambió de nombre a `mesh_radius`. Adicionalmente, una nueva opción, `mesh_origin` se añadió para las camas redondas. Noten que estos cambios también son incompatibles con perfiles de malla previamente guardados. Si se detecta un perfil incompatible sera ignorado y programado para ser removido. El proceso de removimiento puede ser completado usando el comando SAVE_CONFIG. El usuario tendrá que volver a calibrar cada perfil.
ta: 20200109: பெட்_மேச் தொகுதி இப்போது கண்ணி உள்ளமைவுக்கான ஆய்வின் இருப்பிடத்தைக் குறிப்பிடுகிறது. எனவே, சில உள்ளமைவு விருப்பங்கள் அவற்றின் நோக்கம் கொண்ட செயல்பாட்டை இன்னும் துல்லியமாக பிரதிபலிக்கும் வகையில் மறுபெயரிடப்பட்டுள்ளன. செவ்வக படுக்கைகளுக்கு, `Min_point` மற்றும்` MAX_POINT` ஆகியவை முறையே `mesh_min` மற்றும்` Mesh_max` என மறுபெயரிடப்பட்டுள்ளன. வட்ட படுக்கைகளுக்கு, `BED_RADIUS`` Mesh_radius` என மறுபெயரிடப்பட்டது. வட்ட படுக்கைகளுக்கு ஒரு புதிய `மெச்_ரிசின்` விருப்பமும் சேர்க்கப்பட்டுள்ளது. இந்த மாற்றங்கள் முன்னர் சேமிக்கப்பட்ட கண்ணி சுயவிவரங்களுடன் பொருந்தாது என்பதை நினைவில் கொள்க. பொருந்தாத சுயவிவரம் கண்டறியப்பட்டால் அது புறக்கணிக்கப்பட்டு அகற்ற திட்டமிடப்படும். SAVE_CONFIG கட்டளையை வழங்குவதன் மூலம் அகற்றும் செயல்முறையை முடிக்க முடியும். பயனர் ஒவ்வொரு சுயவிவரத்தையும் மீண்டும் அளவீடு செய்ய வேண்டும்.
uk: 20200109: Модуль ліжко_меш тепер посилює розташування зонда для конфігурації сітки. Таким чином, деякі параметри конфігурації були перейменовані в точно відображають їх призначену функціональність. Для прямокутних місць `min_point` і `max_point` були перейменовані в `mesh_min` і `mesh_max` відповідно. `mesh_radius` Для круглих клумб додано новий варіант `mesh_origin`. Зверніть увагу, що ці зміни також несумісні з попередньо збереженими профільами сітки. Якщо несумісний профіль виявлений, він ігнорується і планується видалення. Процес видалення може бути завершено, видаючи команду SAVE_CONFIG. Користувач повинен перерахувати кожен профіль.

source: 20191218: The display config section no longer supports "lcd_type: st7567". Use the "uc1701" display type instead - set "lcd_type: uc1701" and change the "rs_pin: some_pin" to "rst_pin: some_pin". It may also be necessary to add a "contrast: 60" config setting.
es: 20191218: La sección de configuración de la pantalla ha cesado de sostener el "lcd_type: st7567". En su lugar, use el tipo de pantalla "uc1701" - asigne el "lcd_type: uc1701" y cambie el "rs_pin: some_pin" a "rst_pin: some_pin". También, puede ser necesario añadir el parámetro de configuración "contrast: 60".
ta: 20191218: காட்சி கட்டமைப்பு பிரிவு இனி "LCD_TYPE: ST7567" ஐ ஆதரிக்காது. அதற்கு பதிலாக "UC1701" காட்சி வகையைப் பயன்படுத்தவும் - "LCD_TYPE: UC1701" ஐ அமைத்து, "RS_PIN: some_pin" ஐ "rst_pin: some_pin" ஆக மாற்றவும். "மாறுபாடு: 60" கட்டமைப்பு அமைப்பைச் சேர்க்கவும் அவசியமாக இருக்கலாம்.
uk: 20191218: розділ налаштування дисплея більше не підтримує "lcd_type: st7567". Використовуйте тип дисплея "uc1701" замість - встановити "lcd_type: uc1701" і змінити "rs_pin: some_pin" до "rst_pin: some_pin". Щоб додати параметр "contrast: 60".

source: 20191210: The builtin T0, T1, T2, ... commands have been removed. The extruder activate_gcode and deactivate_gcode config options have been removed. If these commands (and scripts) are needed then define individual [gcode_macro T0] style macros that call the ACTIVATE_EXTRUDER command. See the config/sample-idex.cfg and sample-multi-extruder.cfg files for examples.
es: 20191210: Los comandos incorporados T0, T1, T2, ... han sido removidos. Las opciones de configuración activate_gcode y deactivate_gcode han sido removidas. Si se necesitan estos comandos (y programas) entonces defina macros de estilo individual [gcode_macro T0] que llamen al comando ACTIVATE_EXTRUDER. Vea ejemplos en los archivos: config/sample-idex.cfg y sample-multi-extruder.cfg.
ta: 20191210: பில்டின் டி 0, டி 1, டி 2, ... கட்டளைகள் அகற்றப்பட்டுள்ளன. எக்ச்ட்ரூடர் ஆக்டிவேட்_சி கோட் மற்றும் செயலிழப்பு_கோட் கட்டமைப்பு விருப்பங்கள் அகற்றப்பட்டுள்ளன. இந்த கட்டளைகள் (மற்றும் ச்கிரிப்ட்கள்) தேவைப்பட்டால், Activate_extruder கட்டளையை அழைக்கும் தனிப்பட்ட [GCODE_MACRO T0] பாணி மேக்ரோக்களை வரையறுக்கவும். எடுத்துக்காட்டுகளுக்கு config/shampe-idex.cfg மற்றும் மாதிரி-மல்டி-எக்ச்ட்ரடர்.சிஎஃப்சி கோப்புகளைப் பார்க்கவும்.
uk: 20191210: Вбудований T0, T1, T2, ... команди були видалені. Видалено активацію extruder_gcode та deactivate_gcode. Якщо ці команди (і скрипти) потрібні, то визначаються індивідуальні [gcode_macro T0] макроси, які називають команду ACTIVATE_EXTRUDER. Переглянути файл config/sample-idex.cfg і зразок-multi-extruder.cfg для прикладів.

source: 20191210: Support for the M206 command has been removed. Replace with calls to SET_GCODE_OFFSET. If support for M206 is needed, add a [gcode_macro M206] config section that calls SET_GCODE_OFFSET. (For example "SET_GCODE_OFFSET Z=-{params.Z}".)
es: 20191210: Se ha eliminado el sostenimiento para el comando M206. Reemplazar con llamadas a SET_GCODE_OFFSET. Si se necesita sostenimiento para el M206, añada una sección de configuración [gcode_macro M206] que llame a SET_GCODE_OFFSET. (Por ejemplo, "SET_GCODE_OFFSET Z=-{params.Z}").
ta: 20191210: M206 கட்டளைக்கான உதவி அகற்றப்பட்டது. CET_GCODE_OFFSET க்கு அழைப்புகளுடன் மாற்றவும். M206 க்கான உதவி தேவைப்பட்டால், set_gcode_offset ஐ அழைக்கும் [gcode_macro m206] கட்டமைப்பு பகுதியைச் சேர்க்கவும். (எடுத்துக்காட்டாக "set_gcode_offset சட் =-{params.Z}".)
uk: 20191210: Усунено підтримку команди M206. Замініть дзвінки до SET_GCODE_OFFSET. Якщо потрібна підтримка M206, додайте [gcode_macro M206] розділ налаштування, який викликає SET_GCODE_OFFSET. (На прикладі "SET_GCODE_OFFSET Z=-{params.Z}).)

source: 20191202: Support for the undocumented "S" parameter of the "G4" command has been removed. Replace any occurrences of S with the standard "P" parameter (the delay specified in milliseconds).
es: 20191202: Se ha eliminado el sostenimiento para el parámetro indocumentado "S" del comando “G4”. Reemplace cualquier ocurrencia de S con el parámetro estándar "P" (el retardo especificado en milisegundos).
ta: 20191202: "சி 4" கட்டளையின் ஆவணமற்ற "எச்" அளவுருவுக்கான உதவி அகற்றப்பட்டது. S இன் எந்தவொரு நிகழ்வுகளையும் நிலையான "p" அளவுருவுடன் மாற்றவும் (மில்லி விநாடிகளில் குறிப்பிடப்பட்ட தாமதம்).
uk: 20191202: Додано підтримку параметра «S» команди «G4». Заміна будь-яких появ S з параметром "P" (затримка, зазначена в мілісекундах).

source: 20191126: The USB names have changed on micro-controllers with native USB support. They now use a unique chip id by default (where available). If an "mcu" config section uses a "serial" setting that starts with "/dev/serial/by-id/" then it may be necessary to update the config. Run "ls /dev/serial/by-id/*" in an ssh terminal to determine the new id.
es: 20191126: Los nombres de USB han cambiado en los microcontroladores que tienen sostenimiento nativo para USB. Ahora, de manera predeterminada, usan una identificación de chip única (donde esté disponible). Si una sección de configuración del microcontrolador "mcu" usa una configuración "serial" que comienza con "/dev/serial/by-id/" puede ser necesario actualizar la configuración. Ejecute "ls /dev/serial/by-id/*" en un terminal ssh para determinar la nueva identificación.
ta: 20191126: சொந்த யூ.எச்.பி ஆதரவுடன் மைக்ரோ-கன்ட்ரோலர்களில் யூ.எச்.பி பெயர்கள் மாறிவிட்டன. அவர்கள் இப்போது இயல்பாக ஒரு தனித்துவமான சிப் ஐடியைப் பயன்படுத்துகிறார்கள் (கிடைக்கும் இடத்தில்). ஒரு "MCU" கட்டமைப்பு பிரிவு "/dev/serial/by-id/" உடன் தொடங்கும் "சீரியல்" அமைப்பைப் பயன்படுத்தினால், உள்ளமைவைப் புதுப்பிக்க வேண்டியது தேவை. புதிய ஐடியை தீர்மானிக்க பாஓடு முனையத்தில் "LS/DEV/SERIAL/BY-ID/*" ஐ இயக்கவும்.
uk: 20191126: На мікроконтролерах змінено імена USB. В даний час ми використовуємо унікальний чіп id за замовчуванням. Якщо в розділі "mcu" config використовує параметр "serial", який починається з "/dev/serial/by-id/" після чого може знадобитися оновити налаштування. Запуск "ls /dev/serial/by-id/*" в терміналі Ssh для визначення нової ідентифікатора.

source: 20191121: The pressure_advance_lookahead_time parameter has been removed. See example.cfg for alternate configuration settings.
es: 20191121: Se ha eliminado el parámetro pressure_advance_lookahead_time. Consulte example.cfg para conocer los parámetros de configuración alternativos.
ta: 20191121: PRESSER_ADVANCE_LOOKAHEAD_TIME அளவுரு அகற்றப்பட்டது. மாற்று உள்ளமைவு அமைப்புகளுக்கு example.cfg ஐப் பார்க்கவும்.
uk: 20191121: Видалено тиск_advance_lookahead_time параметр. Див. приклад.cfg для альтернативних налаштувань конфігурації.

source: 20191112: The tmc stepper driver virtual enable capability is now automatically enabled if the stepper does not have a dedicated stepper enable pin. Remove references to tmcXXXX:virtual_enable from the config. The ability to control multiple pins in the stepper enable_pin config has been removed. If multiple pins are needed then use a multi_pin config section.
es: 20191112: La capacidad de habilitación virtual del controlador tmc para el motor paso a paso ahora se habilita automáticamente si el motor no tiene un pin the habilitación paso a paso dedicado. Elimine las referencias a tmcXXXX:virtual_enable de la configuración. Se ha eliminado la capacidad de controlar varios pines en la configuración enable_pin del motor paso a paso. Si se necesitan varios pines utilice una sección de configuración multi_pin.
ta: 20191112: டிஎம்சி ச்டெப்பர் டிரைவர் மெய்நிகர் மெய்நிகர் திறனை இப்போது தானாகவே இயக்கப்படுகிறது, ச்டெப்பருக்கு பிரத்யேக ச்டெப்பர் இயக்குநர் முள் இல்லை என்றால். TMCXXXX க்கான குறிப்புகளை அகற்று: கட்டமைப்பிலிருந்து மெய்நிகர்_இன் செய்யக்கூடியது. ச்டெப்பரில் பல ஊசிகளைக் கட்டுப்படுத்தும் திறன் Enable_pin கட்டமைப்பை அகற்றியது. பல ஊசிகள் தேவைப்பட்டால், மல்டி_பின் கட்டமைப்பு பகுதியைப் பயன்படுத்தவும்.
uk: 20191112: Увімкнути можливість драйвера tmc stepper автоматично ввімкнено, якщо stepper не має виділеного крокової панелі. Видалити посилання на tmcXXXX:virtual_enable з налаштування. Увімкнути можливість керування декількома шпильками в степпері увімкнути_pin config. Якщо потрібно декілька штифтів, то скористайтеся розділом багатоконтактного налаштування.

source: 20191107: The primary extruder config section must be specified as "extruder" and may no longer be specified as "extruder0". Gcode command templates that query the extruder status are now accessed via "{printer.extruder}".
es: 20191107: La sección de configuración del extrusor principal debe especificarse como "extruder" y ya no puede especificarse como "extruder0". Ahora se accede a las plantillas de comando Gcode que consultan el estado del extrusor a través de "{printer.extruder}".
ta: 20191107: முதன்மை எக்ச்ட்ரூடர் கட்டமைப்பு பிரிவு "எக்ச்ட்ரூடர்" என்று குறிப்பிடப்பட வேண்டும், மேலும் இனி "எக்ச்ட்ரூடர் 0" என்று குறிப்பிடப்படாது. எக்ச்ட்ரூடர் நிலையை வினவும் GCODE கட்டளை வார்ப்புருக்கள் இப்போது "{printer.extruder}" வழியாக அணுகப்படுகின்றன.
uk: 20191107: В розділі Налаштування первинного екструдера необхідно вказати як "екструдера" і не може бути зазначений як "extruder0". Шаблони командних кодів Gcode, які перетворюють статус екструдера, тепер доступні через "{printer.extruder}".

source: 20191021: Klipper v0.8.0 released
es: 20191021: Ha salido la versión v0.8.0 de Klipper
ta: 20191021: வெட்டுக்கள் V0.8.0 வெளியிடப்பட்டது
uk: 20191021: Klipper v0.8.0 випущений

source: 20191003: The move_to_previous option in [safe_z_homing] now defaults to False. (It was effectively False prior to 20190918.)
es: 20191003: Ahora, la opción move_to_previous en [safe_z_homing] es preestablecida como Falso. (Era efectivamente Falso antes de 20190918.)
ta: 20191003: [SAFE_Z_HOMING] இல் உள்ள MOVE_TO_PREVIOUS விருப்பம் இப்போது இயல்புநிலையாக இருக்கும். (இது 20190918 க்கு முன்னர் திறம்பட தவறானது.)
uk: 20191003: Перехід_to_previous параметр в [safe_z_homing] тепер за замовчуванням до False. (Це було ефективно False до 20190918)

source: 20190918: The zhop option in [safe_z_homing] is always re-applied after Z axis homing completed. This might need users to update custom scripts based on this module.
es: 20190918: La opción zhop en [safe_z_homing] siempre se vuelve a aplicar después de completar el proceso de retorno a casa en el eje Z. Esto podría requerir que los usuarios actualicen los programas personalizados basados en este módulo.
ta: 20190918: [SAFE_Z_HOMING] இல் உள்ள ZHOP விருப்பம் சட் அச்சு ஓமிங் முடிந்ததும் எப்போதும் மீண்டும் பயன்படுத்தப்படுகிறது. இந்த தொகுதியின் அடிப்படையில் தனிப்பயன் ச்கிரிப்ட்களைப் புதுப்பிக்க பயனர்கள் தேவைப்படலாம்.
uk: 20190918: Опція zhop в [safe_z_homing] завжди re-applied після закінчення осі Z. Це може знадобитися для оновлення користувацьких скриптів на основі цього модуля.

source: 20190806: The SET_NEOPIXEL command has been renamed to SET_LED.
es: 20190806: El comando SET_NEOPIXEL ha cambiado de nombre a SET_LED.
ta: 20190806: SET_NEOPIXEL கட்டளை SET_LED என மறுபெயரிடப்பட்டது.
uk: 20190806: Команда SET_NEOPIXEL була перейменована в SET_LED.

source: 20190726: The mcp4728 digital-to-analog code has changed. The default i2c_address is now 0x60 and the voltage reference is now relative to the mcp4728's internal 2.048 volt reference.
es: 20190726: El código para convertir de digital-a-analógico del mcp4728 ha cambiado. El valor predeterminado para el i2c_address ahora es 0x60 y el voltaje de referencia es ahora relativo a la referencia interna de 2.048 vatios del mcp4728.
ta: 20190726: MCP4728 டிசிட்டல்-டு-அனலாக் குறியீடு மாறிவிட்டது. இயல்புநிலை i2c_address இப்போது 0x60 மற்றும் மின்னழுத்த குறிப்பு இப்போது MCP4728 இன் உள் 2.048 வோல்ட் குறிப்புடன் தொடர்புடையது.
uk: 20190726: змінено цифровий код mcp4728. За замовчуванням i2c_address тепер 0x60 і посилання на напругу тепер відносно внутрішньої версії mcp4728.
