Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: ta

source: Temperature-dependant toolhead Z position adjustment. Compensate for vertical toolhead movement caused by thermal expansion of the printer's frame in real-time using a temperature sensor (typically coupled to a vertical section of frame).
ta: வெப்பநிலை-சார்புடைய கருவிஎட் சட் நிலை சரிசெய்தல். வெப்பநிலை சென்சாரைப் பயன்படுத்தி நிகழ்நேரத்தில் அச்சுப்பொறியின் சட்டத்தின் வெப்ப விரிவாக்கத்தால் ஏற்படும் செங்குத்து கருவிஎட் இயக்கத்திற்கு ஈடுசெய்யவும் (பொதுவாக சட்டத்தின் செங்குத்து பிரிவுடன் இணைக்கப்படுகிறது).

source: See also: [extended g-code commands](G-Codes.md#z_thermal_adjust).
ta: மேலும் காண்க: [நீட்டிக்கப்பட்ட சி-குறியீடு கட்டளைகள்] (g-codes.md#z_thermal_adjust).

source: Support for MPU-9250, MPU-9255, MPU-6515, MPU-6050, and MPU-6500 accelerometers (one may define any number of sections with an "mpu9250" prefix).
ta: MPU-9250, MPU-9255, MPU-6515, MPU-6050, மற்றும் MPU-6500 முடுக்கமானிகள் ஆகியவற்றிற்கான உதவி (ஒருவர் "MPU9250" முன்னொட்டு கொண்ட எந்தவொரு பிரிவுகளையும் வரையறுக்கலாம்.

source: Note that Klipper's current micro-controller support for I2C is generally not tolerant to line noise. Unexpected errors on the I2C wires may result in Klipper raising a run-time error. Klipper's support for error recovery varies between each micro-controller type. It is generally recommended to only use I2C devices that are on the same printed circuit board as the micro-controller.
ta: I2C க்கான கிளிப்பரின் தற்போதைய மைக்ரோ-கன்ட்ரோலர் உதவி பொதுவாக வரி சத்தத்தை சகித்துக்கொள்ளாது என்பதை நினைவில் கொள்க. I2C கம்பிகளில் எதிர்பாராத பிழைகள் கிளிப்பர் ரன்-டைம் பிழையை உயர்த்தக்கூடும். பிழை மீட்புக்கான கிளிப்பரின் உதவி ஒவ்வொரு மைக்ரோ-கன்ட்ரோலர் வகைக்கும் இடையில் மாறுபடும். மைக்ரோ-கன்ட்ரோலரின் அதே அச்சிடப்பட்ட சர்க்யூட் போர்டில் இருக்கும் I2C சாதனங்களை மட்டுமே பயன்படுத்த பரிந்துரைக்கப்படுகிறது.

source: Support for LIS2DW accelerometers.
ta: LIS2DW முடுக்கமானிகளுக்கான உதவி.

source: Support for cartesian and hybrid_corexy/z printers with dual carriages on a single axis. The carriage mode can be set via the SET_DUAL_CARRIAGE extended g-code command. For example, "SET_DUAL_CARRIAGE CARRIAGE=1" command will activate the carriage defined in this section (CARRIAGE=0 will return activation to the primary carriage). Dual carriage support is typically combined with extra extruders - the SET_DUAL_CARRIAGE command is often called at the same time as the ACTIVATE_EXTRUDER command. Be sure to park the carriages during deactivation. Note that during G28 homing, typically the primary carriage is homed first followed by the carriage defined in the `[dual_carriage]` config section. However, the `[dual_carriage]` carriage will be homed first if both carriages home in a positive direction and the [dual_carriage] carriage has a `position_endstop` greater than the primary carriage, or if both carriages home in a negative direction and the `[dual_carriage]` carriage has a `position_endstop` less than the primary carriage.
ta: ஒற்றை அச்சில் இரட்டை வண்டிகளுடன் கார்ட்டீசியன் மற்றும் ஐப்ரிட்_கோரெக்சி/இசட் அச்சுப்பொறிகளுக்கான உதவி. வண்டி பயன்முறையை set_dual_carriage நீட்டிக்கப்பட்ட சி-குறியீடு கட்டளை வழியாக அமைக்கலாம். எடுத்துக்காட்டாக, "set_dual_carriage வண்டி = 1" கட்டளை இந்த பிரிவில் வரையறுக்கப்பட்ட வண்டியை செயல்படுத்தும் (வண்டி = 0 முதன்மை வண்டிக்கு செயல்படுத்தும்). இரட்டை வண்டி உதவி பொதுவாக கூடுதல் எக்ச்ட்ரூடர்களுடன் இணைக்கப்படுகிறது - Set_dual_carriage கட்டளை பெரும்பாலும் Activate_extruder கட்டளையின் அதே நேரத்தில் அழைக்கப்படுகிறது. செயலிழக்கும்போது வண்டிகளை நிறுத்த மறக்காதீர்கள். ஐயா 28 ஓமிங்கின் போது, பொதுவாக முதன்மை வண்டி முதலில் `[டூயல்_ காரேச்]` கட்டமைப்பு பிரிவில் வரையறுக்கப்பட்ட வண்டியைத் தொடர்ந்து உள்ளது என்பதை நினைவில் கொள்க. இருப்பினும், இரு நேர்மறையான திசையில் வீட்டிற்கு எடுத்துச் சென்றால் `[இரட்டை_ காரியேச்]` வண்டி முதலில் வைத்திருக்கும் மற்றும் [டூயல்_ காரேச்] வண்டியில் முதன்மை வண்டியை விட `நிலை_என்ட்ச்டாப்` அதிகமாக இருந்தால், அல்லது இருவரும் எதிர்மறையான திசையில் வீட்டிற்கு எடுத்துச் சென்றால் மற்றும்` .

source: Additionally, one could use "SET_DUAL_CARRIAGE CARRIAGE=1 MODE=COPY" or "SET_DUAL_CARRIAGE CARRIAGE=1 MODE=MIRROR" commands to activate either copying or mirroring mode of the dual carriage, in which case it will follow the motion of the carriage 0 accordingly. These commands can be used to print two parts simultaneously - either two identical parts (in COPY mode) or mirrored parts (in MIRROR mode). Note that COPY and MIRROR modes also require appropriate configuration of the extruder on the dual carriage, which can typically be achieved with "SYNC_EXTRUDER_MOTION MOTION_QUEUE=extruder EXTRUDER=<dual_carriage_extruder>" or a similar command.
ta: கூடுதலாக, ஒருவர் "set_dual_carriage வண்டி = 1 பயன்முறை = நகல்" அல்லது "set_dual_carriage வண்டி = 1 பயன்முறை = மிரர்" கட்டளைகளை இரட்டை வண்டியின் நகலெடுத்தல் அல்லது பிரதிபலிக்கும் பயன்முறையை செயல்படுத்தலாம், இந்த விசயத்தில் அது வண்டி 0 இன் இயக்கத்தை பின்பற்றும் . இந்த கட்டளைகளை ஒரே நேரத்தில் இரண்டு பகுதிகளை அச்சிட பயன்படுத்தலாம் - இரண்டு ஒத்த பாகங்கள் (நகல் பயன்முறையில்) அல்லது பிரதிபலித்த பாகங்கள் (கண்ணாடி பயன்முறையில்). நகல் மற்றும் கண்ணாடி முறைகளுக்கு இரட்டை வண்டியில் எக்ச்ட்ரூடரின் பொருத்தமான உள்ளமைவு தேவைப்படுகிறது என்பதை நினைவில் கொள்க, இது பொதுவாக "Sync_extruder_motional Motion_queue = Extruder Extruder = <dual_carriage_extruder>" அல்லது இதே போன்ற கட்டளை மூலம் அடைய முடியும்.

source: AHT10/AHT20/AHT21 temperature sensor
ta: AHT10/AHT20/AHT21 வெப்பநிலை சென்சார்

source: AHT10/AHT20/AHT21 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C) and relative humidity. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report humidity in addition to temperature.
ta: AHT10/AHT20/AHT21 இரண்டு கம்பி இடைமுகம் (I2C) சுற்றுச்சூழல் சென்சார்கள். இந்த சென்சார்கள் எக்ச்ட்ரூடர்கள் மற்றும் ஈட்டர் படுக்கைகளுடன் பயன்படுத்த விரும்பவில்லை என்பதை நினைவில் கொள்க, மாறாக சுற்றுப்புற வெப்பநிலை (சி) மற்றும் ஈரப்பதத்தை கண்காணிக்க. ஒரு GCODE_MACRO க்கு [மாதிரி-macros.cfg] (../ config/shalm-macros.cfg) ஐப் பார்க்கவும், இது வெப்பநிலைக்கு கூடுதலாக ஈரப்பதத்தைப் புகாரளிக்கப் பயன்படலாம்.

source: Combined temperature sensor
ta: ஒருங்கிணைந்த வெப்பநிலை சென்சார்

source: Combined temperature sensor is a virtual temperature sensor based on several other sensors. This sensor can be used with extruders, heater_generic and heater beds.
ta: ஒருங்கிணைந்த வெப்பநிலை சென்சார் என்பது பல சென்சார்களை அடிப்படையாகக் கொண்ட ஒரு மெய்நிகர் வெப்பநிலை சென்சார் ஆகும். இந்த சென்சார் எக்ச்ட்ரூடர்கள், ஈட்டர்_செனெரிக் மற்றும் ஈட்டர் படுக்கைகளுடன் பயன்படுத்தப்படலாம்.

source: Configure a TMC2240 stepper motor driver via SPI bus or UART. To use this feature, define a config section with a "tmc2240" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2240 stepper_x]").
ta: SPI பச் அல்லது UART வழியாக TMC2240 ச்டெப்பர் மின்னோடி டிரைவரை உள்ளமைக்கவும். இந்த அம்சத்தைப் பயன்படுத்த, "TMC2240" முன்னொட்டுடன் ஒரு கட்டமைப்பு பகுதியை வரையறுக்கவும், அதன்பிறகு தொடர்புடைய ச்டெப்பர் கட்டமைப்பு பிரிவின் பெயரை (எடுத்துக்காட்டாக, "[TMC2240 Stepeper_x]").

source: Pulse width modulation digital output pins capable of high speed updates (one may define any number of sections with an "output_pin" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1" type extended [g-code commands](G-Codes.md#output_pin).
ta: துடிப்பு அகல பண்பேற்றம் டிசிட்டல் வெளியீட்டு ஊசிகளை அதிவேக புதுப்பிப்புகளுக்கு திறன் கொண்டது (ஒன்று "வெளியீடு_பின்" முன்னொட்டு கொண்ட எந்தவொரு பிரிவுகளையும் வரையறுக்கலாம்). இங்கே கட்டமைக்கப்பட்ட முள் கள் வெளியீட்டு ஊசிகளாக அமைக்கப்படும், மேலும் "Set_pin முள் = My_Pin மதிப்பு = .1" வகை நீட்டிக்கப்பட்ட [சி-குறியீட்டு கட்டளைகள்] (g- codes.md#output_pin) ஐப் பயன்படுத்தி அவற்றை ரன்-நேரத்தில் மாற்றலாம்.

source: Run-time configurable output pins with dynamic pwm cycle timing (one may define any number of sections with an "pwm_cycle_time" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1 CYCLE_TIME=0.100" type extended [g-code commands](G-Codes.md#pwm_cycle_time).
ta: மாறும் பி.டபிள்யூ.எம் சுழற்சி நேரத்துடன் ரன்-டைம் கட்டமைக்கக்கூடிய வெளியீட்டு ஊசிகள் (ஒன்று "PWM_CYCLE_TIME" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). இங்கே கட்டமைக்கப்பட்ட முள் கள் வெளியீட்டு ஊசிகளாக அமைக்கப்படும், மேலும் "Set_pin முள் = My_pin மதிப்பு = .1 சுழற்சி_ நேரம் = 0.100" வகை நீட்டிக்கப்பட்ட [சி-குறியீட்டு கட்டளைகள்] (g-codes.md#pwm_cycle_time) ஐப் பயன்படுத்தி அவற்றை இயக்க நேரத்தில் மாற்றலாம்.

source: Support for eddy current inductive probes. One may define this section (instead of a probe section) to enable this probe. See the [command reference](G-Codes.md#probe_eddy_current) for further information.
ta: எடி தற்போதைய தூண்டல் ஆய்வுகளுக்கான உதவி. இந்த ஆய்வை இயக்க இந்த பகுதியை (ஆய்வு பிரிவுக்கு பதிலாக) ஒருவர் வரையறுக்கலாம். மேலும் தகவலுக்கு [கட்டளை குறிப்பு] (g-codes.md#probe_eddy_current) ஐப் பார்க்கவும்.

source: [temperature_probe]
ta: [வெப்பநிலை_ப்ரோப்]

source: Reports probe coil temperature. Includes optional thermal drift calibration for eddy current based probes. A `[temperature_probe]` section may be linked to a `[probe_eddy_current]` by using the same postfix for both sections.
ta: சுருள் வெப்பநிலை ஆய்வு. எடி தற்போதைய அடிப்படையிலான ஆய்வுகளுக்கான விருப்ப வெப்ப சறுக்கல் அளவுத்திருத்தத்தை உள்ளடக்கியது. இரு பிரிவுகளுக்கும் ஒரே போச்ட்ஃபிக்சைப் பயன்படுத்துவதன் மூலம் ஒரு `[வெப்பநிலை_பிரோப்]` பிரிவு `[probe_eddy_current] with உடன் இணைக்கப்படலாம்.

source: BMP180/BMP280/BME280/BMP388/BME680 temperature sensor
ta: BMP180/BMP280/BME280/BMP388/BME680 வெப்பநிலை சென்சார்

source: BMP180/BMP280/BME280/BMP388/BME680 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C), pressure (hPa), relative humidity and in case of the BME680 gas level. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report pressure and humidity in addition to temperature.
ta: BMP180/BMP280/BME280/BMP388/BME680 இரண்டு கம்பி இடைமுகம் (I2C) சுற்றுச்சூழல் சென்சார்கள். இந்த சென்சார்கள் எக்ச்ட்ரூடர்கள் மற்றும் ஈட்டர் படுக்கைகளுடன் பயன்படுத்த விரும்பவில்லை என்பதை நினைவில் கொள்க, மாறாக சுற்றுப்புற வெப்பநிலை (சி), அழுத்தம் (எச்பிஏ), உறவினர் ஈரப்பதம் மற்றும் பிஎம்இ 680 காற்று மட்டத்தின் போது கண்காணிக்க. ஒரு GCODE_MACRO க்கு [மாதிரி-macros.cfg] (../ config/shalm-macros.cfg) ஐப் பார்க்கவும், இது வெப்பநிலைக்கு கூடுதலாக அழுத்தம் மற்றும் ஈரப்பதத்தைப் புகாரளிக்கப் பயன்படலாம்.

source: SHT3X sensor
ta: SHT3X சென்சார்

source: SHT3X family two wire interface (I2C) environmental sensor. These sensors have a range of -55~125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers.
ta: SHT3X குடும்பம் இரண்டு கம்பி இடைமுகம் (I2C) சுற்றுச்சூழல் சென்சார். இந்த சென்சார்கள் -55 ~ 125 சி வரம்பைக் கொண்டுள்ளன, எனவே எ.கா. அறை வெப்பநிலை கண்காணிப்பு. அவை எளிய விசிறி/ஈட்டர் கன்ட்ரோலர்களாகவும் செயல்பட முடியும்.

source: Load Cells
ta: செல்களை ஏற்றவும்

source: Load Cell. Uses an ADC sensor attached to a load cell to create a digital scale.
ta: கலத்தை ஏற்றவும். டிசிட்டல் அளவை உருவாக்க சுமை கலத்துடன் இணைக்கப்பட்ட ஏடிசி சென்சாரைப் பயன்படுத்துகிறது.

source: This is a 24 bit low sample rate chip using "bit-bang" communications. It is suitable for filament scales.
ta: இது "பிட்-பேங்" தகவல்தொடர்புகளைப் பயன்படுத்தி 24 பிட் குறைந்த மாதிரி வீத சிப் ஆகும். இது இழை அளவீடுகளுக்கு ஏற்றது.

source: This is the 4x higher sample rate version of the HX711, suitable for probing.
ta: இது HX711 இன் 4x உயர் மாதிரி வீத பதிப்பாகும், இது ஆராய்வதற்கு ஏற்றது.

source: The ADS1220 is a 24 bit ADC supporting up to a 2Khz sample rate configurable in software.
ta: ADS1220 என்பது மென்பொருளில் கட்டமைக்கக்கூடிய 2KHz மாதிரி வீதத்தை ஆதரிக்கும் 24 பிட் ஏடிசி ஆகும்.
