Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_checks.po
Languages: lt, ta

source: This document provides a list of steps to help confirm the pin settings in the Klipper printer.cfg file. It is a good idea to run through these steps after following the steps in the [installation document](Installation.md).
lt: Šiame dokumente pateikiamas veiksmų sąrašas, padedantis patvirtinti kaiščių nustatymus Klipper printer.cfg faile. Rekomenduojama atlikti šiuos veiksmus atlikus veiksmus, nurodytus [diegimo dokumente](Installation.md).
ta: இந்த ஆவணம் Klipper printed.cfg கோப்பில் உள்ள முள் அமைப்புகளை உறுதிப்படுத்த உதவும் படிகளின் பட்டியலை வழங்குகிறது. [நிறுவல் ஆவணம்] (Installation.md) இல் உள்ள படிகளைப் பின்பற்றிய பிறகு இந்த படிகளை இயக்குவது நல்லது.

source: During this guide, it may be necessary to make changes to the Klipper config file. Be sure to issue a RESTART command after every change to the config file to ensure that the change takes effect (type "restart" in the Octoprint terminal tab and then click "Send"). It's also a good idea to issue a STATUS command after every RESTART to verify that the config file is successfully loaded.
lt: Šio vadovo metu gali prireikti atlikti pakeitimus Klipper konfigūracijos faile. Būtinai išleiskite komandą RESTART po kiekvieno konfigūracijos failo pakeitimo, kad pakeitimas įsigaliotų (įveskite "restart" Octoprint terminalo skirtuke ir tada spustelėkite "Siųsti"). Taip pat patartina išleisti STATUS komandą po kiekvieno RESTART, kad būtų patikrinta, ar konfigūracijos failas sėkmingai įkeltas.
ta: இந்த வழிகாட்டியின் போது, கிளிப்பர் கட்டமைப்பு கோப்பில் மாற்றங்களைச் செய்வது அவசியமாக இருக்கலாம். மாற்றம் நடைமுறைக்கு வருவதை உறுதிசெய்ய கட்டமைப்பு கோப்பில் ஒவ்வொரு மாற்றத்திற்குப் பிறகு மறுதொடக்கம் கட்டளையை வழங்குவதை உறுதிப்படுத்திக் கொள்ளுங்கள் (ஆக்டோப்ரிண்ட் டெர்மினல் தாவலில் "மறுதொடக்கம்" என்று தட்டச்சு செய்து, பின்னர் "அனுப்பு" என்பதைக் சொடுக்கு செய்க). கட்டமைப்பு கோப்பு வெற்றிகரமாக ஏற்றப்பட்டதா என்பதை சரிபார்க்க ஒவ்வொரு மறுதொடக்கத்திற்கும் பிறகு ஒரு நிலை கட்டளையை வெளியிடுவதும் நல்லது.

source: Verify temperature
lt: Patikrinkite temperatūrą
ta: வெப்பநிலையை சரிபார்க்கவும்

source: Verify M112
lt: Patikrinkite M112
ta: M112 ஐ சரிபார்க்கவும்

source: Verify heaters
lt: Patikrinkite šildytuvus
ta: ஈட்டர்களை சரிபார்க்கவும்

source: If the printer has a heated bed then perform the above test again with the bed.
lt: Jei spausdintuvas turi šildomą platformą, atlikite aukščiau nurodytą testą dar kartą su platforma.
ta: அச்சுப்பொறியில் சூடான படுக்கை இருந்தால், மேற்கண்ட சோதனையை மீண்டும் படுக்கையுடன் செய்யுங்கள்.

source: Verify stepper motor enable pin
lt: Patikrinkite žingsninio variklio įjungimo kaištį
ta: ச்டெப்பர் மின்னோடி இயக்கவும் முள் சரிபார்க்கவும்

source: Verify endstops
lt: Patikrinkite galinius jungiklius
ta: எண்ட்ச்டாப்புகளை சரிபார்க்கவும்

source: If the endstop does not change at all then it generally indicates that the endstop is connected to a different pin. However, it may also require a change to the pullup setting of the pin (the '^' at the start of the endstop_pin name - most printers will use a pullup resistor and the '^' should be present).
lt: Jei galinis jungiklis visai nesikeičia, tai paprastai rodo, kad galinis jungiklis yra prijungtas prie kito kaiščio. Tačiau taip pat gali prireikti pakeisti kaiščio ištraukimo nustatymą ('^' ženklas endstop_pin pavadinimo pradžioje - dauguma spausdintuvų naudos ištraukimo rezistorių ir '^' turėtų būti).
ta: எண்ட்ச்டாப் எதுவும் மாறவில்லை என்றால், அது பொதுவாக எண்ட்ச்டாப் வேறு முள் உடன் இணைக்கப்பட்டுள்ளது என்பதைக் குறிக்கிறது. இருப்பினும், இது முள் இழுக்கும் அமைப்பில் மாற்றம் தேவைப்படலாம் (எண்ட்ச்டாப்_பின் பெயரின் தொடக்கத்தில் '^' - பெரும்பாலான அச்சுப்பொறிகள் புல்அப் மின்தடையைப் பயன்படுத்தும், மேலும் '^' இருக்க வேண்டும்).

source: Verify stepper motors
lt: Patikrinkite žingsninius variklius
ta: ச்டெப்பர் மோட்டார்கள் சரிபார்க்கவும்

source: If the stepper does not move at all, then verify the "enable_pin" and "step_pin" settings for the stepper. If the stepper motor moves but does not return to its original position then verify the "dir_pin" setting. If the stepper motor oscillates in an incorrect direction, then it generally indicates that the "dir_pin" for the axis needs to be inverted. This is done by adding a '!' to the "dir_pin" in the printer config file (or removing it if one is already there). If the motor moves significantly more or significantly less than one millimeter then verify the "rotation_distance" setting.
lt: Jei žingsninis variklis visai nejuda, patikrinkite "enable_pin" ir "step_pin" nustatymus žingsniniam varikliui. Jei žingsninis variklis juda, bet negrįžta į pradinę padėtį, patikrinkite "dir_pin" nustatymą. Jei žingsninis variklis svyruoja neteisinga kryptimi, tai paprastai rodo, kad ašies "dir_pin" reikia invertuoti. Tai daroma pridedant '!' prie "dir_pin" spausdintuvo konfigūracijos faile (arba pašalinant jį, jei jis jau yra). Jei variklis juda žymiai daugiau arba žymiai mažiau nei vieną milimetrą, patikrinkite "rotation_distance" nustatymą.
ta: ச்டெப்பர் நகர்த்தவில்லை என்றால், ச்டெப்பருக்கான "Enable_pin" மற்றும் "Step_pin" அமைப்புகளை சரிபார்க்கவும். ச்டெப்பர் மின்னோடி நகர்ந்தால் ஆனால் அதன் அசல் நிலைக்குத் திரும்பவில்லை என்றால், "dir_pin" அமைப்பை சரிபார்க்கவும். ச்டெப்பர் மின்னோடி தவறான திசையில் ஊசலாடினால், அது பொதுவாக அச்சுக்கான "dir_pin" தலைகீழாக இருக்க வேண்டும் என்பதைக் குறிக்கிறது. '!' அச்சுப்பொறி கட்டமைப்பு கோப்பில் உள்ள "DIR_PIN" க்கு (அல்லது ஒருவர் ஏற்கனவே இருந்தால் அதை நீக்குகிறது). மின்னோடி ஒரு மில்லிமீட்டரை விட கணிசமாக அதிகமாகவோ அல்லது கணிசமாக குறைவாகவோ நகர்ந்தால், "சுழற்சி_டி" அமைப்பை சரிபார்க்கவும்.

source: Run the above test for each stepper motor defined in the config file. (Set the STEPPER parameter of the STEPPER_BUZZ command to the name of the config section that is to be tested.) If there is no filament in the extruder then one can use STEPPER_BUZZ to verify the extruder motor connectivity (use STEPPER=extruder). Otherwise, it's best to test the extruder motor separately (see the next section).
lt: Atlikite aukščiau nurodytą testą kiekvienam žingsniniam varikliui, apibrėžtam konfigūracijos faile. (Nustatykite STEPPER_BUZZ komandos STEPPER parametrą į konfigūracijos skyriaus, kurį reikia patikrinti, pavadinimą.) Jei ekstruzeryje nėra gijos, galima naudoti STEPPER_BUZZ, kad būtų patikrintas ekstruzerio variklio jungiamumas (naudokite STEPPER=extruder). Priešingu atveju geriausia patikrinti ekstruzerio variklį atskirai (žr. kitą skyrių).
ta: கட்டமைப்பு கோப்பில் வரையறுக்கப்பட்ட ஒவ்வொரு ச்டெப்பர் மோட்டருக்கும் மேலே உள்ள சோதனையை இயக்கவும். . இல்லையெனில், எக்ச்ட்ரூடர் மோட்டாரை தனித்தனியாக சோதிப்பது சிறந்தது (அடுத்த பகுதியைப் பார்க்கவும்).

source: After verifying all endstops and verifying all stepper motors the homing mechanism should be tested. Issue a G28 command to home all axes. Remove power from the printer if it does not home properly. Rerun the endstop and stepper motor verification steps if necessary.
lt: Patikrinus visus galinius jungiklius ir patikrinus visus žingsninius variklius, reikėtų patikrinti pradinės padėties mechanizmą. Išleiskite G28 komandą, kad nustatytumėte visų ašių pradinę padėtį. Atjunkite maitinimą nuo spausdintuvo, jei jis tinkamai negrįžta į pradinę padėtį. Jei reikia, pakartokite galinių jungiklių ir žingsninių variklių patikrinimo veiksmus.
ta: அனைத்து எண்ட்ச்டாப்புகளையும் சரிபார்த்து, அனைத்து ச்டெப்பர் மோட்டர்களையும் சரிபார்த்த பிறகு, ஓமிங் பொறிமுறையை சோதிக்க வேண்டும். அனைத்து அச்சுகளையும் வீட்டிற்கு ஒரு G28 கட்டளையை வழங்கவும். சரியாக வீட்டில் இல்லாவிட்டால் அச்சுப்பொறியிலிருந்து சக்தியை அகற்றவும். தேவைப்பட்டால் எண்ட்ச்டாப் மற்றும் ச்டெப்பர் மின்னோடி சரிபார்ப்பு படிகளை மீண்டும் இயக்கவும்.

source: Verify extruder motor
lt: Patikrinkite ekstruzerio variklį
ta: எக்ச்ட்ரூடர் மோட்டாரை சரிபார்க்கவும்

source: Calibrate PID settings
lt: Kalibruokite PID nustatymus
ta: PID அமைப்புகளை அளவீடு செய்யுங்கள்

source: At the completion of the tuning test run `SAVE_CONFIG` to update the printer.cfg file the new PID settings.
lt: Baigus derinimo testą, paleiskite `SAVE_CONFIG`, kad atnaujintumėte printer.cfg failą su naujais PID nustatymais.
ta: ட்யூனிங் டெச்ட் ரன் `save_config` ஐ புதுப்பிக்க` save_config` புதிய பிஐடி அமைப்புகளை கோப்பு.

source: If the printer has a heated bed and it supports being driven by PWM (Pulse Width Modulation) then it is recommended to use PID control for the bed. (When the bed heater is controlled using the PID algorithm it may turn on and off ten times a second, which may not be suitable for heaters using a mechanical switch.) A typical bed PID calibration command is: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
lt: Jei spausdintuvas turi šildomą platformą ir ji palaiko PWM (impulso pločio moduliaciją) valdymą, rekomenduojama naudoti PID valdymą platformai. (Kai platformos šildytuvas valdomas naudojant PID algoritmą, jis gali įsijungti ir išsijungti dešimt kartų per sekundę, o tai gali netikti šildytuvams, naudojantiems mechaninį jungiklį.) Tipinė platformos PID kalibravimo komanda yra: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
ta: அச்சுப்பொறியில் சூடான படுக்கை இருந்தால், அது PWM (துடிப்பு அகல பண்பேற்றம்) மூலம் இயக்கப்படுவதை ஆதரிக்கிறது என்றால், படுக்கைக்கு PID கட்டுப்பாட்டைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது. . 60`

source: Next steps
lt: Kiti žingsniai
ta: அடுத்த படிகள்

source: This guide is intended to help with basic verification of pin settings in the Klipper configuration file. Be sure to read the [bed leveling](Bed_Level.md) guide. Also see the [Slicers](Slicers.md) document for information on configuring a slicer with Klipper.
lt: Šis vadovas skirtas padėti atlikti pagrindinį kaiščių nustatymų patikrinimą Klipper konfigūracijos faile. Būtinai perskaitykite [platformos lyginimo](Bed_Level.md) vadovą. Taip pat žiūrėkite [Pjaustytuvai](Slicers.md) dokumentą, kuriame pateikiama informacija apie pjaustytuvo konfigūravimą su Klipper.
ta: இந்த வழிகாட்டி கிளிப்பர் உள்ளமைவு கோப்பில் முள் அமைப்புகளின் அடிப்படை சரிபார்ப்புக்கு உதவ வேண்டும். [படுக்கை நிலை] (Bed_level.md) வழிகாட்டியைப் படிக்க மறக்காதீர்கள். கிளிப்பருடன் ஒரு ச்லைசரை உள்ளமைப்பது குறித்த தகவலுக்கு [ச்லைசர்ச்] (ச்லீசர்ச்.எம்டி) ஆவணத்தையும் காண்க.

source: After one has verified that basic printing works, it is a good idea to consider calibrating [pressure advance](Pressure_Advance.md).
lt: Patikrinus, kad pagrindinis spausdinimas veikia, rekomenduojama apsvarstyti [slėgio išankstinio](Pressure_Advance.md) kalibravimą.
ta: அடிப்படை அச்சிடுதல் செயல்படுகிறதா என்பதை ஒருவர் சரிபார்த்த பிறகு, அளவீடு செய்வதை [அழுத்தம்_அட்வன்ச்.ம்டி) அளவீடு செய்வது நல்ல யோசனையாகும்.

source: It may be necessary to perform other types of detailed printer calibration - a number of guides are available online to help with this (for example, do a web search for "3d printer calibration"). As an example, if you experience the effect called ringing, you may try following [resonance compensation](Resonance_Compensation.md) tuning guide.
lt: Gali prireikti atlikti kitų tipų išsamų spausdintuvo kalibravimą - internete yra daug vadovų, padedančių tai atlikti (pavyzdžiui, atlikite internetinę paiešką "3d spausdintuvo kalibravimas"). Pavyzdžiui, jei pastebite efektą, vadinamą skambesiu, galite pabandyti vadovautis [rezonanso kompensavimo](Resonance_Compensation.md) derinimo vadovu.
ta: பிற வகையான விரிவான அச்சுப்பொறி அளவுத்திருத்தத்தை செய்ய வேண்டியது அவசியமாக இருக்கலாம் - இதற்கு உதவ ஆன்லைனில் பல வழிகாட்டிகள் கிடைக்கின்றன (எடுத்துக்காட்டாக, "3D அச்சுப்பொறி அளவுத்திருத்தத்திற்கான" வலைத் தேடலைச் செய்யுங்கள்). உதாரணமாக, ரிங்கிங் எனப்படும் விளைவை நீங்கள் அனுபவித்தால், நீங்கள் [அதிர்வு இழப்பீடு] (அதிர்வு_அம்பென்சேசன். எம்.டி) ட்யூனிங் வழிகாட்டியைப் பின்பற்ற முயற்சி செய்யலாம்.

source: Configuration checks
lt: Konfigūracijos patikrinimai
ta: உள்ளமைவு காசோலைகள்

source: Klipper supports [PID control](https://en.wikipedia.org/wiki/PID_controller) for the extruder and bed heaters. In order to use this control mechanism, it is necessary to calibrate the PID settings on each printer (PID settings found in other firmwares or in the example configuration files often work poorly).
lt: Klipper palaiko [PID valdymą](https://en.wikipedia.org/wiki/PID_controller) ekstruzerio ir platformos šildytuvams. Norint naudoti šį valdymo mechanizmą, būtina kalibruoti PID nustatymus kiekvienam spausdintuvui (PID nustatymai, rasti kitose programinėse įrangose arba pavyzdiniuose konfigūracijos failuose, dažnai veikia prastai).
ta: எக்ச்ட்ரூடர் மற்றும் பெட் ஈட்டர்களுக்கு கிளிப்பர் [PID கட்டுப்பாடு] (https://en.wikipedia.org/wiki/pid_controller) ஐ ஆதரிக்கிறது. இந்த கட்டுப்பாட்டு பொறிமுறையைப் பயன்படுத்த, ஒவ்வொரு அச்சுப்பொறியிலும் பிஐடி அமைப்புகளை அளவீடு செய்வது தேவை (பிற ஃபார்ம்வேர்களில் அல்லது எடுத்துக்காட்டு உள்ளமைவு கோப்புகளில் காணப்படும் பிஐடி அமைப்புகள் பெரும்பாலும் மோசமாக வேலை செய்கின்றன).

source: Start by verifying that temperatures are being properly reported. Navigate to the temperature graph section in the user interface. Verify that the temperature of the nozzle and bed (if applicable) are present and not increasing. If it is increasing, remove power from the printer. If the temperatures are not accurate, review the "sensor_type" and "sensor_pin" settings for the nozzle and/or bed.
lt: Pradėkite patikrindami, ar temperatūros tinkamai pranešamos. Eikite į temperatūros grafiko skyrių vartotojo sąsajoje. Patikrinkite, ar antgalio ir platformos (jei taikoma) temperatūra yra rodoma ir nedidėja. Jei ji didėja, atjunkite maitinimą nuo spausdintuvo. Jei temperatūros nėra tikslios, peržiūrėkite "sensor_type" ir "sensor_pin" nustatymus antgaliui ir (arba) platformai.
ta: வெப்பநிலை சரியாக அறிவிக்கப்படுகிறதா என்பதை சரிபார்ப்பதன் மூலம் தொடங்கவும். பயனர் இடைமுகத்தில் வெப்பநிலை வரைபட பிரிவுக்கு செல்லவும். முனை மற்றும் படுக்கையின் வெப்பநிலை (பொருந்தினால்) இருப்பதை சரிபார்க்கவும். இது அதிகரித்தால், அச்சுப்பொறியிலிருந்து சக்தியை அகற்று. வெப்பநிலை துல்லியமாக இல்லாவிட்டால், முனை மற்றும்/அல்லது படுக்கைக்கு "சென்சார்_ டைப்" மற்றும் "சென்சார்_பின்" அமைப்புகளை மதிப்பாய்வு செய்யவும்.

source: Navigate to the command console and issue an M112 command in the terminal box. This command requests Klipper to go into a "shutdown" state. It will cause an error to show, which can be cleared with a FIRMWARE_RESTART command in the command console. Octoprint will also require a reconnect. Then navigate to the temperature graph section and verify that temperatures continue to update and the temperatures are not increasing. If temperatures are increasing, remove power from the printer.
lt: Eikite į komandų konsolę ir įveskite M112 komandą terminalo lange. Ši komanda prašo Klipper pereiti į "išjungimo" būseną. Tai sukels klaidą, kurią galima išvalyti naudojant FIRMWARE_RESTART komandą komandų konsolėje. Octoprint taip pat reikės iš naujo prisijungti. Tada eikite į temperatūros grafiko skyrių ir patikrinkite, ar temperatūros toliau atnaujinamos ir temperatūros nedidėja. Jei temperatūros didėja, atjunkite maitinimą nuo spausdintuvo.
ta: கட்டளை கன்சோலுக்கு செல்லவும், முனைய பெட்டியில் M112 கட்டளையை வழங்கவும். இந்த கட்டளை கிளிப்பரை "பணிநிறுத்தம்" நிலைக்கு செல்லுமாறு கோருகிறது. இது ஒரு பிழையைக் காண்பிக்கும், இது கட்டளை கன்சோலில் ஒரு ஃபார்ம்வேர்_ரெச்டார்ட் கட்டளையுடன் அழிக்கப்படலாம். ஆக்டோபிரின்ட்டுக்கு மீண்டும் இணைக்கவும் தேவைப்படும். பின்னர் வெப்பநிலை வரைபடப் பிரிவுக்குச் சென்று வெப்பநிலை தொடர்ந்து புதுப்பிக்கப்படுவதையும் வெப்பநிலை அதிகரிக்கவில்லை என்பதையும் சரிபார்க்கவும். வெப்பநிலை அதிகரித்தால், அச்சுப்பொறியிலிருந்து சக்தியை அகற்று.

source: Navigate to the temperature graph section and type in 50 followed by enter in the extruder/tool temperature box. The extruder temperature in the graph should start to increase (within about 30 seconds or so). Then go to the extruder temperature drop-down box and select "Off". After several minutes the temperature should start to return to its initial room temperature value. If the temperature does not increase then verify the "heater_pin" setting in the config.
lt: Eikite į temperatūros grafiko skyrių ir įveskite 50, po to spauskite enter ekstruzerio/įrankio temperatūros langelyje. Ekstruzerio temperatūra grafike turėtų pradėti didėti (per maždaug 30 sekundžių ar panašiai). Tada eikite į ekstruzerio temperatūros išskleidžiamąjį laukelį ir pasirinkite "Išjungta". Po kelių minučių temperatūra turėtų pradėti grįžti į pradinę kambario temperatūros vertę. Jei temperatūra nedidėja, patikrinkite "heater_pin" nustatymą konfigūracijoje.
ta: வெப்பநிலை வரைபடப் பிரிவுக்கு செல்லவும், 50 இல் தட்டச்சு செய்யவும், அதன்பிறகு எக்ச்ட்ரூடர்/கருவி வெப்பநிலை பெட்டியில் உள்ளிடவும். வரைபடத்தில் எக்ச்ட்ரூடர் வெப்பநிலை அதிகரிக்கத் தொடங்க வேண்டும் (சுமார் 30 வினாடிகளுக்குள் அல்லது அதற்குள்). பின்னர் எக்ச்ட்ரூடர் வெப்பநிலை கீழ்தோன்றும் பெட்டிக்குச் சென்று "ஆஃப்" என்பதைத் தேர்ந்தெடுக்கவும். பல நிமிடங்களுக்குப் பிறகு வெப்பநிலை அதன் ஆரம்ப அறை வெப்பநிலை மதிப்புக்கு திரும்பத் தொடங்க வேண்டும். வெப்பநிலை அதிகரிக்கவில்லை என்றால், கட்டமைப்பில் உள்ள "ஈட்டர்_பின்" அமைப்பை சரிபார்க்கவும்.

source: Verify that all of the printer axes can manually move freely (the stepper motors are disabled). If not, issue an M84 command to disable the motors. If any of the axes still can not move freely, then verify the stepper "enable_pin" configuration for the given axis. On most commodity stepper motor drivers, the motor enable pin is "active low" and therefore the enable pin should have a "!" before the pin (for example, "enable_pin: !PA1").
lt: Patikrinkite, ar visos spausdintuvo ašys gali laisvai judėti rankiniu būdu (žingsniniai varikliai yra išjungti). Jei ne, išleiskite M84 komandą, kad išjungtumėte variklius. Jei kuri nors iš ašių vis tiek negali laisvai judėti, patikrinkite žingsninio variklio "enable_pin" konfigūraciją tai ašiai. Daugelyje įprastų žingsninių variklių valdiklių variklio įjungimo kaištis yra "aktyvus žemas", todėl įjungimo kaištis turėtų turėti "!" prieš kaiščio numerį (pavyzdžiui, "enable_pin: !PA1").
ta: அச்சுப்பொறி அச்சுகள் அனைத்தும் கைமுறையாக சுதந்திரமாக நகரும் என்பதை சரிபார்க்கவும் (ச்டெப்பர் மோட்டார்கள் முடக்கப்பட்டுள்ளன). இல்லையென்றால், மோட்டார்கள் முடக்க M84 கட்டளையை வழங்கவும். ஏதேனும் அச்சுகள் இன்னும் சுதந்திரமாக நகர்த்த முடியாவிட்டால், கொடுக்கப்பட்ட அச்சுக்கான ச்டெப்பரை "இயக்கு_பின்" உள்ளமைவை சரிபார்க்கவும். பெரும்பாலான பொருட்களின் ச்டெப்பர் மின்னோடி டிரைவர்களில், மின்னோடி இயக்கு முள் "செயலில் குறைந்தது", எனவே இயக்க முள் ஒரு "!" முள் முன் (எடுத்துக்காட்டாக, "இயக்கு_பின்:! PA1").

source: Manually move all the printer axes so that none of them are in contact with an endstop. Send a QUERY_ENDSTOPS command via the command console. It should respond with the current state of all of the configured endstops and they should all report a state of "open". For each of the endstops, rerun the QUERY_ENDSTOPS command while manually triggering the endstop. The QUERY_ENDSTOPS command should report the endstop as "TRIGGERED".
lt: Rankiniu būdu pajudinkite visas spausdintuvo ašis taip, kad nė viena iš jų nebūtų kontakte su galiniu jungikliu. Išsiųskite QUERY_ENDSTOPS komandą per komandų konsolę. Ji turėtų atsakyti su visų sukonfigūruotų galinių jungiklių esama būsena ir jie visi turėtų pranešti apie "atvirą" būseną. Kiekvienam iš galinių jungiklių pakartokite QUERY_ENDSTOPS komandą, rankiniu būdu aktyvuodami galinį jungiklį. QUERY_ENDSTOPS komanda turėtų pranešti apie galinį jungiklį kaip "SUVEIKĘS".
ta: அனைத்து அச்சுப்பொறி அச்சுகளையும் கைமுறையாக நகர்த்தவும், இதனால் அவை எதுவும் எண்ட்ச்டாப்புடன் தொடர்பு கொள்ளவில்லை. கட்டளை கன்சோல் வழியாக வினவல்_எண்ட்ச்டாப்ச் கட்டளையை அனுப்பவும். இது கட்டமைக்கப்பட்ட அனைத்து எண்ட்ச்டாப்புகளின் தற்போதைய நிலையுடன் பதிலளிக்க வேண்டும், மேலும் அவை அனைத்தும் "திறந்த" நிலையைப் புகாரளிக்க வேண்டும். ஒவ்வொரு எண்ட்ச்டாப்புகளுக்கும், எண்ட்ச்டாப்பை கைமுறையாகத் தூண்டும் போது Query_endstops கட்டளையை மீண்டும் இயக்கவும். Query_endstops கட்டளை எண்ட்ச்டாப்பை "தூண்டப்பட்டது" என்று புகாரளிக்க வேண்டும்.

source: If the endstop appears inverted (it reports "open" when triggered and vice-versa) then add a "!" to the pin definition (for example, "endstop_pin: ^PA2"), or remove the "!" if there is already one present.
lt: Jei galinis jungiklis atrodo invertuotas (jis praneša "atvirą", kai suveikia, ir atvirkščiai), pridėkite "!" prie kaiščio apibrėžimo (pavyzdžiui, "endstop_pin: ^PA2") arba pašalinkite "!", jei jis jau yra.
ta: எண்ட்ச்டாப் தலைகீழாகத் தோன்றினால் (அது தூண்டப்படும்போது "திறந்திருக்கும்" என்று புகாரளிக்கிறது மற்றும் நேர்மாறாக) பின்னர் ஒரு "!" முள் வரையறைக்கு (எடுத்துக்காட்டாக, "எண்ட்ச்டாப்_பின்: ^pa2"), அல்லது "!" ஏற்கனவே ஒரு பரிசு இருந்தால்.

source: Use the STEPPER_BUZZ command to verify the connectivity of each stepper motor. Start by manually positioning the given axis to a midway point and then run `STEPPER_BUZZ STEPPER=stepper_x` in the command console. The STEPPER_BUZZ command will cause the given stepper to move one millimeter in a positive direction and then it will return to its starting position. (If the endstop is defined at position_endstop=0 then at the start of each movement the stepper will move away from the endstop.) It will perform this oscillation ten times.
lt: Naudokite STEPPER_BUZZ komandą, kad patikrintumėte kiekvieno žingsninio variklio jungiamumą. Pradėkite rankiniu būdu nustatydami duotą ašį į vidurinį tašką ir tada paleiskite `STEPPER_BUZZ STEPPER=stepper_x` komandų konsolėje. STEPPER_BUZZ komanda privers duotą žingsninį variklį judėti vieną milimetrą teigiama kryptimi, o tada jis grįš į pradinę padėtį. (Jei galinis jungiklis apibrėžtas position_endstop=0, tai kiekvieno judėjimo pradžioje žingsninis variklis judės tolyn nuo galinio jungiklio.) Jis atliks šį svyravimą dešimt kartų.
ta: ஒவ்வொரு ச்டெப்பர் மோட்டரின் இணைப்பையும் சரிபார்க்க ச்டெப்பர்_பச் கட்டளையைப் பயன்படுத்தவும். கொடுக்கப்பட்ட அச்சை ஒரு மிட்வே புள்ளிக்கு கைமுறையாக நிலைநிறுத்துவதன் மூலம் தொடங்கி, பின்னர் கட்டளை கன்சோலில் `Stepeper_buzz Stepper = Stepper_x` ஐ இயக்கவும். ச்டெப்பர்_பச் கட்டளை கொடுக்கப்பட்ட ச்டெப்பரை ஒரு மில்லிமீட்டரை நேர்மறையான திசையில் நகர்த்தும், பின்னர் அது அதன் தொடக்க நிலைக்குத் திரும்பும். .

source: To test the extruder motor it will be necessary to heat the extruder to a printing temperature. Navigate to the temperature graph section and select a target temperature from the temperature drop-down box (or manually enter an appropriate temperature). Wait for the printer to reach the desired temperature. Then navigate to the command console and click the "Extrude" button. Verify that the extruder motor turns in the correct direction. If it does not, see the troubleshooting tips in the previous section to confirm the "enable_pin", "step_pin", and "dir_pin" settings for the extruder.
lt: Norint išbandyti ekstruzerio variklį, reikės įkaitinti ekstruzerį iki spausdinimo temperatūros. Eikite į temperatūros grafiko skyrių ir pasirinkite tikslinę temperatūrą iš temperatūros išskleidžiamojo laukelio (arba rankiniu būdu įveskite tinkamą temperatūrą). Palaukite, kol spausdintuvas pasieks norimą temperatūrą. Tada eikite į komandų konsolę ir spustelėkite mygtuką "Ekstruduoti". Patikrinkite, ar ekstruzerio variklis sukasi teisinga kryptimi. Jei ne, žr. trikčių šalinimo patarimus ankstesniame skyriuje, kad patvirtintumėte "enable_pin", "step_pin" ir "dir_pin" nustatymus ekstruzeriui.
ta: எக்ச்ட்ரூடர் மோட்டாரை சோதிக்க எக்ச்ட்ரூடரை அச்சிடும் வெப்பநிலைக்கு சூடாக்க வேண்டியது தேவை. வெப்பநிலை வரைபடப் பிரிவுக்குச் சென்று வெப்பநிலை கீழ்தோன்றும் பெட்டியிலிருந்து இலக்கு வெப்பநிலையைத் தேர்ந்தெடுக்கவும் (அல்லது கைமுறையாக பொருத்தமான வெப்பநிலையை உள்ளிடவும்). அச்சுப்பொறி விரும்பிய வெப்பநிலையை அடைய காத்திருங்கள். பின்னர் கட்டளை கன்சோலுக்கு செல்லவும், "எக்ச்ட்ரூட்" பொத்தானைக் சொடுக்கு செய்யவும். எக்ச்ட்ரூடர் மின்னோடி சரியான திசையில் மாறுகிறது என்பதை சரிபார்க்கவும். அவ்வாறு இல்லையென்றால், எக்ச்ட்ரூடருக்கான "Enable_pin", "Step_pin" மற்றும் "dir_pin" அமைப்புகளை உறுதிப்படுத்த முந்தைய பிரிவில் உள்ள சரிசெய்தல் உதவிக்குறிப்புகளைப் பார்க்கவும்.
