Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: ta

source: Custom thermistors (one may define any number of sections with a "thermistor" prefix). A custom thermistor may be used in the sensor_type field of a heater config section. (For example, if one defines a "[thermistor my_thermistor]" section then one may use a "sensor_type: my_thermistor" when defining a heater.) Be sure to place the thermistor section in the config file above its first use in a heater section.
ta: தனிப்பயன் தெர்மோச்டர்கள் (ஒருவர் "தெர்மோச்டர்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). தனிப்பயன் தெர்மோச்டர் ஒரு ஈட்டர் கட்டமைப்பு பிரிவின் சென்சார்_ வகை புலத்தில் பயன்படுத்தப்படலாம். . .

source: Custom ADC temperature sensors (one may define any number of sections with an "adc_temperature" prefix). This allows one to define a custom temperature sensor that measures a voltage on an Analog to Digital Converter (ADC) pin and uses linear interpolation between a set of configured temperature/voltage (or temperature/resistance) measurements to determine the temperature. The resulting sensor can be used as a sensor_type in a heater section. (For example, if one defines a "[adc_temperature my_sensor]" section then one may use a "sensor_type: my_sensor" when defining a heater.) Be sure to place the sensor section in the config file above its first use in a heater section.
ta: தனிப்பயன் ஏடிசி வெப்பநிலை சென்சார்கள் (ஒன்று "ADC_Tempreature" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). டிசிட்டல் மாற்றி (ஏடிசி) முள் ஒரு அனலாக் மீது மின்னழுத்தத்தை அளவிடும் தனிப்பயன் வெப்பநிலை சென்சாரை வரையறுக்க இது அனுமதிக்கிறது மற்றும் வெப்பநிலையைத் தீர்மானிக்க கட்டமைக்கப்பட்ட வெப்பநிலை/மின்னழுத்தம் (அல்லது வெப்பநிலை/எதிர்ப்பு) அளவீடுகளின் தொகுப்பிற்கு இடையில் நேரியல் இடைக்கணிப்பைப் பயன்படுத்துகிறது. இதன் விளைவாக சென்சார் ஒரு ஈட்டர் பிரிவில் சென்சார்_ டைப்பாக பயன்படுத்தப்படலாம். . .

source: [heater_generic]
ta: [ஈட்டர்_செனெரிக்]

source: [temperature_sensor]
ta: [வெப்பநிலை_சென்சர்]

source: Generic temperature sensors. One can define any number of additional temperature sensors that are reported via the M105 command.
ta: பொதுவான வெப்பநிலை சென்சார்கள். M105 கட்டளை வழியாக அறிவிக்கப்படும் கூடுதல் வெப்பநிலை சென்சார்களை ஒருவர் வரையறுக்க முடியும்.

source: Temperature sensors
ta: வெப்பநிலை சென்சார்கள்

source: Common thermistors
ta: பொதுவான தெர்மிச்டர்கள்

source: Common thermistors. The following parameters are available in heater sections that use one of these sensors.
ta: பொதுவான தெர்மிச்டர்கள். இந்த சென்சார்களில் ஒன்றைப் பயன்படுத்தும் ஈட்டர் பிரிவுகளில் பின்வரும் அளவுருக்கள் கிடைக்கின்றன.

source: Common temperature amplifiers
ta: பொதுவான வெப்பநிலை பெருக்கிகள்

source: Common temperature amplifiers. The following parameters are available in heater sections that use one of these sensors.
ta: பொதுவான வெப்பநிலை பெருக்கிகள். இந்த சென்சார்களில் ஒன்றைப் பயன்படுத்தும் ஈட்டர் பிரிவுகளில் பின்வரும் அளவுருக்கள் கிடைக்கின்றன.

source: Directly connected PT1000 sensor
ta: நேரடியாக இணைக்கப்பட்ட PT1000 சென்சார்

source: Directly connected PT1000 sensor. The following parameters are available in heater sections that use one of these sensors.
ta: நேரடியாக இணைக்கப்பட்ட PT1000 சென்சார். இந்த சென்சார்களில் ஒன்றைப் பயன்படுத்தும் ஈட்டர் பிரிவுகளில் பின்வரும் அளவுருக்கள் கிடைக்கின்றன.

source: MAXxxxxx temperature sensors
ta: Maxxxxxx வெப்பநிலை சென்சார்கள்

source: MAXxxxxx serial peripheral interface (SPI) temperature based sensors. The following parameters are available in heater sections that use one of these sensor types.
ta: Maxxxxxx தொடர் புற இடைமுகம் (SPI) வெப்பநிலை அடிப்படையிலான சென்சார்கள். இந்த சென்சார் வகைகளில் ஒன்றைப் பயன்படுத்தும் ஈட்டர் பிரிவுகளில் பின்வரும் அளவுருக்கள் கிடைக்கின்றன.

source: HTU21D sensor
ta: HTU21D சென்சார்

source: HTU21D family two wire interface (I2C) environmental sensor. Note that this sensor is not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C) and relative humidity. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report humidity in addition to temperature.
ta: HTU21D குடும்பம் இரண்டு கம்பி இடைமுகம் (I2C) சுற்றுச்சூழல் சென்சார். இந்த சென்சார் எக்ச்ட்ரூடர்கள் மற்றும் ஈட்டர் படுக்கைகளுடன் பயன்படுத்த விரும்பவில்லை, மாறாக சுற்றுப்புற வெப்பநிலை (சி) மற்றும் ஈரப்பதத்தை கண்காணிக்க. ஒரு GCODE_MACRO க்கு [மாதிரி-macros.cfg] (../ config/shalm-macros.cfg) ஐப் பார்க்கவும், இது வெப்பநிலைக்கு கூடுதலாக ஈரப்பதத்தைப் புகாரளிக்கப் பயன்படலாம்.

source: LM75 temperature sensor
ta: LM75 வெப்பநிலை சென்சார்

source: Builtin micro-controller temperature sensor
ta: மைக்ரோகண்ட்ரோலர் வெப்பநிலை சென்சாரில் கட்டப்பட்டுள்ளது

source: The atsam, atsamd, and stm32 micro-controllers contain an internal temperature sensor. One can use the "temperature_mcu" sensor to monitor these temperatures.
ta: ATSAM, ATSAMD மற்றும் STM32 மைக்ரோ-கன்ட்ரோலர்கள் உள் வெப்பநிலை சென்சார் கொண்டிருக்கின்றன. இந்த வெப்பநிலையை கண்காணிக்க ஒருவர் "வெப்பநிலை_ம்கு" சென்சாரைப் பயன்படுத்தலாம்.

source: Host temperature sensor
ta: புரவலன் வெப்பநிலை சென்சார்

source: Temperature from the machine (eg Raspberry Pi) running the host software.
ta: புரவலன் மென்பொருளை இயக்கும் இயந்திரத்திலிருந்து வெப்பநிலை (எ.கா. ராச்பெர்ரி பை).

source: DS18B20 temperature sensor
ta: DS18B20 வெப்பநிலை சென்சார்

source: DS18B20 is a 1-wire (w1) digital temperature sensor. Note that this sensor is not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C). These sensors have range up to 125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers. DS18B20 sensors are only supported on the "host mcu", e.g. the Raspberry Pi. The w1-gpio Linux kernel module must be installed.
ta: DS18B20 ஒரு 1-கம்பி (W1) டிசிட்டல் வெப்பநிலை சென்சார் ஆகும். இந்த சென்சார் எக்ச்ட்ரூடர்கள் மற்றும் ஈட்டர் படுக்கைகளுடன் பயன்படுத்த விரும்பவில்லை என்பதை நினைவில் கொள்க, மாறாக சுற்றுப்புற வெப்பநிலையை (சி) கண்காணிக்க. இந்த சென்சார்கள் 125 சி வரை உள்ளன, எனவே எ.கா. அறை வெப்பநிலை கண்காணிப்பு. அவை எளிய விசிறி/ஈட்டர் கன்ட்ரோலர்களாகவும் செயல்பட முடியும். DS18B20 சென்சார்கள் "புரவலன் MCU" இல் மட்டுமே ஆதரிக்கப்படுகின்றன, எ.கா. ராச்பெர்ரி பை. W1-GPIO லினக்ச் கர்னல் தொகுதி நிறுவப்பட வேண்டும்.

source: Fans
ta: ரசிகர்கள்

source: [fan]
ta: [ரசிகர்]

source: Print cooling fan.
ta: குளிரூட்டும் விசிறி அச்சிடுக.

source: [heater_fan]
ta: [ஈட்டர்_ஃபான்]

source: Heater cooling fans (one may define any number of sections with a "heater_fan" prefix). A "heater fan" is a fan that will be enabled whenever its associated heater is active. By default, a heater_fan has a shutdown_speed equal to max_power.
ta: ஈட்டர் குளிரூட்டும் ரசிகர்கள் (ஒருவர் "ஈட்டர்_ஃபான்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). "ஈட்டர் விசிறி" என்பது ஒரு சுவைஞர், அதன் தொடர்புடைய ஈட்டர் செயலில் இருக்கும்போதெல்லாம் இயக்கப்படும். இயல்பாக, ஒரு ஈட்டர்_ஃபான் மேக்ச்_பவருக்கு சமமான பணிநிறுத்தம்_ச்பீட் உள்ளது.

source: [controller_fan]
ta: [கட்டுப்பாட்டாளர்_பான்]

source: [temperature_fan]
ta: [வெப்பநிலை_பான்]

source: Temperature-triggered cooling fans (one may define any number of sections with a "temperature_fan" prefix). A "temperature fan" is a fan that will be enabled whenever its associated sensor is above a set temperature. By default, a temperature_fan has a shutdown_speed equal to max_power.
ta: வெப்பநிலை-தூண்டப்பட்ட குளிரூட்டும் ரசிகர்கள் (ஒருவர் "வெப்பநிலை_பான்" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). ஒரு "வெப்பநிலை விசிறி" என்பது ஒரு விசிறி ஆகும், இது தொடர்புடைய சென்சார் ஒரு நிர்ணயிக்கப்பட்ட வெப்பநிலைக்கு மேலே இருக்கும்போதெல்லாம் இயக்கப்படும். இயல்பாக, ஒரு வெப்பநிலை_பான் அதிகபட்சம்_பவருக்கு சமமான பணிநிறுத்தம்_பகலைக் கொண்டுள்ளது.

source: [servo]
ta: [சர்வோ]

source: [neopixel]
ta: [நியோபிக்சல்]

source: [dotstar]
ta: [டாட்ச்டார்]

source: PCA9533 LED support. The PCA9533 is used on the mightyboard.
ta: PCA9533 எல்இடி உதவி. PCA9533 மைட்டிபோர்டில் பயன்படுத்தப்படுகிறது.

source: Execute gcode when a button is pressed or released (or when a pin changes state). You can check the state of the button by using `QUERY_BUTTON button=my_gcode_button`.
ta: ஒரு பொத்தானை அழுத்தும்போது அல்லது வெளியிடும்போது GCODE ஐ இயக்கவும் (அல்லது ஒரு முள் நிலையை மாற்றும்போது). `Query_button பொத்தான் = my_gcode_button` ஐப் பயன்படுத்தி பொத்தானின் நிலையை நீங்கள் சரிபார்க்கலாம்.

source: Statically configured digital output pins (one may define any number of sections with a "static_digital_output" prefix). Pins configured here will be setup as a GPIO output during MCU configuration. They can not be changed at run-time.
ta: நிலையான கட்டமைக்கப்பட்ட டிசிட்டல் வெளியீட்டு ஊசிகளும் (ஒன்று "static_digital_output" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்). இங்கே கட்டமைக்கப்பட்ட முள் கள் MCU உள்ளமைவின் போது GPIO வெளியீடாக அமைக்கப்படும். அவற்றை ரன் நேரத்தில் மாற்ற முடியாது.

source: [multi_pin]
ta: [மல்டி_பின்]

source: Multiple pin outputs (one may define any number of sections with a "multi_pin" prefix). A multi_pin output creates an internal pin alias that can modify multiple output pins each time the alias pin is set. For example, one could define a "[multi_pin my_fan]" object containing two pins and then set "pin=multi_pin:my_fan" in the "[fan]" section - on each fan change both output pins would be updated. These aliases may not be used with stepper motor pins.
ta: பல முள் வெளியீடுகள் (ஒன்று "மல்டி_பின்" முன்னொட்டுடன் எந்த பிரிவுகளையும் வரையறுக்கலாம்). ஒரு மல்டி_பின் வெளியீடு ஒரு உள் முள் மாற்றுப்பெயரை உருவாக்குகிறது, இது ஒவ்வொரு முறையும் மாற்றுப்பெயர் முள் அமைக்கப்படும் போது பல வெளியீட்டு ஊசிகளை மாற்ற முடியும். எடுத்துக்காட்டாக, ஒருவர் "[மல்டி_பின் மை_ஃபான்]" இரண்டு ஊசிகளைக் கொண்ட பொருளை வரையறுக்கலாம், பின்னர் "[விசிறி]" பிரிவில் "முள் = மல்டி_பின்: மை_ஃபான்" அமைக்கலாம் - ஒவ்வொரு விசிறி மாற்றத்திலும் இரண்டு வெளியீட்டு ஊசிகளும் புதுப்பிக்கப்படும். இந்த மாற்றுப்பெயர்கள் ச்டெப்பர் மின்னோடி ஊசிகளுடன் பயன்படுத்தப்படாமல் போகலாம்.

source: TMC stepper driver configuration
ta: டி.எம்.சி ச்டெப்பர் டிரைவர் உள்ளமைவு

source: [tmc2130]
ta: [நோய்கள் 130]

source: Configure a TMC2130 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc2130" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2130 stepper_x]").
ta: SPI பச் வழியாக TMC2130 ச்டெப்பர் மின்னோடி டிரைவரை உள்ளமைக்கவும். இந்த அம்சத்தைப் பயன்படுத்த, "TMC2130" முன்னொட்டுடன் ஒரு கட்டமைப்பு பகுதியை வரையறுக்கவும், அதன்பிறகு தொடர்புடைய ச்டெப்பர் கட்டமைப்பு பிரிவின் பெயரை (எடுத்துக்காட்டாக, "[TMC2130 Stepeper_x]").

source: Configure a TMC2208 (or TMC2224) stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2208" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2208 stepper_x]").
ta: ஒற்றை கம்பி UART வழியாக TMC2208 (அல்லது TMC2224) ச்டெப்பர் மின்னோடி டிரைவரை உள்ளமைக்கவும். இந்த அம்சத்தைப் பயன்படுத்த, "TMC2208" முன்னொட்டுடன் ஒரு கட்டமைப்பு பகுதியை வரையறுக்கவும், அதன்பிறகு தொடர்புடைய ச்டெப்பர் கட்டமைப்பு பிரிவின் பெயரை (எடுத்துக்காட்டாக, "[TMC2208 Steper_x]").

source: Configure a TMC2209 stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2209" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2209 stepper_x]").
ta: ஒற்றை கம்பி UART வழியாக TMC2209 ச்டெப்பர் மின்னோடி டிரைவரை உள்ளமைக்கவும். இந்த அம்சத்தைப் பயன்படுத்த, "TMC2209" முன்னொட்டுடன் ஒரு கட்டமைப்பு பகுதியை வரையறுக்கவும், அதன்பிறகு தொடர்புடைய ச்டெப்பர் கட்டமைப்பு பிரிவின் பெயரை (எடுத்துக்காட்டாக, "[TMC2209 Stepper_x]").

source: Configure a TMC2660 stepper motor driver via SPI bus. To use this feature, define a config section with a tmc2660 prefix followed by the name of the corresponding stepper config section (for example, "[tmc2660 stepper_x]").
ta: SPI பச் வழியாக TMC2660 ச்டெப்பர் மின்னோடி டிரைவரை உள்ளமைக்கவும். இந்த அம்சத்தைப் பயன்படுத்த, ஒரு TMC2660 முன்னொட்டுடன் ஒரு கட்டமைப்பு பகுதியை வரையறுக்கவும், அதன்பிறகு தொடர்புடைய ச்டெப்பர் கட்டமைப்பு பிரிவின் பெயரை (எடுத்துக்காட்டாக, "[TMC2660 STEPPER_X]").

source: Configure a TMC5160 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc5160" prefix followed by the name of the corresponding stepper config section (for example, "[tmc5160 stepper_x]").
ta: SPI பச் வழியாக TMC5160 ச்டெப்பர் மின்னோடி டிரைவரை உள்ளமைக்கவும். இந்த அம்சத்தைப் பயன்படுத்த, "TMC5160" முன்னொட்டுடன் ஒரு கட்டமைப்பு பகுதியை வரையறுக்கவும், அதன்பிறகு தொடர்புடைய ச்டெப்பர் கட்டமைப்பு பிரிவின் பெயரை (எடுத்துக்காட்டாக, "[TMC5160 STEPPER_X]").

source: Run-time stepper motor current configuration
ta: ரன்-டைம் ச்டெப்பர் மின்னோடி தற்போதைய உள்ளமைவு

source: Statically configured AD5206 digipots connected via SPI bus (one may define any number of sections with an "ad5206" prefix).
ta: SPI பச் வழியாக இணைக்கப்பட்டுள்ள AD5206 டிசிபோட்கள் (ஒருவர் "AD5206" முன்னொட்டுடன் எந்தவொரு பிரிவுகளையும் வரையறுக்கலாம்).

source: Statically configured MCP4451 digipot connected via I2C bus (one may define any number of sections with an "mcp4451" prefix).
ta: I2C பச் வழியாக இணைக்கப்பட்ட MCP4451 DIGIPOT (ஒன்று "MCP4451" முன்னொட்டு மூலம் எந்தவொரு பிரிவுகளையும் வரையறுக்கலாம்).

source: Statically configured MCP4728 digital-to-analog converter connected via I2C bus (one may define any number of sections with an "mcp4728" prefix).
ta: I2C பச் வழியாக இணைக்கப்பட்டுள்ள MCP4728 டிசிட்டல்-டு-அனலாக் மாற்றி (ஒருவர் "MCP4728" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்).

source: Statically configured MCP4018 digipot connected via two gpio "bit banging" pins (one may define any number of sections with an "mcp4018" prefix).
ta: இரண்டு சி.பி.ஐ.ஓ "பிட் பேங்கிங்" ஊசிகளின் வழியாக இணைக்கப்பட்டுள்ள MCP4018 டிசிபோட் (ஒருவர் "MCP4018" முன்னொட்டுடன் எத்தனை பிரிவுகளையும் வரையறுக்கலாம்).

source: Display support
ta: ஆதரவைக் காண்பி

source: [display]
ta: [காட்சி]

source: Support for a display attached to the micro-controller.
ta: மைக்ரோ-கன்ட்ரோலருடன் இணைக்கப்பட்ட காட்சிக்கான உதவி.

source: hd44780 display
ta: HD44780 காட்சி

source: Information on configuring hd44780 displays (which is used in "RepRapDiscount 2004 Smart Controller" type displays).
ta: HD44780 காட்சிகளை உள்ளமைப்பது பற்றிய தகவல்கள் (இது "Repapdiscount 2004 அறிவுள்ள கன்ட்ரோலர்" வகை காட்சிகளில் பயன்படுத்தப்படுகிறது).

source: hd44780_spi display
ta: HD44780_SPI காட்சி

source: Information on configuring an hd44780_spi display - a 20x04 display controlled via a hardware "shift register" (which is used in mightyboard based printers).
ta: HD44780_SPI டிச்ப்ளே கட்டமைத்தல் பற்றிய தகவல்கள் - வன்பொருள் "சிப்ட் ரெசிச்டர்" (இது மைலிபோர்டு அடிப்படையிலான அச்சுப்பொறிகளில் பயன்படுத்தப்படுகிறது) வழியாக கட்டுப்படுத்தப்படும் 20x04 காட்சி.

source: st7920 display
ta: ST7920 காட்சி

source: Information on configuring st7920 displays (which is used in "RepRapDiscount 12864 Full Graphic Smart Controller" type displays).
ta: ST7920 காட்சிகளை உள்ளமைப்பது பற்றிய தகவல்கள் (இது "Reparapdiscount 12864 முழு கிராஃபிக் அறிவுள்ள கன்ட்ரோலர்" வகை காட்சிகளில் பயன்படுத்தப்படுகிறது).

source: emulated_st7920 display
ta: emulate_st7920 காட்சி

source: Information on configuring an emulated st7920 display - found in some "2.4 inch touchscreen devices" and similar.
ta: ஒரு பின்பற்றப்பட்ட ST7920 காட்சியை உள்ளமைப்பது பற்றிய தகவல்கள் - சில "2.4 அங்குல தொடுதிரை சாதனங்கள்" மற்றும் ஒத்தவை.

source: uc1701 display
ta: UC1701 காட்சி

source: Information on configuring uc1701 displays (which is used in "MKS Mini 12864" type displays).
ta: UC1701 காட்சிகளை உள்ளமைப்பது பற்றிய தகவல்கள் (இது "MKS MINI 12864" வகை காட்சிகளில் பயன்படுத்தப்படுகிறது).

source: ssd1306 and sh1106 displays
ta: SSD1306 மற்றும் SH1106 காட்சிகள்

source: Information on configuring ssd1306 and sh1106 displays.
ta: SSD1306 மற்றும் SH1106 காட்சிகளை உள்ளமைத்தல் பற்றிய தகவல்கள்.

source: [display_data]
ta: [டிச்ப்ளே_டேட்டா]

source: Support for displaying custom data on an lcd screen. One may create any number of display groups and any number of data items under those groups. The display will show all the data items for a given group if the display_group option in the [display] section is set to the given group name.
ta: எல்சிடி திரையில் தனிப்பயன் தரவைக் காண்பிப்பதற்கான உதவி. ஒருவர் அந்தக் குழுக்களின் கீழ் எத்தனை காட்சி குழுக்களையும் எத்தனை தரவு உருப்படிகளையும் உருவாக்கலாம். [காட்சி] பிரிவில் உள்ள காட்சி_ குழு விருப்பம் கொடுக்கப்பட்ட குழு பெயருக்கு அமைக்கப்பட்டால், கொடுக்கப்பட்ட குழுவிற்கான அனைத்து தரவு உருப்படிகளையும் காட்சி காண்பிக்கும்.

source: A [default set of display groups](../klippy/extras/display/display.cfg) are automatically created. One can replace or extend these display_data items by overriding the defaults in the main printer.cfg config file.
ta: காட்சி குழுக்களின் இயல்புநிலை தொகுப்பு] (../ கிளிப்பி/எக்ச்ட்ராச்/டிச்ப்ளே/டிச்ப்ளே. சி.எஃப்.சி) தானாகவே உருவாக்கப்படும். முதன்மையான அச்சுப்பொறி. CFG கட்டமைப்பு கோப்பில் இயல்புநிலைகளை மீறுவதன் மூலம் இந்த காட்சி_டா உருப்படிகளை ஒருவர் மாற்றலாம் அல்லது நீட்டிக்கலாம்.

source: Display a custom glyph on displays that support it. The given name will be assigned the given display data which can then be referenced in the display templates by their name surrounded by two "tilde" symbols i.e. `~my_display_glyph~`
ta: அதை ஆதரிக்கும் காட்சிகளில் தனிப்பயன் கிளிஃபைக் காண்பி. கொடுக்கப்பட்ட பெயர் கொடுக்கப்பட்ட காட்சி தரவை ஒதுக்கப்படும், பின்னர் காட்சி வார்ப்புருக்கள் அவற்றின் பெயரால் இரண்டு "டில்ட்" சின்னங்களால் சூழப்பட்டுள்ளன, அதாவது `~ my_display_glyph ~`

source: See [sample-glyphs.cfg](../config/sample-glyphs.cfg) for some examples.
ta: சில எடுத்துக்காட்டுகளுக்கு [மாதிரி-Glyphs.cfg] (../ config/shalm-glyphs.cfg) ஐப் பார்க்கவும்.

source: [display my_extra_display]
ta: [my_extra_display ஐக் காண்பி]

source: If a primary [display] section has been defined in printer.cfg as shown above it is possible to define multiple auxiliary displays. Note that auxiliary displays do not currently support menu functionality, thus they do not support the "menu" options or button configuration.
ta: மேலே காட்டப்பட்டுள்ளபடி ஒரு முதன்மை [காட்சி] பிரிவு printur.cfg இல் வரையறுக்கப்பட்டிருந்தால், பல துணை காட்சிகளை வரையறுக்க முடியும். துணை காட்சிகள் தற்போது பட்டியல் செயல்பாட்டை ஆதரிக்கவில்லை என்பதை நினைவில் கொள்க, இதனால் அவை "பட்டியல்" விருப்பங்கள் அல்லது பொத்தானை உள்ளமைவை ஆதரிக்காது.

source: [menu]
ta: [மெனு]

source: Customizable lcd display menus.
ta: தனிப்பயனாக்கக்கூடிய எல்சிடி காட்சி மெனுக்கள்.

source: A [default set of menus](../klippy/extras/display/menu.cfg) are automatically created. One can replace or extend the menu by overriding the defaults in the main printer.cfg config file.
ta: ஒரு [இயல்புநிலை மெனுக்களின் தொகுப்பு] (../ கிளிப்பி/எக்ச்ட்ராச்/டிச்ப்ளே/மெனு. முதன்மையான அச்சுப்பொறி. Cfg கட்டமைப்பு கோப்பில் இயல்புநிலைகளை மீறுவதன் மூலம் மெனுவை மாற்றலாம் அல்லது நீட்டிக்கலாம்.

source: See the [command template document](Command_Templates.md#menu-templates) for information on menu attributes available during template rendering.
ta: வார்ப்புரு வழங்குதல் போது கிடைக்கும் பட்டியல் பண்புக்கூறுகள் பற்றிய தகவலுக்கு [கட்டளை வார்ப்புரு ஆவணம்] (கட்டளை_டெம்ப்ளேட்ச்.ம்டே#மெனு-டெம்ப்ளேட்ச்) ஐப் பார்க்கவும்.

source: Filament sensors
ta: இழை சென்சார்கள்

source: Filament Switch Sensor. Support for filament insert and runout detection using a switch sensor, such as an endstop switch.
ta: இழை சுவிட்ச் சென்சார். எண்ட்ச்டாப் சுவிட்ச் போன்ற ச்விட்ச் சென்சாரைப் பயன்படுத்தி இழை செருகல் மற்றும் ரன்அவுட் கண்டறிதலுக்கான உதவி.

source: Filament Motion Sensor. Support for filament insert and runout detection using an encoder that toggles the output pin during filament movement through the sensor.
ta: இழை இயக்க சென்சார். சென்சார் வழியாக இழை இயக்கத்தின் போது வெளியீட்டு முள் மாற்றும் ஒரு குறியாக்கியைப் பயன்படுத்தி இழை செருகல் மற்றும் ரன்அவுட் கண்டறிதலுக்கான உதவி.

source: TSLl401CL Based Filament Width Sensor. See the [guide](TSL1401CL_Filament_Width_Sensor.md) for more information.
ta: TSLL401CL அடிப்படையிலான இழை அகல சென்சார். மேலும் தகவலுக்கு [வழிகாட்டி] (tsl1401cl_filament_width_sensor.md) ஐப் பார்க்கவும்.

source: Board specific hardware support
ta: குறிப்பிட்ட வன்பொருள் உதவி போர்டு

source: Configure an SX1509 I2C to GPIO expander. Due to the delay incurred by I2C communication you should NOT use SX1509 pins as stepper enable, step or dir pins or any other pin that requires fast bit-banging. They are best used as static or gcode controlled digital outputs or hardware-pwm pins for e.g. fans. One may define any number of sections with an "sx1509" prefix. Each expander provides a set of 16 pins (sx1509_my_sx1509:PIN_0 to sx1509_my_sx1509:PIN_15) which can be used in the printer configuration.
ta: GPIO விரிவாக்கத்திற்கு SX1509 I2C ஐ உள்ளமைக்கவும். I2C தகவல்தொடர்பு ஏற்பட்ட நேரந்தவறுகை காரணமாக, நீங்கள் SX1509 ஊசிகளை ச்டெப்பராகவும், படி அல்லது டிர் பின்ச் அல்லது வேகமாக பிட்-பேங்க் தேவைப்படும் வேறு எந்த முள் பயன்படுத்தக்கூடாது. அவை நிலையான அல்லது GCODE கட்டுப்படுத்தப்பட்ட டிசிட்டல் வெளியீடுகள் அல்லது வன்பொருள்-PWM ஊசிகளாக எ.கா. ரசிகர்கள். "SX1509" முன்னொட்டு கொண்ட எந்தவொரு பிரிவுகளையும் ஒருவர் வரையறுக்கலாம். ஒவ்வொரு விரிவாக்கமும் 16 ஊசிகளின் தொகுப்பை வழங்குகிறது (SX1509_MY_SX1509: PIN_0 முதல் SX1509_MY_SX1509: PIN_15) இது அச்சுப்பொறி உள்ளமைவில் பயன்படுத்தப்படலாம்.

source: See the [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg) file for an example.
ta: எடுத்துக்காட்டுக்கு [generic-duet2-duex.cfg] (../ config/generic-duet2-duex.cfg) கோப்பைப் பார்க்கவும்.

source: Duet2 Maestro analog scaling by vref and vssa readings. Defining an adc_scaled section enables virtual adc pins (such as "my_name:PB0") that are automatically adjusted by the board's vref and vssa monitoring pins. Be sure to define this config section above any config sections that use one these virtual pins.
ta: VREF மற்றும் VSSA வாசிப்புகளால் டூயட் 2 மேச்ட்ரோ அனலாக் அளவிடுதல். ADC_SCALED பகுதியை வரையறுப்பது மெய்நிகர் ADC ஊசிகளை ("My_Name: PB0" போன்றவை) தானாகவே வாரியத்தின் VREF மற்றும் VSSA கண்காணிப்பு ஊசிகளால் சரிசெய்யப்படுகிறது. இந்த மெய்நிகர் ஊசிகளைப் பயன்படுத்தும் எந்தவொரு கட்டமைப்பு பிரிவுகளுக்கும் மேலே இந்த கட்டமைப்பு பகுதியை வரையறுக்க மறக்காதீர்கள்.

source: See the [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg) file for an example.
ta: எடுத்துக்காட்டுக்கு [generic-duet2-maestro.cfg] (../ config/generic-duet2-maestro.cfg) கோப்பைப் பார்க்கவும்.

source: [replicape]
ta: [பிரதி]

source: Other Custom Modules
ta: பிற தனிப்பயன் தொகுதிகள்

source: [palette2]
ta: [தட்டு 2]

source: Palette 2 multimaterial support - provides a tighter integration supporting Palette 2 devices in connected mode.
ta: தட்டு 2 மல்டிமேட்டரியல் உதவி - இணைக்கப்பட்ட பயன்முறையில் இறுக்கமான ஒருங்கிணைப்பு துணை 2 சாதனங்களை வழங்குகிறது.

source: This modules also requires `[virtual_sdcard]` and `[pause_resume]` for full functionality.
ta: இந்த தொகுதிகளுக்கு முழு செயல்பாட்டிற்கு `[மெய்நிகர்_ச்ட்கார்ட்]` மற்றும் `[pause_resume]` தேவைப்படுகிறது.

source: If you use this module, do not use the Palette 2 plugin for Octoprint as they will conflict, and 1 will fail to initialize properly likely aborting your print.
ta: இந்த தொகுதியைப் பயன்படுத்தினால், ஆக்டோப்ரின்ட்டுக்கு தட்டு 2 சொருகி பயன்படுத்த வேண்டாம், ஏனெனில் அவை முரண்படும், மேலும் 1 உங்கள் அச்சுறுத்தலை கருக்கலைப்பதை சரியாக துவக்கத் தவறிவிடும்.

source: If you use Octoprint and stream gcode over the serial port instead of printing from virtual_sd, then remo **M1** and **M0** from *Pausing commands* in *Settings > Serial Connection > Firmware & protocol* will prevent the need to start print on the Palette 2 and unpausing in Octoprint for your print to begin.
ta: மெய்நிகர்_எச்டியிலிருந்து அச்சிடுவதற்குப் பதிலாக சீரியல் போர்ட்டின் மீது ஆக்டோப்ரின்ட் மற்றும் ச்ட்ரீம் சிகோடைப் பயன்படுத்தினால்,*அமைப்புகள்> அமைப்புகள்> தொடர் இணைப்பு> ஃபார்ம்வேர் & நெறிமுறை*இல்*கட்டளைகளை*இடைநிறுத்துவதில் இருந்து ரெமோ ** எம் 1 ** மற்றும் ** எம் 0 ** தட்டு 2 இல் அச்சிடத் தொடங்கவும், உங்கள் அச்சு தொடங்குவதற்கு ஆக்டோப்ரின்ட்டில் நிறுத்தி வைக்கவும்.
