Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: es, ta, uk

source: 20230826: If `safe_distance` is set or calculated to be 0 in `[dual_carriage]`, the carriages proximity checks will be disabled as per documentation. A user may wish to configure `safe_distance` explicitly to prevent accidental crashes of the carriages with each other. Additionally, the homing order of the primary and the dual carriage is changed in some configurations (certain configurations when both carriages home in the same direction, see [[dual_carriage] configuration reference](./Config_Reference.md#dual_carriage) for more details).
es: 20230826: Si `safe_distance` está activado o se calcula a 0 en `[dual_carriage]`, los chequeos de proximidad de los carruajes seran desactivados de acuerdo con la documentación. Es posible que un usuario desee configurar `safe_distance` explícitamente para evitar choques accidentales entre los carruajes. Además, el orden del proceso de retorno a casa de los carruajes principales y secundarios ha cambiado en algunas configuraciones (ciertas configuraciones cuando ambos carruajes estan restornando a casa en la misma dirección, vea [[dual_carriage] configuration reference](./Config_Reference.md#dual_carriage) para más detalles).
ta: 20230826: `[டூயல்_ காரேச்]` இல் `SAFE_DISTANCE` அமைக்கப்பட்டால் அல்லது கணக்கிடப்பட்டால், ஆவணங்களின் படி வண்டிகள் அருகாமையில் காசோலைகள் முடக்கப்படும். ஒரு பயனர் ஒருவருக்கொருவர் வண்டிகளின் தற்செயலான செயலிழப்புகளைத் தடுக்க `SAFE_DISTANCE 'ஐ வெளிப்படையாக உள்ளமைக்க விரும்பலாம். கூடுதலாக, முதன்மை மற்றும் இரட்டை வண்டியின் ஓமிங் ஆர்டர் சில உள்ளமைவுகளில் மாற்றப்படுகிறது (இருவரும் ஒரே திசையில் வீட்டைக் கொண்டு செல்லும்போது சில உள்ளமைவுகள், மேலும் விவரங்களுக்கு [[டூயல்_ காரேச்] உள்ளமைவு குறிப்பு] (. .
uk: 20230826: якщо `safe_distance` встановлено або розраховано як 0 у `[dual_carriage]`, перевірки близькості вагонів буде вимкнено відповідно до документації. Користувач може забажати налаштувати `safe_distance` явно, щоб запобігти випадковим зіткненням вагонів один з одним. Крім того, у деяких конфігураціях змінюється порядок переміщення основної та подвійної кареток (у деяких конфігураціях, коли обидві каретки рухаються в одному напрямку, див. [[dual_carriage] довідник щодо конфігурації](./Config_Reference.md#dual_carriage) для отримання додаткової інформації) .

source: 20230810: The flash-sdcard.sh script now supports both variants of the Bigtreetech SKR-3, STM32H743 and STM32H723. For this, the original tag of btt-skr-3 now has changed to be either btt-skr-3-h743 or btt-skr-3-h723.
es: 20230810: El programa flash-sdcard.sh ahora apoya las dos variantes del Bigtreetech SKR-3: STM32H743 y STM32H723. Para esto, la etiqueta original btt-skr-3 ahora a cambiado a ser btt-skr-3-h743 o btt-skr-3-h723.
ta: 20230810: ஃபிளாச்-SDCARD.SH ச்கிரிப்ட் இப்போது பிக் ட்ரீட்எக் எச்.கே.ஆர் -3, எச்.டி.எம் 32 எச் 743 மற்றும் எச்.டி.எம் 32 எச் 723 ஆகியவற்றின் இரு வகைகளையும் ஆதரிக்கிறது. இதற்காக, BTT-SKR-3 இன் அசல் குறிச்சொல் இப்போது BTT-SKR-3-H743 அல்லது BTT-SKR-3-H723 ஆக மாறிவிட்டது.
uk: 20230810: Флеш-sdcard.sh скрипт тепер підтримує як варіанти Bigtreetech SKR-3, STM32H743 і STM32H723. Для цього оригінальний тег btt-skr-3 тепер змінився як btt-skr-3-h743 або btt-skr-3-h723.

source: 20230729: The exported status for `dual_carriage` is changed. Instead of exporting `mode` and `active_carriage`, the individual modes for each carriage are exported as `printer.dual_carriage.carriage_0` and `printer.dual_carriage.carriage_1`.
es: 20230729: El estado exportado para `dual_carriage` ha cambiado. En lugar de exportar `mode` y `active_carriage`, los modos individuales para cada carruaje se exportan como `printer.dual_carriage.carriage_0` y `printer.dual_carriage.carriage_1`.
ta: 20230729: `டூயல்_ காரேச்` க்கான ஏற்றுமதி நிலை மாற்றப்பட்டுள்ளது. `பயன்முறை` மற்றும்` ஆக்டிவ்_காரேச்` ஆகியவற்றை ஏற்றுமதி செய்வதற்கு பதிலாக, ஒவ்வொரு வண்டிக்கும் தனிப்பட்ட முறைகள் `அச்சுப்பொறி.
uk: 20230729: Змінено експортований статус `dual_carriage`. замість експорту `mode` і `active_carriage`, окремі режими для кожного перевезення експортуються як `printer.dual_carriage.carriage_0` і `printer.dual_carriage.carriage_1`.

source: 20230619: The `relative_reference_index` option has been deprecated and superceded by the `zero_reference_position` option. Refer to the [Bed Mesh Documentation](./Bed_Mesh.md#the-deprecated-relative_reference_index) for details on how to update the configuration. With this deprecation the `RELATIVE_REFERENCE_INDEX` is no longer available as a parameter for the `BED_MESH_CALIBRATE` gcode command.
es: 20230619: La opción `relative_reference_index` se descontinuó y sustituida por la opción `zero_reference_position`. Consulte [Bed Mesh Documentation](./Bed_Mesh.md#the-deprecated-relative_reference_index) para obtener detalles de cómo actualizar la configuración. Con la descontinuación, `RELATIVE_REFERENCE_INDEX` ya no esta disponible como un parámetro para el comando de gcode `BED_MESH_CALIBRATE`.
ta: 20230619: `உறவினர்_ரொஃபென்ச்_இண்டெக்ச்` விருப்பம்` சீரோ_ரெஃபென்ச்_போசிசன்` விருப்பத்தால் நீக்கப்பட்டு மேம்படுத்தப்பட்டுள்ளது. உள்ளமைவை எவ்வாறு புதுப்பிப்பது என்பது குறித்த விவரங்களுக்கு [படுக்கை கண்ணி ஆவணங்கள்] (./ bed_mesh.md#the-deprecated-relative_reference_index) ஐப் பார்க்கவும். இந்த மதிப்பிழப்புடன் `உறவினர்_ரொஃபென்ச்_இண்டெக்ச்` இனி` BED_MESH_CALIBRATE` GCODE கட்டளைக்கான அளவுருவாக கிடைக்காது.
uk: 20230619: параметр `relative_reference_index` застарів і замінений параметром `zero_reference_position`. Зверніться до [документації Bed Mesh](./Bed_Mesh.md#the-deprecated-relative_reference_index), щоб дізнатися, як оновити конфігурацію. Після цього припинення підтримки `RELATIVE_REFERENCE_INDEX` більше не доступний як параметр для команди gcode `BED_MESH_CALIBRATE`.

source: 20230530: The default canbus frequency in "make menuconfig" is now 1000000. If using canbus and using canbus with some other frequency is required, then be sure to select "Enable extra low-level configuration options" and specify the desired "CAN bus speed" in "make menuconfig" when compiling and flashing the micro-controller.
es: 20230530: La frequencia predeterminada del canbus en "make menuconfig" es ahora 1000000. Si esta usando canbus y es necesario usar canbus con otra frequencia, asegúrese de seleccionar "Enable extra low-level configuration options" y especifique la "CAN bus speed" deseada en "make menuconfig" al compilar y reprogramar el microcontrolador.
ta: 20230530: "மேக் மெனுகான்ஃபிக்" இல் இயல்புநிலை கான்பச் அதிர்வெண் இப்போது 1000000 ஆக உள்ளது. கான்பசைப் பயன்படுத்தி வேறு சில அதிர்வெண்ணுடன் கான்பசைப் பயன்படுத்தினால், "கூடுதல் குறைந்த-நிலை உள்ளமைவு விருப்பங்களை இயக்கவும்" மற்றும் விரும்பியதை குறிப்பிடவும் "பச் வேகத்தை குறிப்பிடலாம்" மைக்ரோ-கன்ட்ரோலரை தொகுத்து ஒளிரும் போது "மெனுகான்ஃபிக் உருவாக்கு" இல்.
uk: 20230530: Частота за замовчуванням в "зробити налаштування меню" тепер 1000000. Якщо використовувати канбус і за допомогою канбуса з деякими іншими частотами, то обов'язково виберіть «Включені додаткові опції конфігурації низького рівня» і вкажіть бажану «CAN автобусну швидкість» в «зробити меню налаштування», коли компіляція і миготливий мікроконтролер.

source: 20230525: `SHAPER_CALIBRATE` command immediately applies input shaper parameters if `[input_shaper]` was enabled already.
es: 20230525: El comando `SHAPER_CALIBRATE` aplica inmediatamente los parámetros de los diferentes métodos de combinar señales de entrada con el propósito de minimizar las vibraciones causadas por el movimiento de la impresora ("input shaping" en inglés) si `[input_shaper]` está ya activado.
ta: 20230525: `[input_shaper]` ஏற்கனவே இயக்கப்பட்டிருந்தால் உள்ளீட்டு சேப்பர் அளவுருக்களை உடனடியாக பயன்படுத்துகிறது.
uk: 20230525: `SHAPER_CALIBRATE` команда відразу ж застосовує параметри вводу, якщо `[input_shaper]` була включена вже.

source: 20230407: The `stalled_bytes` counter in the log and in the `printer.mcu.last_stats` field has been renamed to `upcoming_bytes`.
es: 20230407: El nombre del contador `stalled_bytes`en la bitácora y en el campo `printer.mcu.last_stats` cambió a `upcoming_bytes`.
ta: 20230407: பதிவில் உள்ள `stalled_bytes` கவுண்டர் மற்றும்` அச்சுப்பொறி.
uk: 20230407: `stalled_bytes` лічильник в колоді і в `printer.mcu.last_stats` поле перейменовано на `upcoming_bytes`.

source: 20230323: On tmc5160 drivers `multistep_filt` is now enabled by default. Set `driver_MULTISTEP_FILT: False` in the tmc5160 config for the previous behavior.
es: 20230323: En los controladores del tmc5160 `multistep_fit` esta ahora activado de manera predeterminada. Asigne `driver_MULTISTEP_FILT: False` en la configuración del tmc5160 para el comportamiento anterior.
ta: 20230323: TMC5160 இயக்கிகள் `மல்டிச்டெப்_பில்ட்` இப்போது இயல்பாகவே இயக்கப்பட்டுள்ளன. முந்தைய நடத்தைக்கு TMC5160 உள்ளமைவில் `டிரைவர்_மால்டிச்டெப்_பில்ட்: பொய்யை அமைக்கவும்.
uk: 20230323: На драйверах tmc5160 `multistep_filt` тепер включений за замовчуванням. Набір `driver_MULTISTEP_FILT: False` в tmc5160 настройка для попередньої поведінки.

source: 20240313: The `max_accel_to_decel` parameter in the `[printer]` config section has been deprecated. The `ACCEL_TO_DECEL` parameter of the `SET_VELOCITY_LIMIT` command has been deprecated. The `printer.toolhead.max_accel_to_decel` status has been removed. Use the [minimum_cruise_ratio parameter](./Config_Reference.md#printer) instead. The deprecated features will be removed in the near future, and using them in the interim may result in subtly different behavior.
ta: 20240313: `[அச்சுப்பொறி]` கட்டமைப்பு பிரிவில் உள்ள `MAX_ACCEL_TO_DECEL` அளவுரு நீக்கப்பட்டது. `Set_velocity_limit` கட்டளையின்` Act_to_decel` அளவுரு நீக்கப்பட்டது. `Printor.toolhead.max_accel_to_decel` நிலை அகற்றப்பட்டுள்ளது. அதற்கு பதிலாக [MINER_CRUISE_RATIO அளவுரு] (./ config_reference.md#அச்சுப்பொறி) பயன்படுத்தவும். நீக்கப்பட்ட நற்பொருத்தங்கள் எதிர்காலத்தில் அகற்றப்படும், மேலும் அவற்றை இடைக்காலத்தில் பயன்படுத்துவது நுட்பமான மாறுபட்ட நடத்தைக்கு வழிவகுக்கும்.
uk: 20240313: параметр `max_accel_to_decel` у розділі `[printer]` було вилучено. `ACCEL_TO_DECEL` параметр `SET_VELOCITY_LIMIT` команда була розшифрована. `printer.toolhead.max_accel_to_decel` було вилучено статус. Використовуйте параметр [minimum_cruise_ratio](./Config_Reference.md#printer) замість. Відхилені функції будуть видалені в найближчому майбутньому, і використовуючи їх в проміжному режимі може призвести до того, що не відрізняється поведінкою.

source: 20240215: Several deprecated features have been removed. Using "NTC 100K beta 3950" as a thermistor name has been removed (deprecated on 20211110). The `SYNC_STEPPER_TO_EXTRUDER` and `SET_EXTRUDER_STEP_DISTANCE` commands have been removed, and the extruder `shared_heater` config option has been removed (deprecated on 20220210). The bed_mesh `relative_reference_index` option has been removed (deprecated on 20230619).
ta: 20240215: பல நீக்கப்பட்ட நற்பொருத்தங்கள் அகற்றப்பட்டுள்ளன. "என்.டி.சி 100 கே பீட்டா 3950" ஐப் பயன்படுத்துவது தெர்மோச்டர் பெயராக அகற்றப்பட்டுள்ளது (20211110 அன்று நீக்கப்பட்டது). `Sync_stepper_to_extruder` மற்றும்` set_extruder_step_distance` கட்டளைகள் அகற்றப்பட்டுள்ளன, மேலும் எக்ச்ட்ரூடர் `பகிரப்பட்ட_ஈட்டர்` கட்டமைப்பு விருப்பம் அகற்றப்பட்டுள்ளது (20220210 அன்று நீக்கப்பட்டது). BED_MESH `உறவினர்_ரொஃபென்ச்_இண்டெக்ச்` விருப்பம் அகற்றப்பட்டது (20230619 அன்று நீக்கப்பட்டது).
uk: 20240215: було видалено декілька депресованих функцій. За допомогою "NTC 100K beta 3950" в якості ім'я аристора було вилучено (прийнято на 20211110). `SYNC_STEPPER_TO_EXTRUDER` і `SET_EXTRUDER_STEP_DISTANCE` команди були видалені, а екструддер `shared_heater` опція конфігурації була вилучена (депресована 20220210). The Bed_mesh `relative_reference_index` був видалений варіант (депресований 20230619).

source: 20240123: The output_pin SET_PIN CYCLE_TIME parameter has been removed. Use the new [pwm_cycle_time](Config_Reference.md#pwm_cycle_time) module if it is necessary to dynamically change a pwm pin's cycle time.
ta: 20240123: output_pin set_pin cycol_time அளவுரு அகற்றப்பட்டது. PWM முள் சுழற்சி நேரத்தை மாறும் வகையில் மாற்ற வேண்டியது தேவை என்றால் புதிய [PWM_CYCLE_TIME] (config_reference.md#pwm_cycle_time) தொகுதியைப் பயன்படுத்தவும்.
uk: 20240123: Видалено вихід_pin SET_PIN CYCLE_TIME. Використовуйте новий модуль [pwm_cycle_time](Config_Reference.md#pwm_cycle_time) якщо необхідно динамічно змінити час циклу pwm.

source: 20240123: The output_pin `maximum_mcu_duration` parameter is deprecated. Use a [pwm_tool config section](Config_Reference.md#pwm_tool) instead. The option will be removed in the near future.
ta: 20240123: output_pin `macice_mcu_duration` அளவுரு நீக்கப்பட்டது. அதற்கு பதிலாக [pwm_tool கட்டமைப்பு பிரிவு] (config_reference.md#pwm_tool) ஐப் பயன்படுத்தவும். இந்த விருப்பம் எதிர்காலத்தில் அகற்றப்படும்.
uk: 20240123: Вихід_pin `maximum_mcu_duration` параметр відхилений. Використовуйте [pwm_tool config розділ](Config_Reference.md#pwm_tool) замість. Опція буде видалена найближчим часом.

source: 20240123: The output_pin `static_value` parameter is deprecated. Replace with `value` and `shutdown_value` parameters. The option will be removed in the near future.
ta: 20240123: output_pin `static_value` அளவுரு நீக்கப்பட்டது. `மதிப்பு` மற்றும்` பணிநிறுத்தம்_ மதிப்பு` அளவுருக்கள் மூலம் மாற்றவும். இந்த விருப்பம் எதிர்காலத்தில் அகற்றப்படும்.
uk: 20240123: Вихід_pin `static_value` параметр відхилений. `value` і `shutdown_value` параметри. Опція буде видалена найближчим часом.

source: 20231216: The `[hall_filament_width_sensor]` is changed to trigger filament runout when the thickness of the filament exceeds `max_diameter`. The maximum diameter defaults to `default_nominal_filament_diameter + max_difference`. See [[hall_filament_width_sensor] configuration reference](./Config_Reference.md#hall_filament_width_sensor) for more details.
ta: 20231216: `[hall_filament_width_sensor]` இழைகளின் தடிமன் `max_diameter` ஐ தாண்டும்போது இழை ரன்அவுட்டைத் தூண்டுவதற்கு மாற்றப்படுகிறது. அதிகபட்ச விட்டம் இயல்புநிலை `இயல்புநிலை_நோமினல்_பிலமென்ட்_டிஅமீட்டர் + MAX_DIFFERENCE` க்கு இயல்புநிலை. மேலும் விவரங்களுக்கு [[HALL_FILAMENT_WIDTH_SENSOR] உள்ளமைவு குறிப்பு] (.
uk: 20231216: `[hall_filament_width_sensor]` змінено для запуску потоку ниток, коли товщина нитки перевищує `max_diameter`. Максимальний діаметр за замовчуванням до `default_nominal_filament_diameter + max_difference`. [[hall_filament_width_sensor] конфігурація посилання](./Config_Reference.md#hall_filament_width_sensor) для отримання більш детальної інформації.

source: 20231207: Several undocumented config parameters in the `[printer]` config section have been removed (the buffer_time_low, buffer_time_high, buffer_time_start, and move_flush_time parameters).
ta: 20231207: `[அச்சுப்பொறி]` கட்டமைப்பு பிரிவில் உள்ள பல ஆவணமற்ற கட்டமைப்பு அளவுருக்கள் அகற்றப்பட்டுள்ளன (பஃபர்_ டைம்_ லோ, பஃபர்_ டைம்_ஐ, பஃபர்_ டைம்_ச்டார்ட் மற்றும் மூவ்_ஃப்ளச்_ நேர அளவுருக்கள்).
uk: 20231207: Кілька недокументованих параметрів конфігурації в параметрах `[printer]` видалено розділ конфігурації (buffer_time_low, buffer_time_high, buffer_time_start, and switch_flush_time параметри).

source: 20231110: Klipper v0.12.0 released.
ta: 20231110: வெட்டுக்கள் V0.12.0 வெளியிடப்பட்டது.
uk: 20231110: Klipper v0.12.0 випущено.

source: 20240415: The `on_error_gcode` parameter in the `[virtual_sdcard]` config section now has a default. If this parameter is not specified it now defaults to `TURN_OFF_HEATERS`. If the previous behavior is desired (take no default action on an error during a virtual_sdcard print) then define `on_error_gcode` with an empty value.
ta: 20240415: `[மெய்நிகர்_ச்ட்கார்டு]` கட்டமைப்பு பிரிவில் உள்ள `on_error_gcode` அளவுரு இப்போது இயல்புநிலையைக் கொண்டுள்ளது. இந்த அளவுரு குறிப்பிடப்படாவிட்டால், இப்போது இயல்புநிலையாக `டர்ன்_ஆஃப்_ஈட்டர்கள்`. முந்தைய நடத்தை விரும்பினால் (மெய்நிகர்_ச்ட்கார்டு அச்சின் போது பிழையில் இயல்புநிலை நடவடிக்கை எடுக்க வேண்டாம்) பின்னர் `on_error_gcode` ஐ வெற்று மதிப்புடன் வரையறுக்கவும்.
uk: 20240415: параметр `on_error_gcode` в параметрі `[virtual_sdcard]` config розділ тепер має за замовчуванням. Якщо цей параметр не вказаний зараз за замовчуванням до `TURN_OFF_HEATERS`. Якщо попередня поведінка є бажаною (застосуйте не дію за замовчуванням на помилку під час віртуального друку_sdcard) потім визначте `on_error_gcode` з порожньою вартістю.

source: 20241203: The resonance test has been changed to include slow sweeping moves. This change requires that testing point(s) have some clearance in X/Y plane (+/- 30 mm from the test point should suffice when using the default settings). The new test should generally produce more accurate and reliable test results. However, if required, the previous test behavior can be restored by adding options `sweeping_period: 0` and `accel_per_hz: 75` to the `[resonance_tester]` config section.
uk: 20241203: перевірку резонансу було змінено, щоб включити повільні розгортаючі рухи. Ця зміна вимагає, щоб точки тестування мали певний зазор у площині X/Y (+/- 30 мм від точки тестування має бути достатньо, якщо використовуються налаштування за замовчуванням). Новий тест, як правило, повинен дати точніші та надійніші результати тестування. Однак, якщо потрібно, попередню поведінку тесту можна відновити, додавши параметри `sweeping_period: 0` і `accel_per_hz: 75` до розділу конфігурації `[resonance_tester]`.

source: 20241201: In some cases Klipper may have ignored leading characters or spaces in a traditional G-Code command. For example, "99M123" may have been interpreted as "M123" and "M 321" may have been interpreted as "M321". Klipper will now report these cases with an "Unknown command" warning.
uk: 20241201: у деяких випадках Klipper міг проігнорувати початкові символи або пробіли в традиційній команді G-коду. Наприклад, «99M123» могло бути інтерпретовано як «M123», а «M 321» могло бути інтерпретовано як «M321». Klipper тепер повідомлятиме про ці випадки з попередженням «Невідома команда».

source: 20241112: Option `CHIPS=<chip_name>` in `TEST_RESONANCES` and `SHAPER_CALIBRATE` requires specifying the full name(s) of the accel chip(s). For example, `adxl345 rpi` instead of short name - `rpi`.
uk: 20241112: параметр `CHIPS=<назва_чіпа>` в `TEST_RESONANCES` і `SHAPER_CALIBRATE` вимагає вказувати повну назву(на) чіпа(ів) прискорення. Наприклад, `adxl345 rpi` замість короткого імені - `rpi`.

source: 20240912: `SET_PIN`, `SET_SERVO`, `SET_FAN_SPEED`, `M106`, and `M107` commands are now collated. Previously, if many updates to the same object were issued faster than the minimum scheduling time (typically 100ms) then actual updates could be queued far into the future. Now if many updates are issued in rapid succession then it is possible that only the latest request will be applied. If the previous behavior is requried then consider adding explicit `G4` delay commands between updates.
uk: 20240912: команди `SET_PIN`, `SET_SERVO`, `SET_FAN_SPEED`, `M106` і `M107` тепер упорядковано. Раніше, якщо багато оновлень для того самого об’єкта видавалися швидше, ніж мінімальний час планування (зазвичай 100 мс), тоді фактичні оновлення могли ставитися в чергу далеко в майбутнє. Тепер, якщо багато оновлень видано у швидкій послідовності, можливо, буде застосовано лише останній запит. Якщо потрібна попередня поведінка, розгляньте можливість додавання явних команд затримки `G4` між оновленнями.

source: 20240912: Support for `maximum_mcu_duration` and `static_value` parameters in `[output_pin]` config sections have been removed. These options have been deprecated since 20240123.
uk: 20240912: вилучено підтримку параметрів `maximum_mcu_duration` і `static_value` у розділах конфігурації `[output_pin]`. Ці параметри застаріли з 2024 0123.
