Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Contact.po
Languages: ta

source: This document provides contact information for Klipper.
ta: இந்த ஆவணம் கிளிப்பருக்கான தொடர்பு தகவல்களை வழங்குகிறது.

source: [Community Forum](#community-forum)
ta: [சமூக மன்றம்] (#சமூக-ஃபோரம்)

source: [Discord Chat](#discord-chat)
ta: [டிச்கார்ட் அரட்டை] (#டிச்கார்ட்-அரட்டை)

source: [I have a question about Klipper](#i-have-a-question-about-klipper)
ta: [I have a கேள்வி பற்றி Klipper](#i-have-a-question-about-klipper)

source: [I have a feature request](#i-have-a-feature-request)
ta: [எனக்கு ஒரு அம்ச கோரிக்கை உள்ளது] (#i-have-a-fienture-request)

source: [Help! It doesn't work!](#help-it-doesnt-work)
ta: [உதவி! இது வேலை செய்யாது!] (#எல்ப்-இட்-டோச்-வேலை)

source: [I am making changes that I'd like to include in Klipper](#i-am-making-changes-that-id-like-to-include-in-klipper)
ta: [நான் கிளிப்பரில் சேர்க்க விரும்பும் மாற்றங்களைச் செய்கிறேன்] (#I-AM-MAKING- மாற்றங்கள்-அது-ID-fly-worly-in-klipper)

source: Community Forum
ta: சமூக மன்றம்

source: There is a [Klipper Community Discourse server](https://community.klipper3d.org) for discussions on Klipper.
ta: கிளிப்பர் பற்றிய விவாதங்களுக்கு [கிளிப்பர் சமூக சொற்பொழிவு சேவையகம்] (https://community.klipper3d.org) உள்ளது.

source: Discord Chat
ta: முரண்பாடு அரட்டை

source: This server is run by a community of Klipper enthusiasts dedicated to discussions on Klipper. It allows users to chat with other users in real-time.
ta: இந்த சேவையகம் கிளிப்பர் பற்றிய விவாதங்களுக்கு அர்ப்பணிக்கப்பட்ட கிளிப்பர் ஆர்வலர்களின் சமூகத்தால் இயக்கப்படுகிறது. நிகழ்நேரத்தில் மற்ற பயனர்களுடன் அரட்டையடிக்க பயனர்களை இது அனுமதிக்கிறது.

source: I have a question about Klipper
ta: கிளிப்பர் பற்றி எனக்கு ஒரு கேள்வி உள்ளது

source: Many questions we receive are already answered in the [Klipper documentation](Overview.md). Please be sure to to read the documentation and follow the directions provided there.
ta: நாங்கள் பெறும் பல கேள்விகள் ஏற்கனவே [கிளிப்பர் ஆவணம்] (கண்ணோட்டம். எம்.டி) இல் பதிலளிக்கப்பட்டுள்ளன. தயவுசெய்து ஆவணங்களைப் படித்து, அங்கு வழங்கப்பட்ட திசைகளைப் பின்பற்றவும்.

source: It is also possible to search for similar questions in the [Klipper Community Forum](#community-forum).
ta: [கிளிப்பர் சமூக மன்றம்] (#சமூக-ஃபோரம்) இல் இதே போன்ற கேள்விகளைத் தேடவும் முடியும்.

source: If you are interested in sharing your knowledge and experience with other Klipper users then you can join the [Klipper Community Forum](#community-forum) or [Klipper Discord Chat](#discord-chat). Both are communities where Klipper users can discuss Klipper with other users.
ta: உங்கள் அறிவையும் அனுபவத்தையும் மற்ற கிளிப்பர் பயனர்களுடன் பகிர்ந்து கொள்வதில் நீங்கள் ஆர்வமாக இருந்தால், நீங்கள் [கிளிப்பர் சமூக மன்றம்] (#சமூக-ஃபோரம்) அல்லது [கிளிப்பர் டிச்கார்ட் அரட்டை] (#டிச்கார்ட்-அரட்டை) சேரலாம். கிளிப்பர் பயனர்கள் கிளிப்பரைப் பற்றி மற்ற பயனர்களுடன் விவாதிக்கக்கூடிய சமூகங்கள் இரண்டும்.

source: Many questions we receive are general 3d-printing questions that are not specific to Klipper. If you have a general question or are experiencing general printing problems, then you will likely get a better response by asking in a general 3d-printing forum or a forum dedicated to your printer hardware.
ta: நாங்கள் பெறும் பல கேள்விகள் கிளிப்பருக்கு குறிப்பிட்டதல்ல பொதுவான 3D- அச்சிடும் கேள்விகள். உங்களிடம் ஒரு பொதுவான கேள்வி இருந்தால் அல்லது பொது அச்சிடும் சிக்கல்களை அனுபவிக்கிறீர்கள் என்றால், பொது 3D-அச்சிடும் மன்றத்தில் அல்லது உங்கள் அச்சுப்பொறி வன்பொருளுக்கு அர்ப்பணிக்கப்பட்ட ஒரு மன்றத்தில் கேட்பதன் மூலம் நீங்கள் சிறந்த பதிலைப் பெறுவீர்கள்.

source: I have a feature request
ta: எனக்கு ஒரு அம்ச கோரிக்கை உள்ளது

source: All new features require someone interested and able to implement that feature. If you are interested in helping to implement or test a new feature, you can search for ongoing developments in the [Klipper Community Forum](#community-forum). There is also [Klipper Discord Chat](#discord-chat) for discussions between collaborators.
ta: அனைத்து புதிய அம்சங்களுக்கும் ஆர்வமுள்ள மற்றும் அந்த அம்சத்தை செயல்படுத்தக்கூடிய ஒருவர் தேவைப்படுகிறது. புதிய அம்சத்தை செயல்படுத்த அல்லது சோதிக்க உதவுவதில் நீங்கள் ஆர்வமாக இருந்தால், [கிளிப்பர் சமூக மன்றம்] (#சமூக-ஃபோரம்) இல் நடந்த முன்னேற்றங்களை நீங்கள் தேடலாம். ஒத்துழைப்பாளர்களிடையே கலந்துரையாடல்களுக்கு [கிளிப்பர் டிச்கார்ட் அரட்டை] (#டிச்கார்ட்-சாட்) உள்ளது.

source: Help! It doesn't work!
ta: உதவி! இது வேலை செய்யாது!

source: Unfortunately, we receive many more requests for help than we could possibly answer. Most problem reports we see are eventually tracked down to:
ta: துரதிர்ச்டவசமாக, நாங்கள் பதிலளிக்கக்கூடியதை விட உதவிக்காக இன்னும் பல கோரிக்கைகளைப் பெறுகிறோம். நாம் காணும் பெரும்பாலான சிக்கல் அறிக்கைகள் இறுதியில் கண்காணிக்கப்படுகின்றன:

source: Subtle errors in the hardware, or
ta: வன்பொருளில் நுட்பமான பிழைகள், அல்லது

source: Not following all the steps described in the Klipper documentation.
ta: கிளிப்பர் ஆவணத்தில் விவரிக்கப்பட்டுள்ள அனைத்து படிகளையும் பின்பற்றவில்லை.

source: If you are experiencing problems we recommend you carefully read the [Klipper documentation](Overview.md) and double check that all steps were followed.
ta: நீங்கள் சிக்கல்களைச் சந்தித்தால், [கிளிப்பர் ஆவணம்] (கண்ணோட்டம். எம்.டி) கவனமாகப் படித்து, அனைத்து நடவடிக்கைகளும் பின்பற்றப்பட்டுள்ளதா என்பதை இருமுறை சரிபார்க்கவும்.

source: If you are experiencing a printing problem, then we recommend carefully inspecting the printer hardware (all joints, wires, screws, etc.) and verify nothing is abnormal. We find most printing problems are not related to the Klipper software. If you do find a problem with the printer hardware then you will likely get a better response by searching in a general 3d-printing forum or in a forum dedicated to your printer hardware.
ta: நீங்கள் அச்சிடும் சிக்கலை அனுபவிக்கிறீர்கள் என்றால், அச்சுப்பொறி வன்பொருளை (அனைத்து மூட்டுகள், கம்பிகள், திருகுகள் போன்றவை) கவனமாக ஆய்வு செய்ய பரிந்துரைக்கிறோம், மேலும் எதுவும் அசாதாரணமானது என்பதை சரிபார்க்கவும். பெரும்பாலான அச்சிடும் சிக்கல்கள் கிளிப்பர் மென்பொருளுடன் தொடர்புடையவை அல்ல என்பதை நாங்கள் காண்கிறோம். அச்சுப்பொறி வன்பொருளில் நீங்கள் ஒரு சிக்கலைக் கண்டால், பொது 3D-அச்சிடும் மன்றத்தில் அல்லது உங்கள் அச்சுப்பொறி வன்பொருளுக்கு அர்ப்பணிக்கப்பட்ட ஒரு மன்றத்தில் தேடுவதன் மூலம் சிறந்த பதிலைப் பெறுவீர்கள்.

source: It is also possible to search for similar issues in the [Klipper Community Forum](#community-forum).
ta: [கிளிப்பர் சமூக மன்றம்] (#சமூக-ஃபோரம்) இல் இதே போன்ற சிக்கல்களைத் தேடவும் முடியும்.

source: Klipper is an open-source project and we appreciate when collaborators diagnose errors in the software.
ta: கிளிப்பர் ஒரு திறந்த மூல திட்டமாகும், மேலும் ஒத்துழைப்பாளர்கள் மென்பொருளில் பிழைகள் கண்டறியும்போது நாங்கள் பாராட்டுகிறோம்.

source: There is important information that will be needed in order to fix a bug. Please follow these steps:
ta: பிழையை சரிசெய்ய முக்கியமான தகவல்கள் தேவைப்படும். தயவுசெய்து இந்த படிகளைப் பின்பற்றவும்:

source: Obtain the Klipper log file from the event. The log file has been engineered to answer common questions the Klipper developers have about the software and its environment (software version, hardware type, configuration, event timing, and hundreds of other questions).
ta: நிகழ்விலிருந்து கிளிப்பர் பதிவு கோப்பைப் பெறுங்கள். மென்பொருள் மற்றும் அதன் சூழல் (மென்பொருள் பதிப்பு, வன்பொருள் வகை, உள்ளமைவு, நிகழ்வு நேரம் மற்றும் நூற்றுக்கணக்கான பிற கேள்விகள்) பற்றி கிளிப்பர் உருவாக்குபவர்கள் வைத்திருக்கும் பொதுவான கேள்விகளுக்கு பதிலளிக்க பதிவு கோப்பு வடிவமைக்கப்பட்டுள்ளது.

source: The Klipper log file is located in `/tmp/klippy.log` on the Klipper "host" computer (the Raspberry Pi).
ta: கிளிப்பர் பதிவு கோப்பு கிளிப்பர் "புரவலன்" கணினியில் (ராச்பெர்ரி பை) `/tmp/klippy.log` இல் அமைந்துள்ளது.

source: An "scp" or "sftp" utility is needed to copy this log file to your desktop computer. The "scp" utility comes standard with Linux and MacOS desktops. There are freely available scp utilities for other desktops (eg, WinSCP). If using a graphical scp utility that can not directly copy `/tmp/klippy.log` then repeatedly click on `..` or `parent folder` until you get to the root directory, click on the `tmp` folder, and then select the `klippy.log` file.
ta: இந்த பதிவு கோப்பை உங்கள் டெச்க்டாப் கணினியில் நகலெடுக்க "SCP" அல்லது "SFTP" பயன்பாடு தேவை. "SCP" பயன்பாடு லினக்ச் மற்றும் மேகோச் டெச்க்டாப்புகளுடன் தரமாக வருகிறது. பிற டெச்க்டாப்புகளுக்கு இலவசமாக கிடைக்கக்கூடிய SCP பயன்பாடுகள் உள்ளன (எ.கா., WINSCP). `/Tmp/klippy.log` ஐ நேரடியாக நகலெடுக்க முடியாத ஒரு வரைகலை SCP பயன்பாட்டைப் பயன்படுத்தினால், நீங்கள் ரூட் கோப்பகத்திற்கு வரும் வரை` ..` அல்லது `பெற்றோர் கோப்புறை` ஆகியவற்றைக் சொடுக்கு செய்து,` TMP` கோப்புறையைக் சொடுக்கு செய்து, பின்னர் பின்னர் சொடுக்கு செய்க `klippy.log` கோப்பைத் தேர்ந்தெடுக்கவும்.

source: Copy the log file to your desktop so that it can be attached to an issue report.
ta: பதிவு கோப்பை உங்கள் டெச்க்டாப்பில் நகலெடுக்கவும், இதன் மூலம் அது வெளியீட்டு அறிக்கையுடன் இணைக்கப்படலாம்.

source: Do not modify the log file in any way; do not provide a snippet of the log. Only the full unmodified log file provides the necessary information.
ta: பதிவு கோப்பை எந்த வகையிலும் மாற்ற வேண்டாம்; பதிவின் துணுக்கை வழங்க வேண்டாம். முழு மாற்றப்படாத பதிவு கோப்பு மட்டுமே தேவையான தகவல்களை வழங்குகிறது.

source: I am making changes that I'd like to include in Klipper
ta: நான் கிளிப்பரில் சேர்க்க விரும்பும் மாற்றங்களைச் செய்கிறேன்

source: Klipper is open-source software and we appreciate new contributions.
ta: கிளிப்பர் திறந்த மூல மென்பொருள் மற்றும் புதிய பங்களிப்புகளை நாங்கள் பாராட்டுகிறோம்.

source: New contributions (for both code and documentation) are submitted via Github Pull Requests. See the [CONTRIBUTING document](CONTRIBUTING.md) for important information.
ta: புதிய பங்களிப்புகள் (குறியீடு மற்றும் ஆவணங்கள் இரண்டிற்கும்) அறிவிலிமையம் புல் கோரிக்கைகள் வழியாக சமர்ப்பிக்கப்படுகின்றன. முக்கியமான தகவல்களுக்கு [பங்களிப்பு ஆவணம்] (பங்களிப்பு. எம்.டி) ஐப் பார்க்கவும்.

source: Contact
ta: தொடர்பு

source: There is a Discord server dedicated to Klipper at: <https://discord.klipper3d.org>.
ta: கிளிப்பருக்கு அர்ப்பணிக்கப்பட்ட ஒரு டிச்கார்ட் சேவையகம் உள்ளது: <https://discord.klipper3d.org>.

source: [I found a bug in the Klipper software](#i-found-a-bug-in-the-klipper-software)
ta: [கிளிப்பர் மென்பொருளில் நான் ஒரு பிழையைக் கண்டேன்] (#i-found-a-Bug-in-the-klipper-software)

source: [Klipper github](#klipper-github)
ta: [மோவர் கிதுப்] (#மோவர்-கிதப்)

source: I found a bug in the Klipper software
ta: கிளிப்பர் மென்பொருளில் ஒரு பிழையைக் கண்டேன்

source: Problems should be reported in the [Klipper Community Forum](#community-forum).
ta: [கிளிப்பர் சமூக மன்றம்] (#சமூக-ஃபோரம்) இல் சிக்கல்கள் தெரிவிக்கப்பட வேண்டும்.

source: Make sure you are running unmodified code from <https://github.com/Klipper3d/klipper>. If the code has been modified or is obtained from another source, then you should reproduce the problem on the unmodified code from <https://github.com/Klipper3d/klipper> prior to reporting.
ta: <Https://github.com/klipper3d/klipper> இலிருந்து மாற்றப்படாத குறியீட்டை இயக்குகிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். குறியீடு மாற்றியமைக்கப்பட்டிருந்தால் அல்லது வேறொரு மூலத்திலிருந்து பெறப்பட்டிருந்தால், நீங்கள் <https://github.com/klipper3d/klipper> இலிருந்து மாற்றப்படாத குறியீட்டில் சிக்கலை மீண்டும் உருவாக்க வேண்டும்.

source: If possible, run an `M112` command immediately after the undesirable event occurs. This causes Klipper to go into a "shutdown state" and it will cause additional debugging information to be written to the log file.
ta: முடிந்தால், விரும்பத்தகாத நிகழ்வு ஏற்பட்ட உடனேயே `M112` கட்டளையை இயக்கவும். இது கிளிப்பர் ஒரு "பணிநிறுத்தம் நிலைக்கு" செல்ல காரணமாகிறது, மேலும் இது கூடுதல் பிழைத்திருத்த தகவல்களை பதிவு கோப்பில் எழுதும்.

source: It is a good idea to compress the log file with zip or gzip.
ta: பதிவு கோப்பை ZIP அல்லது GZIP உடன் சுருக்குவது நல்லது.

source: Open a new topic on the [Klipper Community Forum](#community-forum) and provide a clear description of the problem. Other Klipper contributors will need to understand what steps were taken, what the desired outcome was, and what outcome actually occurred. The compressed Klipper log file should be attached to that topic.
ta: [கிளிப்பர் சமூக மன்றம்] (#சமூகம்-ஃபோரம்) இல் ஒரு புதிய தலைப்பைத் திறந்து பிரச்சினையின் தெளிவான விளக்கத்தை வழங்கவும். மற்ற கிளிப்பர் பங்களிப்பாளர்கள் என்ன நடவடிக்கை எடுக்கப்பட்டனர், விரும்பிய விளைவு என்ன, உண்மையில் என்ன விளைவு நிகழ்ந்தது என்பதை புரிந்து கொள்ள வேண்டும். சுருக்கப்பட்ட கிளிப்பர் பதிவு கோப்பு அந்த தலைப்பில் இணைக்கப்பட வேண்டும்.

source: There are several [documents for developers](Overview.md#developer-documentation). If you have questions on the code then you can also ask in the [Klipper Community Forum](#community-forum) or on the [Klipper Community Discord](#discord-chat).
ta: டெவலப்பர்களுக்கான பல [ஆவணங்கள்] உள்ளன (கண்ணோட்டம். எம்.டி#டெவலப்பர்-ஆவணப்படம்). குறியீட்டில் உங்களிடம் கேள்விகள் இருந்தால், நீங்கள் [கிளிப்பர் சமூக மன்றம்] (#சமூக-ஃபோரம்) அல்லது [கிளிப்பர் சமூக முரண்பாடு] (#டிச்கார்ட்-அரட்டை) இல் கேட்கலாம்.

source: Klipper github
ta: அறிவிலிமையம் வெட்டுதல்

source: Klipper github may be used by contributors to share the status of their work to improve Klipper. It is expected that the person opening a github ticket is actively working on the given task and will be the one performing all the work necessary to accomplish it. The Klipper github is not used for requests, nor to report bugs, nor to ask questions. Use the [Klipper Community Forum](#community-forum) or the [Klipper Community Discord](#discord-chat) instead.
ta: கிளிப்பரை மேம்படுத்துவதற்காக தங்கள் வேலையின் நிலையைப் பகிர்ந்து கொள்ள கிளிப்பர் அறிவிலிமையம் பங்களிப்பாளர்களால் பயன்படுத்தப்படலாம். அறிவிலிமையம் டிக்கெட்டைத் திறக்கும் நபர் கொடுக்கப்பட்ட பணியில் தீவிரமாக வேலை செய்கிறார், அதை நிறைவேற்ற தேவையான அனைத்து வேலைகளையும் நிகழ்த்துவார் என்று எதிர்பார்க்கப்படுகிறது. கிளிப்பர் அறிவிலிமையம் கோரிக்கைகளுக்காகவோ, பிழைகள் புகாரளிக்கவோ, கேள்விகளைக் கேட்கவோ பயன்படுத்தப்படவில்லை. அதற்கு பதிலாக [கிளிப்பர் சமூக மன்றம்] (#சமூக-ஃபோரம்) அல்லது [கிளிப்பர் சமூக முரண்பாடு] (#டிச்கார்ட்-சாட்) ஐப் பயன்படுத்தவும்.
