Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/CONTRIBUTING.po
Languages: uk, zh_hans

source: Input shaping, resonance testing, kinematics
uk: Вхідне формування, резонансне тестування, кінематика

source: Eric Callahan
uk: Ерік Калаган

source: @Arksine
uk: @Арксин

source: Bed leveling, MCU flashing
uk: Вирівнювання ліжка, миготливий MCU

source: Kevin O'Connor
uk: Кевін О'Коннор

source: @KevinOConnor
uk: @KevinOConнор

source: Core motion system, Micro-controller code
uk: Система руху ядра, код Micro-controller

source: Please do not "ping" any of the reviewers and please do not direct submissions at them. All of the reviewers monitor the forums and PRs, and will take on reviews when they have time to.
uk: Будь ласка, не "ping" будь-який з рецензентів і будь ласка, не прямі надсилання. Всі рецензенти контролюють форуми та PR, а також прийматимуться на відгуки, коли вони встигнуть.

source: The Klipper "maintainers" are:
uk: Кліппер «помічники»:

source: GitHub name
uk: Ім'я GitHub

source: Format of commit messages
uk: Формат комісних повідомлень

source: Each commit should have a commit message formatted similar to the following:
uk: Кожна комісія повинна мати повідомлення, відформатований аналогічним чином:

source: In the above example, `module` should be the name of a file or directory in the repository (without a file extension). For example, `clocksync: Fix typo in pause() call at connect time`. The purpose of specifying a module name in the commit message is to help provide context for the commit comments.
uk: У наведеному вище прикладі `модуль` має бути назва файлу або каталогу в репозиторію (без розширення файлу). Наприклад, `clocksync: Виправлення типу у паузи() виклику під час підключення `. Мета визначення імені модуля в комітовому повідомленні полягає в тому, щоб допомогти забезпечити контекст для коментарів.

source: [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) is a project dedicated to translating Klipper to different languages. [Weblate](https://hosted.weblate.org/projects/klipper/) hosts all the Gettext strings for translating and reviewing. Locales can be displayed on [klipper3d.org](https://www.klipper3d.org) once they satisfy the following requirements:
uk: [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) - проект, присвячений перекладі Klipper на різні мови. [Weblate](https://hosted.weblate.org/projects/klipper/) проводить всі рядки Gettext для перекладу та перегляду. Місцеві жителі можуть відображатися на [klipper3d.org](https://www.klipper3d.org) після того, як вони задовольнять наступні вимоги:

source: All titles (H1) are translated
uk: Всі заголовки (H1) переведені

source: Once the requirements are met, you need to:
uk: Після виконання вимог необхідно:

source: update klipper-tranlations repository [active_translations](https://github.com/Klipper3d/klipper-translations/blob/translations/active_translations)
uk: [active_translations](https://github.com/Klipper3d/klipper-translations/blob/translations/active_translations)

source: Optional: add a manual-index.md file in klipper-translations repository's `docs\locals\<lang>` folder to replace the language specific index.md (generated index.md does not render correctly).
uk: Додатково: додати ручний індекс. md файл в klipper-translations repository `docs\locals\<lang>` папка для заміни певного індексу мови.md (генерований індекс.md не дає права).

source: Known Issues:
uk: Знанні питання:

source: Currently, there isn't a method for correctly translating pictures in the documentation
uk: В даний час існує метод правильної перекладацької документації

source: It is impossible to translate titles in mkdocs.yml.
uk: Не можна перевести назви в mkdocs.yml.

source: When discussing benefits it is preferable to discuss "facts and measurements". In general, reviewers are not looking for responses of the form "someone may find option X useful", nor are they looking for responses of the form "this submission adds a feature that firmware X implements". Instead, it is generally preferable to discuss details on how the quality improvement was measured and what were the results of those measurements - for example, "tests on Acme X1000 printers show improved corners as seen in picture ...", or for example "print time of real-world object X on a Foomatic X900 printer went from 4 hours to 3.5 hours". It is understood that testing of this type can take significant time and effort. Some of Klipper's most notable features took months of discussion, rework, testing, and documentation prior to being merged into the master branch.
uk: При обговоренні переваг бажано обговорити «Факти і вимірювання». В цілому рецензенти не шукають відповіді форми « someone може знайти варіант X корисною», ані вони шукають відповіді форми «це уявлення додає функцію, яку прошивку X реалізує». Замість цього, зазвичай бажано обговорити деталі про те, як було вимірено поліпшення якості, і які були результати цих вимірювань - наприклад, "тести на принтерах Acme X1000 показують поліпшені кути, як видно на малюнку ...", або наприклад " час друку об'єкта реального світу X на Foomatic X900 принтер пішов з 4 годин до 3,5 годин". Зрозуміло, що тестування цього типу може зайняти значний час і зусилля. Декілька найбільш нездатних функцій Кліппера взяли участь у обговоренні, реконструкції, тестування та документації до об’єднання в майстер-гілку.

source: When fixing a defect in the code, submitters should have a general understanding of the root cause of that defect, and the fix should target that root cause.
uk: При фіксуванні дефекту в коді подавачі повинні мати загальне розуміння першопричини цього дефекту, а фіксація повинна ціль, що викликає корінь.

source: James Hartley
uk: Джеймс Хартлі

source: @JamesH1978
uk: @ДжемсХ1978

source: Configuration files
uk: Налаштування файлів

source: Thank you for contributing to Klipper! Please take a moment to read this document.
zh_hans: 感谢你对 Klipper 的贡献！请花一点时间阅读本文档。

source: Creating a new issue
zh_hans: 创建一个新的议题

source: Please see the [contact page](Contact.md) for information on creating an issue.
zh_hans: 请参阅[联系页面](Contact.md)，来了解如何创建议题。

source: Submitting a pull request
zh_hans: 提交拉取请求（PR）

source: Contributions of Code and documentation are managed through github pull requests. Each commit should have a commit message formatted similar to the following:
zh_hans: 代码和文档的贡献是通过github 拉取请求（PR）管理的。每个提交都应该有一个提交信息，其格式类似于以下内容：

source: [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) is a project dedicated to translating Klipper to different languages. [Weblate](https://hosted.weblate.org/projects/klipper/) hosts all the Gettext strings for translating and reviewing. Locales can merge into the Klipper project once they satisfy the following requirements:
zh_hans: [Klipper翻译项目](https://github.com/Klipper3d/klipper-translations)是一个致力于将Klipper翻译成不同语言的项目。[Weblate](https://hosted.weblate.org/projects/klipper/) 托管所有 Gettext 字符串以进行翻译和审查。一旦符合以下要求，本地化可以被合并到 Klipper 项目中：

source: All titles (H1) are covered
zh_hans: 涵盖所有大标题（H1）

source: The navigation hierarchy is in `docs\_klipper3d\mkdocs.yml`.
zh_hans: 导航层级在`docs\_klipper3d\mkdocs.yml`中。
