Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Debugging.po
Languages: ta

source: This document describes some of the Klipper debugging tools.
ta: இந்த ஆவணம் சில கிளிப்பர் பிழைத்திருத்த கருவிகளை விவரிக்கிறது.

source: Translating gcode files to micro-controller commands
ta: GCODE கோப்புகளை மைக்ரோ-கண்ட்ரோலர் கட்டளைகளுக்கு மொழிபெயர்க்கிறது

source: The Klippy host code can run in a batch mode to produce the low-level micro-controller commands associated with a gcode file. Inspecting these low-level commands is useful when trying to understand the actions of the low-level hardware. It can also be useful to compare the difference in micro-controller commands after a code change.
ta: GCODE கோப்புடன் தொடர்புடைய குறைந்த-நிலை மைக்ரோ-கன்ட்ரோலர் கட்டளைகளை உருவாக்க கிளிப்பி புரவலன் குறியீடு ஒரு தொகுதி பயன்முறையில் இயங்க முடியும். குறைந்த அளவிலான வன்பொருளின் செயல்களைப் புரிந்து கொள்ள முயற்சிக்கும்போது இந்த குறைந்த-நிலை கட்டளைகளை ஆய்வு செய்வது பயனுள்ளதாக இருக்கும். குறியீடு மாற்றத்திற்குப் பிறகு மைக்ரோ-கன்ட்ரோலர் கட்டளைகளின் வேறுபாட்டை ஒப்பிட்டுப் பார்க்கவும் இது பயனுள்ளதாக இருக்கும்.

source: To run Klippy in this batch mode, there is a one time step necessary to generate the micro-controller "data dictionary". This is done by compiling the micro-controller code to obtain the **out/klipper.dict** file:
ta: இந்த தொகுதி பயன்முறையில் கிளிப்பியை இயக்க, மைக்ரோ-கன்ட்ரோலர் "தரவு அகராதி" உருவாக்க ஒரு முறை படி தேவை. ** out/klipper.dict ** கோப்பைப் பெற மைக்ரோ-கண்ட்ரோலர் குறியீட்டை தொகுப்பதன் மூலம் இது செய்யப்படுகிறது:

source: Once the above is done it is possible to run Klipper in batch mode (see [installation](Installation.md) for the steps necessary to build the python virtual environment and a printer.cfg file):
ta: மேலே உள்ளதும் முடிந்ததும், பைதான் மெய்நிகர் சூழல் மற்றும் ஒரு அச்சுப்பொறி. CFG கோப்பை உருவாக்க தேவையான படிகளுக்கு கிளிப்பரை தொகுதி பயன்முறையில் இயக்க முடியும் ([நிறுவல்] (நிறுவல்] (நிறுவல். MD) ஐப் பார்க்கவும்):

source: The above will produce a file **test.serial** with the binary serial output. This output can be translated to readable text with:
ta: மேலே உள்ளவை பைனரி தொடர் வெளியீட்டில் ஒரு கோப்பை ** test.serial ** ஐ உருவாக்கும். இந்த வெளியீட்டை படிக்கக்கூடிய உரைக்கு மொழிபெயர்க்கலாம்:

source: The resulting file **test.txt** contains a human readable list of micro-controller commands.
ta: இதன் விளைவாக வரும் கோப்பு ** test.txt ** மைக்ரோ-கன்ட்ரோலர் கட்டளைகளின் மனித படிக்கக்கூடிய பட்டியலைக் கொண்டுள்ளது.

source: The batch mode disables certain response / request commands in order to function. As a result, there will be some differences between actual commands and the above output. The generated data is useful for testing and inspection; it is not useful for sending to a real micro-controller.
ta: தொகுதி பயன்முறை செயல்பட சில பதில் / கோரிக்கை கட்டளைகளை முடக்குகிறது. இதன் விளைவாக, உண்மையான கட்டளைகளுக்கும் மேலே உள்ள வெளியீட்டிற்கும் இடையில் சில வேறுபாடுகள் இருக்கும். உருவாக்கப்பட்ட தரவு சோதனை மற்றும் ஆய்வுக்கு பயனுள்ளதாக இருக்கும்; உண்மையான மைக்ரோ-கன்ட்ரோலருக்கு அனுப்ப இது பயனுள்ளதாக இல்லை.

source: Testing with simulavr
ta: சிமுலாவருடன் சோதனை

source: The [simulavr](http://www.nongnu.org/simulavr/) tool enables one to simulate an Atmel ATmega micro-controller. This section describes how one can run test gcode files through simulavr. It is recommended to run this on a desktop class machine (not a Raspberry Pi) as it does require significant cpu to run efficiently.
ta: [Simulavr] (http://www.nongnu.org/simulavr/) கருவி ஒரு அட்மெல் அட்மெகா மைக்ரோ-கன்ட்ரோலரை உருவகப்படுத்த ஒன்றை செயல்படுத்துகிறது. சிமுலாவர் மூலம் சோதனை GCODE கோப்புகளை எவ்வாறு இயக்க முடியும் என்பதை இந்த பிரிவு விவரிக்கிறது. இதை ஒரு டெச்க்டாப் வகுப்பு கணினியில் (ராச்பெர்ரி பை அல்ல) இயக்க பரிந்துரைக்கப்படுகிறது, ஏனெனில் இது திறமையாக இயக்க குறிப்பிடத்தக்க சிபியு தேவைப்படுகிறது.

source: To compile Klipper for use in simulavr, run:
ta: சிமுலாவரில் பயன்படுத்த கிளிப்பரை தொகுக்க, ரன்:

source: Then, with simulavr running in another window, one can run the following to read gcode from a file (eg, "test.gcode"), process it with Klippy, and send it to Klipper running in simulavr (see [installation](Installation.md) for the steps necessary to build the python virtual environment):
ta: பின்னர், சிமுலாவர் மற்றொரு சாளரத்தில் இயங்குவதால், ஒரு கோப்பிலிருந்து (எ.கா., "டெச்ட்.கோட்") GCODE ஐப் படிக்க பின்வருவனவற்றை இயக்கலாம், அதை கிளிப்பியுடன் செயலாக்கலாம், மேலும் சிமுலாவரில் இயங்கும் கிளிப்பருக்கு அனுப்பவும் ([நிறுவலைப் பார்க்கவும்] .md) பைதான் மெய்நிகர் சூழலை உருவாக்க தேவையான படிகளுக்கு):

source: Using simulavr with gtkwave
ta: Gtkwave உடன் சிமுலாவரைப் பயன்படுத்துதல்

source: One useful feature of simulavr is its ability to create signal wave generation files with the exact timing of events. To do this, follow the directions above, but run avrsim.py with a command-line like the following:
ta: சிமுலாவரின் ஒரு பயனுள்ள நற்பொருத்தம் நிகழ்வுகளின் சரியான நேரத்துடன் சமிக்ஞை அலை உருவாக்கும் கோப்புகளை உருவாக்கும் திறன். இதைச் செய்ய, மேலே உள்ள திசைகளைப் பின்பற்றவும், ஆனால் பின்வருவனவற்றைப் போன்ற கட்டளை வரியுடன் avrsim.py ஐ இயக்கவும்:

source: The above would create a file **avrsim.vcd** with information on each change to the GPIOs on PORTA and PORTB. This could then be viewed using gtkwave with:
ta: மேற்கூறியவை போர்டா மற்றும் போர்ட்பில் உள்ள GPIO களில் ஒவ்வொரு மாற்றத்தையும் பற்றிய தகவல்களுடன் ** avrsim.vcd ** ஒரு கோப்பை உருவாக்கும். இதை GTKWAVE ஐப் பயன்படுத்தி பார்க்கலாம்:

source: Manually sending commands to the micro-controller
ta: மைக்ரோ-கன்ட்ரோலருக்கு கைமுறையாக கட்டளைகளை அனுப்புகிறது

source: Normally, the host klippy.py process would be used to translate gcode commands to Klipper micro-controller commands. However, it's also possible to manually send these MCU commands (functions marked with the DECL_COMMAND() macro in the Klipper source code). To do so, run:
ta: பொதுவாக, GCODE கட்டளைகளை கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் கட்டளைகளுக்கு மொழிபெயர்க்க புரவலன் klippy.py செயல்முறை பயன்படுத்தப்படும். இருப்பினும், இந்த எம்.சி.யு கட்டளைகளை கைமுறையாக அனுப்பவும் முடியும் (கிளிப்பர் மூலக் குறியீட்டில் உள்ள டெக்_ கமாண்ட் () மேக்ரோவுடன் குறிக்கப்பட்ட செயல்பாடுகள்). அவ்வாறு செய்ய, இயக்க:

source: See the "HELP" command within the tool for more information on its functionality.
ta: அதன் செயல்பாடு குறித்த கூடுதல் தகவலுக்கு கருவியில் உள்ள "உதவி" கட்டளையைப் பார்க்கவும்.

source: Some command-line options are available. For more information run: `~/klippy-env/bin/python ./klippy/console.py --help`
ta: சில கட்டளை-வரி விருப்பங்கள் கிடைக்கின்றன. மேலும் தகவலுக்கு: `~/klippy-env/bin/python

source: Generating load graphs
ta: சுமை வரைபடங்களை உருவாக்குகிறது

source: The Klippy log file (/tmp/klippy.log) stores statistics on bandwidth, micro-controller load, and host buffer load. It can be useful to graph these statistics after a print.
ta: கிளிப்பி பதிவு கோப்பு (/tmp/klippy.log) அலைவரிசை, மைக்ரோ-கன்ட்ரோலர் சுமை மற்றும் புரவலன் இடையக சுமை ஆகியவற்றில் புள்ளிவிவரங்களை சேமிக்கிறது. அச்சுக்குப் பிறகு இந்த புள்ளிவிவரங்களை வரைபடமாக்குவது பயனுள்ளதாக இருக்கும்.

source: To generate a graph, a one time step is necessary to install the "matplotlib" package:
ta: ஒரு வரைபடத்தை உருவாக்க, "MATPLOTLIB" தொகுப்பை நிறுவ ஒரு நேர படி அவசியம்:

source: Then graphs can be produced with:
ta: பின்னர் வரைபடங்களை உருவாக்கலாம்:

source: One can then view the resulting **loadgraph.png** file.
ta: இதன் விளைவாக ** loadgraph.png ** கோப்பைக் காணலாம்.

source: Different graphs can be produced. For more information run: `~/klipper/scripts/graphstats.py --help`
ta: வெவ்வேறு வரைபடங்களை உருவாக்க முடியும். மேலும் தகவலுக்கு இயங்கும்: `~/klipper/scripts/brackstats.py - -help`

source: Extracting information from the klippy.log file
ta: Klippy.log கோப்பிலிருந்து தகவல்களைப் பெறுதல்

source: The Klippy log file (/tmp/klippy.log) also contains debugging information. There is a logextract.py script that may be useful when analyzing a micro-controller shutdown or similar problem. It is typically run with something like:
ta: கிளிப்பி பதிவு கோப்பு (/tmp/klippy.log) பிழைத்திருத்த தகவல்களையும் கொண்டுள்ளது. மைக்ரோ-கன்ட்ரோலர் பணிநிறுத்தம் அல்லது இதே போன்ற சிக்கலை பகுப்பாய்வு செய்யும் போது பயனுள்ளதாக இருக்கும் ஒரு logextract.py ச்கிரிப்ட் உள்ளது. இது பொதுவாக ஏதாவது ஒன்றைக் கொண்டு இயக்கப்படுகிறது:

source: The script will extract the printer config file and will extract MCU shutdown information. The information dumps from an MCU shutdown (if present) will be reordered by timestamp to assist in diagnosing cause and effect scenarios.
ta: ச்கிரிப்ட் அச்சுப்பொறி கட்டமைப்பு கோப்பைப் பிரித்தெடுக்கும் மற்றும் MCU பணிநிறுத்தம் தகவலைப் பிரித்தெடுக்கும். MCU பணிநிறுத்தத்திலிருந்து (இருந்தால்) செய்தி குப்பைகள் காரணம் மற்றும் விளைவு காட்சிகளைக் கண்டறிய உதவுவதற்காக நேர முத்திரையால் மறுவரிசைப்படுத்தப்படும்.

source: Running the regression tests
ta: பின்னடைவு சோதனைகளை இயக்குகிறது

source: The main Klipper GitHub repository uses "github actions" to run a series of regression tests. It can be useful to run some of these tests locally.
ta: முக்கிய கிளிப்பர் அறிவிலிமையம் களஞ்சியம் தொடர்ச்சியான பின்னடைவு சோதனைகளை இயக்க "அறிவிலிமையம் செயல்களை" பயன்படுத்துகிறது. இந்த சோதனைகளில் சிலவற்றை உள்நாட்டில் இயக்குவது பயனுள்ளதாக இருக்கும்.

source: The source code "whitespace check" can be run with:
ta: மூலக் குறியீடு "வைட்ச்பேச் செக்" உடன் இயக்கப்படலாம்:

source: make menuconfig make
ta: மெனுகான்ஃபிக் செய்யுங்கள் உருவாக்கு

source: ~/klippy-env/bin/python ./klippy/klippy.py ~/printer.cfg -i test.gcode -o test.serial -v -d out/klipper.dict
ta: ~/klippy -env/bin/python.

source: ~/klippy-env/bin/python ./klippy/parsedump.py out/klipper.dict test.serial > test.txt
ta: ~/klippy-env/bin/python

source: ~/klippy-env/bin/python ./klippy/klippy.py config/generic-simulavr.cfg -i test.gcode -v
ta: ~/klippy -env/bin/python

source: ~/klippy-env/bin/python ./klippy/console.py /tmp/pseudoserial
ta: ~/klippy-env/bin/python

source: ~/klipper/scripts/graphstats.py /tmp/klippy.log -o loadgraph.png
ta: ~/klipper/scripts/brackstats.py /tmp/klippy.log -o loadgraph.png

source: mkdir work_directory cd work_directory cp /tmp/klippy.log . ~/klipper/scripts/logextract.py ./klippy.log
ta: mkdir work_directory குறுவட்டு வேலை_ அடைவு cp /tmp/klippy.log. ~/klipper/scripts/logextract.py ./klippy.log

source: tar xfz klipper-dict-20??????.tar.gz ~/klippy-env/bin/python ~/klipper/scripts/test_klippy.py -d dict/ ~/klipper/test/klippy/*.test
ta: XFZ கிளிப்பர்-டிக்ட் -20 ?????? ~/Klippy -env/bin/python ~/klipper/scripts/test_klippy.py -d dict/~/cutter/test/klippy/*

source: Debugging
ta: பிழைத்திருத்தம்

source: Motion analysis and data logging
ta: இயக்க பகுப்பாய்வு மற்றும் தரவு பதிவு

source: Klipper supports logging its internal motion history, which can be later analyzed. To use this feature, Klipper must be started with the [API Server](API_Server.md) enabled.
ta: கிளிப்பர் அதன் உள் இயக்க வரலாற்றை பதிவு செய்வதை ஆதரிக்கிறது, பின்னர் அதை பகுப்பாய்வு செய்யலாம். இந்த அம்சத்தைப் பயன்படுத்த, கிளிப்பரை [API சேவையகம்] (API_SERVER.MD) இயக்கப்பட்டதாகத் தொடங்க வேண்டும்.

source: Data logging is enabled with the `data_logger.py` tool. For example:
ta: தரவு பதிவு `data_logger.py` கருவியுடன் இயக்கப்பட்டது. உதாரணமாக:

source: ~/klipper/scripts/motan/data_logger.py /tmp/klippy_uds mylog
ta: ~/கிளிஃப்ச்/ச்கிரிப்ட்கள்/மோட்டான்/டேட்டா_லாக்சர்.பி/டி.எம்.பி/கிளிப்பி_யூட் மைலாக்

source: This command will connect to the Klipper API Server, subscribe to status and motion information, and log the results. Two files are generated - a compressed data file and an index file (eg, `mylog.json.gz` and `mylog.index.gz`). After starting the logging, it is possible to complete prints and other actions - the logging will continue in the background. When done logging, hit `ctrl-c` to exit from the `data_logger.py` tool.
ta: இந்த கட்டளை கிளிப்பர் பநிஇ சேவையகத்துடன் இணைக்கும், நிலை மற்றும் இயக்கத் தகவல்களுக்கு குழுசேரும், முடிவுகளை பதிவு செய்யும். இரண்டு கோப்புகள் உருவாக்கப்படுகின்றன - சுருக்கப்பட்ட தரவு கோப்பு மற்றும் ஒரு குறியீட்டு கோப்பு (எ.கா., `mylog.json.gz` மற்றும்` mylog.index.gz`). உள்நுழைவைத் தொடங்கிய பிறகு, அச்சிட்டு மற்றும் பிற செயல்களை முடிக்க முடியும் - உள்நுழைவு பின்னணியில் தொடரும். உள்நுழைவு முடிந்ததும், `data_logger.py` கருவியிலிருந்து வெளியேற` ctrl-c` ஐ அழுத்தவும்.

source: The resulting files can be read and graphed using the `motan_graph.py` tool. To generate graphs on a Raspberry Pi, a one time step is necessary to install the "matplotlib" package:
ta: இதன் விளைவாக வரும் கோப்புகளைப் படித்து `motan_graph.py` கருவியைப் பயன்படுத்தி கிராப் செய்யலாம். ராச்பெர்ரி பை மீது வரைபடங்களை உருவாக்க, "மேட்ப்ளோட்லிப்" தொகுப்பை நிறுவ ஒரு நேர படி அவசியம்:

source: However, it may be more convenient to copy the data files to a desktop class machine along with the Python code in the `scripts/motan/` directory. The motion analysis scripts should run on any machine with a recent version of [Python](https://python.org) and [Matplotlib](https://matplotlib.org/) installed.
ta: இருப்பினும், தரவுக் கோப்புகளை `ச்கிரிப்டுகள்/மோட்டான்/` கோப்பகத்தில் உள்ள பைதான் குறியீட்டுடன் டெச்க்டாப் வகுப்பு இயந்திரத்தில் நகலெடுப்பது மிகவும் வசதியாக இருக்கலாம். மோசன் அனாலிசிச் ச்கிரிப்ட்கள் எந்தவொரு கணினியிலும் [பைதான்] (https://python.org) மற்றும் [Matplotlib] (https://matplotlib.org/) நிறுவப்பட்ட பதிப்பைக் கொண்டு இயங்க வேண்டும்.

source: Graphs can be generated with a command like the following:
ta: பின்வருவன போன்ற கட்டளையுடன் வரைபடங்களை உருவாக்க முடியும்:

source: One can use the `-g` option to specify the datasets to graph (it takes a Python literal containing a list of lists). For example:
ta: தரவுத்தொகுப்புகளை வரைபடமாகக் குறிப்பிட `-g` விருப்பத்தைப் பயன்படுத்தலாம் (இது பட்டியல்களின் பட்டியலைக் கொண்ட பைதான் நேரடி எடுக்கும்). உதாரணமாக:

source: ~/klipper/scripts/motan/motan_graph.py mylog -g '[["trapq(toolhead,velocity)"], ["trapq(toolhead,accel)"]]'
ta: ~/klipper/scripts/motan/motan_graph.py mylog -g '[["trapq (கருவித்தொகுப்பு, வேகம்)"], ["ட்ராப்க் (கருவித்தொகை, முடி)"]]'

source: The list of available datasets can be found using the `-l` option - for example:
ta: கிடைக்கக்கூடிய தரவுத்தொகுப்புகளின் பட்டியலை `-l` விருப்பத்தைப் பயன்படுத்தி காணலாம் - எடுத்துக்காட்டாக:

source: It is also possible to specify matplotlib plot options for each dataset:
ta: ஒவ்வொரு தரவுத்தொகுப்பிற்கும் MATPLOTLIB சூழ்ச்சி விருப்பங்களைக் குறிப்பிடவும் முடியும்:

source: ~/klipper/scripts/motan/motan_graph.py mylog -g '[["trapq(toolhead,velocity)?color=red&alpha=0.4"]]'
ta: ~/klipper/scripts/motan/motan_graph.py mylog -g '[["trapq (கருவித்தளம், வேகம்)? வண்ணம் = சிவப்பு & ஆல்பா = 0.4"]]'

source: Many matplotlib options are available; some examples are "color", "label", "alpha", and "linestyle".
ta: பல MATPLOTLIB விருப்பங்கள் கிடைக்கின்றன; சில எடுத்துக்காட்டுகள் "வண்ணம்", "லேபிள்", "ஆல்பா" மற்றும் "லின்ச்டைல்".

source: The `motan_graph.py` tool supports several other command-line options - use the `--help` option to see a list. It may also be convenient to view/modify the [motan_graph.py](../scripts/motan/motan_graph.py) script itself.
ta: `Motan_graph.py` கருவி பல கட்டளை-வரி விருப்பங்களை ஆதரிக்கிறது-ஒரு பட்டியலைக் காண`--help` விருப்பத்தைப் பயன்படுத்தவும். [Motan_graph.py] (../ ச்கிரிப்ட்கள்/மோட்டான்/மோட்டான்_ கிராப்.பை) ச்கிரிப்டைக் காண/மாற்றவும் வசதியாக இருக்கலாம்.

source: cd /path/to/klipper make menuconfig
ta: குறுவட்டு/பாதை/முதல்/கிளிப்பர் மெனுகான்ஃபிக் செய்யுங்கள்

source: and compile the micro-controller software for an AVR atmega644p and select SIMULAVR software emulation support. Then one can compile Klipper (run `make`) and then start the simulation with:
ta: மற்றும் AVR ATMEGA644P க்கான மைக்ரோ-கன்ட்ரோலர் மென்பொருளை தொகுத்து, சிமுலாவர் மென்பொருள் எமுலேசன் ஆதரவைத் தேர்ந்தெடுக்கவும். பின்னர் ஒருவர் கிளிப்பரை தொகுக்கலாம் (`மேக்`) பின்னர் உருவகப்படுத்துதலைத் தொடங்கலாம்:

source: PYTHONPATH=/path/to/simulavr/src/python/ ./scripts/avrsim.py out/klipper.elf -t PORTA.PORT,PORTC.PORT
ta: பைதன்பாத் =/பாதை/to/simulavr/src/python/

source: The Klippy regression test suite requires "data dictionaries" from many platforms. The easiest way to obtain them is to [download them from github](https://github.com/Klipper3d/klipper/issues/1438). Once the data dictionaries are downloaded, use the following to run the regression suite:
ta: கிளிப்பி பின்னடைவு சோதனை தொகுப்புக்கு பல தளங்களிலிருந்து "தரவு அகராதிகள்" தேவை. அவற்றைப் பெறுவதற்கான எளிதான வழி, [கிட்அப்பிலிருந்து அவற்றைப் பதிவிறக்குவது] (https://github.com/klipper3d/klipper/issues/1438). தரவு அகராதிகள் பதிவிறக்கம் செய்யப்பட்டதும், பின்னடைவு தொகுப்பை இயக்க பின்வருவனவற்றைப் பயன்படுத்தவும்:

source: The raw data logs produced by the `data_logger.py` tool follow the format described in the [API Server](API_Server.md). It may be useful to inspect the data with a Unix command like the following: `gunzip < mylog.json.gz | tr '\03' '\n' | less`
ta: `Data_logger.py` கருவியால் தயாரிக்கப்பட்ட மூல தரவு பதிவுகள் [API சேவையகம்] (API_SERVER.MD) இல் விவரிக்கப்பட்டுள்ள வடிவமைப்பைப் பின்பற்றுகின்றன. பின்வருவன போன்ற யூனிக்ச் கட்டளையுடன் தரவை ஆய்வு செய்வது பயனுள்ளதாக இருக்கும்: `கன்சிப் <mylog.json.gz | tr '\ 03' '\ n' | குறைவாக`

source: To use simulavr, download the simulavr package and compile with python support. Note that the build system may need to have some packages (such as swig) installed in order to build the python module.
ta: சிமுலாவரைப் பயன்படுத்த, சிமுலாவர் தொகுப்பைப் பதிவிறக்கி பைதான் ஆதரவுடன் தொகுக்கவும். பைதான் தொகுதியை உருவாக்க சில தொகுப்புகள் (ச்விக் போன்றவை) நிறுவப்பட்டிருக்க வேண்டும் என்பதை நினைவில் கொள்க.

source: git clone git://git.savannah.nongnu.org/simulavr.git cd simulavr make python make build
ta: git நகலி கிட்: //git.savannah.nongnu.org/simulavr.git குறுவட்டு சிமுலாவர் பைத்தானை உருவாக்குங்கள் உருவாக்க

source: Make sure a file like **./build/pysimulavr/_pysimulavr.*.so** is present after the above compilation:
ta: **./Build/pysimulavr/_pysimulavr.*. எனவே ** மேலே உள்ள தொகுப்புக்குப் பிறகு ** உள்ளது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்:

source: ls ./build/pysimulavr/_pysimulavr.*.so
ta: ls

source: If you are on a Debian-based system (Debian, Ubuntu, etc.) you can install the following packages and generate *.deb files for system-wide installation of simulavr:
ta: நீங்கள் ஒரு டெபியன் அடிப்படையிலான கணினியில் இருந்தால் (டெபியன், உபுண்டு, முதலியன) நீங்கள் பின்வரும் தொகுப்புகளை நிறுவலாம் மற்றும் சிமுலாவரின் கணினி அளவிலான நிறுவலுக்காக *.deb கோப்புகளை உருவாக்கலாம்:

source: sudo apt update sudo apt install g++ make cmake swig rst2pdf help2man texinfo make cfgclean python debian sudo dpkg -i build/debian/python3-simulavr*.deb
ta: சூடோ APT புதுப்பிப்பு sudo apt install g ++ உருவாக்கு cmake swig rst2pdf help2man dexinfo Cfgclean பைதான் Debian ஐ உருவாக்குங்கள் sudo dpkg -i பில்ட்/டெபியன்/பைதான் 3 -சிமுலாவர்*.டெப்

source: PYTHONPATH=/path/to/simulavr/build/pysimulavr/ ./scripts/avrsim.py out/klipper.elf
ta: பைதன்பாத் =/பாதை/to/simulavr/build/pysimulavr/

source: Note that if you have installed python3-simulavr system-wide, you do not need to set `PYTHONPATH`, and can simply run the simulator as
ta: நீங்கள் பைதான் 3-சிமுலாவர் கணினி அளவிலான நிறுவியிருந்தால், நீங்கள் `பைதன்பாத்` அமைக்கத் தேவையில்லை, மேலும் சிமுலேட்டரை இயக்க முடியும்

source: ./scripts/avrsim.py out/klipper.elf
ta: ./scripts/avrsim.py out/cliffs.elf

source: This command should report a specific file (e.g. **./build/pysimulavr/_pysimulavr.cpython-39-x86_64-linux-gnu.so**) and not an error.
ta: இந்த கட்டளை ஒரு குறிப்பிட்ட கோப்பைப் புகாரளிக்க வேண்டும் (எ.கா. **.
