Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Delta_Calibrate.po
Languages: ta

source: This document describes Klipper's automatic calibration system for "delta" style printers.
ta: இந்த ஆவணம் "டெல்டா" பாணி அச்சுப்பொறிகளுக்கான கிளிப்பரின் தானியங்கி அளவுத்திருத்த அமைப்பை விவரிக்கிறது.

source: Delta calibration involves finding the tower endstop positions, tower angles, delta radius, and delta arm lengths. These settings control printer motion on a delta printer. Each one of these parameters has a non-obvious and non-linear impact and it is difficult to calibrate them manually. In contrast, the software calibration code can provide excellent results with just a few minutes of time. No special probing hardware is necessary.
ta: டெல்டா அளவுத்திருத்தத்தில் டவர் எண்ட்ச்டாப் நிலைகள், கோபுர கோணங்கள், டெல்டா ஆரம் மற்றும் டெல்டா கை நீளங்களைக் கண்டுபிடிப்பதை உள்ளடக்குகிறது. இந்த அமைப்புகள் டெல்டா அச்சுப்பொறியில் அச்சுப்பொறி இயக்கத்தைக் கட்டுப்படுத்துகின்றன. இந்த அளவுருக்கள் ஒவ்வொன்றும் வெளிப்படையான மற்றும் நேரியல் அல்லாத தாக்கத்தைக் கொண்டுள்ளன, மேலும் அவற்றை கைமுறையாக அளவீடு செய்வது கடினம். இதற்கு நேர்மாறாக, மென்பொருள் அளவுத்திருத்தக் குறியீடு சில நிமிட நேரங்களுடன் சிறந்த முடிவுகளை வழங்க முடியும். சிறப்பு ஆய்வு வன்பொருள் தேவையில்லை.

source: Ultimately, the delta calibration is dependent on the precision of the tower endstop switches. If one is using Trinamic stepper motor drivers then consider enabling [endstop phase](Endstop_Phase.md) detection to improve the accuracy of those switches.
ta: இறுதியில், டெல்டா அளவுத்திருத்தம் டவர் எண்ட்ச்டாப் சுவிட்சுகளின் துல்லியத்தைப் பொறுத்தது. ஒருவர் டிரினாமிக் ச்டெப்பர் மின்னோடி இயக்கிகளைப் பயன்படுத்துகிறார்களானால், அந்த சுவிட்சுகளின் துல்லியத்தை மேம்படுத்த [எண்ட்ச்டாப் கட்டம்] (Endstop_phase.md) கண்டறிதலை இயக்குவதைக் கவனியுங்கள்.

source: Automatic vs manual probing
ta: தானியங்கி Vs கையேடு ஆய்வு

source: Klipper supports calibrating the delta parameters via a manual probing method or via an automatic Z probe.
ta: கையேடு ஆய்வு முறை வழியாக அல்லது தானியங்கி சட் ஆய்வு வழியாக டெல்டா அளவுருக்களை அளவீடு செய்வதை கிளிப்பர் ஆதரிக்கிறது.

source: A number of delta printer kits come with automatic Z probes that are not sufficiently accurate (specifically, small differences in arm length can cause effector tilt which can skew an automatic probe). If using an automatic probe then first [calibrate the probe](Probe_Calibrate.md) and then check for a [probe location bias](Probe_Calibrate.md#location-bias-check). If the automatic probe has a bias of more than 25 microns (.025mm) then use manual probing instead. Manual probing only takes a few minutes and it eliminates error introduced by the probe.
ta: பல டெல்டா அச்சுப்பொறி கருவிகள் தானியங்கி சட் ஆய்வுகள் போதுமான அளவு துல்லியமாக இல்லை (குறிப்பாக, கை நீளத்தில் சிறிய வேறுபாடுகள் செயல்திறன் சாய்வை ஏற்படுத்தும், இது ஒரு தானியங்கி ஆய்வைத் தவிர்க்கலாம்). தானியங்கி ஆய்வைப் பயன்படுத்தினால், முதலில் [ஆய்வை அளவீடு செய்யுங்கள்] (probe_calibrate.md), பின்னர் [ஆய்வு இருப்பிட சார்பு] (probe_calibrate.md#இருப்பிட-பயாச்-செக்) ஐ சரிபார்க்கவும். தானியங்கி ஆய்வுக்கு 25 மைக்ரான் (.025 மிமீ) ஒரு சார்பு இருந்தால், அதற்கு பதிலாக கையேடு ஆய்வைப் பயன்படுத்தவும். கையேடு ஆய்வு சில நிமிடங்கள் மட்டுமே ஆகும், மேலும் இது ஆய்வால் அறிமுகப்படுத்தப்பட்ட பிழையை நீக்குகிறது.

source: If using a probe that is mounted on the side of the hotend (that is, it has an X or Y offset) then note that performing delta calibration will invalidate the results of probe calibration. These types of probes are rarely suitable for use on a delta (because minor effector tilt will result in a probe location bias). If using the probe anyway, then be sure to rerun probe calibration after any delta calibration.
ta: ஒட்டெண்டின் பக்கத்தில் பொருத்தப்பட்ட ஒரு ஆய்வைப் பயன்படுத்தினால் (அதாவது, இது ஒரு ஃச் அல்லது ஒய் ஆஃப்செட்டைக் கொண்டுள்ளது) பின்னர் டெல்டா அளவுத்திருத்தத்தை நிகழ்த்துவது ஆய்வு அளவுத்திருத்தத்தின் முடிவுகளை செல்லாது என்பதை நினைவில் கொள்க. இந்த வகையான ஆய்வுகள் டெல்டாவில் பயன்படுத்த அரிதாகவே பொருத்தமானவை (ஏனெனில் சிறிய செயல்திறன் சாய்வு ஆய்வு இருப்பிட சார்புக்கு வழிவகுக்கும்). எப்படியிருந்தாலும் ஆய்வைப் பயன்படுத்தினால், எந்த டெல்டா அளவுத்திருத்தத்திற்குப் பிறகு ஆய்வு அளவுத்திருத்தத்தை மீண்டும் இயக்க மறக்காதீர்கள்.

source: Basic delta calibration
ta: அடிப்படை டெல்டா அளவுத்திருத்தம்

source: Klipper has a DELTA_CALIBRATE command that can perform basic delta calibration. This command probes seven different points on the bed and calculates new values for the tower angles, tower endstops, and delta radius.
ta: கிளிப்பரில் ஒரு டெல்டா_கலிப்ரேட் கட்டளை உள்ளது, இது அடிப்படை டெல்டா அளவுத்திருத்தத்தை செய்ய முடியும். இந்த கட்டளை படுக்கையில் ஏழு வெவ்வேறு புள்ளிகளை ஆராய்ந்து கோபுர கோணங்கள், டவர் எண்ட்ச்டாப்ச் மற்றும் டெல்டா ஆரம் ஆகியவற்றிற்கான புதிய மதிப்புகளைக் கணக்கிடுகிறது.

source: In order to perform this calibration the initial delta parameters (arm lengths, radius, and endstop positions) must be provided and they should have an accuracy to within a few millimeters. Most delta printer kits will provide these parameters - configure the printer with these initial defaults and then go on to run the DELTA_CALIBRATE command as described below. If no defaults are available then search online for a delta calibration guide that can provide a basic starting point.
ta: இந்த அளவுத்திருத்தத்தை செய்ய ஆரம்ப டெல்டா அளவுருக்கள் (கை நீளம், ஆரம் மற்றும் எண்ட்ச்டாப் நிலைகள்) வழங்கப்பட வேண்டும், மேலும் அவை ஒரு சில மில்லிமீட்டருக்குள் ஒரு துல்லியத்தை கொண்டிருக்க வேண்டும். பெரும்பாலான டெல்டா அச்சுப்பொறி கருவிகள் இந்த அளவுருக்களை வழங்கும் - இந்த ஆரம்ப இயல்புநிலைகளுடன் அச்சுப்பொறியை உள்ளமைக்கவும், பின்னர் கீழே விவரிக்கப்பட்டுள்ளபடி டெல்டா_கலிப்ரேட் கட்டளையை இயக்கவும். இயல்புநிலை எதுவும் கிடைக்கவில்லை என்றால், அடிப்படை தொடக்க புள்ளியை வழங்கக்கூடிய டெல்டா அளவுத்திருத்த வழிகாட்டியை ஆன்லைனில் தேடுங்கள்.

source: During the delta calibration process it may be necessary for the printer to probe below what would otherwise be considered the plane of the bed. It is typical to permit this during calibration by updating the config so that the printer's `minimum_z_position=-5`. (Once calibration completes, one can remove this setting from the config.)
ta: டெல்டா அளவுத்திருத்த செயல்பாட்டின் போது, அச்சுப்பொறி படுக்கையின் விமானமாக கருதப்படுவதை கீழே ஆய்வு செய்ய வேண்டியது தேவை. அச்சுப்பொறியின் `குறைந்தபட்ச_இசட்_போசிசன் = -5` என்ற கட்டமைப்பைப் புதுப்பிப்பதன் மூலம் அளவுத்திருத்தத்தின் போது இதை அனுமதிப்பது பொதுவானது. (அளவுத்திருத்தம் முடிந்ததும், ஒருவர் இந்த அமைப்பை உள்ளமைவிலிருந்து அகற்றலாம்.)

source: There are two ways to perform the probing - manual probing (`DELTA_CALIBRATE METHOD=manual`) and automatic probing (`DELTA_CALIBRATE`). The manual probing method will move the head near the bed and then wait for the user to follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location.
ta: ஆய்வு செய்ய இரண்டு வழிகள் உள்ளன - கையேடு ஆய்வு (`டெல்டா_கலிப்ரேட் முறை = கையேடு`) மற்றும் தானியங்கி ஆய்வு (` டெல்டா_காலிபிரேட்`). கையேடு ஆய்வு முறை தலையை படுக்கைக்கு அருகில் நகர்த்தும், பின்னர் பயனருக்கு இடையிலான உண்மையான தூரத்தை தீர்மானிக்க பயனர் ["காகித சோதனை"] (Bed_level.md#the-paper-test) இல் விவரிக்கப்பட்டுள்ள படிகளைப் பின்பற்றக் காத்திருக்கிறார் கொடுக்கப்பட்ட இடத்தில் படுக்கை.

source: To perform the basic probe, make sure the config has a [delta_calibrate] section defined and then run the tool:
ta: அடிப்படை ஆய்வைச் செய்ய, கட்டமைப்பில் [டெல்டா_கலிப்ரேட்] பிரிவு வரையறுக்கப்பட்டுள்ளது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், பின்னர் கருவியை இயக்கவும்:

source: After probing the seven points new delta parameters will be calculated. Save and apply these parameters by running:
ta: ஏழு புள்ளிகளை ஆராய்ந்த பிறகு புதிய டெல்டா அளவுருக்கள் கணக்கிடப்படும். இயங்குவதன் மூலம் இந்த அளவுருக்களைச் சேமித்து பயன்படுத்துங்கள்:

source: The basic calibration should provide delta parameters that are accurate enough for basic printing. If this is a new printer, this is a good time to print some basic objects and verify general functionality.
ta: அடிப்படை அளவுத்திருத்தம் அடிப்படை அச்சிடலுக்கு போதுமான துல்லியமான டெல்டா அளவுருக்களை வழங்க வேண்டும். இது ஒரு புதிய அச்சுப்பொறியாக இருந்தால், சில அடிப்படை பொருள்களை அச்சிட்டு பொதுவான செயல்பாட்டை சரிபார்க்க இது ஒரு நல்ல நேரம்.

source: Enhanced delta calibration
ta: மேம்படுத்தப்பட்ட டெல்டா அளவுத்திருத்தம்

source: The basic delta calibration generally does a good job of calculating delta parameters such that the nozzle is the correct distance from the bed. However, it does not attempt to calibrate X and Y dimensional accuracy. It's a good idea to perform an enhanced delta calibration to verify dimensional accuracy.
ta: அடிப்படை டெல்டா அளவுத்திருத்தம் பொதுவாக டெல்டா அளவுருக்களைக் கணக்கிடுவதற்கான ஒரு நல்ல வேலையைச் செய்கிறது, அதாவது முனை படுக்கையிலிருந்து சரியான தூரம். இருப்பினும், இது ஃச் மற்றும் ஒய் பரிமாண துல்லியத்தை அளவீடு செய்ய முயற்சிக்கவில்லை. பரிமாண துல்லியத்தை சரிபார்க்க மேம்பட்ட டெல்டா அளவுத்திருத்தத்தை செய்வது நல்லது.

source: This calibration procedure requires printing a test object and measuring parts of that test object with digital calipers.
ta: இந்த அளவுத்திருத்த நடைமுறைக்கு ஒரு சோதனை பொருளை அச்சிடுவதும், அந்த சோதனை பொருளின் பகுதிகளை டிசிட்டல் காலிபர்களுடன் அளவிடுவதும் தேவைப்படுகிறது.

source: Use a slicer to generate G-Code from the [docs/prints/calibrate_size.stl](prints/calibrate_size.stl) file. Slice the object using a slow speed (eg, 40mm/s). If possible, use a stiff plastic (such as PLA) for the object. The object has a diameter of 140mm. If this is too large for the printer then one can scale it down (but be sure to uniformly scale both the X and Y axes). If the printer supports significantly larger prints then this object can also be increased in size. A larger size can improve the measurement accuracy, but good print adhesion is more important than a larger print size.
ta: [டாக்ச்/அச்சிட்டு/அளவீடுகள்/அளவீடு_சிச்.ச்டிஎல்] (அச்சிட்டு/அளவீடு_சிச்.ச்டிஎல்) கோப்பிலிருந்து சி-குறியீட்டை உருவாக்க ஒரு ச்லைசரைப் பயன்படுத்தவும். மெதுவான வேகத்தைப் பயன்படுத்தி பொருளை நறுக்கவும் (எ.கா., 40 மிமீ/வி). முடிந்தால், பொருளுக்கு கடினமான பிளாச்டிக் (பி.எல்.ஏ போன்றவை) பயன்படுத்தவும். பொருள் 140 மிமீ விட்டம் கொண்டது. இது அச்சுப்பொறிக்கு மிகப் பெரியதாக இருந்தால், அதை அளவிட முடியும் (ஆனால் ஃச் மற்றும் ஒய் அச்சுகள் இரண்டையும் ஒரே மாதிரியாக அளவிட மறக்காதீர்கள்). அச்சுப்பொறி கணிசமாக பெரிய அச்சிட்டுகளை ஆதரித்தால், இந்த பொருளையும் அளவிலும் அதிகரிக்க முடியும். ஒரு பெரிய அளவு அளவீட்டு துல்லியத்தை மேம்படுத்தலாம், ஆனால் பெரிய அச்சு அளவை விட நல்ல அச்சு ஒட்டுதல் முக்கியமானது.

source: Print the test object and wait for it to fully cool. The commands described below must be run with the same printer settings used to print the calibration object (don't run DELTA_CALIBRATE between printing and measuring, or do something that would otherwise change the printer configuration).
ta: சோதனை பொருளை அச்சிட்டு, அது முழுமையாக குளிர்விக்கும் வரை காத்திருங்கள். கீழே விவரிக்கப்பட்டுள்ள கட்டளைகள் அளவுத்திருத்த பொருளை அச்சிடப் பயன்படுத்தப்படும் அதே அச்சுப்பொறி அமைப்புகளுடன் இயக்கப்பட வேண்டும் (அச்சிடுதல் மற்றும் அளவிடுவதற்கு இடையில் டெல்டா_கலிப்ரேட் செய்ய வேண்டாம், அல்லது அச்சுப்பொறி உள்ளமைவை மாற்றக்கூடிய ஒன்றைச் செய்ய வேண்டாம்).

source: If possible, perform the measurements described below while the object is still attached to the print bed, but don't worry if the part detaches from the bed - just try to avoid bending the object when performing the measurements.
ta: முடிந்தால், பொருள் இன்னும் அச்சு படுக்கையுடன் இணைக்கப்பட்டிருக்கும்போது கீழே விவரிக்கப்பட்ட அளவீடுகளைச் செய்யுங்கள், ஆனால் பகுதி படுக்கையில் இருந்து பிரிந்தால் கவலைப்பட வேண்டாம் - அளவீடுகளைச் செய்யும்போது பொருளை வளைப்பதைத் தவிர்க்க முயற்சிக்கவும்.

source: Start by measuring the distance between the center pillar and the pillar next to the "A" label (which should also be pointing towards the "A" tower).
ta: "ஏ" லேபிளுக்கு அடுத்துள்ள மையத் தூணுக்கும் தூணுக்கும் இடையிலான தூரத்தை அளவிடுவதன் மூலம் தொடங்கவும் (இது "ஒரு" கோபுரத்தை நோக்கி சுட்டிக்காட்ட வேண்டும்).

source: Then go counterclockwise and measure the distances between the center pillar and the other pillars (distance from center to pillar across from C label, distance from center to pillar with B label, etc.).
ta: பின்னர் எதிரெதிர் திசையில் சென்று மையத் தூணுக்கும் பிற தூண்களுக்கும் இடையிலான தூரத்தை அளவிடவும் (சி லேபிளிலிருந்து மையத்திலிருந்து தூணுக்கு தூரம், மையத்திலிருந்து தூணுக்கு பி லேபிளுடன் தூரம் போன்றவை).

source: Enter these parameters into Klipper with a comma separated list of floating point numbers:
ta: மிதக்கும் புள்ளி எண்களின் கமா பிரிக்கப்பட்ட பட்டியலுடன் இந்த அளவுருக்களை கிளிப்பரில் உள்ளிடவும்:

source: Provide the values without spaces between them.
ta: அவற்றுக்கு இடையில் இடைவெளிகள் இல்லாமல் மதிப்புகளை வழங்கவும்.

source: Then measure the distance between the A pillar and the pillar across from the C label.
ta: சி லேபிளிலிருந்து ஒரு தூண் மற்றும் தூணுக்கு இடையிலான தூரத்தை அளவிடவும்.

source: Then go counterclockwise and measure the distance between the pillar across from C to the B pillar, the distance between the B pillar and the pillar across from A, and so on.
ta: பின்னர் எதிரெதிர் திசையில் சென்று சி முதல் பி தூண் வரை தூணுக்கு இடையிலான தூரத்தை அளவிடவும், பி தூணுக்கும் தூணுக்கும் இடையிலான தூரம் A இலிருந்து, மற்றும் பல.

source: Enter these parameters into Klipper:
ta: இந்த அளவுருக்களை கிளிப்பரில் உள்ளிடவும்:

source: At this point it is okay to remove the object from the bed. The final measurements are of the pillars themselves. Measure the size of the center pillar along the A spoke, then the B spoke, and then the C spoke.
ta: இந்த கட்டத்தில் படுக்கையிலிருந்து பொருளை அகற்றுவது பரவாயில்லை. இறுதி அளவீடுகள் தூண்களில் உள்ளன. ஒரு பேச்சுடன் மையத் தூணின் அளவை அளவிடவும், பின்னர் பி பேசினார், பின்னர் சி பேசினார்.

source: Enter them into Klipper:
ta: கிளிப்பரில் அவற்றை உள்ளிடவும்:

source: The final measurements are of the outer pillars. Start by measuring the distance of the A pillar along the line from A to the pillar across from C.
ta: இறுதி அளவீடுகள் வெளிப்புற தூண்களில் உள்ளன. ஒரு தூணின் தூரத்தை ஒரு முதல் தூண் வரை சி முழுவதும் இருந்து அளவிடுவதன் மூலம் தொடங்கவும்.

source: Then go counterclockwise and measure the remaining outer pillars (pillar across from C along the line to B, B pillar along the line to pillar across from A, etc.).
ta: பின்னர் எதிரெதிர் திசையில் சென்று மீதமுள்ள வெளிப்புற தூண்களை அளவிடவும் (சி இலிருந்து பி, பி தூணுக்குள் பி, பி தூண் வரியுடன் ஒரு தூண் வரை A, முதலியன).

source: And enter them into Klipper:
ta: அவற்றை கிளிப்பரில் உள்ளிடவும்:

source: If the object was scaled to a smaller or larger size then provide the scale factor that was used when slicing the object:
ta: பொருள் ஒரு சிறிய அல்லது பெரிய அளவிற்கு அளவிடப்பட்டால், பொருளை வெட்டும்போது பயன்படுத்தப்பட்ட அளவிலான காரணியை வழங்கவும்:

source: (A scale value of 2.0 would mean the object is twice its original size, 0.5 would be half its original size.)
ta: (2.0 இன் அளவிலான மதிப்பு பொருள் அதன் அசல் அளவு இரு மடங்கு, 0.5 அதன் அசல் அளவில் பாதியாக இருக்கும் என்று பொருள்.)

source: Finally, perform the enhanced delta calibration by running:
ta: இறுதியாக, இயங்குவதன் மூலம் மேம்படுத்தப்பட்ட டெல்டா அளவுத்திருத்தத்தை செய்யுங்கள்:

source: This command can take several minutes to complete. After completion it will calculate updated delta parameters (delta radius, tower angles, endstop positions, and arm lengths). Use the SAVE_CONFIG command to save and apply the settings:
ta: இந்த கட்டளை முடிக்க பல நிமிடங்கள் ஆகலாம். முடிந்ததும் அது புதுப்பிக்கப்பட்ட டெல்டா அளவுருக்களைக் கணக்கிடும் (டெல்டா ஆரம், கோபுர கோணங்கள், எண்ட்ச்டாப் நிலைகள் மற்றும் கை நீளம்). அமைப்புகளைச் சேமிக்கவும் பயன்படுத்தவும் save_config கட்டளையைப் பயன்படுத்தவும்:

source: The SAVE_CONFIG command will save both the updated delta parameters and information from the distance measurements. Future DELTA_CALIBRATE commands will also utilize this distance information. Do not attempt to reenter the raw distance measurements after running SAVE_CONFIG, as this command changes the printer configuration and the raw measurements no longer apply.
ta: SAVE_CONFIG கட்டளை புதுப்பிக்கப்பட்ட டெல்டா அளவுருக்கள் மற்றும் தகவல்கள் இரண்டையும் தூர அளவீடுகளிலிருந்து சேமிக்கும். எதிர்கால டெல்டா_கலிப்ரேட் கட்டளைகளும் இந்த தொலைதூர தகவல்களையும் பயன்படுத்தும். Save_config ஐ இயக்கிய பின் மூல தூர அளவீடுகளை மீண்டும் சேர்க்க முயற்சிக்காதீர்கள், ஏனெனில் இந்த கட்டளை அச்சுப்பொறி உள்ளமைவை மாற்றுகிறது மற்றும் மூல அளவீடுகள் இனி பொருந்தாது.

source: Additional notes
ta: கூடுதல் குறிப்புகள்

source: If the delta printer has good dimensional accuracy then the distance between any two pillars should be around 74mm and the width of every pillar should be around 9mm. (Specifically, the goal is for the distance between any two pillars minus the width of one of the pillars to be exactly 65mm.) Should there be a dimensional inaccuracy in the part then the DELTA_ANALYZE routine will calculate new delta parameters using both the distance measurements and the previous height measurements from the last DELTA_CALIBRATE command.
ta: டெல்டா அச்சுப்பொறிக்கு நல்ல பரிமாண துல்லியம் இருந்தால், எந்த இரண்டு தூண்களுக்கும் இடையிலான தூரம் 74 மிமீ இருக்க வேண்டும், ஒவ்வொரு தூணின் அகலமும் 9 மி.மீ. . மற்றும் கடைசி டெல்டா_கலிப்ரேட் கட்டளையிலிருந்து முந்தைய உயர அளவீடுகள்.

source: DELTA_ANALYZE may produce delta parameters that are surprising. For example, it may suggest arm lengths that do not match the printer's actual arm lengths. Despite this, testing has shown that DELTA_ANALYZE often produces superior results. It is believed that the calculated delta parameters are able to account for slight errors elsewhere in the hardware. For example, small differences in arm length may result in a tilt to the effector and some of that tilt may be accounted for by adjusting the arm length parameters.
ta: டெல்டா_அனலைச் ஆச்சரியமான டெல்டா அளவுருக்களை உருவாக்கக்கூடும். எடுத்துக்காட்டாக, அச்சுப்பொறியின் உண்மையான கை நீளங்களுடன் பொருந்தாத கை நீளங்களை இது பரிந்துரைக்கலாம். இதுபோன்ற போதிலும், டெல்டா_அனலைச் பெரும்பாலும் சிறந்த முடிவுகளைத் தருகிறது என்பதை சோதனை காட்டுகிறது. கணக்கிடப்பட்ட டெல்டா அளவுருக்கள் வன்பொருளில் வேறு எங்கும் சிறிய பிழைகள் காரணமாக இருக்க முடியும் என்று நம்பப்படுகிறது. எடுத்துக்காட்டாக, கை நீளத்தில் உள்ள சிறிய வேறுபாடுகள் செயல்திறனுக்கு சாய்வை ஏற்படுத்தக்கூடும், மேலும் அந்த சில சாய்வில் கை நீள அளவுருக்களை சரிசெய்வதன் மூலம் கணக்கிடப்படலாம்.

source: Using Bed Mesh on a Delta
ta: ஒரு டெல்டாவில் படுக்கை கண்ணி பயன்படுத்துதல்

source: It is possible to use [bed mesh](Bed_Mesh.md) on a delta. However, it is important to obtain good delta calibration prior to enabling a bed mesh. Running bed mesh with poor delta calibration will result in confusing and poor results.
ta: டெல்டாவில் [படுக்கை கண்ணி] (BED_MESH.MD) பயன்படுத்த முடியும். இருப்பினும், படுக்கை கண்ணி இயக்குவதற்கு முன்பு நல்ல டெல்டா அளவுத்திருத்தத்தைப் பெறுவது முதன்மை. மோசமான டெல்டா அளவுத்திருத்தத்துடன் படுக்கை கண்ணி ஓடுவது குழப்பமான மற்றும் மோசமான முடிவுகளை ஏற்படுத்தும்.

source: Note that performing delta calibration will invalidate any previously obtained bed mesh. After performing a new delta calibration be sure to rerun BED_MESH_CALIBRATE.
ta: டெல்டா அளவுத்திருத்தத்தை நிகழ்த்துவது முன்னர் பெறப்பட்ட படுக்கை கண்ணி என்ற செல்லாது என்பதை நினைவில் கொள்க. புதிய டெல்டா அளவுத்திருத்தத்தை செய்த பிறகு, BED_MESH_CALIBRATE ஐ மீண்டும் இயக்கவும்.

source: G28 DELTA_CALIBRATE METHOD=manual
ta: ஐயா 28 டெல்டா_கலிப்ரேட் முறை = கையேடு

source: DELTA_ANALYZE OUTER_DISTS=<a_to_far_c>,<far_c_to_b>,<b_to_far_a>,<far_a_to_c>,<c_to_far_b>,<far_b_to_a>
ta: Delta_analize outer_dists = <a_to_far_c>, <far_c_to_b>, <b_to_far_a>, <far_a_to_c>, <c_to_far_b>, <far_b_to_a>

source: DELTA_ANALYZE SCALE=1.0
ta: டெல்டா_அனாலிச் அளவு = 1.0

source: DELTA_ANALYZE CALIBRATE=extended
ta: Delta_analyze அளவீடு = விரிவாக்கப்பட்டது

source: Delta calibration
ta: டெல்டா அளவுத்திருத்தம்

source: Prior to running an enhanced delta calibration one must run the basic delta calibration (via the DELTA_CALIBRATE command) and save the results (via the SAVE_CONFIG command). Make sure there hasn't been any notable change to the printer configuration nor hardware since last performing a basic delta calibration (if unsure, rerun the [basic delta calibration](#basic-delta-calibration), including SAVE_CONFIG, just prior to printing the test object described below.)
ta: மேம்பட்ட டெல்டா அளவுத்திருத்தத்தை இயக்குவதற்கு முன்பு ஒருவர் அடிப்படை டெல்டா அளவுத்திருத்தத்தை (டெல்டா_கலிப்ரேட் கட்டளை வழியாக) இயக்க வேண்டும் மற்றும் முடிவுகளைச் சேமிக்க வேண்டும் (Save_config கட்டளை வழியாக). கடைசியாக ஒரு அடிப்படை டெல்டா அளவுத்திருத்தத்தை நிகழ்த்தியதிலிருந்து அச்சுப்பொறி உள்ளமைவு அல்லது வன்பொருளில் குறிப்பிடத்தக்க மாற்றங்கள் எதுவும் இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் (தெரியாவிட்டால், [அடிப்படை டெல்டா அளவுத்திருத்தம்] (#அடிப்படை-டெல்டா-அளவுத்திருத்தத்தை) மீண்டும் இயக்கவும் கீழே விவரிக்கப்பட்டுள்ள சோதனை பொருள்.)
