Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Eddy_Probe.po
Languages: bg, hu, ru, ta, uk

source: Eddy probe manufacturers may offer a stock drift calibration that can be manually added to `drift_calibration` option of the `[probe_eddy_current]` section. If they do not, or if the stock calibration does not perform well on your system, the `temperature_probe` module offers a manual calibration procedure via the `TEMPERATURE_PROBE_CALIBRATE` gcode command.
bg: Производителите на вихрови сонди могат да предложат стандартна калибрация на дрейфа, която може да се добави ръчно към опцията `drift_calibration` в раздела `[probe_eddy_current]`. Ако това не е така или ако стандартното калибриране не работи добре във вашата система, модулът `temperature_probe` предлага процедура за ръчно калибриране чрез gcode командата `TEMPERATURE_PROBE_CALIBRATE`.
hu: Az örvényszondák gyártói kínálhatnak készleten lévő elhajlás kalibrációt, amelyet manuálisan hozzá lehet adni a `[probe_eddy_current]` szakasz `drift_calibration` opciójához. Ha nem, vagy ha a készletkalibráció nem működik jól a rendszereden, a `temperature_probe` modul a `TEMPERATURE_PROBE_CALIBRATE` G-kód parancs segítségével manuális kalibrálási eljárást kínál.
ru: Производители вихревых датчиков могут предлагать стандартную калибровку дрейфа, которую можно вручную добавить в опцию `drift_calibration` секции `[probe_eddy_current]`. Если они этого не делают, или если стандартная калибровка не дает хороших результатов в вашей системе, модуль `temperature_probe` предлагает процедуру ручной калибровки с помощью gcode-команды `TEMPERATURE_PROBE_CALIBRATE`.
ta: எடி ஆய்வு உற்பத்தியாளர்கள் ஒரு பங்கு சறுக்கல் அளவுத்திருத்தத்தை வழங்கலாம், இது `[probe_eddy_current]` பிரிவின் `சறுக்கல்_காலிபிரேசன்` விருப்பத்தில் கைமுறையாக சேர்க்கப்படலாம். அவை அவ்வாறு செய்யாவிட்டால், அல்லது பங்கு அளவுத்திருத்தம் உங்கள் கணினியில் சிறப்பாக செயல்படவில்லை என்றால், `வெப்பநிலை_பிரோப்` தொகுதி` வெப்பநிலை_பிரோப்_லிபிரேட்` சிகோட் கட்டளை வழியாக ஒரு கையேடு அளவுத்திருத்த நடைமுறையை வழங்குகிறது.
uk: Виробники Едді-пробе можуть запропонувати калібрування запасів, які можна вручну додавати до `drift_calibration` параметр `[probe_eddy_current]`. Якщо вони не є, або якщо калібрування запасів не виконує добре на вашій системі, модуль ` Температура_probe` пропонує процедуру ручного калібрування через `TEMPERATURE_PROBE_CALIBRATE` gcode команди.

source: Prior to performing calibration the user should have an idea of what the maximum attainable temperature probe coil temperature is. This temperature should be used to set the `TARGET` parameter of the `TEMPERATURE_PROBE_CALIBRATE` command. The goal is to calibrate across the widest temperature range possible, thus its desirable to start with the printer cold and finish with the coil at the maximum temperature it can reach.
bg: Преди извършване на калибрирането потребителят трябва да има представа каква е максималната постижима температура на намотката на температурната сонда. Тази температура трябва да се използва за задаване на параметъра `TARGET` на командата `TEMPERATURE_PROBE_CALIBRATE`. Целта е да се калибрира във възможно най-широк температурен диапазон, поради което е желателно да се започне със студен принтер и да се завърши с намотка при максималната температура, която може да достигне.
hu: A kalibrálás elvégzése előtt a felhasználónak tudnia kell, hogy mi a maximálisan elérhető hőmérsékletű szondatekercs hőmérséklete. Ezt a hőmérsékletet kell használni a `TEMPERATURE_PROBE_CALIBRATE` parancs `TARGET` paraméterének beállításához. A cél a lehető legszélesebb hőmérséklet-tartományban történő kalibrálás, ezért ajánlatos, hogy hidegen kezdjük, és a tekercset a maximálisan elérhető hőmérsékleten fejezzük be a kalibrálást.
ru: Перед выполнением калибровки пользователь должен иметь представление о максимально достижимой температуре катушки температурного зонда. Эта температура должна использоваться для установки параметра `TARGET` команды `TEMPERATURE_PROBE_CALIBRATE`. Целью является калибровка в максимально широком диапазоне температур, поэтому желательно начинать калибровку с холодного принтера и заканчивать с катушкой при максимальной температуре, которую она может достичь.
ta: அளவுத்திருத்தத்தை செய்வதற்கு முன், பயனருக்கு அதிகபட்ச அடையக்கூடிய வெப்பநிலை ஆய்வு சுருள் வெப்பநிலை என்ன என்பதைப் பற்றிய ஒரு சிந்தனை இருக்க வேண்டும். இந்த வெப்பநிலை `வெப்பநிலை_பிரோப்_லிபிரேட்` கட்டளையின்` இலக்கு` அளவுருவை அமைக்க பயன்படுத்தப்பட வேண்டும். சாத்தியமான பரந்த வெப்பநிலை வரம்பில் அளவீடு செய்வதே குறிக்கோள், இதனால் அச்சுப்பொறி குளிர்ச்சியுடன் தொடங்கவும், அதை அடையக்கூடிய அதிகபட்ச வெப்பநிலையில் சுருளுடன் முடிக்கவும் விரும்பத்தக்கது.
uk: Перед виконанням калібрування користувач повинен мати уявлення про те, що максимальна інтенсивна температура зондової температури є температура. Ця температура повинна бути використана для встановлення параметра `TARGET` `TEMPERATURE_PROBE_CALIBRATE`. Мета полягає в тому, щоб калібрувати по широкому діапазоні температур, таким чином, бажано починати з принтера холодом і закінчуючи котушкою при максимальній температурі вона може досягати.

source: Once a `[temperature_probe]` is configured, the following steps may be taken to perform thermal drift calibration:
bg: След като се конфигурира `[температурна сонда]`, могат да се предприемат следните стъпки за извършване на калибриране на температурния дрейф:
hu: Miután a `[temperature_probe]`-t konfiguráltuk, a következő lépésekkel végezhető el a termikus elhajlás kalibrálás:
ru: После настройки `[temperature_probe]` можно выполнить следующие шаги для калибровки теплового дрейфа:
ta: `[வெப்பநிலை_பிரோப்]` கட்டமைக்கப்பட்டவுடன், வெப்ப சறுக்கல் அளவுத்திருத்தத்தை செய்ய பின்வரும் படிகள் எடுக்கப்படலாம்:
uk: Після того, як налаштовується `[температурний_probe]`, можна приймати наступні кроки для виконання термообробки:

source: The probe must be calibrated using `PROBE_EDDY_CURRENT_CALIBRATE` when a `[temperature_probe]` is configured and linked. This captures the temperature during calibration which is necessary to perform thermal drift compensation.
bg: Сондата трябва да се калибрира, като се използва `PROBE_EDDY_CURRENT_CALIBRATE`, когато се конфигурира и свърже `[temperature_probe]`. По този начин се улавя температурата по време на калибрирането, което е необходимо за извършване на компенсация на температурния дрейф.
hu: A szondát a `PROBE_EDDY_CURRENT_CALIBRATE` használatával kell kalibrálni, amikor a `[temperature_probe]`-t konfiguráljuk és összekapcsoljuk. Ez rögzíti a hőmérsékletet a kalibrálás során, ami a termikus elhajlás kompenzáció elvégzéséhez szükséges.
ru: Датчик должен быть откалиброван с помощью `PROBE_EDDY_CURRENT_CALIBRATE`, когда настроен и связан `[temperature_probe]`. При этом фиксируется температура во время калибровки, что необходимо для компенсации теплового дрейфа.
ta: ஒரு `[வெப்பநிலை_பிரோப்]` கட்டமைக்கப்பட்டு இணைக்கப்படும்போது `probe_eddy_current_calibrate` ஐப் பயன்படுத்தி ஆய்வு அளவீடு செய்யப்பட வேண்டும். இது வெப்ப சறுக்கல் இழப்பீடு செய்ய தேவையான அளவுத்திருத்தத்தின் போது வெப்பநிலையைப் பிடிக்கிறது.
uk: Ви повинні бути калібровані за допомогою ` PROBE_EDDY_CURRENT_CALIBRATE` при налаштуванні та пов'язаному настройку `. Це захоплює температуру під час калібрування, яка необхідна для виконання теплової компенсації.

source: Make sure the nozzle is free of debris and filament.
bg: Уверете се, че дюзата е свободна от замърсявания и нишки.
hu: Győződj meg róla, hogy a fúvóka mentes a törmeléktől és a szálaktól.
ru: Убедитесь, что в сопле нет мусора и нити.
ta: முனை குப்பைகள் மற்றும் இழை இல்லாதது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Переконайтеся, що сопла є безкоштовним від сміття і ниток.

source: The bed, nozzle, and probe coil should be cold prior to calibration.
bg: Преди калибрирането леглото, дюзата и намотката на сондата трябва да са студени.
hu: Az ágynak, a fúvókának és a szondatekercsnek hidegnek kell lennie a kalibrálás előtt.
ru: Перед калибровкой станина, сопло и катушка зонда должны быть холодными.
ta: அளவுத்திருத்தத்திற்கு முன் படுக்கை, முனை மற்றும் ஆய்வு சுருள் குளிர்ச்சியாக இருக்க வேண்டும்.
uk: Ліжко, насадка, і пробіжна котушка повинна бути холодною до калібрування.

source: The following steps are required if the `calibration_position`, `calibration_extruder_temp`, and `extruder_heating_z` options in `[temperature_probe]` are **NOT** configured:
bg: Следващите стъпки са необходими, ако опциите `calibration_position`, `calibration_extruder_temp` и `extruder_heating_z` в `[temperature_probe]` не са конфигурирани:
hu: A következő lépésekre akkor van szükség, ha a `[temperature_probe]`-ban a `calibration_position`, `calibration_extruder_temp` és `extruder_heating_z` opciók **NINCSENEK** beállítva:
ru: Следующие шаги необходимы, если опции `calibration_position`, `calibration_extruder_temp` и `extruder_heating_z` в `[temperature_probe]` не настроены **НЕТ**:
ta: `அளவுத்திருத்த_போசிசன்`,` அளவுத்திருத்த_எக்ச்ட்ரூட்_டெம்ப்`, மற்றும் `[வெப்பநிலை_பிரோப்]` இல் `எக்ச்ட்ரூடர்_ஈடிங்_இச்` விருப்பங்கள் இருந்தால் பின்வரும் படிகள் தேவைப்படுகின்றன ** ** கட்டமைக்கப்பட்டவை:
uk: Наступні кроки потрібні, якщо `calibration_position`, `calibration_extruder_temp`, і `extruder_heating_z` параметри `[температур_probe]` **NOT** налаштовані:

source: Move the tool to the center of the bed. Z should be 30mm+ above the bed.
bg: Преместете инструмента в центъра на леглото. Z трябва да е над 30 мм над леглото.
hu: Vidd a nyomtatófejet az ágy közepére. A Z-nek az ágy felett 30 mm-nél nagyobb magasságban kell lennie.
ru: Переместите инструмент в центр станины. Z должна быть на 30 мм выше станины.
ta: கருவியை படுக்கையின் மையத்திற்கு நகர்த்தவும். சட் படுக்கைக்கு மேலே 30 மிமீ+ இருக்க வேண்டும்.
uk: Перемістити засіб до центру ліжка. З повинно бути 30мм+ над ліжком.

source: Heat the extruder to a temperature above the maximum safe bed temperature. 150-170C should be sufficient for most configurations. The purpose of heating the extruder is to avoid nozzle expansion during calibration.
bg: Загрейте екструдера до температура над максималната безопасна температура на леглото. 150-170С трябва да са достатъчни за повечето конфигурации. Целта на загряването на екструдера е да се избегне разширяването на дюзата по време на калибрирането.
hu: Fűtsd fel az extrudert a maximális biztonságos ágyhőmérséklet feletti hőmérsékletre. A legtöbb konfigurációhoz 150-170C elegendőnek kell lennie. Az extruder felmelegítésének célja a fúvóka tágulásának elkerülése a kalibrálás során.
ru: Нагрейте экструдер до температуры, превышающей максимальную безопасную температуру слоя. Для большинства конфигураций достаточно 150-170C. Цель нагрева экструдера - избежать расширения сопла во время калибровки.
ta: அதிகபட்ச பாதுகாப்பான படுக்கை வெப்பநிலைக்கு மேலே வெப்பநிலைக்கு எக்ச்ட்ரூடரை சூடாக்கவும். 150-170 சி பெரும்பாலான உள்ளமைவுகளுக்கு போதுமானதாக இருக்க வேண்டும். எக்ச்ட்ரூடரை சூடாக்குவதன் நோக்கம் அளவுத்திருத்தத்தின் போது முனை விரிவாக்கத்தைத் தவிர்ப்பது.
uk: Підігрів екструдера до температури над максимальною кімнатною температурою. 150-170К повинен бути достатнім для більшості конфігурацій. Мета обігріву екструдера полягає в тому, щоб уникнути розширення насадок під час калібрування.

source: When the extruder temperature has settled, move the Z axis down to about 1mm above the bed.
bg: Когато температурата на екструдера се успокои, преместете оста Z надолу до около 1 mm над леглото.
hu: Amikor az extruder hőmérséklete beállt, mozgasd a Z tengelyt körülbelül 1 mm-rel az ágy fölé.
ru: Когда температура экструдера установится, переместите ось Z вниз на высоту около 1 мм над станиной.
ta: எக்ச்ட்ரூடர் வெப்பநிலை குடியேறியதும், சட் அச்சை படுக்கைக்கு மேலே 1 மிமீ வரை நகர்த்தவும்.
uk: Коли температура екструдера влаштована, перемістіть осі Z до близько 1 мм над ліжком.

source: Start drift calibration. If the probe's name is `my_probe` and the maximum probe temperature we can achieve is 80C, the appropriate gcode command is `TEMPERATURE_PROBE_CALIBRATE PROBE=my_probe TARGET=80`. If configured, the tool will move to the X,Y coordinate specified by the `calibration_position` and the Z value specified by `extruder_heating_z`. After heating the extruder to the specified temperature the tool will move to the Z value specified by the`calibration_position`.
bg: Започнете калибриране на дрейфа. Ако името на сондата е `my_probe` и максималната температура на сондата, която можем да постигнем, е 80C, подходящата gcode команда е `TEMPERATURE_PROBE_CALIBRATE PROBE=my_probe TARGET=80`. Ако е конфигуриран, инструментът ще се придвижи до координатите X,Y, зададени от `calibration_position`, и стойността Z, зададена от `extruder_heating_z`. След нагряване на екструдера до зададената температура инструментът ще се придвижи до стойността Z, зададена от `calibration_position`.
hu: Elhajlás kalibrálás megkezdése. Ha a szonda neve `my_probe` és a maximálisan elérhető szondahőmérséklet 80C, a megfelelő G-kód parancs a `TEMPERATURE_PROBE_CALIBRATE PROBE=my_probe TARGET=80`. Ha beállítjuk, a nyomtatófejet a `calibration_position` által megadott X-Y koordinátára, akkor az `extruder_heating_z` által megadott Z értékre fog mozogni. Miután az extruder a megadott hőmérsékletre melegedett, a szerszám a `calibration_position ` által megadott Z értékre mozog.
ru: Запустите калибровку дрейфа. Если имя зонда `my_probe` и максимальная температура зонда, которую мы можем достичь, равна 80C, то соответствующая команда gcode будет `TEMPERATURE_PROBE_CALIBRATE PROBE=my_probe TARGET=80`. Если инструмент настроен, он переместится в координаты X,Y, указанные в `calibration_position`, и в значение Z, указанное в `extruder_heating_z`. После нагрева экструдера до заданной температуры инструмент переместится к значению Z, указанному в `calibration_position`.
ta: சறுக்கல் அளவுத்திருத்தத்தைத் தொடங்குங்கள். ஆய்வின் பெயர் `my_probe` மற்றும் நாம் அடையக்கூடிய அதிகபட்ச ஆய்வு வெப்பநிலை 80c என்றால், பொருத்தமான GCODE கட்டளை` வெப்பநிலை_பிரோப்_கலிப்ரேட் ஆய்வு = my_probe target = 80` ஆகும். கட்டமைக்கப்பட்டால், கருவி ஃச், ஒய் ஒருங்கிணைப்பு `அளவுத்திருத்த_போசிசன்` மற்றும்` எக்ச்ட்ரூடர்_ஈடிங்_இசட்` ஆல் குறிப்பிடப்பட்ட சட் மதிப்பு ஆகியவற்றிற்கு நகரும். குறிப்பிட்ட வெப்பநிலைக்கு எக்ச்ட்ரூடரை சூடாக்கிய பிறகு, கருவி `காலிபிரேசன்_போசிசன்` ஆல் குறிப்பிடப்பட்ட சட் மதிப்புக்கு நகரும்.
uk: Почати калібрування дрейфу. Якщо ім'я пробе `my_probe` і максимальна температура проби ми можемо досягати 80C, відповідна команда gcode `TEMPERATURE_PROBE_CALIBRATE PROBE=my_probe TARGET=80`. При налаштуванні інструмент перейде до координат X,Y, зазначеного `calibration_position` і значення Z, зазначеного `extruder_heating_z`. Після нагріву екструдера до вказаної температури інструмент перейде до значення Z, зазначеного `calibration_position`.

source: The procedure will request a manual probe. Perform the manual probe with the paper test and `ACCEPT`. The calibration procedure will take the first set of samples with the probe then park the probe in the heating position.
bg: Процедурата ще поиска ръчна сонда. Извършете ръчната сонда с теста на хартията и `АКСЕПТ`. Процедурата за калибриране ще направи първия набор от проби със сондата, след което ще паркира сондата в позиция за нагряване.
hu: Az eljárás kézi szondát fog kérni. Végezd el a kézi mérést a papírteszttel és az `ACCEPT` gombbal. A kalibrálási eljárás a szondával elvégzi az első mintasorozatot, majd a szondát a fűtési pozícióban leállítja.
ru: Процедура запросит ручной тест. Выполните ручной зонд с бумажным тестом и `ПРИНЯТЬ`. Процедура калибровки возьмет первый набор проб с помощью зонда, а затем припаркует зонд в положении нагрева.
ta: செயல்முறை ஒரு கையேடு ஆய்வைக் கோரும். காகித சோதனையுடன் கையேடு ஆய்வு செய்து `ஏற்றுக்கொள்`. அளவுத்திருத்த செயல்முறை முதல் மாதிரிகளை ஆய்வுடன் எடுத்து, பின்னர் வெப்பமூட்டும் நிலையில் ஆய்வை நிறுத்தும்.
uk: Процедуру буде вимагати ручного зонду. Виконайте ручний зонд з паперовим тестом та `ACCEPT`. Процедуру калібрування візьмуть перший набір зразків зондом, потім паркують зону в положенні опалення.

source: If the `calibration_bed_temp` is **NOT** configured turn on the bed heat to the maximum safe temperature. Otherwise this step will be performed automatically.
bg: Ако параметърът `calibration_bed_temp` не е конфигуриран, включете отоплението на леглото до максималната безопасна температура. В противен случай тази стъпка ще бъде извършена автоматично.
hu: Ha a `calibration_bed_temp` értéke **NINCSEN** beállítva, kapcsold be az ágy fűtését a maximális biztonságos hőmérsékletre. Ellenkező esetben ez a lépés automatikusan végrehajtásra kerül.
ru: Если параметр `calibration_bed_temp` **НЕ** настроен, включите подогрев кровати до максимальной безопасной температуры. В противном случае этот шаг будет выполнен автоматически.
ta: `அளவுத்திருத்த_பெட்_டெம்ப்` என்றால் ** ** கட்டமைக்கப்பட்ட கட்டமைக்கப்பட்டிருந்தால், படுக்கை வெப்பத்தை அதிகபட்ச பாதுகாப்பான வெப்பநிலைக்கு இயக்கவும். இல்லையெனில் இந்த படி தானாக செய்யப்படும்.
uk: Якщо `calibration_bed_temp` is **NOT** налаштовується поворот на вогні ліжка до максимальної безпечної температури. В іншому випадку цей крок буде виконуватися автоматично.

source: By default the calibration procedure will request a manual probe every 2C between samples until the `TARGET` is reached. The temperature delta between samples can be customized by setting the `STEP` parameter in `TEMPERATURE_PROBE_CALIBRATE`. Care should be taken when setting a custom `STEP` value, a value too high may request too few samples resulting in a poor calibration.
bg: По подразбиране процедурата за калибриране изисква ръчна сонда на всеки 2С между пробите до достигане на `Целевата стойност`. Температурната разлика между пробите може да се персонализира чрез задаване на параметъра `STEP` в `TEMPERATURE_PROBE_CALIBRATE`. Трябва да се внимава, когато се задава персонализирана стойност на `STEP`, тъй като твърде висока стойност може да изисква твърде малко проби, което да доведе до лошо калибриране.
hu: Alapértelmezés szerint a kalibrációs eljárás a minták között 2C-nként kézi szondát kér, amíg a `TARGET` el nem éri a célt. A minták közötti hőmérséklet-különbség testre szabható a `TEMPERATURE_PROBE_CALIBRATE` paraméter `STEP` beállításával. Az egyéni `STEP` érték beállításakor óvatosan kell eljárni, a túl magas érték túl kevés mintát kérhet, ami rossz kalibrációt eredményezhet.
ru: По умолчанию процедура калибровки будет запрашивать ручной зонд каждые 2C между образцами, пока не будет достигнуто значение `TARGET`. Дельта температур между пробами может быть настроена путем установки параметра `STEP` в `TEMPERATURE_PROBE_CALIBRATE`. Следует быть осторожным при установке пользовательского значения `STEP`, слишком высокое значение может запросить слишком мало образцов, что приведет к плохой калибровке.
ta: இயல்பாகவே அளவுத்திருத்த செயல்முறை `இலக்கு` அடையும் வரை மாதிரிகளுக்கு இடையில் ஒவ்வொரு 2 சி கையேடு ஆய்வைக் கோரும். `STEP` அளவுருவை` வெப்பநிலை_பிரோப்_கலிபிரேட்` அமைப்பதன் மூலம் மாதிரிகளுக்கு இடையிலான வெப்பநிலை டெல்டாவைத் தனிப்பயனாக்கலாம். தனிப்பயன் `படி` மதிப்பை அமைக்கும் போது கவனமாக இருக்க வேண்டும், மிக உயர்ந்த மதிப்பு மிகக் குறைவான மாதிரிகளைக் கோரலாம், இதன் விளைவாக மோசமான அளவுத்திருத்தம் ஏற்படுகிறது.
uk: За замовчуванням процедура калібрування буде вимагати ручного зонду кожні 2C між зразками до досягнення `TARGET`. Температурний дельта між зразками можна налаштувати за допомогою параметра `STEP` `TEMPERATURE_PROBE_CALIBRATE`. Порада повинна бути прийнята при налаштуванні на замовлення ` STP` значення, значення занадто висока може вимагати занадто кілька зразків, що призводить до поганого калібрування.

source: The following additional gcode commands are available during drift calibration:
bg: Следните допълнителни gcode команди са достъпни по време на калибрирането на дрейфа:
hu: Az elhajlás kalibrálás során a következő további G-kód parancsok állnak rendelkezésre:
ru: Во время калибровки дрейфа доступны следующие дополнительные команды gcode:
ta: சறுக்கல் அளவுத்திருத்தத்தின் போது பின்வரும் கூடுதல் GCODE கட்டளைகள் கிடைக்கின்றன:
uk: Для калібрування дрифт доступні наступні додаткові команди gcode:

source: `TEMPERATURE_PROBE_NEXT` may be used to force a new sample before the step delta has been reached.
bg: `TEMPERATURE_PROBE_NEXT` може да се използва за форсиране на нова проба, преди да е достигната делтата на стъпката.
hu: A `TEMPERATURE_PROBE_NEXT` használható egy új minta kényszerítésére a lépés delta elérése előtt.
ru: `TEMPERATURE_PROBE_NEXT` может использоваться для принудительного взятия нового образца до достижения дельты шага.
ta: டெல்டாவை அடைவதற்கு முன்பு புதிய மாதிரியை கட்டாயப்படுத்த `வெப்பநிலை_பிரோப்_நெக்ச்ட்` பயன்படுத்தப்படலாம்.
uk: `TEMPERATURE_PROBE_NEXT` може використовуватися для посилення нового зразка перед початком дельти.

source: `TEMPERATURE_PROBE_COMPLETE` may be used to complete calibration before the `TARGET` has been reached.
bg: `TEMPERATURE_PROBE_COMPLETE` може да се използва за завършване на калибрирането преди достигане на `TARGET`.
hu: A `TEMPERATURE_PROBE_COMPLETE` használható a kalibrálás befejezéséhez a `TARGET` elérése előtt.
ru: `TEMPERATURE_PROBE_COMPLETE` может использоваться для завершения калибровки до достижения `TARGET`.
ta: `இலக்கு` அடைவதற்கு முன்னர் அளவுத்திருத்தத்தை முடிக்க` வெப்பநிலை_பிரோப்_ கமோப்லெட்` பயன்படுத்தப்படலாம்.
uk: `TEMPERATURE_PROBE_COMPLETE` може використовуватися для повного калібрування до `TARGET`.

source: `ABORT` may be used to end calibration and discard results.
bg: `ABORT` може да се използва за прекратяване на калибрирането и изхвърляне на резултатите.
hu: Az `ABORT` a kalibrálás befejezéséhez és az eredmények elvetéséhez használható.
ta: `கருக்கலைப்பு` அளவுத்திருத்தத்தை முடிவுக்குக் கொண்டுவரவும் முடிவுகளை நிராகரிக்கவும் பயன்படுத்தப்படலாம்.
uk: `ABORT` може бути використана для кінцевого калібрування та результатів віддачі.

source: When calibration is finished use `SAVE_CONFIG` to store the drift calibration.
bg: След приключване на калибрирането използвайте `SAVE_CONFIG`, за да съхраните калибрирането на дрейфа.
hu: Ha a kalibrálás befejeződött, használd a `SAVE_CONFIG` funkciót az elhajlás kalibrálás tárolásához.
ta: அளவுத்திருத்தம் முடிந்ததும் சறுக்கல் அளவுத்திருத்தத்தை சேமிக்க `save_config` ஐப் பயன்படுத்தவும்.
uk: Після закінчення калібрування використовується `SAVE_CONFIG` для зберігання калібрування дрифту.

source: As one may conclude, the calibration process outlined above is more challenging and time consuming than most other procedures. It may require practice and several attempts to achieve an optimal calibration.
bg: Както може да се заключи, процесът на калибриране, описан по-горе, е по-труден и отнема повече време, отколкото повечето други процедури. Той може да изисква практика и няколко опита за постигане на оптимално калибриране.
hu: Amint arra következtethetünk, a fent vázolt kalibrációs folyamat nagyobb kihívást jelent és időigényesebb, mint a legtöbb más eljárás. Az optimális kalibrálás eléréséhez gyakorlatra és többszöri próbálkozásra lehet szükség.
ta: ஒருவர் முடிவுக்கு வருவது போல், மேலே குறிப்பிட்டுள்ள அளவுத்திருத்த செயல்முறை மற்ற நடைமுறைகளை விட மிகவும் சவாலானது மற்றும் நேரத்தை எடுத்துக்கொள்வது. இதற்கு பயிற்சி மற்றும் உகந்த அளவுத்திருத்தத்தை அடைய பல முயற்சிகள் தேவைப்படலாம்.
uk: Як можна зробити висновок, процес калібрування окреслено вище, є більш складним і трудомістким, ніж більшість інших процедур. Для досягнення оптимального калібрування може знадобитися практика та декілька спроб.

source: [probe_eddy_current my_probe] # eddy probe configuration... [temperature_probe my_probe] # temperature probe configuration...
ru: [probe_eddy_current my_probe] # конфигурация вихревого зонда... [temperature_probe my_probe] # конфигурация температурного зонда...
