Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Eddy_Probe.po
Languages: bg, hu, ru, ta, uk

source: Eddy Current Inductive probe
bg: Вихров ток Индуктивна сонда
hu: Örvényáramú induktív szonda
ru: Индуктивный датчик вихревых токов
ta: எடி தற்போதைய தூண்டல் ஆய்வு
uk: Eddy Поточний індуктивний зонд

source: This document describes how to use an [eddy current](https://en.wikipedia.org/wiki/Eddy_current) inductive probe in Klipper.
bg: Този документ описва как да използвате индуктивна сонда [вихрови токове](https://en.wikipedia.org/wiki/Eddy_current) в Klipper.
hu: Ez a dokumentum az [örvényáramú](https://en.wikipedia.org/wiki/Eddy_current) induktív szonda Klipperben történő használatát írja le.
ru: В этом документе описывается использование индуктивного датчика [вихревого тока](https://en.wikipedia.org/wiki/Eddy_current) в Klipper.
ta: கிளிப்பரில் தூண்டல் ஆய்வு ஒரு [எடி தற்போதைய] (https://en.wikipedia.org/wiki/eddy_current) ஐ எவ்வாறு பயன்படுத்துவது என்பதை இந்த ஆவணம் விவரிக்கிறது.
uk: Цей документ описує, як використовувати [видимий струм](https://en.wikipedia.org/wiki/Eddy_current) індуктивний зонд в Klipper.

source: Currently, an eddy current probe can not be used for Z homing. The sensor can only be used for Z probing.
bg: Понастоящем сондата за вихрови токове не може да се използва за Z-насочване. Сензорът може да се използва само за Z-сондиране.
hu: Jelenleg az örvényáramú szonda nem használható Z-kezdőpont felvételre. Az érzékelő csak Z-szondázásra használható.
ru: В настоящее время вихретоковый датчик не может быть использован для Z-наведения. Датчик можно использовать только для Z-зондирования.
ta: தற்போது, ஒரு எடி தற்போதைய ஆய்வை சட் ஓமிங்கிற்கு பயன்படுத்த முடியாது. சென்சார் சட் ஆய்வுக்கு மட்டுமே பயன்படுத்தப்படலாம்.
uk: В даний час eddy поточний зонд не може використовуватися для Z-підсмоктування. Датчик може використовуватися тільки для зондування Z.

source: Start by declaring a [probe_eddy_current config section](Config_Reference.md#probe_eddy_current) in the printer.cfg file. It is recommended to set the `z_offset` to 0.5mm. It is typical for the sensor to require an `x_offset` and `y_offset`. If these values are not known, one should estimate the values during initial calibration.
bg: Започнете, като декларирате [probe_eddy_current config section](Config_Reference.md#probe_eddy_current) във файла printer.cfg. Препоръчително е да зададете `z_offset` на 0,5 mm. Обикновено сензорът се нуждае от `x_offset` и `y_offset`. Ако тези стойности не са известни, те трябва да се оценят по време на първоначалното калибриране.
hu: Kezdd a [probe_eddy_current konfigurációs szakasz](Config_Reference.md#probe_eddy_current) deklarálásával a printer.cfg fájlban. A `z_offset` értéket ajánlott 0,5 mm-re állítani. Jellemző, hogy az érzékelőnek szüksége van egy `x_offset` és egy `y_offset` értékre. Ha ezek az értékek nem ismertek, akkor a kezdeti kalibrálás során becsléssel adjuk meg az értékeket.
ru: Начните с объявления секции конфигурации [probe_eddy_current](Config_Reference.md#probe_eddy_current) в файле printer.cfg. Рекомендуется установить `z_offset` на 0,5 мм. Обычно для датчика требуется `x_offset` и `y_offset`. Если эти значения неизвестны, их следует оценить при первоначальной калибровке.
ta: அச்சுப்பொறி. Cfg கோப்பில் [probe_eddy_current கட்டமைப்பு பிரிவு] (config_reference.md#probe_eddy_current) அறிவிப்பதன் மூலம் தொடங்கவும். `Z_offset` ஐ 0.5 மிமீ என அமைக்க பரிந்துரைக்கப்படுகிறது. சென்சார் ஒரு `x_offset` மற்றும்` y_offset` தேவைப்படுவது பொதுவானது. இந்த மதிப்புகள் தெரியவில்லை என்றால், ஆரம்ப அளவுத்திருத்தத்தின் போது மதிப்புகளை ஒருவர் மதிப்பிட வேண்டும்.
uk: Початок, декларування [probe_eddy_current_config section](Config_Reference.md#probe_eddy_current) в файлі принтера.cfg. Рекомендується встановити `z_offset` до 0.5mm. Для датчика потрібно `x_offset` і `y_offset`. Якщо ці значення не відомі, слід оцінити значення при початковому калібруванні.

source: The first step in calibration is to determine the appropriate DRIVE_CURRENT for the sensor. Home the printer and navigate the toolhead so that the sensor is near the center of the bed and is about 20mm above the bed. Then issue an `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<config_name>` command. For example, if the config section was named `[probe_eddy_current my_eddy_probe]` then one would run `LDC_CALIBRATE_DRIVE_CURRENT CHIP=my_eddy_probe`. This command should complete in a few seconds. After it completes, issue a `SAVE_CONFIG` command to save the results to the printer.cfg and restart.
bg: Първата стъпка при калибрирането е да се определи подходящият DRIVE_CURRENT за сензора. Включете принтера в изходно положение и насочете главата на инструмента така, че сензорът да е близо до центъра на леглото и да е на около 20 мм над него. След това издайте командата `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<config_name>`. Например, ако разделът на конфигурацията е наречен `[probe_eddy_current my_eddy_probe]`, тогава трябва да се изпълни `LDC_CALIBRATE_DRIVE_CURRENT CHIP=my_eddy_probe`. Тази команда трябва да приключи за няколко секунди. След като завърши, издайте командата `SAVE_CONFIG`, за да запазите резултатите в printer.cfg, и рестартирайте.
hu: A kalibrálás első lépése az érzékelő megfelelő DRIVE_CURRENT értékének meghatározása. Állítsd be a nyomtatót, és navigáld a nyomtatófejet úgy, hogy az érzékelő az ágy közepéhez közel, az ágy felett kb. 20 mm-re legyen. Ezután add ki az `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<config_name>` parancsot. Ha például a konfigurációs szakasz neve `[probe_eddy_current my_eddy_probe]`, akkor az `LDC_CALIBRATE_DRIVE_CURRENT CHIP=my_eddy_probe` parancsot kell futtatni. Ez a parancs néhány másodperc alatt befejeződik. Miután befejeződött, adj ki egy `SAVE_CONFIG` parancsot az eredmények mentéséhez a printer.cfg fájlba, és indítsd újra.
ru: Первым шагом в калибровке является определение подходящего DRIVE_CURRENT для датчика. Включите принтер и установите инструментальную головку так, чтобы датчик находился около центра станины и был примерно на 20 мм выше нее. Затем выполните команду `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<имя_конфигурации>`. Например, если раздел конфигурации был назван `[probe_eddy_current my_eddy_probe]`, то следует выполнить команду `LDC_CALIBRATE_DRIVE_CURRENT CHIP=my_eddy_probe`. Эта команда должна завершиться через несколько секунд. После ее выполнения выполните команду `SAVE_CONFIG`, чтобы сохранить результаты в файле printer.cfg, и перезагрузитесь.
ta: அளவுத்திருத்தத்தின் முதல் படி சென்சாருக்கு பொருத்தமான டிரைவ்_கரண்ட் தீர்மானிக்க வேண்டும். அச்சுப்பொறியை வைத்து, கருவியின் தலைக்கு செல்லவும், இதனால் சென்சார் படுக்கையின் மையத்திற்கு அருகில் இருக்கும், மேலும் படுக்கைக்கு மேலே 20 மிமீ இருக்கும். பின்னர் ஒரு `LDC_CALIBRATE_DRIVE_CURRENT CHIP = <config_name>` கட்டளை. எடுத்துக்காட்டாக, கட்டமைப்பு பிரிவுக்கு `[probe_eddy_current my_eddy_probe] என்று பெயரிடப்பட்டிருந்தால், ஒருவர்` ldc_calibrate_drive_current chip = my_eddy_probe` ஐ இயக்குவார். இந்த கட்டளை சில நொடிகளில் முடிக்க வேண்டும். அது முடிந்ததும், முடிவுகளை அச்சுப்பொறியில் சேமித்து மறுதொடக்கம் செய்ய `save_config` கட்டளையை வழங்கவும்.
uk: Для визначення відповідного DRIVE_CURRENT для датчика. Головна принтер і навігація інструментальногоголови так, щоб датчик знаходиться біля центру ліжка і становить близько 20мм над ліжком. `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<config_name>` команда. Наприклад, якщо розділ конфігурації був названий `[probe_eddy_current my_eddy_probe]` потім один буде курсувати `LDC_CALIBRATE_DRIVE_CURRENT CHIP=my_eddy_probe`. Ця команда повинна завершитися протягом декількох секунд. Після завершення випуску `SAVE_CONFIG` команди зберегти результати на принтері.cfg і перезавантаження.

source: The second step in calibration is to correlate the sensor readings to the corresponding Z heights. Home the printer and navigate the toolhead so that the nozzle is near the center of the bed. Then run an `PROBE_EDDY_CURRENT_CALIBRATE CHIP=my_eddy_probe` command. Once the tool starts, follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position. The tool will then move the the toolhead so that the sensor is above the point where the nozzle used to be and run a series of movements to correlate the sensor to Z positions. This will take a couple of minutes. After the tool completes, issue a `SAVE_CONFIG` command to save the results to the printer.cfg and restart.
bg: Втората стъпка при калибрирането е да се съпоставят показанията на сензора със съответните височини Z. Включете принтера в изходно положение и настройте главата на инструмента така, че дюзата да е близо до центъра на леглото. След това изпълнете командата `PROBE_EDDY_CURRENT_CALIBRATE CHIP=my_eddy_probe`. След като инструментът се стартира, следвайте стъпките, описани в ["the paper test"](Bed_Level.md#the-paper-test), за да определите действителното разстояние между дюзата и леглото на даденото място. След приключването на тези стъпки може да се приеме позицията. След това инструментът ще премести главата на инструмента, така че сензорът да се намира над точката, където е била дюзата, и ще извърши поредица от движения, за да съпостави сензора с Z позициите. Това ще отнеме няколко минути. След като инструментът завърши, издайте командата `SAVE_CONFIG`, за да запазите резултатите в printer.cfg, и рестартирайте.
hu: A kalibrálás második lépése az érzékelő leolvasásainak és a megfelelő Z magasságoknak a korrelálása. Állítsd be a nyomtatót, és navigáld a nyomtatófejet úgy, hogy a fúvóka az ágy közepéhez közel legyen. Ezután futtass egy `PROBE_EDDY_CURRENT_CALIBRATE CHIP=my_eddy_probe` parancsot. Miután a fej elindult, kövesd a [„a papír teszt”](Bed_Level.md#the-paper-test) pontban leírt lépéseket a fúvóka és az ágy közötti tényleges távolság meghatározásához az adott helyen. Ha ezek a lépések befejeződtek, akkor a pozíciót „ELFOGADHATJUK”. A gép ezután úgy mozgatja a nyomtatófejet, hogy az érzékelő a fúvóka korábbi helye fölé kerüljön, és lefuttat egy sor mozgást, hogy az érzékelőt a Z pozíciókkal korrelálja. Ez néhány percet vesz igénybe. Miután az eszköz befejezte a munkát, adj ki egy `SAVE_CONFIG` parancsot az eredmények mentéséhez a printer.cfg fájlba, és indítsd újra.
ru: Второй шаг калибровки - соотнесение показаний датчиков с соответствующими высотами Z. Включите принтер и установите головку инструмента так, чтобы сопло находилось около центра станины. Затем выполните команду `PROBE_EDDY_CURRENT_CALIBRATE CHIP=my_eddy_probe`. После запуска инструмента выполните действия, описанные в разделе ["Тест на бумаге"](Bed_Level.md#the-paper-test), чтобы определить фактическое расстояние между соплом и станиной в заданном месте. После выполнения этих шагов можно `принять` положение. Затем инструмент переместит инструментальную головку так, чтобы датчик находился над точкой, где раньше находилась насадка, и выполнит серию движений, чтобы соотнести положение датчика с положением Z. Это займет пару минут. После завершения работы инструмента выполните команду `SAVE_CONFIG`, чтобы сохранить результаты в файле printer.cfg, и перезагрузитесь.
ta: அளவுத்திருத்தத்தின் இரண்டாவது படி சென்சார் அளவீடுகளை தொடர்புடைய சட் உயரங்களுடன் தொடர்புபடுத்துவதாகும். வீட்டிற்கு அச்சுப்பொறியில் மற்றும் கருவியை வழிநடத்துங்கள், இதனால் முனை படுக்கையின் மையத்திற்கு அருகில் இருக்கும். பின்னர் `probe_eddy_current_calibrate chip = my_eddy_probe` கட்டளையை இயக்கவும். கருவி தொடங்கியதும், கொடுக்கப்பட்ட இடத்தில் முனை மற்றும் படுக்கைக்கு இடையிலான உண்மையான தூரத்தை தீர்மானிக்க ["காகித சோதனை"] (BED_LEVEL.MD#THE-PATER-TEST) இல் விவரிக்கப்பட்டுள்ள படிகளைப் பின்பற்றவும். அந்த படிகள் முடிந்ததும் ஒருவர் நிலையை ஏற்றுக்கொள்ளலாம். கருவி பின்னர் கருவியை நகர்த்தும், இதனால் சென்சார் முனை இருந்த இடத்திற்கு மேலே இருக்கும், மேலும் சென்சாரை சட் நிலைகளுடன் தொடர்புபடுத்த தொடர்ச்சியான இயக்கங்களை இயக்குகிறது. இதற்கு இரண்டு நிமிடங்கள் எடுக்கும். கருவி முடிந்ததும், முடிவுகளை அச்சுப்பொறியில் சேமித்து மறுதொடக்கம் செய்ய `save_config` கட்டளையை வழங்கவும்.
uk: Другим кроком у калібруванні є співвіднесення показань датчика з відповідними висотами Z. Встановіть принтер і перемістіть інструментальну головку так, щоб сопло було поблизу центру станини. Потім запустіть команду `PROBE_EDDY_CURRENT_CALIBRATE CHIP=my_eddy_probe`. Коли інструмент запуститься, виконайте кроки, описані в ["тест паперу"](Bed_Level.md#the-paper-test), щоб визначити фактичну відстань між соплом і ложем у вказаному місці. Після завершення цих кроків можна «ПРИЙНЯТИ» позицію. Потім інструмент перемістить головку так, щоб датчик знаходився над точкою, де раніше було сопло, і виконає серію рухів, щоб співвіднести датчик із положеннями Z. Це займе кілька хвилин. Після завершення роботи інструменту введіть команду `SAVE_CONFIG`, щоб зберегти результати в printer.cfg і перезапустіть.

source: After initial calibration it is a good idea to verify that the `x_offset` and `y_offset` are accurate. Follow the steps to [calibrate probe x and y offsets](Probe_Calibrate.md#calibrating-probe-x-and-y-offsets). If either the `x_offset` or `y_offset` is modified then be sure to run the `PROBE_EDDY_CURRENT_CALIBRATE` command (as described above) after making the change.
bg: След първоначалното калибриране е добре да проверите дали стойностите на `x_offset` и `y_offset` са точни. Следвайте стъпките за [калибриране на отместванията x и y на сондата](Probe_Calibrate.md#calibrating-probe-x-and-y-offsets). Ако `x_offset` или `y_offset` са променени, не забравяйте да изпълните командата `PROBE_EDDY_CURRENT_CALIBRATE` (както е описано по-горе) след извършване на промяната.
hu: A kezdeti kalibrálás után érdemes ellenőrizni, hogy az `x_offset` és `y_offset` értékek pontosak-e. Kövesd a [szonda X- és Y-eltolásának kalibrálása](Probe_Calibrate.md#calibrating-probe-x-and-y-offsets) lépéseit. Ha az `x_offset` vagy az `y_offset` értéket módosítod, akkor a módosítás után feltétlenül futtasd a `PROBE_EDDY_CURRENT_CALIBRATE` parancsot (a fent leírtak szerint).
ru: После первоначальной калибровки рекомендуется проверить точность значений `x_offset` и `y_offset`. Выполните шаги по [калибровке смещений x и y зонда](Probe_Calibrate.md#calibrating-probe-x-and-y-offsets). Если изменяется `x_offset` или `y_offset`, то после внесения изменений обязательно выполните команду `PROBE_EDDY_CURRENT_CALIBRATE` (как описано выше).
ta: ஆரம்ப அளவுத்திருத்தத்திற்குப் பிறகு, `x_offset` மற்றும்` y_offset` ஆகியோர் துல்லியமானவர்கள் என்பதை சரிபார்க்க இது ஒரு நல்ல யோசனையாகும். [ஆய்வு ஃச் மற்றும் ஒய் ஆஃப்செட்களை அளவீடு செய்வதற்கான படிகளைப் பின்பற்றவும் (probe_calibrate.md#அளவீடு-புரோப்-எக்ச்-அண்ட்-ஒய்-ஆஃப்செட்டுகள்). `X_offset` அல்லது` y_offset` மாற்றியமைக்கப்பட்டால், மாற்றத்தை செய்தபின் `probe_eddy_current_calibrate` கட்டளையை (மேலே விவரிக்கப்பட்டுள்ளபடி) இயக்க மறக்காதீர்கள்.
uk: Після початкового калібрування це хороша ідея, щоб переконатися, що `x_offset` і `y_offset` є точним. Дотримуйтесь кроків до [calibrate probe x і y offsets](Probe_Calibrate.md#calibrating-probe-x-і-offsets). Якщо ви використовуєте `x_offset` або `y_offset`, то обов'язково запустіть `PROBE_EDDY_CURRENT_CALIBRATE` команди (як описано вище) після внесення змін.

source: Once calibration is complete, one may use all the standard Klipper tools that use a Z probe.
bg: След като калибрирането е завършено, можете да използвате всички стандартни инструменти на Klipper, които използват Z-сонда.
hu: A kalibrálás befejezése után a Z-szondát használó összes szabványos Klipper eszköz használható.
ru: После завершения калибровки можно использовать все стандартные инструменты Klipper, в которых применяется Z-зонд.
ta: அளவுத்திருத்தம் முடிந்ததும், சட் ஆய்வைப் பயன்படுத்தும் அனைத்து நிலையான கிளிப்பர் கருவிகளையும் ஒருவர் பயன்படுத்தலாம்.
uk: Після завершення калібрування можна скористатися всіма стандартними інструментами для затискачів, які використовують зонд Z.

source: Note that eddy current sensors (and inductive probes in general) are susceptible to "thermal drift". That is, changes in temperature can result in changes in reported Z height. Changes in either the bed surface temperature or sensor hardware temperature can skew the results. It is important that calibration and probing is only done when the printer is at a stable temperature.
bg: Имайте предвид, че сензорите за вихрови токове (и индуктивните сонди като цяло) са податливи на "термичен дрейф". Това означава, че промените в температурата могат да доведат до промени в отчетената височина Z. Промените в температурата на повърхността на леглото или в температурата на хардуера на сензора могат да изкривят резултатите. Важно е калибрирането и сондирането да се извършват само когато температурата на принтера е стабилна.
hu: Vedd figyelembe, hogy az örvényáram-érzékelők (és általában az induktív szondák) érzékenyek a „termikus elhajlásra”. Vagyis a hőmérséklet változása a jelentett Z magasság változását eredményezheti. Az ágyfelület hőmérsékletének vagy a szenzor hardverhőmérsékletének változása torzíthatja az eredményeket. Fontos, hogy a kalibrálás és a szondázás csak akkor történjen, amikor a nyomtató stabil hőmérsékleten van.
ru: Обратите внимание, что вихретоковые датчики (и индуктивные датчики в целом) подвержены "тепловому дрейфу". То есть изменение температуры может привести к изменению регистрируемой высоты Z. Изменения температуры поверхности ложа или аппаратной температуры датчика могут исказить результаты. Важно, чтобы калибровка и измерение проводились только при стабильной температуре принтера.
ta: எடி தற்போதைய சென்சார்கள் (மற்றும் பொதுவாக தூண்டல் ஆய்வுகள்) "வெப்ப சறுக்கல்" க்கு ஆளாகின்றன என்பதை நினைவில் கொள்க. அதாவது, வெப்பநிலையில் ஏற்படும் மாற்றங்கள் அறிக்கையிடப்பட்ட சட் உயரத்தில் மாற்றங்களை ஏற்படுத்தும். படுக்கை மேற்பரப்பு வெப்பநிலை அல்லது சென்சார் வன்பொருள் வெப்பநிலையில் ஏற்படும் மாற்றங்கள் முடிவுகளைத் தவிர்க்கலாம். அச்சுப்பொறி நிலையான வெப்பநிலையில் இருக்கும்போது மட்டுமே அளவுத்திருத்தம் மற்றும் ஆய்வு செய்யப்படுவது முதன்மை.
uk: Зауважте, що датчики денного струму (і індуктивні зонди в цілому) схильні до «термального дрейфу». Таким чином, зміни температури можуть призвести до змін, внесених до висоти Z. Зміна температури поверхні ліжка або датчика температури апаратного пристрою можна розрізати результати. Важливо, що калібрування і пробування проводиться тільки при стабільній температурі принтера.

source: Thermal Drift Calibration
bg: Калибриране на термичния дрейф
hu: Termikus elhajlás kalibrálása
ru: Калибровка теплового отвода
ta: வெப்ப சறுக்கல் அளவுத்திருத்தம்
uk: Термозбіжне калібрування

source: As with all inductive probes, eddy current probes are subject to significant thermal drift. If the eddy probe has a temperature sensor on the coil it is possible to configure a `[temperature_probe]` to report coil temperature and enable software drift compensation. To link a temperature probe to an eddy current probe the `[temperature_probe]` section must share a name with the `[probe_eddy_current]` section. For example:
bg: Както при всички индуктивни сонди, сондите за вихрови токове са подложени на значителен термичен дрейф. Ако вихровата сонда има температурен сензор на намотката, е възможно да се конфигурира `[temperature_probe]` за отчитане на температурата на намотката и да се активира софтуерна компенсация на дрейфа. За да се свърже температурна сонда с вихровотокова сонда, разделът `[temperature_probe]` трябва да има общо име с раздела `[probe_eddy_current]`. Например:
hu: Mint minden induktív szondánál, az örvényáramú szondáknál is jelentős a termikus elhajlás. Ha az örvényáramú szonda a tekercsen hőmérséklet-érzékelővel rendelkezik, akkor lehetőség van egy `[temperature_probe]-t konfigurálni a tekercs hőmérsékletének jelentésére és a szoftveres hajláskompenzáció engedélyezésére. A hőmérsékletmérő szonda és az örvényáramú szonda összekapcsolásához a `[temperature_probe]` szakasszal közös nevet kell adnia a `[probe_eddy_current]` szakasznak. Például:
ru: Как и все индуктивные датчики, вихретоковые датчики подвержены значительному тепловому дрейфу. Если вихретоковый датчик имеет температурный датчик на катушке, можно сконфигурировать раздел `[temperature_probe]` для сообщения о температуре катушки и включения программной компенсации дрейфа. Чтобы связать температурный датчик с вихретоковым датчиком, секция `[temperature_probe]` должна иметь общее имя с секцией `[probe_eddy_current]`. Например:
ta: அனைத்து தூண்டல் ஆய்வுகளையும் போலவே, எடி தற்போதைய ஆய்வுகள் குறிப்பிடத்தக்க வெப்ப சறுக்கலுக்கு உட்பட்டவை. எடி ஆய்வில் சுருளில் வெப்பநிலை சென்சார் இருந்தால், சுருள் வெப்பநிலையைப் புகாரளிப்பதற்கும் மென்பொருள் சறுக்கல் இழப்பீட்டை இயக்குவதற்கும் `[வெப்பநிலை_பிரோப்]` உள்ளமைக்க முடியும். வெப்பநிலை ஆய்வை எடி மின்னோட்ட ஆய்வுடன் இணைக்க `[வெப்பநிலை_பிரோப்]` பிரிவு `[probe_eddy_current]` பிரிவுடன் ஒரு பெயரைப் பகிர வேண்டும். உதாரணமாக:
uk: Як з усіма індуктивними зонами, вихровими струмовими зонами підлягають значному термічному дрейфу. Якщо eddy probe має датчик температури на котушкі, можна налаштувати `[температурний_probe]`, щоб повідомити температуру котушки і увімкнути компенсацію накопичувача програмного забезпечення. Щоб зв'язати температурний зонд до eddy поточного зонду `[температурний_probe]` розділ повинен ділитися назвою `[probe_eddy_current]` розділ. Наприклад:

source: See the [configuration reference](Config_Reference.md#temperature_probe) for further details on how to configure a `temperature_probe`. It is advised to configure the `calibration_position`, `calibration_extruder_temp`, `extruder_heating_z`, and `calibration_bed_temp` options, as doing so will automate some of the steps outlined below.
bg: Вижте [configuration reference](Config_Reference.md#temperature_probe) за повече подробности относно конфигурирането на `temperature_probe`. Препоръчително е да конфигурирате опциите `calibration_position`, `calibration_extruder_temp`, `extruder_heating_z` и `calibration_bed_temp`, тъй като това ще автоматизира някои от стъпките, описани по-долу.
hu: A [konfigurációs hivatkozás](Config_Reference.md#temperature_probe) további részleteket tartalmaz a `temperature_probe` konfigurálásáról. Javasoljuk a `calibration_position`, `calibration_extruder_temp`, `extruder_heating_z` és `calibration_bed_temp` opciók konfigurálását, mivel ez automatizálja az alább ismertetett lépések egy részét.
ru: Дополнительные сведения о том, как настроить `temperature_probe`, см. в [справочнике конфигурации](Config_Reference.md#temperature_probe). Рекомендуется настроить опции `calibration_position`, `calibration_extruder_temp`, `extruder_heating_z` и `calibration_bed_temp`, поскольку это позволит автоматизировать некоторые шаги, описанные ниже.
