Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Endstop_Phase.po
Languages: bg, pt, ta, uk

source: In order to use this system the endstop must be accurate enough to identify the stepper position within two "full steps". So, for example, if a stepper is using 16 micro-steps with a step distance of 0.005mm then the endstop must have an accuracy of at least 0.160mm. If one gets "Endstop stepper_z incorrect phase" type error messages than in may be due to an endstop that is not sufficiently accurate. If recalibration does not help then disable endstop phase adjustments by removing them from the config file.
bg: За да може да се използва тази система, крайният ограничител трябва да бъде достатъчно точен, за да определи позицията на стъпковия механизъм в рамките на две "пълни стъпки". Така например, ако стъпковият механизъм използва 16 микростъпки с разстояние между стъпките 0,005 mm, крайният ограничител трябва да има точност най-малко 0,160 mm. Ако се получават съобщения за грешка от типа "Endstop stepper_z incorrect phase", това може да се дължи на крайния ограничител, който не е достатъчно точен. Ако повторното калибриране не помогне, забранете настройките на фазата на ендстопа, като ги премахнете от файла за конфигуриране.
pt: Para utilizar este sistema, o fim de curso deve ser suficientemente preciso para identificar a posição do passo dentro de dois "passos completos". Assim, por exemplo, se um stepper estiver usando 16 micropassos com uma distância de passo de 0,005 mm, o fim de curso deverá ter uma precisão de pelo menos 0,160 mm. Se alguém receber mensagens de erro do tipo "Endstop stepper_z fase incorreta", isso pode ser devido a um fim de curso que não é suficientemente preciso. Se a recalibração não ajudar, desative os ajustes de fase de fim de curso removendo-os do arquivo de configuração.
ta: இந்த அமைப்பைப் பயன்படுத்துவதற்கு, ச்டெப்பர் நிலையை இரண்டு "முழு படிகள்" க்குள் அடையாளம் காண எண்ட்ச்டாப் துல்லியமாக இருக்க வேண்டும். எனவே, எடுத்துக்காட்டாக, ஒரு ச்டெப்பர் 0.005 மிமீ படி தூரத்துடன் 16 மைக்ரோ-படிகளைப் பயன்படுத்தினால், எண்ட்ச்டாப் குறைந்தது 0.160 மிமீ துல்லியத்தைக் கொண்டிருக்க வேண்டும். ஒருவர் கிடைத்தால், "எண்ட்ச்டாப் ச்டெபர்_இது தவறான கட்டம்" வகை பிழை செய்திகள் போதுமான துல்லியமாக இல்லாத எண்ட்ச்டாப்பின் காரணமாக இருக்கலாம். மறுசீரமைப்பு உதவாது என்றால், கட்டமைப்பு கோப்பிலிருந்து அவற்றை அகற்றுவதன் மூலம் எண்ட்ச்டாப் கட்ட மாற்றங்களை முடக்கு.
uk: Для того, щоб використовувати цю систему, торцева поверхня повинна бути досить точною, щоб визначити позицію кроквя в межах двох "повних кроків". Так, наприклад, якщо степпер використовується 16 мікрокроступів з покроковою дистанцією 0.005мм, після чого стілець повинен мати точність принаймні 0,160мм. Якщо один отримує "Endstop stepper_z невірної фази" повідомлення про помилку типу, ніж у може бути пов'язано з кінцевою поверхнею, яка не є достатньо точним. Якщо рекалібрація не допомагає потім відключати налаштування фазових торрентів, видалівши їх з конфігураційного файлу.

source: If one is using a traditional stepper controlled Z axis (as on a cartesian or corexy printer) along with traditional bed leveling screws then it is also possible to use this system to arrange for each print layer to be performed on a "full step" boundary. To enable this feature be sure the G-Code slicer is configured with a layer height that is a multiple of a "full step", manually enable the endstop_align_zero option in the endstop_phase config section (see [config reference](Config_Reference.md#endstop_phase) for further details), and then re-level the bed screws.
bg: Ако се използва традиционна ос Z, управлявана от стъпков механизъм (като при картезиански или корексиален принтер), заедно с традиционни винтове за изравняване на леглото, тогава е възможно също така да се използва тази система, за да се организира всеки печатен слой да се извършва на границата на "пълна стъпка". За да активирате тази функция, уверете се, че G-Code слайсерът е конфигуриран с височина на слоя, която е кратна на "пълна стъпка", ръчно активирайте опцията endstop_align_zero в секцията за конфигуриране endstop_phase (вижте [config reference](Config_Reference.md#endstop_phase) за повече подробности) и след това отново нивелирайте винтовете на леглото.
pt: Se alguém estiver usando um eixo Z tradicional controlado por passo (como em uma impressora cartesiana ou corexy) junto com parafusos de nivelamento de base tradicionais, então também é possível usar este sistema para organizar cada camada de impressão a ser executada em um limite de "etapa completa" . Para ativar esse recurso, certifique-se de que o fatiador G-Code esteja configurado com uma altura de camada que seja um múltiplo de uma "etapa completa", habilite manualmente a opção endstop_align_zero na seção de configuração endstop_phase (consulte [referência de configuração](Config_Reference.md#endstop_phase ) para obter mais detalhes) e, em seguida, nivelar novamente os parafusos da base.
ta: பாரம்பரிய படுக்கை சமநிலைப்படுத்தும் திருகுகளுடன் ஒரு பாரம்பரிய ச்டெப்பர் கட்டுப்படுத்தப்பட்ட சட் அச்சில் (ஒரு கார்ட்டீசியன் அல்லது கோரெக்சி அச்சுப்பொறியைப் போல) ஒருவர் பயன்படுத்தினால், ஒவ்வொரு அச்சு அடுக்கையும் ஒரு "முழு படி" எல்லையில் செய்ய ஏற்பாடு செய்ய இந்த அமைப்பைப் பயன்படுத்தவும் முடியும் . இந்த அம்சத்தை செயல்படுத்த, சி-குறியீடு ச்லைசர் ஒரு அடுக்கு உயரத்துடன் கட்டமைக்கப்பட்டுள்ளது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், இது "முழு படி" என்ற பல மடங்கு, எண்ட்ச்டாப்_பேச் கட்டமைப்பு பிரிவில் எண்ட்ச்டாப்_அலின்_செரோ விருப்பத்தை கைமுறையாக இயக்கவும் ([கட்டமைப்பு_ரெச்] ) மேலும் விவரங்களுக்கு), பின்னர் படுக்கை திருகுகளை மீண்டும் நிலைநிறுத்தவும்.
uk: Якщо ви використовуєте традиційну крокову вісь Z (як на візках, так і на струменевій принтері) разом з традиційними вирівнюючими гвинтами, то також можна використовувати цю систему, щоб влаштовувати для кожного шару друку, щоб виконати на межі "повний крок". Щоб увімкнути цю функцію, обов'язково налаштовується скибочка G-Code з висотою шару, яка являє собою декілька "повний крок", вручну увімкніть параметр endstop_align_zero в розділі endstop_phase config (див. [Налаштування посилання](Config_Reference.md#endstop_phase) для подальших деталей), а потім перерівняти гвинти.

source: It is possible to use this system with traditional (non-Trinamic) stepper motor drivers. However, doing this requires making sure that the stepper motor drivers are reset every time the micro-controller is reset. (If the two are always reset together then Klipper can determine the stepper phase by tracking the total number of steps it has commanded the stepper to move.) Currently, the only way to do this reliably is if both the micro-controller and stepper motor drivers are powered solely from USB and that USB power is provided from a host running on a Raspberry Pi. In this situation one can specify an mcu config with "restart_method: rpi_usb" - that option will arrange for the micro-controller to always be reset via a USB power reset, which would arrange for both the micro-controller and stepper motor drivers to be reset together. If using this mechanism, one would then need to manually configure the "trigger_phase" config sections (see [config reference](Config_Reference.md#endstop_phase) for the details).
bg: Възможно е тази система да се използва с традиционни (нетринамови) драйвери за стъпкови двигатели. За целта обаче е необходимо да се уверите, че драйверите на стъпковите двигатели се нулират при всяко нулиране на микроконтролера. (Ако двете устройства се нулират винаги заедно, Klipper може да определи фазата на стъпковия двигател, като проследи общия брой стъпки, на които е дал команда на стъпковия двигател да се движи.) Понастоящем единственият начин да се направи това надеждно е, ако микроконтролерът и драйверите на стъпковия двигател се захранват единствено от USB и това USB захранване се осигурява от хост, работещ на Raspberry Pi. В тази ситуация може да се зададе конфигурация на mcu с "restart_method: rpi_usb" - тази опция ще направи така, че микроконтролерът винаги да се нулира чрез нулиране на USB захранването, което ще направи така, че и микроконтролерът, и драйверите на стъпковия двигател да се нулират заедно. Ако се използва този механизъм, ще трябва ръчно да се конфигурират секциите на конфигурацията "trigger_phase" (за подробности вижте [config reference](Config_Reference.md#endstop_phase)).
pt: É possível usar este sistema com drivers de motor de passo tradicionais (não Trinamic). No entanto, fazer isso requer garantir que os drivers do motor de passo sejam reiniciados toda vez que o microcontrolador for reiniciado. (Se os dois são sempre redefinidos juntos, o Klipper pode determinar a fase do passo a passo rastreando o número total de passos que ele comandou para o passo a passo.) Atualmente, a única maneira de fazer isso de forma confiável é se tanto o microcontrolador quanto o motor de passo os drivers são alimentados exclusivamente por USB e a alimentação USB é fornecida por um host rodando em um Raspberry Pi. Nesta situação, pode-se especificar uma configuração mcu com "restart_method: rpi_usb" - essa opção fará com que o microcontrolador seja sempre redefinido por meio de uma redefinição de energia USB, o que faria com que tanto o microcontrolador quanto os drivers do motor de passo fossem redefinir juntos. Se usar esse mecanismo, será necessário configurar manualmente as seções de configuração "trigger_phase" (consulte [referência de configuração](Config_Reference.md#endstop_phase) para obter detalhes).
ta: பாரம்பரிய (டிரினமிக் அல்லாத) ச்டெப்பர் மின்னோடி இயக்கிகளுடன் இந்த அமைப்பைப் பயன்படுத்த முடியும். இருப்பினும், இதைச் செய்வதற்கு ஒவ்வொரு முறையும் மைக்ரோ-கன்ட்ரோலர் மீட்டமைக்கப்படும் போது ச்டெப்பர் மின்னோடி இயக்கிகள் மீட்டமைக்கப்படுவதை உறுதிசெய்ய வேண்டும். . ஓட்டுநர்கள் யூ.எச்.பியிலிருந்து மட்டுமே இயக்கப்படுகிறார்கள், மேலும் ராச்பெர்ரி பையில் இயங்கும் ஓச்டிலிருந்து யூ.எச்.பி ஆற்றல் வழங்கப்படுகிறது. இந்த சூழ்நிலையில், "Restart_method: rpi_usb" உடன் ஒரு MCU கட்டமைப்பைக் குறிப்பிடலாம்-அந்த விருப்பம் மைக்ரோ-கன்ட்ரோலருக்கு எப்போதும் யூ.எச்.பி பவர் மீட்டமைப்பு வழியாக மீட்டமைக்க ஏற்பாடு செய்யும், இது மைக்ரோ-கன்ட்ரோலர் மற்றும் ச்டெப்பர் மின்னோடி டிரைவர்கள் இரண்டிற்கும் ஏற்பாடு செய்யும் ஒன்றாக மீட்டமைக்கவும். இந்த பொறிமுறையைப் பயன்படுத்தினால், ஒருவர் "தூண்டுதல்_பேச்" கட்டமைப்பு பிரிவுகளை கைமுறையாக கட்டமைக்க வேண்டும் (விவரங்களுக்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#endstop_phase) ஐப் பார்க்கவும்).
uk: Можливе використання цієї системи з традиційними (нетринамічними) кроковими двигунами. Тим не менш, це вимагає того, що крокові двигуни скидають кожен раз, коли мікроконтролер скидається. (Якщо два завжди скидаються разом, то Klipper може визначити фазу крокової залози, відстежуючи загальну кількість кроків, які він замовив stepper для переміщення.) В даний час єдиний спосіб зробити це надійно, якщо як мікроконтролер, так і кроковий двигун драйверів працює виключно з USB і що живлення USB забезпечується від господаря, що працює на Raspberry Pi. У цій ситуації можна вказати на конфігурацію mcu з "restart_method: rpi_usb" - що варіант буде влаштовувати для мікроконтролера, щоб завжди бути скиданням живлення USB, який буде влаштовувати як для мікроконтролерів, так і для водіїв крокових двигунів, які будуть скидати разом. Якщо ви використовуєте цей механізм, то потрібно вручну налаштувати розділи "trigger_phase" (див. [посилання на налаштування](Config_Reference.md#endstop_phase) для деталей).

source: [endstop_phase]
uk: [ендстоп_фаза]

source: ENDSTOP_PHASE_CALIBRATE STEPPER=stepper_z
uk: УКРПОШТА СТЕППЕР=Степпер_з

source: SAVE_CONFIG
uk: ПРОКСИМУС

source: Endstop phase
pt: Fase de parada
ta: எண்ட்ச்டாப் கட்டம்
uk: Положення кінцевика
