Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Example_Configs.po
Languages: pt_br

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
pt_br: Esse documento contém diretrizes para contribuir com um exemplo de configuração do Klipper para o repositório github do Klipper (localizado no [diretório de configuração](../config/)).

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
pt_br: Note que o [servidor de Discussão Comunitária do Klipper](https://community.klipper3d.org) também é uma fonte útil para achar e compartilhar arquivos de configuração.

source: Guidelines
pt_br: Diretrizes

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
pt_br: O prefixo `generic` é usado para uma placa controladora de impressora 3d que pode ser usada em vários tipos diferentes de impressoras.

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
pt_br: O prefixo `kit` é para impressoras 3d que são montadas de acordo especificações amplamente utilizadas. Essas impressoras de "kit" são geralmente diferentes de "impressoras" normais visto que não são vendidas por um fabricante.

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
pt_br: O prefixo `sample` é usado para "trechos" de configuração que são possíveis de serem copiados e colados no arquivo de configuração principal.

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
pt_br: O prefixo `example` é usado para descrever a cinemática da impressora. Esse tipo de configuração tipicamente é somente adicionado junto ao código para um novo tipo de cinemática de impressora.

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
pt_br: Klipper deve ser capaz de iniciar arquivos de exemplo de configuração `printer`, `generic` e `kit` sem erros. Esses arquivos de configuração devem ser adicionados a pasta de reversão de teste [test/klippy/printers.test](../test/klippy/printers.test). Adicione novos arquivos de configuração a essa pasta de teste, na parte apropriada, em ordem alfabética dentro da seção.

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
pt_br: O exemplo de configuração deve ser para a configuração "padrão" da impressora. (Existem muitas configurações "customizadas" para acompanhar no repositório principal do Klipper.) Analogicamente, somente adicionamos arquivos de exemplo de configuração para impressoras, kits e placas que tenham popularidade com o público em geral (p. ex., devem ter ao menos 100 unidades dela em uso). Considere usar o [servidor de Discussão Comunitária do Klipper](https://community.klipper3d.org) para outras configurações.

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
pt_br: Somente especifique dispositivos presentes na dada impressora ou placa. Não especifique ajustes específicos a sua configuração em particular. Para arquivos de configuração `generic` somente esses dispositivos devem ser descritos. Por exemplo, não faria sentido adicionar uma configuração de tela a uma configuração "genérica" visto que não há como saber se a placa será conectada a esse tipo de tela. Se a placa tem uma entrada para um hardware em específico, para facilitar a adição de um periférico opcional (p. ex., uma porta para bltouch), adicione uma seção "comentada" para o dispositivo em questão.

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
pt_br: Não especifique `pressure_advance` em um exemplo de configuração, visto que esse valor é específico ao filamento, não ao hardware da impressora. Da mesma forma, não especifique os ajustes `max_extrude_only_velocity` ou `max_extrude_only_accel`.

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
pt_br: Não especifique uma seção de configuração contendo um caminho ou hardware de hospedeiro. Por exemplo, não determine seções de configuração `[virtual_sdcard]` ou `[temperature_host]`.

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
pt_br: Somente defina macros que utilizem funcionalidade específica a uma impressora ou determine g-codes que são habitualmente emitidos por fatiadores configurados para a impressora em questão.

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
pt_br: Onde possível, é melhor usar o mesmo texto, expressão, indentação e ordenamento por seção dos arquivos de configuração existentes. No topo de cada arquivo de configuração deve estar listado o tipo de microcontrolador que o usuário deve escolher durante o comando "make menuconfig". O mesmo também deve conter uma referência ao arquivo "docs/Config_Reference.md".

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
pt_br: Não copie o campo documentação nos arquivos de exemplo de configuração. (Ao se fazer isso se cria uma obrigação de manutenção, visto que em uma atualização na documentação seria necessário modificá-la em vários lugares.)

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
pt_br: Arquivos de configuração de exemplo não devem conter uma seção "SAVE_CONFIG". Se necessário, copie os campos relevantes da seção SAVE_CONFIG para a parte apropriada na área da configuração principal.

source: Use `field: value` syntax instead of `field=value`.
pt_br: Use a sintaxe `field: value` ao invés de `field=value`.

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
pt_br: Evite definir valores de campo que estão configurados a seus valores padrão. Por exemplo, não se deve especificar `min_extrude_temp: 170` visto que esse já é o valor padrão.

source: Where possible, lines should not exceed 80 columns.
pt_br: Onde possível, as linhas não devem ultrapassar 80 colunas.

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
pt_br: Evite adicionar mensagens de atribuição ou revisão nos arquivos de configuração. (Por exemplo, evite adicionar linhas como "Esse arquivo foi criado por ...".) Coloque a atribuição e o histórico de mudanças na mensagem de comprometimento do git.

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
pt_br: Não desabilite o sistema de segurança padrão de um arquivo de configuração de exemplo. Por exemplo, a definição não deve especificar uma `max_extrude_cross_section` customizada. Não desabilite os recursos de depuração. Por exemplo não deve se ter uma seção de configuração `force_move`.

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
pt_br: Arquivos de configuração de exemplo são submetidos se criando um "pull request" no github. Por favor siga das instruções no [documento de contribuição](CONTRIBUTING.md).

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
pt_br: O prefixo `printer` é usado para impressoras em sua configuração padrão, vendidas por um fabricante convencional.

source: Example configurations
pt_br: Exemplo de configurações

source: Select the appropriate config filename prefix:
pt_br: Selecione o prefixo de nome de arquivo de configuração apropriado:

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
pt_br: Todos arquivos de configuração devem terminar com o sufixo `.cfg`. Os arquivos de configuração `printer` devem terminar com um ano, seguido por `.cfg` (p. ex. `-2019.cfg`). Nesse caso, o ano é o ano aproximado em que a impressora foi vendida.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
pt_br: Não utilize espaços ou caracteres especiais no nome do arquivo de configuração. O nome de arquivo deve conter somente os caracteres `A-Z`, `a-z`, `0-9`, `-` e `.`.

source: Do not use any deprecated features in the example config file.
pt_br: Não use recursos obsoletos no arquivo de configuração de exemplo.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
pt_br: Quando adicionar uma `rotation_distance` para uma extrusora é preferível especificar uma `gear_ratio`, caso a extrusora tenha um mecanismo de engrenagens. É esperado que a rotation_distance nas configurações de exemplo esteja correlacionada com a circunferência da engrenagem fresada da extrusora - que é normalmente na faixa de 20 a 35mm. Quando se especifica uma `gear_ratio` é preferível que se informe o número de dentes das engrenagens que compõem o mecanismo (p. ex., prefira `gear_ratio: 80:20` a `gear_ratio: 4:1`). Veja o [documento Distância de Rotação](Rotation_Distance.md#using-a-gear_ratio) para mais informações.

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
pt_br: Todas as placas suportadas pelo Klipper conseguem usar a taxa de transmissão serial padrão de 250000. Não recomende uma taxa de transmissão serial diferente no arquivo de exemplo de configuração.
