Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: ru, ta

source: How can I donate to the project?
ru: Как я могу пожертвовать проекту?
ta: திட்டத்திற்கு நான் எவ்வாறு நன்கொடை அளிக்க முடியும்?

source: How do I calculate the rotation_distance config parameter?
ru: Как мне рассчитать конфигурационный параметр rotation_distance?
ta: சுழற்சி_டி கட்டமைப்பு அளவுருவை எவ்வாறு கணக்கிடுவது?

source: See the [rotation distance document](Rotation_Distance.md).
ru: Посмотрите на [rotation distance document](Rotation_Distance.md).
ta: [சுழற்சி தூர ஆவணம்] (சுழற்சி_டிச்டன்ச்.எம்டி) ஐப் பார்க்கவும்.

source: Where's my serial port?
ru: Где мой последовательный порт?
ta: எனது தொடர் துறைமுகம் எங்கே?

source: The general way to find a USB serial port is to run `ls /dev/serial/by-id/*` from an ssh terminal on the host machine. It will likely produce output similar to the following:
ru: Общий способ найти последовательный порт USB — запустить `ls /dev/serial/by-id/*` из терминала ssh на хост-компьютере. Скорее всего, это приведет к выводу, похожему на следующее:
ta: யூ.எச்.பி சீரியல் போர்ட்டைக் கண்டுபிடிப்பதற்கான பொதுவான வழி, புரவலன் கணினியில் உள்ள ஒரு எச்.எச்.எச் முனையத்திலிருந்து `ls/dev/serial/by-id/*` இயக்க வேண்டும். இது பின்வருவனவற்றைப் போன்ற வெளியீட்டை உருவாக்கும்:

source: The name found in the above command is stable and it is possible to use it in the config file and while flashing the micro-controller code. For example, a flash command might look similar to:
ru: Имя, определённое в приведенной выше команде, является стабильным, и его можно использовать в файле конфигурации и при прошивке кода микроконтроллера. Например, команда «flash» может выглядеть примерно так:
ta: மேலே உள்ள கட்டளையில் காணப்படும் பெயர் நிலையானது மற்றும் அதை கட்டமைப்பு கோப்பில் பயன்படுத்த முடியும் மற்றும் மைக்ரோ-கன்ட்ரோலர் குறியீட்டை ஒளிரும் போது. எடுத்துக்காட்டாக, ஒரு ஃபிளாச் கட்டளை ஒத்ததாகத் தோன்றலாம்:

source: and the updated config might look like:
ru: и обновлённая конфигурация может выглядеть так:
ta: புதுப்பிக்கப்பட்ட கட்டமைப்பு போல் இருக்கலாம்:

source: Be sure to copy-and-paste the name from the "ls" command that you ran above as the name will be different for each printer.
ru: Обязательно скопируйте и вставьте имя из команды «ls», которую вы запустили выше, так как имя будет разным для каждого принтера.
ta: ஒவ்வொரு அச்சுப்பொறியுக்கும் பெயர் வித்தியாசமாக இருப்பதால் நீங்கள் மேலே ஓடிய "எல்.எச்" கட்டளையிலிருந்து பெயரை நகலெடுத்து ஒட்டவும்.

source: If you are using multiple micro-controllers and they do not have unique ids (common on boards with a CH340 USB chip) then follow the directions above using the command `ls /dev/serial/by-path/*` instead.
ru: Если вы используете несколько микроконтроллеров, которые не имеют уникальных идентификаторов (распространены на чипах CH340 USB) тогда следуйте инструкциям выше, используя команду `ls /dev/serial/by-path/*` вместо этого.
ta: நீங்கள் பல மைக்ரோ-கன்ட்ரோலர்களைப் பயன்படுத்துகிறீர்கள் என்றால், அவற்றில் தனித்துவமான ஐடிகள் இல்லை (CH340 யூ.எச்.பி சிப்புடன் பலகைகளில் பொதுவானவை) பின்னர் `ls/dev/serial/byath/*` கட்டளையைப் பயன்படுத்தி மேலே உள்ள திசைகளைப் பின்பற்றவும்.

source: When the micro-controller restarts the device changes to /dev/ttyUSB1
ru: Когда микроконтроллер перезапускает устройство, изменения в/dev/ttyUSB1
ta: மைக்ரோ-கன்ட்ரோலர் மறுதொடக்கம் செய்யும் போது சாதனம் /dev /ttyusb1 ஆக மாறுகிறது

source: Follow the directions in the "[Where's my serial port?](#wheres-my-serial-port)" section to prevent this from occurring.
ru: Следуйте указаниям из секции "[Где мой последовательный порт?](#где-мой-последовательный-порт)" чтобы предотвратить это.
ta: இது நிகழாமல் தடுக்க "[எனது சீரியல் துறைமுகம் எங்கே?] (#வீர்ச்-என்-சீரியல்-போர்ட்)" பிரிவில் உள்ள திசைகளைப் பின்பற்றவும்.

source: The "make flash" command doesn't work
ru: Команда "прошить" не работает
ta: "ஃப்ளாச் மேக்" கட்டளை வேலை செய்யாது

source: The code attempts to flash the device using the most common method for each platform. Unfortunately, there is a lot of variance in flashing methods, so the "make flash" command may not work on all boards.
ru: Код пытается прошить устройство с помощью самого распространенного способа. К сожалению, существует множество способов прошивки, потому команда "прошить" может не работать на всех возможных приборах.
ta: ஒவ்வொரு தளத்திற்கும் மிகவும் பொதுவான முறையைப் பயன்படுத்தி சாதனத்தை ஒளிரச் செய்ய குறியீடு முயற்சிக்கிறது. துரதிர்ச்டவசமாக, ஒளிரும் முறைகளில் நிறைய மாறுபாடுகள் உள்ளன, எனவே "மேக் ஃப்ளாச்" கட்டளை அனைத்து பலகைகளிலும் வேலை செய்யாது.

source: If you're having an intermittent failure or you do have a standard setup, then double check that Klipper isn't running when flashing (sudo service klipper stop), make sure OctoPrint isn't trying to connect directly to the device (open the Connection tab in the web page and click Disconnect if the Serial Port is set to the device), and make sure FLASH_DEVICE is set correctly for your board (see the [question above](#wheres-my-serial-port)).
ru: Если у вас периодические сбои или стандартная настройка, проверьте, не запущен ли Klipper при прошивке (sudo service klipper stop), убедитесь, что OctoPrint не пытается подключиться к устройству напрямую (откройте вкладку Соединение на веб-странице и нажмите Отключить, если для устройства установлен Последовательный порт), и убедитесь, что FLASH_DEVICE установлен правильно для вашей платы (см. [вопрос выше](#wheres-my-serial-port)).
ta: நீங்கள் ஒரு இடைப்பட்ட தோல்வியைக் கொண்டிருந்தால் அல்லது உங்களிடம் ஒரு நிலையான அமைப்பு இருந்தால், ஒளிரும் போது கிளிப்பர் இயங்கவில்லை என்பதை இருமுறை சரிபார்க்கவும் வலைப்பக்கத்தில் உள்ள இணைப்பு தாவல் மற்றும் சீரியல் துறைமுகம் சாதனத்தில் அமைக்கப்பட்டிருந்தால் துண்டிக்கவும் என்பதைக் சொடுக்கு செய்து, உங்கள் போர்டுக்கு ஃப்ளாச்_டெவிச் சரியாக அமைக்கப்பட்டிருப்பதை உறுதிசெய்க (மேலே உள்ள [மேலே உள்ள கேள்வியைப் பார்க்கவும்] (#வீச்-என்-சீரியல்-போர்ட்)).

source: However, if "make flash" just doesn't work for your board, then you will need to manually flash. See if there is a config file in the [config directory](../config) with specific instructions for flashing the device. Also, check the board manufacturer's documentation to see if it describes how to flash the device. Finally, it may be possible to manually flash the device using tools such as "avrdude" or "bossac" - see the [bootloader document](Bootloaders.md) for additional information.
ru: Однако если "make flash" просто не работает для вашей платы, то вам придется прошивать вручную. Проверьте, есть ли в каталоге [config](../config) файл конфигурации с конкретными инструкциями по прошивке устройства. Также проверьте документацию производителя платы, чтобы узнать, описано ли в ней, как прошить устройство. Наконец, можно прошить устройство вручную с помощью таких инструментов, как "avrdude" или "bossac" - дополнительную информацию см. в документе [ bootloader document](Bootloaders.md)].
ta: இருப்பினும், "ஃப்ளாச் மேக்" உங்கள் போர்டுக்கு வேலை செய்யாவிட்டால், நீங்கள் கைமுறையாக ஒளிர வேண்டும். சாதனத்தை ஒளிரச் செய்வதற்கான குறிப்பிட்ட வழிமுறைகளுடன் [கட்டமைப்பு அடைவு] (../ கட்டமைப்பு) இல் ஒரு கட்டமைப்பு கோப்பு இருக்கிறதா என்று பாருங்கள். மேலும், சாதனத்தை எவ்வாறு ஒளிரச் செய்வது என்பதை விவரிக்கிறதா என்பதைப் பார்க்க வாரிய உற்பத்தியாளரின் ஆவணங்களை சரிபார்க்கவும். இறுதியாக, "AVRDUDE" அல்லது "BOSAC" போன்ற கருவிகளைப் பயன்படுத்தி சாதனத்தை கைமுறையாக ஒளிரச் செய்ய முடியும் - கூடுதல் தகவலுக்கு [Bootloader ஆவணம்] (Bootloaders.md) ஐப் பார்க்கவும்.

source: How do I change the serial baud rate?
ru: Как я могу изменить скорость порта?
ta: தொடர் பாட் வீதத்தை எவ்வாறு மாற்றுவது?

source: The recommended baud rate for Klipper is 250000. This baud rate works well on all micro-controller boards that Klipper supports. If you've found an online guide recommending a different baud rate, then ignore that part of the guide and continue with the default value of 250000.
ru: Рекомендуемая скорость передачи данных для Klipper - 250000. Эта скорость передачи данных хорошо работает на всех платах микроконтроллеров, которые поддерживает Klipper. Если вы нашли в Интернете руководство, рекомендующее другую скорость передачи данных, проигнорируйте эту часть руководства и продолжайте использовать значение по умолчанию 250000.
ta: கிளிப்பருக்கான பரிந்துரைக்கப்பட்ட பாட் வீதம் 250000 ஆகும். கிளிப்பர் ஆதரிக்கும் அனைத்து மைக்ரோ-கன்ட்ரோலர் போர்டுகளிலும் இந்த பாட் விகிதம் நன்றாக வேலை செய்கிறது. வேறுபட்ட பாட் வீதத்தை பரிந்துரைக்கும் நிகழ்நிலை வழிகாட்டியை நீங்கள் கண்டறிந்தால், வழிகாட்டியின் அந்த பகுதியை புறக்கணித்து 250000 இயல்புநிலை மதிப்பைத் தொடரவும்.

source: If you want to change the baud rate anyway, then the new rate will need to be configured in the micro-controller (during **make menuconfig**) and that updated code will need to be compiled and flashed to the micro-controller. The Klipper printer.cfg file will also need to be updated to match that baud rate (see the [config reference](Config_Reference.md#mcu) for details). For example:
ru: Если вы все равно хотите изменить скорость передачи данных, то новую скорость нужно будет настроить в микроконтроллере (во время **make menuconfig**), а обновленный код нужно будет скомпилировать и прошить в микроконтроллер. Файл Klipper printer.cfg также нужно будет обновить, чтобы он соответствовал этой скорости передачи данных (подробности см. в [ссылка на конфигурацию ](Config_Reference.md#mcu). Например:
ta: நீங்கள் எப்படியாவது பாட் விகிதத்தை மாற்ற விரும்பினால், புதிய வீதத்தை மைக்ரோ-கன்ட்ரோலரில் (** மெனுகான்ஃபிக் ** இன் போது) கட்டமைக்க வேண்டும், மேலும் அந்த புதுப்பிக்கப்பட்ட குறியீட்டை தொகுத்து மைக்ரோ கான்ட்ரோலருக்கு பறக்க வேண்டும். அந்த பாட் வீதத்துடன் பொருந்தக்கூடிய கிளிப்பர் அச்சுப்பொறி. உதாரணமாக:

source: The baud rate shown on the OctoPrint web page has no impact on the internal Klipper micro-controller baud rate. Always set the OctoPrint baud rate to 250000 when using Klipper.
ru: Скорость передачи данных, указанная на веб-странице OctoPrint, не влияет на скорость передачи данных внутреннего микроконтроллера Klipper. При использовании Klipper всегда устанавливайте скорость передачи данных OctoPrint на 250000.
ta: ஆக்டோபிரிண்ட் வலைப்பக்கத்தில் காட்டப்பட்டுள்ள பாட் வீதம் உள் கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் பாட் வீதத்தில் எந்த தாக்கத்தையும் ஏற்படுத்தாது. கிளிப்பரைப் பயன்படுத்தும் போது எப்போதும் ஆக்டோப்ரிண்ட் பாட் வீதத்தை 250000 ஆக அமைக்கவும்.

source: The Klipper micro-controller baud rate is not related to the baud rate of the micro-controller's bootloader. See the [bootloader document](Bootloaders.md) for additional information on bootloaders.
ru: Скорость передачи данных микроконтроллера Klipper не связана со скоростью передачи данных загрузчика микроконтроллера. Дополнительную информацию о загрузчиках смотрите в документе [bootloader](Bootloaders.md).
ta: கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் பாட் வீதம் மைக்ரோ-கன்ட்ரோலரின் துவக்க ஏற்றியின் பாட் வீதத்துடன் தொடர்புடையது அல்ல. துவக்க ஏற்றிகள் பற்றிய கூடுதல் தகவலுக்கு [துவக்க ஏற்றி ஆவணம்] (bootloaders.md) ஐப் பார்க்கவும்.

source: Can I run Klipper on something other than a Raspberry Pi 3?
ru: Можно ли запустить Klipper на чем-то другом, кроме Raspberry Pi 3?
ta: ராச்பெர்ரி பை 3 ஐத் தவிர வேறு எதையாவது நான் கிளிப்பரை இயக்க முடியுமா?

source: The recommended hardware is a Raspberry Pi 2, Raspberry Pi 3, or Raspberry Pi 4.
ru: Рекомендуемое оборудование - Raspberry Pi 2, Raspberry Pi 3 или Raspberry Pi 4.
ta: பரிந்துரைக்கப்பட்ட வன்பொருள் ஒரு ராச்பெர்ரி பை 2, ராச்பெர்ரி பை 3, அல்லது ராச்பெர்ரி பை 4 ஆகும்.

source: Klipper will run on a Raspberry Pi 1 and on the Raspberry Pi Zero, but these boards don't have enough processing power to run OctoPrint well. It is common for print stalls to occur on these slower machines when printing directly from OctoPrint. (The printer may move faster than OctoPrint can send movement commands.) If you wish to run on one one of these slower boards anyway, consider using the "virtual_sdcard" feature when printing (see [config reference](Config_Reference.md#virtual_sdcard) for details).
ru: Klipper будет работать на Raspberry Pi 1 и на Raspberry Pi Zero, но эти платы не обладают достаточной вычислительной мощностью для работы OctoPrint. На этих медленных машинах часто возникают задержки печати при печати непосредственно из OctoPrint. (Принтер может двигаться быстрее, чем OctoPrint может посылать команды перемещения). Если вы хотите работать на одной из этих медленных плат, рассмотрите возможность использования функции "virtual_sdcard" при печати (подробности смотрите в [ссылка на конфигурацию](Config_Reference.md#virtual_sdcard)).
ta: கிளிப்பர் ஒரு ராச்பெர்ரி பை 1 மற்றும் ராச்பெர்ரி பை பூச்சியத்தில் இயங்கும், ஆனால் இந்த பலகைகளுக்கு ஆக்டோப்ரின்ட்டை நன்றாக இயக்க போதுமான செயலாக்க ஆற்றல் இல்லை. ஆக்டோபிரிண்டிலிருந்து நேரடியாக அச்சிடும்போது இந்த மெதுவான இயந்திரங்களில் அச்சு ச்டால்கள் ஏற்படுவது பொதுவானது. . விவரங்களுக்கு).

source: Klipper has been run on other machines. The Klipper host software only requires Python running on a Linux (or similar) computer. However, if you wish to run it on a different machine you will need Linux admin knowledge to install the system prerequisites for that particular machine. See the [install-octopi.sh](../scripts/install-octopi.sh) script for further information on the necessary Linux admin steps.
ru: Klipper уже запускался на других машинах. Для работы хост-программы Klipper требуется только Python, запущенный на компьютере с ОС Linux (или аналогичной). Однако если вы хотите запустить его на другой машине, вам понадобятся знания администратора Linux, чтобы установить системные предпосылки для этой машины. Дополнительную информацию о необходимых действиях администратора Linux см. в сценарии [install-octopi.sh](../scripts/install-octopi.sh).
ta: கிளிப்பர் மற்ற இயந்திரங்களில் இயக்கப்பட்டுள்ளது. கிளிப்பர் புரவலன் மென்பொருளுக்கு லினக்ச் (அல்லது ஒத்த) கணினியில் பைதான் இயங்க வேண்டும். இருப்பினும், நீங்கள் அதை வேறு கணினியில் இயக்க விரும்பினால், அந்த குறிப்பிட்ட இயந்திரத்திற்கான கணினி முன்நிபந்தனைகளை நிறுவ லினக்ச் நிர்வாக அறிவு உங்களுக்குத் தேவைப்படும். தேவையான லினக்ச் நிர்வாக படிகள் பற்றிய கூடுதல் தகவலுக்கு [install-octopi.sh] (../ ச்கிரிப்ட்கள்/நிறுவல்-ஆக்டோபி.சே) ச்கிரிப்டைப் பார்க்கவும்.

source: If you are looking to run the Klipper host software on a low-end chip, then be aware that, at a minimum, a machine with "double precision floating point" hardware is required.
ru: Если вы хотите запустить хост-программу Klipper на низкоуровневом чипе, то имейте в виду, что, как минимум, требуется машина с аппаратным обеспечением "двойной точности с плавающей точкой".
ta: நீங்கள் கிளிப்பர் புரவலன் மென்பொருளை குறைந்த அளவிலான சிப்பில் இயக்க விரும்பினால், குறைந்தபட்சம், "இரட்டை துல்லியமான மிதக்கும் புள்ளி" வன்பொருள் கொண்ட ஒரு இயந்திரம் தேவை என்பதை அறிந்து கொள்ளுங்கள்.

source: If you are looking to run the Klipper host software on a shared general-purpose desktop or server class machine, then note that Klipper has some real-time scheduling requirements. If, during a print, the host computer also performs an intensive general-purpose computing task (such as defragmenting a hard drive, 3d rendering, heavy swapping, etc.), then it may cause Klipper to report print errors.
ru: Если вы хотите запустить хост-программу Klipper на общей настольной или серверной машине общего назначения, обратите внимание, что Klipper предъявляет определенные требования к расписанию в реальном времени. Если во время печати хост-компьютер также выполняет интенсивную вычислительную задачу общего назначения (например, дефрагментацию жесткого диска, 3d-рендеринг, интенсивный свопинг и т. д.), то это может привести к тому, что Klipper будет сообщать об ошибках печати.
ta: பகிரப்பட்ட பொது-நோக்கம் டெச்க்டாப் அல்லது சேவையக வகுப்பு இயந்திரத்தில் கிளிப்பர் புரவலன் மென்பொருளை இயக்க நீங்கள் விரும்பினால், கிளிப்பருக்கு சில நிகழ்நேர திட்டமிடல் தேவைகள் உள்ளன என்பதை நினைவில் கொள்க. ஒரு அச்சின் போது, ஓச்ட் கணினி ஒரு தீவிரமான பொது-நோக்கம் கொண்ட கணினி பணியைச் செய்கிறது (ஒரு வன், 3D வழங்குதல், கனமான இடமாற்றம் போன்றவை), இது கிளிப்பர் அச்சு பிழைகளைப் புகாரளிக்க காரணமாக இருக்கலாம்.

source: Note: If you are not using an OctoPi image, be aware that several Linux distributions enable a "ModemManager" (or similar) package that can disrupt serial communication. (Which can cause Klipper to report seemingly random "Lost communication with MCU" errors.) If you install Klipper on one of these distributions you may need to disable that package.
ru: Примечание: Если вы не используете образ OctoPi, имейте в виду, что некоторые дистрибутивы Linux включают пакет "ModemManager" (или аналогичный), который может нарушить последовательную связь. (Это может привести к тому, что Klipper будет выдавать случайные ошибки "Потеряна связь с MCU"). Если вы устанавливаете Klipper на один из таких дистрибутивов, вам может потребоваться отключить этот пакет.
ta: குறிப்பு: நீங்கள் ஒரு ஆக்டோபி படத்தைப் பயன்படுத்தவில்லை என்றால், பல லினக்ச் விநியோகங்கள் தொடர் தகவல்தொடர்புக்கு இடையூறு விளைவிக்கும் "மோடெம்மேனேசர்" (அல்லது ஒத்த) தொகுப்பை இயக்குகின்றன என்பதை அறிந்து கொள்ளுங்கள். .

source: Can I run multiple instances of Klipper on the same host machine?
ru: Можно ли запустить несколько экземпляров Klipper на одном хост-машине?
ta: ஒரே புரவலன் கணினியில் கிளிப்பரின் பல நிகழ்வுகளை நான் இயக்க முடியுமா?

source: It is possible to run multiple instances of the Klipper host software, but doing so requires Linux admin knowledge. The Klipper installation scripts ultimately cause the following Unix command to be run:
ru: Можно запустить несколько экземпляров хост-программы Klipper, но для этого требуются знания администратора Linux. Сценарии установки Klipper в конечном итоге вызывают выполнение следующей команды Unix:
ta: கிளிப்பர் புரவலன் மென்பொருளின் பல நிகழ்வுகளை இயக்க முடியும், ஆனால் அவ்வாறு செய்ய லினக்ச் நிர்வாக அறிவு தேவைப்படுகிறது. கிளிப்பர் நிறுவல் ச்கிரிப்ட்கள் இறுதியில் பின்வரும் யூனிக்ச் கட்டளையை இயக்க காரணமாகின்றன:

source: One can run multiple instances of the above command as long as each instance has its own printer config file, its own log file, and its own pseudo-tty. For example:
ru: Можно запустить несколько экземпляров вышеуказанной команды, если у каждого экземпляра есть свой файл конфигурации принтера, свой файл журнала и своя псевдо-тишина. Например:
ta: ஒவ்வொரு நிகழ்விலும் அதன் சொந்த அச்சுப்பொறி கட்டமைப்பு கோப்பு, அதன் சொந்த பதிவு கோப்பு மற்றும் அதன் சொந்த போலி-டிடி இருக்கும் வரை மேலே உள்ள கட்டளையின் பல நிகழ்வுகளை ஒருவர் இயக்க முடியும். உதாரணமாக:

source: If you choose to do this, you will need to implement the necessary start, stop, and installation scripts (if any). The [install-octopi.sh](../scripts/install-octopi.sh) script and the [klipper-start.sh](../scripts/klipper-start.sh) script may be useful as examples.
ru: Если вы решите сделать это, вам нужно будет реализовать необходимые скрипты запуска, остановки и установки (если таковые имеются). В качестве примера можно привести скрипт [install-octopi.sh](../scripts/install-octopi.sh) и скрипт [klipper-start.sh](../scripts/klipper-start.sh).
ta: இதைச் செய்ய நீங்கள் தேர்வுசெய்தால், தேவையான தொடக்க, நிறுத்தம் மற்றும் நிறுவல் ச்கிரிப்ட்களை (ஏதேனும் இருந்தால்) செயல்படுத்த வேண்டும். [Install-octopi.sh] (../ ச்கிரிப்ட்கள்/நிறுவல்-ஆக்டோபி.சே) ச்கிரிப்ட் மற்றும் [klipper-start.sh] (../ ச்கிரிப்ட்கள்/கிளிப்பர்-ச்டார்ட்.சே) ச்கிரிப்ட் எடுத்துக்காட்டுகளாக பயனுள்ளதாக இருக்கும்.

source: Do I have to use OctoPrint?
ru: Обязательно ли использовать OctoPrint?
ta: நான் ஆக்டோபிரிண்டைப் பயன்படுத்த வேண்டுமா?

source: The Klipper software is not dependent on OctoPrint. It is possible to use alternative software to send commands to Klipper, but doing so requires Linux admin knowledge.
ru: Программное обеспечение Klipper не зависит от OctoPrint. Можно использовать альтернативное программное обеспечение для отправки команд в Klipper, но это требует знаний администратора Linux.
ta: கிளிப்பர் மென்பொருள் ஆக்டோபிரிண்டைப் பொறுத்தது அல்ல. கிளிப்பருக்கு கட்டளைகளை அனுப்ப மாற்று மென்பொருளைப் பயன்படுத்த முடியும், ஆனால் அவ்வாறு செய்ய லினக்ச் நிர்வாக அறிவு தேவைப்படுகிறது.

source: Klipper creates a "virtual serial port" via the "/tmp/printer" file, and it emulates a classic 3d-printer serial interface via that file. In general, alternative software may work with Klipper as long as it can be configured to use "/tmp/printer" for the printer serial port.
ru: Klipper создает "виртуальный последовательный порт" через файл "/tmp/printer" и эмулирует классический последовательный интерфейс 3d-принтера через этот файл. В общем, альтернативное программное обеспечение может работать с Klipper, если оно может быть настроено на использование "/tmp/printer" для последовательного порта принтера.
ta: கிளிப்பர் "/டி.எம்.பி/அச்சுப்பொறி" கோப்பு வழியாக "மெய்நிகர் சீரியல் போர்ட்டை" உருவாக்குகிறார், மேலும் இது அந்தக் கோப்பு வழியாக ஒரு உன்னதமான 3D-பிரிண்டர் தொடர் இடைமுகத்தை பின்பற்றுகிறது. பொதுவாக, அச்சுப்பொறி சீரியல் போர்ட்டுக்கு "/TMP/அச்சுப்பொறி" பயன்படுத்த கட்டமைக்கக்கூடிய வரை மாற்று மென்பொருள் கிளிப்பருடன் வேலை செய்யலாம்.

source: Why can't I move the stepper before homing the printer?
ru: Почему я не могу перемещать шаговый механизм перед наведением принтера?
ta: அச்சுப்பொறியைத் தயாரிப்பதற்கு முன்பு நான் ஏன் ச்டெப்பரை நகர்த்த முடியாது?

source: The code does this to reduce the chance of accidentally commanding the head into the bed or a wall. Once the printer is homed the software attempts to verify each move is within the position_min/max defined in the config file. If the motors are disabled (via an M84 or M18 command) then the motors will need to be homed again prior to movement.
ru: Это делается для того, чтобы уменьшить вероятность случайного попадания головки в кровать или стену. После наведения принтера программа пытается проверить, что каждое перемещение находится в пределах position_min/max, заданных в файле конфигурации. Если двигатели отключены (командой M84 или M18), то перед перемещением их нужно будет снова навести.
ta: தற்செயலாக தலையை படுக்கை அல்லது சுவருக்குள் கட்டளையிடும் வாய்ப்பைக் குறைக்க குறியீடு இதைச் செய்கிறது. அச்சுப்பொறி சொந்தமானதும் மென்பொருள் ஒவ்வொரு நகர்வையும் சரிபார்க்க முயற்சிகள் கட்டமைப்பு கோப்பில் வரையறுக்கப்பட்டுள்ள நிலை_மின்/அதிகபட்சம். மோட்டார்கள் முடக்கப்பட்டிருந்தால் (ஒரு M84 அல்லது M18 கட்டளை வழியாக) மோட்டார்கள் இயக்கத்திற்கு முன் மீண்டும் தங்க வைக்கப்பட வேண்டும்.

source: If you want to move the head after canceling a print via OctoPrint, consider changing the OctoPrint cancel sequence to do that for you. It's configured in OctoPrint via a web browser under: Settings->GCODE Scripts
ru: Если вы хотите перемещать головку после отмены печати через OctoPrint, измените последовательность отмены OctoPrint, чтобы она делала это за вас. Она настраивается в OctoPrint через веб-браузер в разделе: Настройки->Сценарии GCODE
ta: ஆக்டோபிரிண்ட் வழியாக ஒரு அச்சை ரத்து செய்த பிறகு நீங்கள் தலையை நகர்த்த விரும்பினால், உங்களுக்காக அதைச் செய்ய ஆக்டோபிரிண்ட் ரத்துசெய் வரிசையை மாற்றுவதைக் கவனியுங்கள். இது ஒரு வலை உலாவி வழியாக ஆக்டோபிரிண்டில் கட்டமைக்கப்பட்டுள்ளது: அமைப்புகள்-> GCODE ச்கிரிப்ட்கள்

source: If you want to move the head after a print finishes, consider adding the desired movement to the "custom g-code" section of your slicer.
ru: Если вы хотите перемещать головку после завершения печати, добавьте нужное движение в раздел "пользовательский g-код" вашего слайсера.
ta: அச்சு முடிந்தபின் நீங்கள் தலையை நகர்த்த விரும்பினால், உங்கள் ச்லைசரின் "தனிப்பயன் சி-குறியீடு" பிரிவில் விரும்பிய இயக்கத்தை சேர்ப்பதைக் கவனியுங்கள்.
