Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: ru, ta

source: If the printer requires some additional movement as part of the homing process itself (or fundamentally does not have a homing process) then consider using a safe_z_home or homing_override section in the config file. If you need to move a stepper for diagnostic or debugging purposes then consider adding a force_move section to the config file. See [config reference](Config_Reference.md#customized_homing) for further details on these options.
ru: Если принтер требует дополнительного перемещения в рамках процесса самонаведения (или в принципе не имеет процесса самонаведения), рассмотрите возможность использования секции safe_z_home или homing_override в файле конфигурации. Если вам необходимо перемещать шаговый механизм в целях диагностики или отладки, подумайте о добавлении секции force_move в файл конфигурации. Дополнительные сведения об этих опциях смотрите в [ ссылка на конфигурацию ](Config_Reference.md#customized_homing).
ta: ஓமிங் செயல்முறையின் ஒரு பகுதியாக அச்சுப்பொறிக்கு சில கூடுதல் இயக்கம் தேவைப்பட்டால் (அல்லது அடிப்படையில் ஒரு ஓமிங் செயல்முறை இல்லை) பின்னர் கட்டமைப்பு கோப்பில் பாதுகாப்பான_இசட்_ஓம் அல்லது ஓமிங்_ஓவர்ரைடு பிரிவைப் பயன்படுத்துவதைக் கவனியுங்கள். கண்டறியும் அல்லது பிழைத்திருத்த நோக்கங்களுக்காக நீங்கள் ஒரு ச்டெப்பரை நகர்த்த வேண்டும் என்றால், கட்டமைப்பு கோப்பில் ஒரு ஃபோர்ச்_மோவ் பகுதியைச் சேர்ப்பதைக் கவனியுங்கள். இந்த விருப்பங்கள் குறித்த கூடுதல் விவரங்களுக்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#தனிப்பயனாக்கப்பட்ட_ஓமிங்) ஐப் பார்க்கவும்.

source: Why is the Z position_endstop set to 0.5 in the default configs?
ru: Почему в конфигурации по умолчанию для параметра Z position_endstop установлено значение 0,5?
ta: இயல்புநிலை உள்ளமைவுகளில் சட் pasition_endstop 0.5 ஆக ஏன் அமைக்கப்படுகிறது?

source: For cartesian style printers the Z position_endstop specifies how far the nozzle is from the bed when the endstop triggers. If possible, it is recommended to use a Z-max endstop and home away from the bed (as this reduces the potential for bed collisions). However, if one must home towards the bed then it is recommended to position the endstop so it triggers when the nozzle is still a small distance away from the bed. This way, when homing the axis, it will stop before the nozzle touches the bed. See the [bed level document](Bed_Level.md) for more information.
ru: Для принтеров картезианского типа параметр Z position_endstop указывает, на каком расстоянии от станины находится сопло в момент срабатывания концевого упора. По возможности рекомендуется использовать концевой упор Z-max и размещать сопло вдали от станины (так как это снижает вероятность столкновений со станиной). Однако если необходимо направить ось к станине, рекомендуется установить концевой упор таким образом, чтобы он срабатывал, когда сопло находится на небольшом расстоянии от станины. Таким образом, при наведении оси она остановится до того, как сопло коснется станины. Дополнительные сведения см. в документе [Уровень станины](Bed_Level.md).
ta: கார்ட்டீசியன் பாணி அச்சுப்பொறிகளுக்கு, எண்ட்ச்டாப் தூண்டும்போது படுக்கையில் இருந்து முனை எவ்வளவு தூரம் இருக்கிறது என்பதைக் குறிப்பிடுகிறது. முடிந்தால், ஒரு இசட்-மேக்ச் எண்ட்ச்டாப் மற்றும் படுக்கையில் இருந்து வீட்டைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது (இது படுக்கை மோதல்களுக்கான திறனைக் குறைக்கிறது). இருப்பினும், ஒருவர் படுக்கையை நோக்கி வீட்டிற்கு வர வேண்டும் என்றால், எண்ட்ச்டாப்பை நிலைநிறுத்த பரிந்துரைக்கப்படுகிறது, எனவே முனை இன்னும் படுக்கையில் இருந்து சிறிது தூரத்தில் இருக்கும்போது அது தூண்டுகிறது. இந்த வழியில், அச்சைத் தக்கவைக்கும்போது, முனை படுக்கையைத் தொடுவதற்கு முன்பு அது நின்றுவிடும். மேலும் தகவலுக்கு [படுக்கை நிலை ஆவணம்] (Bed_level.md) ஐப் பார்க்கவும்.

source: I converted my config from Marlin and the X/Y axes work fine, but I just get a screeching noise when homing the Z axis
ru: Я преобразовал свою конфигурацию из Marlin, и оси X/Y работают нормально, но при наведении на ось Z появляется визжащий шум
ta: நான் எனது உள்ளமைவை மார்லினிலிருந்து மாற்றினேன், எக்ச்/ஒய் அச்சுகள் நன்றாக வேலை செய்கின்றன, ஆனால் சட் அச்சில் இடமளிக்கும் போது எனக்கு ஒரு ஒலி கிடைக்கிறது

source: Short answer: First, make sure you have verified the stepper configuration as described in the [config check document](Config_checks.md). If the problem persists, try reducing the max_z_velocity setting in the printer config.
ru: Краткий ответ: Во-первых, убедитесь, что вы проверили конфигурацию степпера, как описано в документе [ config check document ](Config_checks.md). Если проблема сохраняется, попробуйте уменьшить параметр max_z_velocity в конфигурации принтера.
ta: குறுகிய பதில்: முதலில், [கட்டமைப்பு காசோலை ஆவணம்] (config_checks.md) இல் விவரிக்கப்பட்டுள்ளபடி நீங்கள் ச்டெப்பர் உள்ளமைவை சரிபார்த்துள்ளீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். சிக்கல் தொடர்ந்தால், அச்சுப்பொறி உள்ளமைவில் MAX_Z_VELOCITY அமைப்பைக் குறைக்க முயற்சிக்கவும்.

source: Long answer: In practice Marlin can typically only step at a rate of around 10000 steps per second. If it is requested to move at a speed that would require a higher step rate then Marlin will generally just step as fast as it can. Klipper is able to achieve much higher step rates, but the stepper motor may not have sufficient torque to move at a higher speed. So, for a Z axis with a high gearing ratio or high microsteps setting the actual obtainable max_z_velocity may be smaller than what is configured in Marlin.
ru: Длинный ответ: На практике Marlin обычно может шагать со скоростью около 10000 шагов в секунду. Если его попросят двигаться со скоростью, требующей большей частоты шагов, то Marlin, как правило, будет шагать настолько быстро, насколько сможет. Klipper способен достичь гораздо более высокой частоты шагов, но шаговый двигатель может не иметь достаточного крутящего момента для движения на более высокой скорости. Таким образом, для оси Z с высоким передаточным отношением или высокими настройками микрошагов фактическая достижимая скорость max_z_velocity может быть меньше, чем настроенная в Marlin.
ta: நீண்ட பதில்: நடைமுறையில் மார்லின் பொதுவாக நொடிக்கு 10000 படிகள் என்ற விகிதத்தில் மட்டுமே முடியும். அதிக படி விகிதம் தேவைப்படும் வேகத்தில் செல்லும்படி கோரப்பட்டால், மார்லின் பொதுவாக முடிந்தவரை வேகமாக அடியெடுத்து வைப்பார். கிளிப்பர் மிக உயர்ந்த படி விகிதங்களை அடைய முடியும், ஆனால் ச்டெப்பர் மோட்டருக்கு அதிக வேகத்தில் செல்ல போதுமான முறுக்கு இருக்காது. எனவே, அதிக கியரிங் விகிதம் அல்லது அதிக மைக்ரோச்டெப்சைக் கொண்ட ஒரு சட் அச்சுக்கு உண்மையான பெறக்கூடிய MAX_Z_VELOCITY அமைக்கும் மார்லினில் கட்டமைக்கப்பட்டதை விட சிறியதாக இருக்கலாம்.

source: My TMC motor driver turns off in the middle of a print
ru: Драйвер двигателя TMC выключается в середине печати
ta: எனது டிஎம்சி மின்னோடி டிரைவர் அச்சின் நடுவில் அணைக்கப்படும்

source: If using the TMC2208 (or TMC2224) driver in "standalone mode" then make sure to use the [latest version of Klipper](#how-do-i-upgrade-to-the-latest-software). A workaround for a TMC2208 "stealthchop" driver problem was added to Klipper in mid-March of 2020.
ru: Если вы используете драйвер TMC2208 (или TMC2224) в "автономном режиме", убедитесь, что вы используете [последнюю версию Klipper](#how-do-i-upgrade-to-the-latest-software). В середине марта 2020 года в Klipper было добавлено обходное решение проблемы "stealthchop" драйвера TMC2208.
ta: "தனித்தனி பயன்முறையில்" TMC2208 (அல்லது TMC2224) இயக்கியைப் பயன்படுத்தினால், [கிளிப்பரின் அண்மைக் கால பதிப்பைப் பயன்படுத்துவதை உறுதிசெய்து கொள்ளுங்கள் (#எப்படி-டோ-ஐ-பெக்ரேட்-டு-தி-லாடெச்ட்-ச்கோஃப்ட்வேர்). 2020 ஆம் ஆண்டின் மார்ச் மாதத்தின் நடுப்பகுதியில் கிளிப்பரில் டி.எம்.சி 2208 "ச்டீல்த்சாப்" இயக்கி சிக்கலுக்கான ஒரு பணித்தொகுப்பு சேர்க்கப்பட்டது.

source: I keep getting random "Lost communication with MCU" errors
ru: Я продолжаю получать случайные ошибки "Потеряна связь с MCU"
ta: நான் சீரற்ற "எம்.சி.யுவுடன் இழந்த தகவல்தொடர்பு" பிழைகளைப் பெறுகிறேன்

source: This is commonly caused by hardware errors on the USB connection between the host machine and the micro-controller. Things to look for:
ru: Обычно это вызвано аппаратными ошибками в USB-соединении между хост-машиной и микроконтроллером. На что обратить внимание:
ta: புரவலன் இயந்திரத்திற்கும் மைக்ரோ-கன்ட்ரோலருக்கும் இடையிலான யூ.எச்.பி இணைப்பில் வன்பொருள் பிழைகள் காரணமாக இது பொதுவாக ஏற்படுகிறது. கவனிக்க வேண்டிய விசயங்கள்:

source: Use a good quality USB cable between the host machine and micro-controller. Make sure the plugs are secure.
ru: Используйте качественный USB-кабель между хост-машиной и микроконтроллером. Убедитесь, что штекеры надежно закреплены.
ta: புரவலன் மெசின் மற்றும் மைக்ரோ-கன்ட்ரோலருக்கு இடையில் நல்ல தரமான யூ.எச்.பி கேபிளைப் பயன்படுத்தவும். செருகல்கள் பாதுகாப்பானவை என்பதை உறுதிப்படுத்தவும்.

source: Make sure the printer's power supply is not being overloaded. (Power fluctuations to the micro-controller's USB chip may result in resets of that chip.)
ru: Убедитесь, что источник питания принтера не перегружен. (Перепады напряжения на USB-чипе микроконтроллера могут привести к его перезагрузке)
ta: அச்சுப்பொறியின் மின்சாரம் அதிக சுமை இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். (மைக்ரோ-கன்ட்ரோலரின் யூ.எச்.பி சிப்பிற்கு ஆற்றல் ஏற்ற இறக்கங்கள் அந்த சிப்பின் மீட்டமைப்பை ஏற்படுத்தக்கூடும்.)

source: Verify stepper, heater, and other printer wires are not crimped or frayed. (Printer movement may place stress on a faulty wire causing it to lose contact, briefly short, or generate excessive noise.)
ru: Убедитесь, что провода шагового двигателя, нагревателя и другие провода принтера не пережаты и не перетерты. (Движение принтера может создавать нагрузку на неисправный провод, что приведет к потере контакта, кратковременному замыканию или возникновению чрезмерного шума)
ta: ச்டெப்பர், ஈட்டர் மற்றும் பிற அச்சுப்பொறி கம்பிகள் முடக்கப்படவில்லை அல்லது வறுத்தெடுக்கப்படவில்லை என்பதை சரிபார்க்கவும். (அச்சுப்பொறி இயக்கம் ஒரு தவறான கம்பியில் மன அழுத்தத்தை ஏற்படுத்தக்கூடும், இது தொடர்பை இழக்க நேரிடும், சுருக்கமாக குறுகியதாக அல்லது அதிக சத்தத்தை உருவாக்குகிறது.)

source: There have been reports of high USB noise when both the printer's power supply and the host's 5V power supply are mixed. (If you find that the micro-controller powers on when either the printer's power supply is on or the USB cable is plugged in, then it indicates the 5V power supplies are being mixed.) It may help to configure the micro-controller to use power from only one source. (Alternatively, if the micro-controller board can not configure its power source, one may modify a USB cable so that it does not carry 5V power between the host and micro-controller.)
ru: Поступали сообщения о высоком уровне шума USB при смешанном питании принтера и 5 В хоста. (Если вы обнаружите, что микроконтроллер включается, когда включен источник питания принтера или подключен кабель USB, это означает, что источники питания 5 В смешиваются). Возможно, поможет настройка микроконтроллера на использование питания только от одного источника. (В качестве альтернативы, если плата микроконтроллера не может настроить источник питания, можно модифицировать USB-кабель таким образом, чтобы он не передавал 5 В между хостом и микроконтроллером)
ta: அச்சுப்பொறியின் மின்சாரம் மற்றும் ஓச்டின் 5 வி மின்சாரம் இரண்டுமே கலக்கும்போது உயர் யூ.எச்.பி ஒலி பற்றிய தகவல்கள் வந்துள்ளன. . ஒரே ஒரு மூலத்திலிருந்து ஆற்றல். .

source: My Raspberry Pi keeps rebooting during prints
ru: Мой Raspberry Pi постоянно перезагружается во время печати
ta: எனது ராச்பெர்ரி பை அச்சிட்டுகளின் போது மறுதொடக்கம் செய்கிறது

source: This is most likely do to voltage fluctuations. Follow the same troubleshooting steps for a ["Lost communication with MCU"](#i-keep-getting-random-lost-communication-with-mcu-errors) error.
ru: Скорее всего, это связано с перепадами напряжения. Выполните те же шаги по устранению ошибки ["Потеряна связь с MCU"] (#i-keep-getting-random-lost-communication-with-mcu-errors).
ta: மின்னழுத்த ஏற்ற இறக்கங்களுக்கு இது பெரும்பாலும் செய்யப்படுகிறது. ["எம்.சி.யுவுடன் இழந்த தொடர்பு"] (#ஐ-கீப்-கிடிங்-ரேண்டம்-லோச்ட்-கம்யூனிகேசன்-எம்.சி.யு-பிழைகள்) பிழைக்கான அதே சரிசெய்தல் படிகளைப் பின்பற்றவும்.

source: Some old versions of the AVR bootloader have a known bug in watchdog event handling. This typically manifests when the printer.cfg file has restart_method set to "command". When the bug occurs, the AVR device will be unresponsive until power is removed and reapplied to the device (the power or status LEDs may also blink repeatedly until the power is removed).
ru: В некоторых старых версиях загрузчика AVR известна ошибка в обработке событий сторожевого таймера. Обычно это проявляется, когда в файле printer.cfg для параметра restart_method установлено значение "command". При возникновении ошибки устройство AVR не реагирует на запросы до тех пор, пока не будет снято и снова подано питание (светодиоды питания или состояния также могут неоднократно мигать до тех пор, пока питание не будет снято).
ta: ஏ.வி.ஆர் துவக்க ஏற்றியின் சில பழைய பதிப்புகள் கண்காணிப்பு நிகழ்வு கையாளுதலில் அறியப்பட்ட பிழையைக் கொண்டுள்ளன. அச்சுப்பொறி. Cfg கோப்பில் Restart_method "கட்டளை" என அமைக்கப்பட்டிருக்கும் போது இது பொதுவாக வெளிப்படுகிறது. பிழை ஏற்படும் போது, மின்சாரம் அகற்றப்பட்டு சாதனத்திற்கு மீண்டும் பயன்படுத்தப்படும் வரை ஏ.வி.ஆர் சாதனம் பதிலளிக்காது (சக்தி அகற்றப்படும் வரை ஆற்றல் அல்லது நிலை எல்.ஈ.டிகளும் மீண்டும் மீண்டும் ஒளிரக்கூடும்).

source: The workaround is to use a restart_method other than "command" or to flash an updated bootloader to the AVR device. Flashing a new bootloader is a one time step that typically requires an external programmer - see [Bootloaders](Bootloaders.md) for further details.
ru: Обходным решением является использование метода restart_method, отличного от "command", или прошивка обновленного загрузчика в устройство AVR. Прошивка нового загрузчика - это одноразовый шаг, для которого обычно требуется внешний программатор - более подробную информацию см. в [Bootloaders](Bootloaders.md).
ta: "கட்டளை" தவிர வேறு ஒரு RESTART_METHOD ஐப் பயன்படுத்துவது அல்லது புதுப்பிக்கப்பட்ட துவக்க ஏற்றியை AVR சாதனத்தில் ஒளிரச் செய்வது. புதிய துவக்க ஏற்றி ஒளிரும் ஒரு நேர படியாகும், இது பொதுவாக வெளிப்புற புரோகிராமர் தேவைப்படுகிறது - மேலும் விவரங்களுக்கு [துவக்க ஏற்றிகள்] (Bootloaders.md) ஐப் பார்க்கவும்.

source: Will the heaters be left on if the Raspberry Pi crashes?
ru: Останутся ли обогреватели включенными, если Raspberry Pi сломается?
ta: ராச்பெர்ரி பை செயலிழந்தால் ஈட்டர்கள் விடப்படுமா?

source: The software has been designed to prevent that. Once the host enables a heater, the host software needs to confirm that enablement every 5 seconds. If the micro-controller does not receive a confirmation every 5 seconds it goes into a "shutdown" state which is designed to turn off all heaters and stepper motors.
ru: Программное обеспечение разработано таким образом, чтобы предотвратить это. Как только хост включает нагреватель, программное обеспечение хоста должно подтверждать это включение каждые 5 секунд. Если микроконтроллер не получает подтверждения каждые 5 секунд, он переходит в состояние "выключения", которое предназначено для отключения всех нагревателей и шаговых двигателей.
ta: அதைத் தடுக்க மென்பொருள் வடிவமைக்கப்பட்டுள்ளது. புரவலன் ஒரு ஈட்டரை இயக்கியதும், புரவலன் மென்பொருள் ஒவ்வொரு 5 விநாடிகளுக்கும் அந்த செயல்பாட்டை உறுதிப்படுத்த வேண்டும். மைக்ரோ-கன்ட்ரோலர் ஒவ்வொரு 5 விநாடிகளிலும் ஒரு உறுதிப்படுத்தலைப் பெறவில்லை என்றால், அது ஒரு "பணிநிறுத்தம்" நிலைக்கு செல்கிறது, இது அனைத்து ஈட்டர்களையும் ச்டெப்பர் மோட்டர்களையும் அணைக்க வடிவமைக்கப்பட்டுள்ளது.

source: See the "config_digital_out" command in the [MCU commands](MCU_Commands.md) document for further details.
ru: Дополнительные сведения смотрите в команде "config_digital_out" в документе [MCU commands](MCU_Commands.md).
ta: மேலும் விவரங்களுக்கு [MCU கட்டளைகள்] (MCU_COMMANDS.MD) ஆவணத்தில் "config_digital_out" கட்டளையைப் பார்க்கவும்.

source: In addition, the micro-controller software is configured with a minimum and maximum temperature range for each heater at startup (see the min_temp and max_temp parameters in the [config reference](Config_Reference.md#extruder) for details). If the micro-controller detects that the temperature is outside of that range then it will also enter a "shutdown" state.
ru: Кроме того, при запуске программное обеспечение микроконтроллера настраивается на минимальный и максимальный температурный диапазон для каждого нагревателя (подробнее см. параметры min_temp и max_temp в [config reference](Config_Reference.md#extruder)). Если микроконтроллер обнаружит, что температура выходит за пределы этого диапазона, он также перейдет в состояние "отключения".
ta: கூடுதலாக, மைக்ரோ-கன்ட்ரோலர் மென்பொருள் தொடக்கத்தில் ஒவ்வொரு ஈட்டருக்கும் குறைந்தபட்ச மற்றும் அதிகபட்ச வெப்பநிலை வரம்புடன் கட்டமைக்கப்பட்டுள்ளது (விவரங்களுக்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#எக்ச்ட்ரூடர்) இல் MIN_TEMP மற்றும் MAX_TEMP அளவுருக்களைப் பார்க்கவும்). மைக்ரோ கான்ட்ரோலர் வெப்பநிலை அந்த வரம்பிற்கு வெளியே இருப்பதைக் கண்டறிந்தால், அது ஒரு "பணிநிறுத்தம்" நிலையிலும் நுழையும்.

source: Separately, the host software also implements code to check that heaters and temperature sensors are functioning correctly. See the [config reference](Config_Reference.md#verify_heater) for further details.
ru: Отдельно в хост-программе реализован код для проверки правильности работы нагревателей и датчиков температуры. Дополнительные сведения см. в [ссылка на конфигурацию](Config_Reference.md#verify_heater).
ta: தனித்தனியாக, ஈட்டர்கள் மற்றும் வெப்பநிலை சென்சார்கள் சரியாக செயல்படுகின்றனவா என்பதை சரிபார்க்க புரவலன் மென்பொருள் குறியீட்டை செயல்படுத்துகிறது. மேலும் விவரங்களுக்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#vorify_heater) ஐப் பார்க்கவும்.

source: How do I convert a Marlin pin number to a Klipper pin name?
ru: Как преобразовать номер пина Marlin в имя пина Klipper?
ta: மார்லின் முள் எண்ணை கிளிப்பர் முள் பெயராக மாற்றுவது எப்படி?

source: Short answer: A mapping is available in the [sample-aliases.cfg](../config/sample-aliases.cfg) file. Use that file as a guide to finding the actual micro-controller pin names. (It is also possible to copy the relevant [board_pins](Config_Reference.md#board_pins) config section into your config file and use the aliases in your config, but it is preferable to translate and use the actual micro-controller pin names.) Note that the sample-aliases.cfg file uses pin names that start with the prefix "ar" instead of "D" (eg, Arduino pin `D23` is Klipper alias `ar23`) and the prefix "analog" instead of "A" (eg, Arduino pin `A14` is Klipper alias `analog14`).
ru: Короткий ответ: Сопоставление доступно в файле [sample-aliases.cfg](../config/sample-aliases.cfg). Используйте этот файл как руководство для поиска реальных имен выводов микроконтроллера. (Можно также скопировать соответствующий раздел конфигурации [board_pins](Config_Reference.md#board_pins) в свой файл конфигурации и использовать псевдонимы в конфигурации, но предпочтительнее перевести и использовать реальные имена выводов микроконтроллера). Обратите внимание, что в файле sample-aliases.cfg используются имена выводов, начинающиеся с префикса "ar" вместо "D" (например, вывод Arduino `D23` - это Klipper-алиас `ar23`) и префикса "analog" вместо "A" (например, вывод Arduino `A14` - это Klipper-алиас `analog14`).
ta: குறுகிய பதில்: [மாதிரி-ALIASES.CFG] (../ config/shalm-aliases.cfg) கோப்பில் ஒரு மேப்பிங் கிடைக்கிறது. உண்மையான மைக்ரோ-கன்ட்ரோலர் முள் பெயர்களைக் கண்டுபிடிப்பதற்கான வழிகாட்டியாக அந்தக் கோப்பைப் பயன்படுத்தவும். . மாதிரி-ALIASES.CFG கோப்பு "d" க்கு பதிலாக "AR" முன்னொட்டுடன் தொடங்கும் முள் பெயர்களைப் பயன்படுத்துகிறது (எ.கா. "(எ.கா., அர்டுயினோ முள்` ஏ 14` என்பது கிளிப்பர் மாற்றுப்பெயர் `அனலாக் 14`).

source: Long answer: Klipper uses the standard pin names defined by the micro-controller. On the Atmega chips these hardware pins have names like `PA4`, `PC7`, or `PD2`.
ru: Длинный ответ: Klipper использует стандартные имена выводов, определяемые микроконтроллером. В чипах Atmega эти аппаратные пины имеют такие названия, как `PA4`, `PC7` или `PD2`.
ta: நீண்ட பதில்: மைக்ரோ-கன்ட்ரோலரால் வரையறுக்கப்பட்ட நிலையான முள் பெயர்களை கிளிப்பர் பயன்படுத்துகிறது. அட்மெகா சில்லுகளில் இந்த வன்பொருள் ஊசிகளும் `PA4`,` PC7`, அல்லது `PD2` போன்ற பெயர்களைக் கொண்டுள்ளன.

source: Long ago, the Arduino project decided to avoid using the standard hardware names in favor of their own pin names based on incrementing numbers - these Arduino names generally look like `D23` or `A14`. This was an unfortunate choice that has lead to a great deal of confusion. In particular the Arduino pin numbers frequently don't translate to the same hardware names. For example, `D21` is `PD0` on one common Arduino board, but is `PC7` on another common Arduino board.
ru: Давным-давно проект Arduino решил отказаться от использования стандартных аппаратных названий в пользу собственных названий выводов, основанных на возрастающих числах - эти названия Arduino обычно выглядят как `D23` или `A14`. Это был неудачный выбор, который привел к большой путанице. В частности, номера выводов Arduino часто не совпадают с названиями аппаратуры. Например, `D21` - это `PD0` на одной распространенной плате Arduino, но `PC7` на другой распространенной плате Arduino.
ta: நீண்ட காலத்திற்கு முன்பு, ஆர்டுயினோ திட்டம் அதிகரிக்கும் எண்களின் அடிப்படையில் தங்கள் சொந்த முள் பெயர்களுக்கு ஆதரவாக நிலையான வன்பொருள் பெயர்களைப் பயன்படுத்துவதைத் தவிர்க்க முடிவு செய்தது - இந்த ஆர்டுயினோ பெயர்கள் பொதுவாக `டி 23` அல்லது` ஏ 14` போல இருக்கும். இது ஒரு துரதிர்ச்டவசமான தேர்வாக இருந்தது, இது பெரும் குழப்பத்திற்கு வழிவகுத்தது. குறிப்பாக அர்டுயினோ முள் எண்கள் அடிக்கடி அதே வன்பொருள் பெயர்களுக்கு மொழிபெயர்க்காது. எடுத்துக்காட்டாக, `டி 21` என்பது ஒரு பொதுவான அர்டுயினோ போர்டில்` பி.டி 0` ஆகும், ஆனால் இது மற்றொரு பொதுவான ஆர்டுயினோ போர்டில் `பிசி 7` ஆகும்.

source: To avoid this confusion, the core Klipper code uses the standard pin names defined by the micro-controller.
ru: Чтобы избежать этой путаницы, основной код Klipper использует стандартные имена выводов, определенные микроконтроллером.
ta: இந்த குழப்பத்தைத் தவிர்க்க, கோர் கிளிப்பர் குறியீடு மைக்ரோ-கன்ட்ரோலரால் வரையறுக்கப்பட்ட நிலையான முள் பெயர்களைப் பயன்படுத்துகிறது.

source: Do I have to wire my device to a specific type of micro-controller pin?
ru: Нужно ли подключать устройство к определенному типу выводов микроконтроллера?
ta: எனது சாதனத்தை ஒரு குறிப்பிட்ட வகை மைக்ரோ-கன்ட்ரோலர் முள் கம்பி செய்ய வேண்டுமா?

source: It depends on the type of device and type of pin:
ru: Это зависит от типа устройства и типа пина:
ta: இது சாதனத்தின் வகை மற்றும் முள் வகையைப் பொறுத்தது:

source: ADC pins (or Analog pins): For thermistors and similar "analog" sensors, the device must be wired to an "analog" or "ADC" capable pin on the micro-controller. If you configure Klipper to use a pin that is not analog capable, Klipper will report a "Not a valid ADC pin" error.
ru: Штырьки АЦП (или аналоговые штырьки): Для термисторов и подобных "аналоговых" датчиков устройство должно быть подключено к "аналоговому" или "АЦП" выводу микроконтроллера. Если вы настроите Klipper на использование вывода, который не поддерживает аналоговый режим, Klipper выдаст ошибку "Not a valid ADC pin".
ta: ஏடிசி ஊசிகள் (அல்லது அனலாக் ஊசிகள்): தெர்மிச்டர்கள் மற்றும் ஒத்த "அனலாக்" சென்சார்களுக்கு, சாதனத்தை மைக்ரோ-கன்ட்ரோலரில் "அனலாக்" அல்லது "ஏடிசி" திறமையான முள் கம்பி செய்ய வேண்டும். அனலாக் திறன் இல்லாத ஒரு முள் பயன்படுத்த கிளிப்பரை நீங்கள் கட்டமைத்தால், கிளிப்பர் "செல்லுபடியாகும் ஏடிசி முள் அல்ல" பிழையைப் புகாரளிக்கும்.
