Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: ru, ta

source: PWM pins (or Timer pins): Klipper does not use hardware PWM by default for any device. So, in general, one may wire heaters, fans, and similar devices to any general purpose IO pin. However, fans and output_pin devices may be optionally configured to use `hardware_pwm: True`, in which case the micro-controller must support hardware PWM on the pin (otherwise, Klipper will report a "Not a valid PWM pin" error).
ru: ШИМ-контакты (или контакты таймера): Klipper не использует аппаратный ШИМ по умолчанию для любого устройства. Поэтому, в общем случае, можно подключать нагреватели, вентиляторы и подобные устройства к любому выводу IO общего назначения. Однако вентиляторы и устройства output_pin могут быть опционально настроены на использование `hardware_pwm: True`, в этом случае микроконтроллер должен поддерживать аппаратную ШИМ на выводе (иначе Klipper выдаст ошибку "Not a valid PWM pin").
ta: PWM ஊசிகள் (அல்லது நேரங்குறிகருவி ஊசிகளும்): எந்தவொரு சாதனத்திற்கும் கிளிப்பர் முன்னிருப்பாக வன்பொருள் PWM ஐப் பயன்படுத்தாது. எனவே, பொதுவாக, ஒருவர் ஈட்டர்கள், ரசிகர்கள் மற்றும் ஒத்த சாதனங்களை எந்த பொது நோக்கத்திற்கும் io முள் கம்பி செய்யலாம். இருப்பினும், ரசிகர்கள் மற்றும் வெளியீடு_பின் சாதனங்கள் `வன்பொருள்_பிடபிள்யூஎம்: உண்மை` பயன்படுத்த விருப்பமாக கட்டமைக்கப்படலாம், இந்த விசயத்தில் மைக்ரோ-கான்ரோல்டர் முள் மீது வன்பொருள் பி.டபிள்யூ.எம்.

source: IRQ pins (or Interrupt pins): Klipper does not use hardware interrupts on IO pins, so it is never necessary to wire a device to one of these micro-controller pins.
ru: Штырьки IRQ (или штырьки прерываний): Klipper не использует аппаратные прерывания на выводах ввода-вывода, поэтому никогда не нужно подключать устройство к одному из этих выводов микроконтроллера.
ta: IRQ ஊசிகள் (அல்லது குறுக்கீடு ஊசிகளும்): கிளிப்பர் IO ஊசிகளில் வன்பொருள் குறுக்கீடுகளைப் பயன்படுத்துவதில்லை, எனவே இந்த மைக்ரோ-கன்ட்ரோலர் ஊசிகளில் ஒன்றில் ஒரு சாதனத்தை கம்பி செய்வது ஒருபோதும் தேவையில்லை.

source: SPI pins: When using hardware SPI it is necessary to wire the pins to the micro-controller's SPI capable pins. However, most devices can be configured to use "software SPI", in which case any general purpose IO pins may be used.
ru: Штырьки SPI: При использовании аппаратного SPI необходимо подключить контакты к выводам микроконтроллера, поддерживающим SPI. Однако большинство устройств можно настроить на использование "программного SPI", и в этом случае можно использовать любые выводы ввода-вывода общего назначения.
ta: SPI ஊசிகள்: வன்பொருள் SPI ஐப் பயன்படுத்தும் போது மைக்ரோ-கன்ட்ரோலரின் SPI திறன் கொண்ட ஊசிகளுக்கு ஊசிகளை கம்பி செய்வது தேவை. இருப்பினும், பெரும்பாலான சாதனங்களை "மென்பொருள் SPI" ஐப் பயன்படுத்த கட்டமைக்க முடியும், இந்த விசயத்தில் எந்தவொரு பொது நோக்கமும் IO ஊசிகளைப் பயன்படுத்தலாம்.

source: I2C pins: When using I2C it is necessary to wire the pins to the micro-controller's I2C capable pins.
ru: Штырьки I2C: При использовании I2C необходимо подключить контакты к выводам микроконтроллера, поддерживающим I2C.
ta: I2C ஊசிகள்: I2C ஐப் பயன்படுத்தும் போது மைக்ரோ-கன்ட்ரோலரின் I2C திறன் கொண்ட ஊசிகளுக்கு ஊசிகளை கம்பி செய்வது தேவை.

source: Other devices may be wired to any general purpose IO pin. For example, steppers, heaters, fans, Z probes, servos, LEDs, common hd44780/st7920 LCD displays, the Trinamic UART control line may be wired to any general purpose IO pin.
ru: Другие устройства могут быть подключены к любому выводу IO общего назначения. Например, шаговики, нагреватели, вентиляторы, Z-зонды, сервоприводы, светодиоды, обычные ЖК-дисплеи hd44780/st7920, линия управления Trinamic UART может быть подключена к любому выводу IO общего назначения.
ta: பிற சாதனங்கள் எந்த பொது நோக்கத்திற்கும் IO முள் கம்பி செய்யப்படலாம். எடுத்துக்காட்டாக, ச்டெப்பர்கள், ஈட்டர்கள், ரசிகர்கள், சட் ஆய்வுகள், சர்வோச், எல்.ஈ.

source: How do I cancel an M109/M190 "wait for temperature" request?
ru: Как отменить запрос M109/M190 "ожидание температуры"?
ta: M109/M190 "வெப்பநிலைக்காக காத்திருங்கள்" கோரிக்கையை எவ்வாறு ரத்து செய்வது?

source: Navigate to the OctoPrint terminal tab and issue an M112 command in the terminal box. The M112 command will cause Klipper to enter into a "shutdown" state, and it will cause OctoPrint to disconnect from Klipper. Navigate to the OctoPrint connection area and click on "Connect" to cause OctoPrint to reconnect. Navigate back to the terminal tab and issue a FIRMWARE_RESTART command to clear the Klipper error state. After completing this sequence, the previous heating request will be canceled and a new print may be started.
ru: Перейдите на вкладку терминала OctoPrint и выполните команду M112 в окне терминала. Команда M112 приведет к тому, что Klipper перейдет в состояние "выключения", и OctoPrint отключится от Klipper. Перейдите в область подключения OctoPrint и нажмите на кнопку "Подключить", чтобы OctoPrint снова подключился. Вернитесь на вкладку терминала и выполните команду FIRMWARE_RESTART, чтобы очистить состояние ошибки Klipper. После выполнения этой последовательности предыдущий запрос на нагрев будет отменен, и можно будет начать новую печать.
ta: ஆக்டோபிரிண்ட் முனைய தாவலுக்கு செல்லவும், முனைய பெட்டியில் M112 கட்டளையை வழங்கவும். M112 கட்டளை கிளிப்பர் ஒரு "பணிநிறுத்தம்" நிலைக்குள் நுழையும், மேலும் இது ஆக்டோபிரிண்ட் கிளிப்பரில் இருந்து துண்டிக்க காரணமாகிறது. ஆக்டோப்ரண்ட் இணைப்பு பகுதிக்குச் சென்று, ஆக்டோப்ரின்ட் மீண்டும் இணைக்க "இணைப்பு" என்பதைக் சொடுக்கு செய்க. டெர்மினல் தாவலுக்குச் சென்று கிளிப்பர் பிழை நிலையை அழிக்க ஃபார்ம்வேர்_ரெச்டார்ட் கட்டளையை வழங்கவும். இந்த வரிசையை முடித்த பிறகு, முந்தைய வெப்ப கோரிக்கை ரத்து செய்யப்பட்டு புதிய அச்சு தொடங்கப்படலாம்.

source: Can I find out whether the printer has lost steps?
ru: Можно ли узнать, не сбился ли принтер с шага?
ta: அச்சுப்பொறி படிகளை இழந்துவிட்டதா என்பதை நான் கண்டுபிடிக்க முடியுமா?

source: In a way, yes. Home the printer, issue a `GET_POSITION` command, run your print, home again and issue another `GET_POSITION`. Then compare the values in the `mcu:` line.
ru: В некотором смысле, да. Верните принтер домой, выполните команду `GET_POSITION`, запустите печать, снова вернитесь домой и выполните еще одну команду `GET_POSITION`. Затем сравните значения в строке `mcu:`.
ta: ஒரு வழியில், ஆம். வீட்டில் அச்சுப்பொறி, `get_position` கட்டளையை வழங்கவும், உங்கள் அச்சு, வீட்டை மீண்டும் இயக்கவும், மற்றொரு` get_position` ஐ வழங்கவும். பின்னர் `MCU:` வரியில் உள்ள மதிப்புகளை ஒப்பிடுக.

source: This might be helpful to tune settings like stepper motor currents, accelerations and speeds without needing to actually print something and waste filament: just run some high-speed moves in between the `GET_POSITION` commands.
ru: Это может быть полезно для настройки таких параметров, как токи, ускорения и скорости шаговых двигателей, без необходимости печатать что-то и тратить нить: просто выполните несколько высокоскоростных движений между командами `GET_POSITION`.
ta: உண்மையில் ஏதாவது மற்றும் கழிவு இழைகளை அச்சிடத் தேவையில்லாமல் ச்டெப்பர் மின்னோடி நீரோட்டங்கள், முடுக்கம் மற்றும் விரைவு போன்ற அமைப்புகளை மாற்ற இது உதவியாக இருக்கும்: `Get_Position` கட்டளைகளுக்கு இடையில் சில அதிவேக நகர்வுகளை இயக்கவும்.

source: Note that endstop switches themselves tend to trigger at slightly different positions, so a difference of a couple of microsteps is likely the result of endstop inaccuracies. A stepper motor itself can only lose steps in increments of 4 full steps. (So, if one is using 16 microsteps, then a lost step on the stepper would result in the "mcu:" step counter being off by a multiple of 64 microsteps.)
ru: Обратите внимание, что сами концевые выключатели имеют тенденцию срабатывать в немного разных положениях, поэтому разница в пару микрошагов, скорее всего, является результатом неточности концевого выключателя. Сам шаговый двигатель может терять шаги только с шагом в 4 полных шага. (Таким образом, если используется 16 микрошагов, то потеря шага на шаговом двигателе приведет к тому, что счетчик шагов "mcu:" будет смещен на величину, кратную 64 микрошагам)
ta: எண்ட்ச்டாப் சுவிட்சுகள் தங்களை சற்று மாறுபட்ட நிலைகளில் தூண்டுகின்றன என்பதை நினைவில் கொள்க, எனவே ஓரிரு மைக்ரோச்டெப்சின் வேறுபாடு எண்ட்ச்டாப் தவறான செயல்களின் விளைவாக இருக்கலாம். ஒரு ச்டெப்பர் மின்னோடி 4 முழு படிகளின் அதிகரிப்புகளில் படிகளை மட்டுமே இழக்க முடியும். .

source: Why does Klipper report errors? I lost my print!
ru: Почему Klipper сообщает об ошибках? Я потерял печать!
ta: கிளிப்பர் ஏன் பிழைகள் என்று புகாரளிக்கிறது? நான் என் அச்சு இழந்தேன்!

source: Short answer: We want to know if our printers detect a problem so that the underlying issue can be fixed and we can obtain great quality prints. We definitely do not want our printers to silently produce low quality prints.
ru: Короткий ответ: Мы хотим знать, обнаруживают ли наши принтеры проблему, чтобы можно было устранить основную проблему и получить отпечатки отличного качества. Мы определенно не хотим, чтобы наши принтеры беззвучно выдавали отпечатки низкого качества.
ta: குறுகிய பதில்: எங்கள் அச்சுப்பொறிகள் ஒரு சிக்கலைக் கண்டறிந்தனவா என்பதை அறிய விரும்புகிறோம், இதனால் அடிப்படை சிக்கலை சரிசெய்ய முடியும், மேலும் சிறந்த தரமான அச்சிட்டுகளைப் பெறலாம். எங்கள் அச்சுப்பொறிகள் குறைந்த தரமான அச்சிட்டுகளை அமைதியாக உருவாக்குவதை நாங்கள் நிச்சயமாக விரும்பவில்லை.

source: Long answer: Klipper has been engineered to automatically workaround many transient problems. For example, it automatically detects communication errors and will retransmit; it schedules actions in advance and buffers commands at multiple layers to enable precise timing even with intermittent interference. However, should the software detect an error that it can not recover from, if it is commanded to take an invalid action, or if it detects it is hopelessly unable to perform its commanded task, then Klipper will report an error. In these situations there is a high risk of producing a low-quality print (or worse). It is hoped that alerting the user will empower them to fix the underlying issue and improve the overall quality of their prints.
ru: Длинный ответ: Klipper был спроектирован таким образом, чтобы автоматически обходить многие переходные проблемы. Например, он автоматически обнаруживает ошибки связи и осуществляет повторную передачу; он заранее планирует действия и буферизует команды на нескольких уровнях, чтобы обеспечить точную синхронизацию даже в условиях периодических помех. Однако если программа обнаружит ошибку, от которой она не может оправиться, если ей будет приказано выполнить недопустимое действие или если она обнаружит, что безнадежно не в состоянии выполнить поставленную задачу, Klipper сообщит об ошибке. В таких ситуациях высок риск получения некачественного отпечатка (или даже хуже). Мы надеемся, что предупреждение пользователя позволит ему устранить основную проблему и повысить общее качество отпечатков.
ta: நீண்ட பதில்: பல நிலையற்ற சிக்கல்களை தானாகவே செயல்படுத்த கிளிப்பர் வடிவமைக்கப்பட்டுள்ளது. எடுத்துக்காட்டாக, இது தானாகவே தகவல்தொடர்பு பிழைகளைக் கண்டறிந்து மீண்டும் அனுப்பும்; இது முன்கூட்டியே செயல்களைத் திட்டமிடுகிறது மற்றும் இடைப்பட்ட குறுக்கீட்டோடு கூட துல்லியமான நேரத்தை செயல்படுத்த பல அடுக்குகளில் கட்டளைகளை இடையகப்படுத்துகிறது. எவ்வாறாயினும், தவறான நடவடிக்கை எடுக்க கட்டளையிடப்பட்டால், அல்லது அதைக் கண்டறிந்தால், அதன் கட்டளையிடப்பட்ட பணியை நம்பிக்கையற்ற முறையில் செய்ய முடியாவிட்டால், அதை மீட்டெடுக்க முடியாத ஒரு பிழையை மென்பொருள் கண்டறிந்தால், கிளிப்பர் ஒரு பிழையைப் புகாரளிக்கும். இந்த சூழ்நிலைகளில் குறைந்த தரமான அச்சு (அல்லது மோசமானது) உருவாக்கும் அதிக இடர் உள்ளது. அடிப்படை சிக்கலை சரிசெய்யவும், அவற்றின் அச்சிட்டுகளின் ஒட்டுமொத்த தரத்தை மேம்படுத்தவும் பயனரை எச்சரிக்கை செய்வது அவர்களுக்கு அதிகாரம் அளிக்கும் என்று நம்பப்படுகிறது.

source: There are some related questions: Why doesn't Klipper pause the print instead? Report a warning instead? Check for errors before the print? Ignore errors in user typed commands? etc? Currently Klipper reads commands using the G-Code protocol, and unfortunately the G-Code command protocol is not flexible enough to make these alternatives practical today. There is developer interest in improving the user experience during abnormal events, but it is expected that will require notable infrastructure work (including a shift away from G-Code).
ru: Есть несколько сопутствующих вопросов: Почему Klipper не приостанавливает печать? Не выдает предупреждение? Проверить наличие ошибок перед печатью? Игнорировать ошибки в набранных пользователем командах и т. д.? В настоящее время Klipper считывает команды по протоколу G-Code, и, к сожалению, протокол команд G-Code недостаточно гибок, чтобы сделать эти альтернативы практичными на сегодняшний день. Разработчики заинтересованы в улучшении пользовательского опыта во время аномальных событий, но ожидается, что это потребует значительной работы над инфраструктурой (включая отказ от G-Code).
ta: தொடர்புடைய சில கேள்விகள் உள்ளன: அதற்கு பதிலாக கிளிப்பர் ஏன் அச்சிடலை இடைநிறுத்தவில்லை? அதற்கு பதிலாக ஒரு எச்சரிக்கையைப் புகாரளிக்கவா? அச்சிடுவதற்கு முன் பிழைகளை சரிபார்க்கவா? பயனர் தட்டச்சு செய்யப்பட்ட கட்டளைகளில் பிழைகளை புறக்கணிக்கவா? போன்றவை? தற்போது கிளிப்பர் சி-கோட் நெறிமுறையைப் பயன்படுத்தி கட்டளைகளைப் படிக்கிறார், துரதிர்ச்டவசமாக சி-குறியீட்டு கட்டளை நெறிமுறை இந்த மாற்றுகளை இன்று நடைமுறைப்படுத்துவதற்கு போதுமான நெகிழ்வானதாக இல்லை. அசாதாரண நிகழ்வுகளின் போது பயனர் அனுபவத்தை மேம்படுத்துவதில் உருவாக்குபவர் ஆர்வம் உள்ளது, ஆனால் இது குறிப்பிடத்தக்க உள்கட்டமைப்பு பணிகள் தேவைப்படும் என்று எதிர்பார்க்கப்படுகிறது (சி-குறியீட்டிலிருந்து விலகிச் செல்வது உட்பட).

source: How do I upgrade to the latest software?
ru: Как обновить программное обеспечение до последней версии?
ta: அண்மைக் கால மென்பொருளுக்கு எவ்வாறு மேம்படுத்துவது?

source: The first step to upgrading the software is to review the latest [config changes](Config_Changes.md) document. On occasion, changes are made to the software that require users to update their settings as part of a software upgrade. It is a good idea to review this document prior to upgrading.
ru: Первым шагом к обновлению программного обеспечения является просмотр последнего документа [config changes](Config_Changes.md). Иногда в программное обеспечение вносятся изменения, требующие от пользователей обновления настроек в рамках обновления программного обеспечения. Нелишним будет ознакомиться с этим документом перед обновлением.
ta: மென்பொருளை மேம்படுத்துவதற்கான முதல் படி அண்மைக் கால [கட்டமைப்பு மாற்றங்கள்] (config_changes.md) ஆவணத்தை மதிப்பாய்வு செய்வதாகும். சந்தர்ப்பத்தில், மென்பொருள் மேம்படுத்தலின் ஒரு பகுதியாக பயனர்கள் தங்கள் அமைப்புகளை புதுப்பிக்க வேண்டிய மென்பொருளில் மாற்றங்கள் செய்யப்படுகின்றன. மேம்படுத்துவதற்கு முன்பு இந்த ஆவணத்தை மதிப்பாய்வு செய்வது நல்லது.

source: When ready to upgrade, the general method is to ssh into the Raspberry Pi and run:
ru: Когда вы будете готовы к обновлению, как правило, нужно войти в Raspberry Pi по ssh и запустить программу:
ta: மேம்படுத்தத் தயாராக இருக்கும்போது, பொதுவான முறை ராச்பெர்ரி பை மற்றும் ரன் ஆகியவற்றில் பாஓடு ஆகும்:

source: Then one can recompile and flash the micro-controller code. For example:
ru: Затем можно перекомпилировать и прошить код микроконтроллера. Например:
ta: பின்னர் ஒருவர் மைக்ரோகண்ட்ரோலர் குறியீட்டை தொகுத்து ஒளிரச் செய்யலாம். உதாரணமாக:

source: However, it's often the case that only the host software changes. In this case, one can update and restart just the host software with:
ru: Однако часто бывает так, что меняется только программное обеспечение хоста. В этом случае можно обновить и перезапустить только хост-программу:
ta: இருப்பினும், புரவலன் மென்பொருள் மட்டுமே மாறுகிறது. இந்த வழக்கில், புரவலன் மென்பொருளைப் புதுப்பித்து மறுதொடக்கம் செய்யலாம்:

source: If after using this shortcut the software warns about needing to reflash the micro-controller or some other unusual error occurs, then follow the full upgrade steps outlined above.
ru: Если после использования этого ярлыка программа выдаст предупреждение о необходимости перепрошивки микроконтроллера или возникнет другая необычная ошибка, выполните все шаги по обновлению, описанные выше.
ta: இந்த குறுக்குவழியைப் பயன்படுத்திய பிறகு, மைக்ரோ-கன்ட்ரோலரை மறுசீரமைக்க வேண்டிய தேவை அல்லது வேறு சில அசாதாரண பிழை ஏற்பட்டால், மேலே குறிப்பிட்டுள்ள முழு மேம்படுத்தல் படிகளைப் பின்பற்றவும்.

source: If any errors persist then double check the [config changes](Config_Changes.md) document, as you may need to modify the printer configuration.
ru: Если ошибки сохраняются, проверьте документ [config changes](Config_Changes.md), так как вам может потребоваться изменить конфигурацию принтера.
ta: ஏதேனும் பிழைகள் தொடர்ந்தால், [கட்டமைப்பு மாற்றங்கள்] (config_changes.md) ஆவணத்தை இருமுறை சரிபார்க்கவும், ஏனெனில் நீங்கள் அச்சுப்பொறி உள்ளமைவை மாற்ற வேண்டியிருக்கும்.

source: Note that the RESTART and FIRMWARE_RESTART g-code commands do not load new software - the above "sudo service klipper restart" and "make flash" commands are needed for a software change to take effect.
ru: Обратите внимание, что команды g-кода RESTART и FIRMWARE_RESTART не загружают новое программное обеспечение - для того чтобы изменения в программном обеспечении вступили в силу, необходимо выполнить вышеуказанные команды "sudo service klipper restart" и "make flash".
ta: மறுதொடக்கம் மற்றும் ஃபார்ம்வேர்_ரெச்டார்ட் ஐயா -கோட் கட்டளைகள் புதிய மென்பொருளை ஏற்றாது என்பதை நினைவில் கொள்க - மேலே உள்ள "சூடோ பணி கிளிப்பர் மறுதொடக்கம்" மற்றும் "ஃப்ளாச் மேக்" கட்டளைகள் ஒரு மென்பொருள் மாற்றம் நடைமுறைக்கு வர வேண்டும்.

source: How do I uninstall Klipper?
ru: Как удалить Klipper?
ta: கிளிப்பரை எவ்வாறு நிறுவல் நீக்குவது?

source: On the firmware end, nothing special needs to happen. Just follow the flashing directions for the new firmware.
ru: Для прошивки ничего особенного делать не нужно. Просто следуйте инструкциям по прошивке новой прошивки.
ta: ஃபார்ம்வேர் முடிவில், சிறப்பு தேவையில்லை. புதிய ஃபார்ம்வேர்க்கான ஒளிரும் திசைகளைப் பின்பற்றவும்.

source: On the raspberry pi end, an uninstall script is available in [scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh). For example:
ru: На стороне raspberry pi сценарий удаления доступен в [scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh). Например:
ta: ராச்பெர்ரி பை முடிவில், ஒரு நிறுவல் நீக்குதல் ச்கிரிப்ட் [ச்கிரிப்ட்கள்/கிளிப்பர்-யூன்ச்டால். உதாரணமாக:

source: sudo service klipper stop make flash FLASH_DEVICE=/dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0 sudo service klipper start
ta: சூடோ பணி கிளிப்பர் நிறுத்தம் ஃப்ளாச் ஃப்ளாச்_டெவிச் =/dev/serial/by-id/USB-1A86_USB2.0-SERIAL-IF00-Port0 ஐ உருவாக்குங்கள் சூடோ பணி கிளிப்பர் தொடக்க

source: [mcu] serial: /dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0
ta: [MCU] சீரியல்: /dev/serial/by-id/usb-1a86_usb2.0-serial-if00-port0

source: [mcu] baud: 250000
ta: [MCU] பாட்: 250000

source: ~/klippy-env/bin/python ~/klipper/klippy/klippy.py ~/printer.cfg -l /tmp/klippy.log
ta: ~/Klippy -env/bin/python ~/klipper/klippy/klippy.py ~/printel.cfg -l /tmp/klippy.log

source: ~/klippy-env/bin/python ~/klipper/klippy/klippy.py ~/printer2.cfg -l /tmp/klippy2.log -I /tmp/printer2
ta: ~/Klippy -env/bin/python ~/klipper/klippy/klippy.py ~/prinatur2.cfg -l /tmp/klippy2.log -i/tmp/printer2

source: cd ~/klipper git pull ~/klipper/scripts/install-octopi.sh
ta: சிடி ~/கிளிப்பர் அறிவிலி இழுத்தல் ~/klipper/scripts/install-octopi.sh

source: make menuconfig make clean make sudo service klipper stop make flash FLASH_DEVICE=/dev/ttyACM0 sudo service klipper start
ta: மெனுகான்ஃபிக் செய்யுங்கள் சுத்தமாக செய்யுங்கள் உருவாக்கு சூடோ பணி கிளிப்பர் நிறுத்தம் ஃப்ளாச் ஃப்ளாச்_டெவிச் =/dev/ttyacm0 ஐ உருவாக்கவும் சூடோ பணி கிளிப்பர் தொடக்க

source: cd ~/klipper git pull sudo service klipper restart
ta: குறுவட்டு ~/கிளிஃப்ச் அறிவிலி இழுத்தல் சூடோ பணி வெட்டு மறுதொடக்கம்

source: sudo ~/klipper/scripts/klipper-uninstall.sh rm -rf ~/klippy-env ~/klipper
ta: sudo ~/mower/scripts/cliff-uninstall.sh Rm -rf ~/klippy -env ~/clips

source: Frequently Asked Questions
ru: Часто задаваемые вопросы
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

source: For running on the Beaglebone, see the [Beaglebone specific installation instructions](Beaglebone.md).
ru: Для запуска на Beaglebone см. инструкцию по установке [Beaglebone specific installation instructions](Beaglebone.md).
ta: பீகல்போனில் இயங்குவதற்கு, [பீகல்போன் குறிப்பிட்ட நிறுவல் வழிமுறைகள்] (BeagleBone.md) ஐப் பார்க்கவும்.

source: If using a Raspberry Pi, use a [good quality power supply](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) for the Raspberry Pi and use a [good quality USB cable](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) to connect that power supply to the Pi. If you get "under voltage" warnings from OctoPrint, this is related to the power supply and it must be fixed.
ru: Если вы используете Raspberry Pi, используйте [качественный блок питания](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) для Raspberry Pi и [качественный USB-кабель](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) для подключения этого блока питания к Pi. Если OctoPrint выдает предупреждение "пониженное напряжение", это связано с блоком питания и должно быть исправлено.
ta: ராச்பெர்ரி பை பயன்படுத்தினால், [நல்ல தரமான மின்சாரம்] (https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) ராச்பெர்ரி பை மற்றும் [நல்ல தரமான யூ.எச்.பி. கேபிள்] (https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) அந்த மின்சார விநியோகத்தை PI உடன் இணைக்க. ஆக்டோப்ரின்ட்டிலிருந்து "மின்னழுத்தத்தின் கீழ்" எச்சரிக்கைகளைப் பெற்றால், இது மின்சார விநியோகத்துடன் தொடர்புடையது, அது சரி செய்யப்பட வேண்டும்.

source: When I set `restart_method=command` my AVR device just hangs on a restart
ru: Когда я устанавливаю `restart_method=command`, мое устройство AVR просто зависает при перезапуске
ta: நான் `Restart_method = கட்டளை` அமைக்கும் போது எனது AVR சாதனம் மறுதொடக்கத்தில் தொங்குகிறது

source: Thank you for your support. See the [Sponsors page](Sponsors.md) for information.
ru: Благодарим вас за поддержку. Информацию смотрите на странице [Спонсоры](Sponsors.md).
ta: உங்கள் ஆதரவுக்கு நன்றி. தகவலுக்கு [ச்பான்சர்கள் பக்கம்] (spons.md) ஐப் பார்க்கவும்.
