Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/G-Codes.po
Languages: ta, zh_hans

source: `PALETTE_DISCONNECT`: This command disconnects from the Palette 2.
ta: `தட்டு_டிச்கோனெக்ட்`: இந்த கட்டளை தட்டு 2 இலிருந்து துண்டிக்கப்படுகிறது.
zh_hans: `PALETTE_DISCONNECT`：该命令断开与Palette 2的连接。

source: `PALETTE_CLEAR`: This command instructs the Palette 2 to clear all of the input and output paths of filament.
ta: `தட்டு_க்லியர்`: இழைகளின் உள்ளீடு மற்றும் வெளியீட்டு பாதைகள் அனைத்தையும் அழிக்க இந்த கட்டளை தட்டு 2 க்கு அறிவுறுத்துகிறது.
zh_hans: `PALETTE_CLEAR`:该命令指示 Palette 2 清除所有耗材的输入或者输出。

source: `PALETTE_CUT`: This command instructs the Palette 2 to cut the filament currently loaded in the splice core.
ta: `தட்டு_கட்`: இந்த கட்டளை தட்டு 2 ஐ ச்பைச் கோரில் ஏற்றப்பட்ட இழைகளை வெட்டுமாறு அறிவுறுத்துகிறது.
zh_hans: `PALETTE_CUT`:该命令指引Palette 2切割耗材并且装载分段的耗材。

source: `PALETTE_SMART_LOAD`: This command start the smart load sequence on the Palette 2. Filament is loaded automatically by extruding it the distance calibrated on the device for the printer, and instructs the Palette 2 once the loading has been completed. This command is the same as pressing **Smart Load** directly on the Palette 2 screen after the filament load is complete.
ta: `தட்டு_மார்ட்_லோட்`: இந்த கட்டளை தட்டில் அறிவுள்ள சுமை வரிசையைத் தொடங்குகிறது. இந்த கட்டளை ** அறிவுள்ள சுமை ** ஐ அழுத்துவது சமம், இழை சுமை முடிந்ததும் தட்டு 2 திரையில் நேரடியாக.
zh_hans: `PALETTE_SMART_LOAD`：该命令在Palette 2上启动智能加载序列。通过在设备上为打印机校准的距离挤压，自动加载耗材，并在加载完成后指示Palette 2。该命令与耗材加载完成后直接在Palette 2屏幕上按**Smart Load**相同。

source: Palette prints work by embedding special OCodes (Omega Codes) in the GCode file:
ta: GCODE கோப்பில் சிறப்பு OCODES (OMEGA குறியீடுகள்) உட்பொதிப்பதன் மூலம் தட்டு அச்சிட்டுகள் வேலை செய்கின்றன:
zh_hans: Palette打印通过在GCode文件中嵌入特殊的OCodes（Omega Codes）来工作。

source: `O1`...`O32`: These codes are read from the GCode stream and processed by this module and passed to the Palette 2 device.
ta: `O1` ...` O32`: இந்த குறியீடுகள் GCODE ச்ட்ரீமில் இருந்து படிக்கப்பட்டு இந்த தொகுதியால் செயலாக்கப்பட்டு தட்டு 2 சாதனத்திற்கு அனுப்பப்படுகின்றன.
zh_hans: `O1`...`O32`：这些代码从G-Code流中读出并且传递给Palette 2设备进行处理。

source: G-Codes
ta: சி-குறியீடுகள்

source: `Z_OFFSET_APPLY_ENDSTOP`: Take the current Z Gcode offset (aka, babystepping), and subtract it from the stepper_z endstop_position. This acts to take a frequently used babystepping value, and "make it permanent". Requires a `SAVE_CONFIG` to take effect.
ta: `Z_offset_apply_endstop`: தற்போதைய சட் gcode ஆஃப்செட்டை (அக்கா, பேபிச்டெப்பிங்) எடுத்து, அதை ச்டெப்பர்_இச் எண்ட்ச்டாப்_போசிசனில் இருந்து கழிக்கவும். இது அடிக்கடி பயன்படுத்தப்படும் பேபிச்டெப்பிங் மதிப்பை எடுக்கவும், "அதை நிரந்தரமாக்கவும்" செயல்படுகிறது. நடைமுறைக்கு வர `save_config` தேவை.

source: `Z_OFFSET_APPLY_PROBE`: Take the current Z Gcode offset (aka, babystepping), and subtract if from the probe's z_offset. This acts to take a frequently used babystepping value, and "make it permanent". Requires a `SAVE_CONFIG` to take effect.
ta: `Z_offset_apply_probe`: தற்போதைய சட் gcode ஆஃப்செட்டை (அக்கா, பேபிச்டெப்பிங்) எடுத்து, ஆய்வின் z_offset இலிருந்து கழிக்கவும். இது அடிக்கடி பயன்படுத்தப்படும் பேபிச்டெப்பிங் மதிப்பை எடுக்கவும், "அதை நிரந்தரமாக்கவும்" செயல்படுகிறது. நடைமுறைக்கு வர `save_config` தேவை.

source: `TUNING_TOWER COMMAND=<command> PARAMETER=<name> START=<value> [SKIP=<value>] [FACTOR=<value> [BAND=<value>]] | [STEP_DELTA=<value> STEP_HEIGHT=<value>]`: A tool for tuning a parameter on each Z height during a print. The tool will run the given `COMMAND` with the given `PARAMETER` assigned to a value that varies with `Z` according to a formula. Use `FACTOR` if you will use a ruler or calipers to measure the Z height of the optimum value, or `STEP_DELTA` and `STEP_HEIGHT` if the tuning tower model has bands of discrete values as is common with temperature towers. If `SKIP=<value>` is specified, the tuning process doesn't begin until Z height `<value>` is reached, and below that the value will be set to `START`; in this case, the `z_height` used in the formulas below is actually `max(z - skip, 0)`. There are three possible combinations of options:
ta: `Tuning_tower கட்டளை = <கட்டளை> அளவுரு = <amen> தொடங்கு = <value> [skip = <value>] [காரணி = <மதிப்பு> [band = <மதிப்பு>]] | . ஒரு சூத்திரத்தின்படி `Z` உடன் மாறுபடும் மதிப்புக்கு ஒதுக்கப்பட்ட` அளவுரு` உடன் கொடுக்கப்பட்ட `கட்டளை` கருவி இயக்கும். உகந்த மதிப்பின் சட் உயரத்தை அளவிட நீங்கள் ஒரு ஆட்சியாளர் அல்லது காலிப்பர்களைப் பயன்படுத்தினால் `காரணி` ஐப் பயன்படுத்தவும், அல்லது` Step_delta` மற்றும் `Step_height` ஆகியவற்றை வெப்பநிலை கோபுரங்களுடன் பொதுவானதாக இருக்கும் வகையில் தனித்துவமான மதிப்புகளின் பட்டைகள் இருந்தால். `Skip = <மதிப்பு>` குறிப்பிடப்பட்டால், சட் உயரம் `<மதிப்பு>` அடையும் வரை டியூனிங் செயல்முறை தொடங்காது, அதற்குக் கீழே மதிப்பு `தொடக்க` என அமைக்கப்படும்; இந்த வழக்கில், கீழே உள்ள சூத்திரங்களில் பயன்படுத்தப்படும் `Z_HEIGHT` உண்மையில்` அதிகபட்சம் (z - ச்கிப், 0) `. விருப்பங்களின் மூன்று சேர்க்கைகள் உள்ளன:

source: `ACCELEROMETER_MEASURE [CHIP=<config_name>] [NAME=<value>]`: Starts accelerometer measurements at the requested number of samples per second. If CHIP is not specified it defaults to "adxl345". The command works in a start-stop mode: when executed for the first time, it starts the measurements, next execution stops them. The results of measurements are written to a file named `/tmp/adxl345-<chip>-<name>.csv` where `<chip>` is the name of the accelerometer chip (`my_chip_name` from `[adxl345 my_chip_name]`) and `<name>` is the optional NAME parameter. If NAME is not specified it defaults to the current time in "YYYYMMDD_HHMMSS" format. If the accelerometer does not have a name in its config section (simply `[adxl345]`) then `<chip>` part of the name is not generated.
ta: `முடுக்கமானி_மேசர் [CHIP = <config_name>] [பெயர் = <மதிப்பு>]`: ஒரு நொடிக்கு கோரப்பட்ட எண்ணிக்கையில் முடுக்கமானி அளவீடுகளைத் தொடங்குகிறது. சிப் குறிப்பிடப்படவில்லை என்றால், அது "ADXL345" க்கு இயல்புநிலையாகும். கட்டளை ஒரு தொடக்க-நிறுத்த பயன்முறையில் செயல்படுகிறது: முதல் முறையாக செயல்படுத்தப்படும் போது, அது அளவீடுகளைத் தொடங்குகிறது, அடுத்த சாவுஒறுப்பு அவற்றைத் தடுக்கிறது. அளவீடுகளின் முடிவுகள் `/tmp/adxl345- <cip>-<sip> .csv` என்ற கோப்பில் எழுதப்பட்டுள்ளன, அங்கு` <iph> `என்பது முடுக்கமானி சிப்பின் பெயர் (` adxl345 my_chip_name] `இலிருந்து` my_chip_name` ) மற்றும் `<பெயர்>` என்பது விருப்ப பெயர் அளவுரு. பெயர் குறிப்பிடப்படாவிட்டால், அது தற்போதைய நேரத்திற்கு "yyyymmdd_hhmmss" வடிவத்தில் இயல்புநிலையாகிறது. முடுக்கமானி அதன் கட்டமைப்பு பிரிவில் ஒரு பெயர் இல்லையென்றால் (வெறுமனே `[adxl345]`) `<ipl>` பெயரின் ஒரு பகுதி உருவாக்கப்படவில்லை.
zh_hans: `ACCELEROMETER_MEASURE [CHIP=<config_name>] [NAME=<value>]` 。以要求的每秒采样数启动加速度计测量。如果没有指定CHIP，则默认为 "adxl345"。该命令以启动-停止模式工作：第一次执行时，它开始测量，下次执行时停止测量。测量结果被写入一个名为`/tmp/adxl345-<chip>-<name>的文件中。csv`，其中`<chip>`是加速度计芯片的名称（`my_chip_name`来自`[adxl345 my_chip_name]`），`<name>`是可选NAME参数。如果没有指定NAME，则默认为当前时间，格式为 "YYYMMDD_HHMMSS"。如果加速度计在其配置部分没有名称（只是`[adxl345]`），那么`<chip >`部分的名称就不会生成。

source: `ACCELEROMETER_QUERY [CHIP=<config_name>] [RATE=<value>]`: queries accelerometer for the current value. If CHIP is not specified it defaults to "adxl345". If RATE is not specified, the default value is used. This command is useful to test the connection to the ADXL345 accelerometer: one of the returned values should be a free-fall acceleration (+/- some noise of the chip).
ta: `முடுக்கமானி_க்யூரி [CHIP = <config_name>] [விகிதம் = <மதிப்பு>]`: தற்போதைய மதிப்புக்கு முடுக்கமான அளவிலான வினவல்கள். சிப் குறிப்பிடப்படவில்லை என்றால், அது "ADXL345" க்கு இயல்புநிலையாகும். விகிதம் குறிப்பிடப்படவில்லை என்றால், இயல்புநிலை மதிப்பு பயன்படுத்தப்படுகிறது. ADXL345 முடுக்கமானியுடன் இணைப்பைச் சோதிக்க இந்த கட்டளை பயனுள்ளதாக இருக்கும்: திரும்பிய மதிப்புகளில் ஒன்று இலவச-வீழ்ச்சி முடுக்கம் (+/- சிப்பின் சில சத்தம்) இருக்க வேண்டும்.
zh_hans: `ACCELEROMETER_QUERY [CHIP=<config_name>] [RATE=<value>]`: 查询加速度计的当前值。如果没有指定芯片，则默认为 "adxl345"。如果没有指定RATE，则使用默认值。该命令对于测试与ADXL345加速度计的连接非常有用：返回的数值之一应该是自由落体加速度（+/-芯片的一些噪声）。

source: `CALC_MEASURED_SKEW [AC=<ac_length>] [BD=<bd_length>] [AD=<ad_length>]`: Calculates and reports the skew (in radians and degrees) based on a measured print. This can be useful for determining the printer's current skew after correction has been applied. It may also be useful before correction is applied to determine if skew correction is necessary. See [Skew Correction](Skew_Correction.md) for details on skew calibration objects and measurements.
ta: . திருத்தம் பயன்படுத்தப்பட்ட பிறகு அச்சுப்பொறியின் தற்போதைய வளைவை தீர்மானிக்க இது பயனுள்ளதாக இருக்கும். வளைவு திருத்தம் அவசியமா என்பதை தீர்மானிக்க திருத்தம் பயன்படுத்தப்படுவதற்கு முன்பும் இது பயனுள்ளதாக இருக்கும். வளைவு அளவுத்திருத்த பொருள்கள் மற்றும் அளவீடுகள் பற்றிய விவரங்களுக்கு [SKEW திருத்தம்] (SKEW_CORRECTION.MD) ஐப் பார்க்கவும்.

source: `BED_MESH_OUTPUT PGP=[<0:1>]`: This command outputs the current probed z values and current mesh values to the terminal. If PGP=1 is specified the X, Y coordinates generated by bed_mesh, along with their associated indices, will be output to the terminal.
ta: `BED_MESH_OUTPUT PGP = [<0: 1>]`: இந்த கட்டளை தற்போதைய ஆய்வு செய்யப்பட்ட சட் மதிப்புகள் மற்றும் தற்போதைய கண்ணி மதிப்புகளை முனையத்திற்கு வெளியிடுகிறது. PGP = 1 ஃச் ஐக் குறிப்பிடினால், BED_MESH ஆல் உருவாக்கப்படும் ஒய் ஆயத்தொகுப்புகள், அவற்றுடன் தொடர்புடைய குறியீடுகளுடன், முனையத்திற்கு வெளியீடாக இருக்கும்.

source: Additional Commands
ta: கூடுதல் கட்டளைகள்

source: The following commands are available when an [adxl345 config section](Config_Reference.md#adxl345) is enabled.
ta: [ADXL345 கட்டமைப்பு பிரிவு] (config_reference.md#adxl345) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: ACCELEROMETER_QUERY
ta: முடுக்கமானி_ குவேரி

source: ACCELEROMETER_DEBUG_READ
ta: முடுக்கமானி_டெபக்_ரெட்

source: `ACCELEROMETER_DEBUG_READ [CHIP=<config_name>] REG=<register>`: queries ADXL345 register "register" (e.g. 44 or 0x2C). Can be useful for debugging purposes.
ta: `முடுக்கமானி_டெபக்_ரெட் [CHIP = <config_name>] reg = <பதிவு>`: வினவல்கள் ADXL345 பதிவு "பதிவு" (எ.கா. 44 அல்லது 0x2C). பிழைத்திருத்த நோக்கங்களுக்காக பயனுள்ளதாக இருக்கும்.

source: ACCELEROMETER_DEBUG_WRITE
ta: முடுக்கமானி_டெபக்_ரைட்

source: `ACCELEROMETER_DEBUG_WRITE [CHIP=<config_name>] REG=<register> VAL=<value>`: Writes raw "value" into a register "register". Both "value" and "register" can be a decimal or a hexadecimal integer. Use with care, and refer to ADXL345 data sheet for the reference.
ta: `முடுக்கமானி_டெபக்_ரைட் [CHIP = <config_name>] reg = <பதிவு> VAL = <மதிப்பு>`: மூல "மதிப்பு" ஒரு பதிவேட்டில் "பதிவு" என்று எழுதுகிறார். "மதிப்பு" மற்றும் "பதிவு" இரண்டும் ஒரு தசம அல்லது எக்சாடெசிமல் முழு எண்ணாக இருக்கலாம். கவனத்துடன் பயன்படுத்தவும், குறிப்புக்கு ADXL345 தரவு தாளைப் பார்க்கவும்.

source: The following commands are available when the [bed_mesh config section](Config_Reference.md#bed_mesh) is enabled (also see the [bed mesh guide](Bed_Mesh.md)).
ta: [BED_MESH கட்டமைப்பு பிரிவு] (config_reference.md#bed_mesh) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும் ([படுக்கை கண்ணி வழிகாட்டி] (Bed_mesh.md) ஐயும் பார்க்கவும்).

source: `BED_MESH_PROFILE LOAD=<name> SAVE=<name> REMOVE=<name>`: This command provides profile management for mesh state. LOAD will restore the mesh state from the profile matching the supplied name. SAVE will save the current mesh state to a profile matching the supplied name. Remove will delete the profile matching the supplied name from persistent memory. Note that after SAVE or REMOVE operations have been run the SAVE_CONFIG gcode must be run to make the changes to persistent memory permanent.
ta: `Bed_mesh_profile load = <amen> சேமி = <name> reyed = <amen>`: இந்த கட்டளை மெச் நிலைக்கு சுயவிவர நிர்வாகத்தை வழங்குகிறது. வழங்கப்பட்ட பெயருடன் பொருந்தக்கூடிய சுயவிவரத்திலிருந்து சுமை கண்ணி நிலையை மீட்டெடுக்கும். சேமிப்பு தற்போதைய மெச் நிலையை வழங்கப்பட்ட பெயருடன் பொருந்தக்கூடிய சுயவிவரத்திற்கு சேமிக்கும். தொடர்ச்சியான நினைவகத்திலிருந்து வழங்கப்பட்ட பெயருடன் பொருந்தக்கூடிய சுயவிவரத்தை அகற்று நீக்கிவிடும். சேமிப்பு அல்லது அகற்றப்பட்ட செயல்பாடுகள் இயக்கப்பட்ட பிறகு, தொடர்ச்சியான நினைவகத்திற்கான மாற்றங்களை நிரந்தரமாக்குவதற்கு Save_config Gcode இயக்க வேண்டும் என்பதை நினைவில் கொள்க.

source: The following commands are available when the [bed_screws config section](Config_Reference.md#bed_screws) is enabled (also see the [manual level guide](Manual_Level.md#adjusting-bed-leveling-screws)).
ta: [BED_SCREWS கட்டமைப்பு பிரிவு] (config_reference.md#bed_screws) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளைகள் கிடைக்கின்றன ([கையேடு நிலை வழிகாட்டி] (கையேடு_லெவல்.

source: The following commands are available when the [bed_tilt config section](Config_Reference.md#bed_tilt) is enabled.
ta: [Bed_tilt கட்டமைப்பு பிரிவு] (config_reference.md#bed_tilt) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: The following command is available when a [bltouch config section](Config_Reference.md#bltouch) is enabled (also see the [BL-Touch guide](BLTouch.md)).
ta: [Bltouch கட்டமைப்பு பிரிவு] (config_reference.md#bltouch) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளை கிடைக்கும் ([Bl-touch வழிகாட்டி] (bltouch.md) ஐயும் பார்க்கவும்).

source: `BLTOUCH_DEBUG COMMAND=<command>`: This sends a command to the BLTouch. It may be useful for debugging. Available commands are: `pin_down`, `touch_mode`, `pin_up`, `self_test`, `reset`. A BL-Touch V3.0 or V3.1 may also support `set_5V_output_mode`, `set_OD_output_mode`, `output_mode_store` commands.
ta: `Bltouch_debug கட்டளை = <கட்டளை>`: இது ஒரு கட்டளையை bltouch க்கு அனுப்புகிறது. பிழைத்திருத்தத்திற்கு இது பயனுள்ளதாக இருக்கும். கிடைக்கக்கூடிய கட்டளைகள்: `பின்_டவுன்`,` டச்_மோட்`, `பின்_பூப்`,` சுய_டெச்ட்`, `மீட்டமை`. ஒரு bl-touch v3.0 அல்லது v3.1 `set_5v_output_mode`,` set_od_output_mode`, `output_mode_store` கட்டளைகளையும் ஆதரிக்கலாம்.

source: [configfile]
ta: [கட்டமைப்பு]

source: The configfile module is automatically loaded.
ta: கட்டமைப்பு தொகுதி தானாக ஏற்றப்படும்.

source: The following command is enabled if a [delayed_gcode config section](Config_Reference.md#delayed_gcode) has been enabled (also see the [template guide](Command_Templates.md#delayed-gcodes)).
ta: ஒரு [தாமதமான_சி கோட் கட்டமைப்பு பிரிவு] (config_reference.md#dealed_gcode) இயக்கப்பட்டிருந்தால் பின்வரும் கட்டளை இயக்கப்பட்டது ([வார்ப்புரு வழிகாட்டி] (Command_templates.md#தாமதமான-GCODES) ஐப் பார்க்கவும்).

source: [delta_calibrate]
ta: [டெல்டா_கலிப்ரேட்]

source: The following commands are available when the [delta_calibrate config section](Config_Reference.md#linear-delta-kinematics) is enabled (also see the [delta calibrate guide](Delta_Calibrate.md)).
ta: [Delta_calibrate கட்டமைப்பு பிரிவு] (config_reference.md#லீனியர்-டெல்டா-கினாடிக்ச்) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளைகள் கிடைக்கின்றன ([டெல்டா அளவீடு வழிகாட்டி] (டெல்டா_கலிபிரேட். எம்.டி) ஐயும் பார்க்கவும்).

source: The following command is available when a [display config section](Config_Reference.md#gcode_macro) is enabled.
ta: [காட்சி கட்டமைப்பு பிரிவு] (config_reference.md#gcode_macro) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: [display_status]
ta: [டிச்ப்ளே_ச்டேட்டச்]

source: The display_status module is automatically loaded if a [display config section](Config_Reference.md#display) is enabled. It provides the following standard G-Code commands:
ta: [காட்சி கட்டமைப்பு பிரிவு] (config_reference.md#காட்சி) இயக்கப்பட்டிருந்தால் காட்சி_ச்டேட்டச் தொகுதி தானாக ஏற்றப்படும். இது பின்வரும் நிலையான சி-குறியீடு கட்டளைகளை வழங்குகிறது:

source: The following command is available when the [dual_carriage config section](Config_Reference.md#dual_carriage) is enabled.
ta: [Buyal_carriage கட்டமைப்பு பிரிவு] (config_reference.md#dual_carriage) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: The following commands are available when an [endstop_phase config section](Config_Reference.md#endstop_phase) is enabled (also see the [endstop phase guide](Endstop_Phase.md)).
ta: [EndStop_Phase கட்டமைப்பு பிரிவு] (config_reference.md#endstop_phase) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும் ([எண்ட்ச்டாப் கட்ட வழிகாட்டி] (endstop_phase.md) ஐப் பார்க்கவும்).

source: [extruder]
ta: [எக்ச்ட்ரூடர்]

source: The following commands are available if an [extruder config section](Config_Reference.md#extruder) is enabled:
ta: [எக்ச்ட்ரூடர் கட்டமைப்பு பிரிவு] (config_reference.md#extruder) இயக்கப்பட்டிருந்தால் பின்வரும் கட்டளைகள் கிடைக்கும்:

source: The following command is available when a [fan_generic config section](Config_Reference.md#fan_generic) is enabled.
ta: [Fan_generic கட்டமைப்பு பிரிவு] (config_reference.md#fan_generic) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: `SET_FAN_SPEED FAN=config_name SPEED=<speed>` This command sets the speed of a fan. "speed" must be between 0.0 and 1.0.
ta: `Set_fan_speed fan = config_name விரைவு = <weotive>` இந்த கட்டளை விசிறியின் வேகத்தை அமைக்கிறது. "விரைவு" 0.0 முதல் 1.0 வரை இருக்க வேண்டும்.

source: The following standard G-Code commands are available when the [firmware_retraction config section](Config_Reference.md#firmware_retraction) is enabled. These commands allow you to utilize the firmware retraction feature available in many slicers, to reduce stringing during non-extrusion moves from one part of the print to another. Appropriately configuring pressure advance reduces the length of retraction required.
ta: [Firmware_retraction கட்டமைப்பு பிரிவு] (config_reference.md#firmware_retraction) இயக்கப்பட்டால் பின்வரும் நிலையான சி-குறியீடு கட்டளைகள் கிடைக்கின்றன. இந்த கட்டளைகள் பல ச்லைசர்களில் கிடைக்கும் ஃபார்ம்வேர் திரும்பப் பெறுதல் அம்சத்தைப் பயன்படுத்த அனுமதிக்கின்றன, அச்சுப்பொறியின் ஒரு பகுதியிலிருந்து இன்னொரு பகுதிக்கு வெளியேற்றப்படாத நகர்வுகளின் போது சரம் குறைக்க. அழுத்தம் முன்கூட்டியே சரியான முறையில் கட்டமைப்பது தேவையான பின்வாங்கலின் நீளத்தைக் குறைக்கிறது.

source: The following additional commands are also available.
ta: பின்வரும் கூடுதல் கட்டளைகளும் கிடைக்கின்றன.

source: The following command is available when a [filament_switch_sensor](Config_Reference.md#filament_switch_sensor) or [filament_motion_sensor](Config_Reference.md#filament_motion_sensor) config section is enabled.
ta: ஒரு [Filament_switch_sensor] (config_reference.md#filemament_switch_sensor) அல்லது [Filament_motion_sensor] (config_reference.md#filemation_motion_sensor) கட்டமைப்பு பிரிவு இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளை கிடைக்கும்.

source: `QUERY_FILAMENT_SENSOR SENSOR=<sensor_name>`: Queries the current status of the filament sensor. The data displayed on the terminal will depend on the sensor type defined in the configuration.
ta: `Query_filament_sensor உணரி = <sensor_name>`: இழை சென்சாரின் தற்போதைய நிலையை வினவுகிறது. முனையத்தில் காட்டப்படும் தரவு உள்ளமைவில் வரையறுக்கப்பட்ட சென்சார் வகையைப் பொறுத்தது.

source: FORCE_MOVE
ta: Forse_move

source: The gcode module is automatically loaded.
ta: GCODE தொகுதி தானாக ஏற்றப்படும்.

source: RESTART
ta: மறுதொடக்கம்

source: STATUS
ta: நிலை

source: HELP
ta: உதவி

source: The following command is available when a [gcode_macro config section](Config_Reference.md#gcode_macro) is enabled (also see the [command templates guide](Command_Templates.md)).
ta: [Gcode_macro கட்டமைப்பு பிரிவு] (config_reference.md#gcode_macro) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளை கிடைக்கும் ([கட்டளை வார்ப்புருக்கள் வழிகாட்டி] (Command_templates.md) ஐப் பார்க்கவும்).

source: The gcode_move module is automatically loaded.
ta: GCODE_MOVE தொகுதி தானாக ஏற்றப்படும்.

source: The following commands are available when the [tsl1401cl filament width sensor config section](Config_Reference.md#tsl1401cl_filament_width_sensor) or [hall filament width sensor config section](Config_Reference.md#hall_filament_width_sensor) is enabled (also see [TSLl401CL Filament Width Sensor](TSL1401CL_Filament_Width_Sensor.md) and [Hall Filament Width Sensor](Hall_Filament_Width_Sensor.md)):
ta: [TSL1401CL FILECT WIDTH உணரி கட்டமைப்பு பிரிவு] (config_reference.md#tsl1401cl_filament_width_sensor) அல்லது [ஆல் ஃபிலேமென்ட் அகல சென்சார் கட்டமைப்பு பிரிவு] (config_reference.md#hall_filament_width_salthalthalth) போது பின்வரும் கட்டளைகள் கிடைக்கின்றன. TSL1401CL_FILAMENT_WIDTH_SENSOR.MD) மற்றும் [ஆல் ஃபிலிமென்ட் அகல சென்சார்] (ஆல்_பிலமென்ட்_விட்_சென்சர்.மிடி)):

source: `QUERY_FILAMENT_WIDTH`: Return the current measured filament width.
ta: `Query_filament_width`: தற்போதைய அளவிடப்பட்ட இழை அகலத்தைத் திருப்பி விடுங்கள்.

source: `RESET_FILAMENT_WIDTH_SENSOR`: Clear all sensor readings. Helpful after filament change.
ta: `மீட்டமை_பிலமென்ட்_விட்_சென்சர்`: அனைத்து சென்சார் வாசிப்புகளையும் அழிக்கவும். இழை மாற்றத்திற்குப் பிறகு உதவியாக இருக்கும்.

source: DISABLE_FILAMENT_WIDTH_SENSOR
ta: முடக்கு_பிலமென்ட்_விட்_சென்சர்

source: `DISABLE_FILAMENT_WIDTH_SENSOR`: Turn off the filament width sensor and stop using it for flow control.
ta: `முடக்கு_பிலமென்ட்_விட்_சென்சர்`: இழை அகல சென்சாரை அணைத்து, ஓட்டக் கட்டுப்பாட்டுக்கு அதைப் பயன்படுத்துவதை நிறுத்துங்கள்.

source: `ENABLE_FILAMENT_WIDTH_SENSOR`: Turn on the filament width sensor and start using it for flow control.
ta: `Enable_filament_width_sensor`: இழை அகல சென்சாரை இயக்கி, ஓட்டக் கட்டுப்பாட்டுக்கு அதைப் பயன்படுத்தத் தொடங்குங்கள்.

source: `QUERY_RAW_FILAMENT_WIDTH`: Return the current ADC channel readings and RAW sensor value for calibration points.
ta: `Query_raw_filament_width`: அளவுத்திருத்த புள்ளிகளுக்கான தற்போதைய ADC சேனல் அளவீடுகள் மற்றும் மூல சென்சார் மதிப்பைத் தரவும்.

source: `ENABLE_FILAMENT_WIDTH_LOG`: Turn on diameter logging.
ta: `Enable_filament_width_log`: விட்டம் பதிவை இயக்கவும்.

source: DISABLE_FILAMENT_WIDTH_LOG
ta: முடக்கு_பிலமென்ட்_விட்_லாக்

source: `DISABLE_FILAMENT_WIDTH_LOG`: Turn off diameter logging.
ta: `முடக்கு_பிலமென்ட்_விட்_லாக்`: விட்டம் பதிவை அணைக்கவும்.

source: [heaters]
ta: [ஈட்டர்கள்]

source: The heaters module is automatically loaded if a heater is defined in the config file.
ta: கட்டமைப்பு கோப்பில் ஒரு ஈட்டர் வரையறுக்கப்பட்டால் ஈட்டர்கள் தொகுதி தானாக ஏற்றப்படும்.

source: TEMPERATURE_WAIT
ta: வெப்பநிலை_ வெயிட்

source: The idle_timeout module is automatically loaded.
ta: Idle_timeout தொகுதி தானாக ஏற்றப்படும்.

source: The following command is enabled if an [input_shaper config section](Config_Reference.md#input_shaper) has been enabled (also see the [resonance compensation guide](Resonance_Compensation.md)).
ta: [Input_shaper கட்டமைப்பு பிரிவு] (config_reference.md#input_shaper) இயக்கப்பட்டிருந்தால் பின்வரும் கட்டளை இயக்கப்பட்டது ([அதிர்வு இழப்பீட்டு வழிகாட்டி] (அதிர்வு_பென்சேசன்.மிடி) ஐப் பார்க்கவும்).

source: [manual_probe]
ta: [கையேடு_ப்ரோப்]

source: The manual_probe module is automatically loaded.
ta: கையேடு_பிரோப் தொகுதி தானாக ஏற்றப்படும்.

source: MANUAL_PROBE
ta: கையேடு_ப்ரோப்

source: The following command is available when a [manual_stepper config section](Config_Reference.md#manual_stepper) is enabled.
ta: [கையேடு_ச்டெப்பர் கட்டமைப்பு பிரிவு] (config_reference.md#manual_stepper) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: MANUAL_STEPPER
ta: கையேடு_ச்டெப்பர்

source: The following command is available when an [output_pin config section](Config_Reference.md#output_pin) is enabled.
ta: [வெளியீடு_பின் கட்டமைப்பு பிரிவு] (config_reference.md#output_pin) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: The following commands are available when the [palette2 config section](Config_Reference.md#palette2) is enabled.
ta: [தட்டு 2 கட்டமைப்பு பிரிவு] (config_reference.md#plate2) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: PALETTE_CONNECT
ta: தட்டு_கனெக்ட்

source: PALETTE_DISCONNECT
ta: தட்டு_டிச்கனெக்ட்

source: PALETTE_CLEAR
ta: தட்டு_ கிளையர்

source: PALETTE_CUT
ta: தட்டு_கட்

source: PALETTE_SMART_LOAD
ta: தட்டு_மார்ட்_லோட்

source: The pid_calibrate module is automatically loaded if a heater is defined in the config file.
ta: கட்டமைப்பு கோப்பில் ஒரு ஈட்டர் வரையறுக்கப்பட்டால் PID_Calibrate தொகுதி தானாக ஏற்றப்படும்.

source: PAUSE
ta: இடைநிறுத்தம்

source: RESUME
ta: மீண்டும் தொடங்குங்கள்

source: CANCEL_PRINT
ta: Reancel_print
