Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/G-Codes.po
Languages: ta, zh_hans

source: `BED_MESH_PROFILE LOAD=<name> SAVE=<name> REMOVE=<name>`: This command provides profile management for mesh state. LOAD will restore the mesh state from the profile matching the supplied name. SAVE will save the current mesh state to a profile matching the supplied name. Remove will delete the profile matching the supplied name from persistent memory. Note that after SAVE or REMOVE operations have been run the SAVE_CONFIG gcode must be run to make the changes to peristent memory permanent.
zh_hans: `BED_MESH_PROFILE LOAD=<name> SAVE=<name> REMOVE=<name>`：此命令提供网格状态的配置文件管理。LOAD 将从与所提供名称匹配的配置文件中恢复网格状态。SAVE 会将当前的网格状态保存到与所提供的名称相符的配置文件中。Remove（删除）将从持久性内存中删除与所提供名称相匹配的配置文件。请注意，在SAVE或REMOVE操作后，必须运行SAVE_CONFIG gcode，以便永久更改。

source: `BED_MESH_OFFSET [X=<value>] [Y=<value>]`: Applies X and/or Y offsets to the mesh lookup. This is useful for printers with independent extruders, as an offset is necessary to produce correct Z adjustment after a tool change.
zh_hans: `BED_MESH_OFFSET [X=<value>] [Y=<value>]`。将X和/或Y的偏移量应用于网格查找。这对具有多个独立挤出头的打印机很有用，因为偏移量对切换工具头后产生正确的 Z 值调整是至关重要的。

source: Bed Screws Helper
zh_hans: 打印床螺丝助手

source: Bed Screws Tilt Adjust Helper
zh_hans: 打印床螺丝倾斜调整助手

source: Dual Carriages
zh_hans: 双滑车

source: `SET_DUAL_CARRIAGE CARRIAGE=[0|1]`: This command will set the active carriage. It is typically invoked from the activate_gcode and deactivate_gcode fields in a multiple extruder configuration.
zh_hans: `SET_DUAL_CARRIAGE CARRIAGE=[0|1]`:该命令将设置活动的滑块。它通常是在一个多挤出机配置中从 activate_gcode和deactivate_gcode字段调用。

source: `DUMP_TMC STEPPER=<name>`: This command will read the TMC driver registers and report their values.
zh_hans: `DUMP_TMC STEPPER=<name>`。该命令将读取TMC驱动寄存器并报告其值。

source: `INIT_TMC STEPPER=<name>`: This command will intitialize the TMC registers. Needed to re-enable the driver if power to the chip is turned off then back on.
zh_hans: `INIT_TMC STEPPER=<name>`：该命令将初始化TMC寄存器。如果芯片的电源被关闭然后又被打开，需要重新启用驱动程序。

source: Endstop adjustments by stepper phase
zh_hans: 通过步进相位进行限位调整

source: SDcard loop
zh_hans: SD卡循环

source: `SDCARD_LOOP_BEGIN COUNT=<count>`: Begin a looped section in the SD print. A count of 0 indicates that the section should be looped indefinately.
zh_hans: `SDCARD_LOOP_BEGIN COUNT=<count>`：在SD打印中开始一个循环的部分。计数为0表示该部分应无限期地循环。

source: Send message (respond) to host
zh_hans: 向主机发送消息（回复）

source: Pause Resume
zh_hans: 暂停与恢复

source: Filament Sensor
zh_hans: 耗材传感器

source: `QUERY_FILAMENT_SENSOR SENSOR=<sensor_name>`: Queries the current status of the filament sensor. The data displayed on the terminal will depend on the sensor type defined in the confguration.
zh_hans: `QUERY_FILAMENT_SENSOR SENSOR=<sensor_name>`。查询耗材传感器的当前状态。终端上显示的数据将取决于配置中定义的传感器类型。

source: Firmware Retraction
zh_hans: 固件回抽

source: `CALC_MEASURED_SKEW [AC=<ac_length>] [BD=<bd_length>] [AD=<ad_length>]`: Calculates and reports the skew (in radians and degrees) based on a measured print. This can be useful for determining the printer's current skew after correction has been applied. It may also be useful before correction is applied to determine if skew correction is necessary. See skew_correction.md for details on skew calibration objects and measurements.
zh_hans: `CALC_MEASURED_SKEW [AC=<ac_length>] [BD=<bd_length>] [AD=<ad_length>]`：根据测量的打印并计算斜度（以弧度和度为单位）。这对确定应用校正后打印机的当前偏斜很有用。在应用校正之前，它也可以用来确定是否需要进行偏斜校正。关于斜度校准对象和测量的详细信息，请参见skew_correction.md。

source: Delayed GCode
zh_hans: 延迟 GCode

source: Save Variables
zh_hans: 保存变量

source: Resonance compensation
zh_hans: 共振补偿

source: Adxl345 Accelerometer Commands
zh_hans: Adxl345 加速度传感器命令

source: Resonance Testing Commands
zh_hans: 共振测试命令

source: Palette 2 Commands
zh_hans: Palette 2 命令

source: `SCREWS_TILT_CALCULATE [DIRECTION=CW|CCW] [<probe_parameter>=<value>]`: This command will invoke the bed screws adjustment tool. It will command the nozzle to different locations (as defined in the config file) probing the z height and calculate the number of knob turns to adjust the bed level. If DIRECTION is specified, the knob turns will all be in the same direction, clockwise (CW) or counterclockwise (CCW). See the PROBE command for details on the optional probe parameters. IMPORTANT: You MUST always do a G28 before using this command.
zh_hans: `SCREWS_TILT_CALCULATE [DIRECTION=CW|CCW] [<probe_parameter>=<value>]`：该命令将调用热床丝杆调整工具。它将命令喷嘴到不同的位置（如配置文件中定义的）探测z高度，并计算出调整床面水平的旋钮旋转次数。如果指定了DIRECTION，旋钮的转动方向都是一样的，顺时针（CW）或逆时针（CCW）。有关可选探头参数的详细信息，请参见PROBE命令。重要的是：在使用这个命令之前，你必须先做一个G28。

source: `FACTOR`: The value changes at a rate of `factor` per millimeter. The formula used is `value = start + factor * z_height`. You can plug the optimum Z height directly into the formula to determine the optimum parameter value.
zh_hans: `FACTOR`：值以每毫米`factor` 的速度变化。使用的公式是`value = start + factor * z_height`。你可以把最佳的Z高度直接插入公式中，以确定最佳的参数值。

source: `FACTOR` and `BAND`: The value changes at an average rate of `factor` per millimeter, but in discrete bands where the adjustment will only be made every `BAND` millimeters of Z height. The formula used is `value = start + factor * ((floor(z_height / band) + .5) * band)`.
zh_hans: `FACTOR`和`BAND`：值以每毫米`factor`的平均速度变化，但在离散的带子中，每隔`BAND`毫米的Z高度才会进行调整。使用的公式是 `value = start + factor * ((floor(z_height / band) + .5) * band)`。

source: `ACCELEROMETER_DEBUG_READ [CHIP=<config_name>] REG=<register>`: queries ADXL345 register <register> (e.g. 44 or 0x2C). Can be useful for debugging purposes.
zh_hans: `ACCELEROMETER_DEBUG_READ [CHIP=<config_name>] REG=<register>`：查询ADXL345寄存器<register>（例如44或0x2C）。对于调试来说是很有用的。

source: `ACCELEROMETER_DEBUG_WRITE [CHIP=<config_name>] REG=<reg> VAL=<value>`: writes raw <value> into a register <register>. Both <value> and <register> can be a decimal or a hexadecimal integer. Use with care, and refer to ADXL345 data sheet for the reference.
zh_hans: `ACCELEROMETER_DEBUG_WRITE [CHIP=<config_name>] REG=<reg> VAL=<value>`：将原始<value>写入寄存器<register>中。<value>和<register>都可以是一个十进制或十六进制的整数。使用时要注意，参考ADXL345数据表。
