Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/G-Codes.po
Languages: ta, zh_hans

source: This document describes the commands that Klipper supports. These are commands that one may enter into the OctoPrint terminal tab.
ta: இந்த ஆவணம் கிளிப்பர் ஆதரிக்கும் கட்டளைகளை விவரிக்கிறது. இவை ஆக்டோப்ரிண்ட் முனைய தாவலில் ஒருவர் நுழையக்கூடிய கட்டளைகள்.

source: G-Code commands
ta: சி-கோட் கட்டளைகள்
zh_hans: G代码命令

source: Klipper supports the following standard G-Code commands:
ta: கிளிப்பர் பின்வரும் நிலையான சி-குறியீட்டு கட்டளைகளை ஆதரிக்கிறது:
zh_hans: Klipper支持以下标准的G-Code命令：

source: Move (G0 or G1): `G1 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<speed>]`
ta: நகர்த்து (G0 அல்லது G1): `G1 [x <pos>] [y <pos>] [z <pos>] [e <pos>] [f <speed>]`
zh_hans: 移动 (G0 or G1): `G1 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<speed>]`

source: Dwell: `G4 P<milliseconds>`
ta: வசிக்கும்: `சி 4 பி <மில்லி விநாடிகள்>`
zh_hans: 停留时间：`G4 P<milliseconds>`

source: Move to origin: `G28 [X] [Y] [Z]`
ta: தோற்றத்திற்கு நகர்த்தவும்: `சி 28 [x] [y] [z]`
zh_hans: 返回原点：`G28 [X] [Y] [Z]`

source: Turn off motors: `M18` or `M84`
ta: மோட்டார்கள் அணைக்க: `M18` அல்லது` M84`

source: Wait for current moves to finish: `M400`
ta: தற்போதைய நகர்வுகள் முடிவடையும் வரை காத்திருங்கள்: `M400`

source: Use absolute/relative distances for extrusion: `M82`, `M83`
ta: வெளியேற்றத்திற்கு முழுமையான/உறவினர் தூரங்களைப் பயன்படுத்தவும்: `M82`,` M83`

source: Use absolute/relative coordinates: `G90`, `G91`
ta: முழுமையான/உறவினர் ஒருங்கிணைப்புகளைப் பயன்படுத்தவும்: `G90`,` G91`

source: Set position: `G92 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>]`
ta: நிலையை அமைக்கவும்: `G92 [x <pos>] [y <pos>] [z <pos>] [e <pos>]`

source: Set speed factor override percentage: `M220 S<percent>`
ta: வேக காரணி மீறல் சதவீதத்தை அமைக்கவும்: `M220 S <சதவீதம்>`

source: Set extrude factor override percentage: `M221 S<percent>`
ta: எக்ச்ட்ரூட் காரணி மீறல் சதவீதத்தை அமைக்கவும்: `M221 S <சதவீதம்>`
zh_hans: 设置挤压因子覆盖百分比：`M221 S<percent>`

source: Set acceleration: `M204 S<value>` OR `M204 P<value> T<value>`
ta: முடுக்கம் அமைக்கவும்: `M204 S <மதிப்பு>` அல்லது `M204 P <மதிப்பு> T <மதிப்பு>`
zh_hans: 设置加速度：`M204 S<value>` 或 `M204 P<value> T<value>`

source: Note: If S is not specified and both P and T are specified, then the acceleration is set to the minimum of P and T. If only one of P or T is specified, the command has no effect.
ta: குறிப்பு: எச் குறிப்பிடப்படவில்லை மற்றும் பி மற்றும் டி இரண்டும் குறிப்பிடப்பட்டால், முடுக்கம் குறைந்தபட்ச பி மற்றும் டி என அமைக்கப்படுகிறது. பி அல்லது டி ஒன்று மட்டுமே குறிப்பிடப்பட்டால், கட்டளை எந்த விளைவையும் ஏற்படுத்தாது.
zh_hans: 注意：如果没有指定S，同时指定了P和T，那么加速度将被设置为P和T中的最小值。

source: Get extruder temperature: `M105`
ta: எக்ச்ட்ரூடர் வெப்பநிலையைப் பெறுங்கள்: `M105`
zh_hans: 获取挤出机温度：`M105`

source: Set extruder temperature: `M104 [T<index>] [S<temperature>]`
ta: எக்ச்ட்ரூடர் வெப்பநிலையை அமைக்கவும்: `M104 [T <endex>] [S <வெப்பநிலை>]`
zh_hans: 设置挤出机温度：`M104 [T<index>] [S<temperature>]`

source: Set extruder temperature and wait: `M109 [T<index>] S<temperature>`
ta: எக்ச்ட்ரூடர் வெப்பநிலையை அமைத்து காத்திருங்கள்: `M109 [T <endex>] கள் <வெப்பநிலை>`
zh_hans: 设置挤出机温度并等待：`M109 [T<index>] S<temperature>`。

source: Note: M109 always waits for temperature to settle at requested value
ta: குறிப்பு: M109 எப்போதும் கோரப்பட்ட மதிப்பில் வெப்பநிலை குடியேறக் காத்திருக்கிறது
zh_hans: 注意：M109总是等待温度稳定在请求的数值上。

source: Set bed temperature: `M140 [S<temperature>]`
ta: படுக்கை வெப்பநிலையை அமைக்கவும்: `M140 [S <வெப்பநிலை>]`
zh_hans: 设置热床温度：`M140 [S<temperature>]`

source: Set bed temperature and wait: `M190 S<temperature>`
ta: படுக்கை வெப்பநிலையை அமைத்து காத்திருங்கள்: `M190 S <வெப்பநிலை>`
zh_hans: 设置热床温度并且等待：`M190 S<temperature>`

source: Note: M190 always waits for temperature to settle at requested value
ta: குறிப்பு: M190 எப்போதும் கோரப்பட்ட மதிப்பில் வெப்பநிலை குடியேறக் காத்திருக்கிறது
zh_hans: 注意：M190总是等待温度稳定在请求的数值上。

source: Set fan speed: `M106 S<value>`
ta: விசிறி வேகத்தை அமைக்கவும்: `M106 S <மதிப்பு>`
zh_hans: 设置风扇速度：`M106 S<value>`

source: Turn fan off: `M107`
ta: சுவைஞர் முடக்கு: `M107`

source: Emergency stop: `M112`
ta: அவசர நிறுத்தம்: `M112`
zh_hans: 紧急停止：`M112`

source: Get current position: `M114`
ta: தற்போதைய நிலையைப் பெறுங்கள்: `M114`
zh_hans: 获取当前位置：`M114`

source: Get firmware version: `M115`
ta: ஃபார்ம்வேர் பதிப்பைப் பெறுங்கள்: `M115`
zh_hans: 获取固件版本：`M115`

source: For further details on the above commands see the [RepRap G-Code documentation](http://reprap.org/wiki/G-code).
ta: மேலே உள்ள கட்டளைகளில் மேலும் விவரங்களுக்கு [Reprap g-code ஆவணங்கள்] (http://reprap.org/wiki/g-code) ஐப் பார்க்கவும்.
zh_hans: 有关上述命令的更多详细信息，请参阅 [RepRap G-Code documentation](http://reprap.org/wiki/G-code)

source: If one requires a less common G-Code command then it may be possible to implement it with a custom [gcode_macro config section](Config_Reference.md#gcode_macro). For example, one might use this to implement: `G12`, `G29`, `G30`, `G31`, `M42`, `M80`, `M81`, `T1`, etc.
ta: ஒருவருக்கு குறைவான பொதுவான சி-குறியீட்டு கட்டளை தேவைப்பட்டால், அதை தனிப்பயன் [GCODE_MACRO கட்டமைப்பு பிரிவு] (config_reference.md#gcode_macro) மூலம் செயல்படுத்த முடியும். எடுத்துக்காட்டாக, இதைச் செயல்படுத்த ஒருவர் இதைப் பயன்படுத்தலாம்: `G12`,` G29`, `G30`,` G31`, `M42`,` M80`, `M81`,` T1` போன்றவை.
zh_hans: 如果一个人需要一个不太常见的G-Code命令，那么可以用一个自定义的[gcode_macro config section](Config_Reference.md#gcode_macro)来实现它。例如，我们可以用这个来实现。`G12`, `G29`, `G30`, `G31`, `M42`, `M80`, `M81`, `T1` ，etc

source: List SD card: `M20`
ta: எச்டி அட்டை பட்டியல்: `எம் 20`
zh_hans: 列出SD卡：`M20` 。

source: Initialize SD card: `M21`
ta: எச்டி கார்டைத் தொடங்கவும்: `எம் 21`
zh_hans: 初始化SD卡：`M21`

source: Select SD file: `M23 <filename>`
ta: SD கோப்பைத் தேர்ந்தெடுக்கவும்: `M23 <filename>`
zh_hans: 选择SD卡文件：`M23 <filename>`

source: Start/resume SD print: `M24`
ta: எச்டி அச்சு தொடங்கவும்/மீண்டும் தொடங்குங்கள்: `எம் 24`

source: Pause SD print: `M25`
ta: இடைநிறுத்த எச்டி அச்சு: `M25`
zh_hans: 暂停 SD 卡打印： `M25`

source: Set SD position: `M26 S<offset>`
ta: எச்டி நிலையை அமைக்கவும்: `எம் 26 எச் <ஆஃப்செட்>`

source: Report SD print status: `M27`
ta: எச்டி அச்சு நிலையைப் புகாரளிக்கவும்: `எம் 27`
zh_hans: 报告SD卡打印状态：`M27`

source: The following standard G-Code commands are available if a [gcode_arcs config section](Config_Reference.md#gcode_arcs) is enabled:
ta: ஒரு [gcode_arcs கட்டமைப்பு பிரிவு] (config_reference.md#gcode_arcs) இயக்கப்பட்டிருந்தால் பின்வரும் நிலையான சி-குறியீட்டு கட்டளைகள் கிடைக்கும்:

source: Display Message: `M117 <message>`
ta: செய்தியைக் காண்பி: `M117 <செய்தி>`
zh_hans: 显示信息： `M117 <message> `

source: Set build percentage: `M73 P<percent>`
ta: உருவாக்க சதவீதத்தை அமைக்கவும்: `M73 P <persel>`
zh_hans: 设置构建百分比：`M73 P<percent>`

source: Get Endstop Status: `M119` (Use QUERY_ENDSTOPS instead.)
ta: எண்ட்ச்டாப் நிலையைப் பெறுங்கள்: `M119` (அதற்கு பதிலாக Query_endstops ஐப் பயன்படுத்தவும்.)
zh_hans: 获取限位状态：`M119` (使用QUERY_ENDSTOPS代替)

source: Klipper uses "extended" G-Code commands for general configuration and status. These extended commands all follow a similar format - they start with a command name and may be followed by one or more parameters. For example: `SET_SERVO SERVO=myservo ANGLE=5.3`. In this document, the commands and parameters are shown in uppercase, however they are not case sensitive. (So, "SET_SERVO" and "set_servo" both run the same command.)
ta: கிளிப்பர் பொதுவான உள்ளமைவு மற்றும் நிலைக்கு "விரிவாக்கப்பட்ட" சி-குறியீடு கட்டளைகளைப் பயன்படுத்துகிறார். இந்த நீட்டிக்கப்பட்ட கட்டளைகள் அனைத்தும் இதேபோன்ற வடிவமைப்பைப் பின்பற்றுகின்றன - அவை ஒரு கட்டளை பெயருடன் தொடங்குகின்றன, மேலும் ஒன்று அல்லது அதற்கு மேற்பட்ட அளவுருக்கள் பின்பற்றப்படலாம். எடுத்துக்காட்டாக: `set_servo servo = myservo கோணம் = 5.3`. இந்த ஆவணத்தில், கட்டளைகள் மற்றும் அளவுருக்கள் பெரிய எழுத்தில் காட்டப்பட்டுள்ளன, இருப்பினும் அவை வழக்கு உணர்திறன் இல்லை. (எனவே, "set_servo" மற்றும் "set_servo" இரண்டும் ஒரே கட்டளையை இயக்குகின்றன.)
zh_hans: Klipper使用 "extended" 的G代码命令来进行一般的配置和状态。这些扩展命令都遵循一个类似的格式--它们以一个命令名开始，后面可能有一个或多个参数。比如说：`SET_SERVO SERVO=myservo ANGLE=5.3`。在本文件中，命令和参数以大写字母显示，但它们不分大小写。(所以，"SET_SERVO "和 "set_servo "都是运行同一个命令）

source: `QUERY_ENDSTOPS`: Probe the axis endstops and report if they are "triggered" or in an "open" state. This command is typically used to verify that an endstop is working correctly.
ta: `Query_endstops`: அச்சு எண்ட்ச்டாப்புகளை ஆராய்ந்து அவை" தூண்டப்பட்டால் "அல்லது" திறந்த "நிலையில் இருந்தால் புகாரளிக்கவும். ஒரு எண்ட்ச்டாப் சரியாக வேலை செய்கிறது என்பதை சரிபார்க்க இந்த கட்டளை பொதுவாக பயன்படுத்தப்படுகிறது.
zh_hans: `QUERY_ENDSTOPS`：检测限位并返回限位是否被 "triggered"或处于"open"。该命令通常用于验证一个限位是否正常工作。

source: `QUERY_ADC [NAME=<config_name>] [PULLUP=<value>]`: Report the last analog value received for a configured analog pin. If NAME is not provided, the list of available adc names are reported. If PULLUP is provided (as a value in Ohms), the raw analog value along with the equivalent resistance given that pullup is reported.
ta: `Query_adc [பெயர் = <config_name>] [Bullup = <value>]`: கட்டமைக்கப்பட்ட அனலாக் முள் பெறப்பட்ட கடைசி அனலாக் மதிப்பைப் புகாரளிக்கவும். பெயர் வழங்கப்படாவிட்டால், கிடைக்கக்கூடிய ADC பெயர்களின் பட்டியல் தெரிவிக்கப்படும். இழுத்தல் வழங்கப்பட்டால் (ஓம்சில் ஒரு மதிப்பாக), ரா அனலாக் மதிப்பு மற்றும் சமமான எதிர்ப்புடன் புல்அப் தெரிவிக்கப்படுகிறது.
zh_hans: `QUERY_ADC [NAME=<config_name>] [PULLUP=<value>]` ：返回为配置的模拟引脚收到的最后一个模拟值。如果NAME没有被提供，将报告可用的adc名称列表。如果提供了PULLUP（以欧姆为单位的数值），将会返回原始模拟值和给定的等效电阻。

source: `SET_GCODE_OFFSET [X=<pos>|X_ADJUST=<adjust>] [Y=<pos>|Y_ADJUST=<adjust>] [Z=<pos>|Z_ADJUST=<adjust>] [MOVE=1 [MOVE_SPEED=<speed>]]`: Set a positional offset to apply to future G-Code commands. This is commonly used to virtually change the Z bed offset or to set nozzle XY offsets when switching extruders. For example, if "SET_GCODE_OFFSET Z=0.2" is sent, then future G-Code moves will have 0.2mm added to their Z height. If the X_ADJUST style parameters are used, then the adjustment will be added to any existing offset (eg, "SET_GCODE_OFFSET Z=-0.2" followed by "SET_GCODE_OFFSET Z_ADJUST=0.3" would result in a total Z offset of 0.1). If "MOVE=1" is specified then a toolhead move will be issued to apply the given offset (otherwise the offset will take effect on the next absolute G-Code move that specifies the given axis). If "MOVE_SPEED" is specified then the toolhead move will be performed with the given speed (in mm/s); otherwise the toolhead move will use the last specified G-Code speed.
ta: `Set_gcode_offset [x = <pos> | x_adjust = <extrige>] [y = <pos> | y_adjust = <extrige>] [z = <pos> | z_adjust = <extrige>] [move = 1 [mov_speed = <வேகம் >] `: எதிர்கால சி-குறியீட்டு கட்டளைகளுக்கு விண்ணப்பிக்க ஒரு நிலை ஆஃப்செட்டை அமைக்கவும். இது பொதுவாக சட் படுக்கை ஆஃப்செட்டை மாற்ற அல்லது எக்ச்ட்ரூடர்களை மாற்றும்போது முனை xy ஆஃப்செட்களை அமைக்க பயன்படுகிறது. எடுத்துக்காட்டாக, "set_gcode_offset சட் = 0.2" அனுப்பப்பட்டால், எதிர்கால சி-குறியீட்டு நகர்வுகள் அவற்றின் சட் உயரத்தில் 0.2 மிமீ சேர்க்கப்படும். X_adjust பாணி அளவுருக்கள் பயன்படுத்தப்பட்டால், சரிசெய்தல் தற்போதுள்ள எந்த ஆஃப்செட்டிலும் சேர்க்கப்படும் (எ.கா. "மூவ் = 1" குறிப்பிடப்பட்டால், கொடுக்கப்பட்ட ஆஃப்செட்டைப் பயன்படுத்துவதற்கு ஒரு கருவித் தலை நடவடிக்கை வழங்கப்படும் (இல்லையெனில் கொடுக்கப்பட்ட அச்சைக் குறிப்பிடும் அடுத்த முழுமையான சி-குறியீட்டு நகர்வில் ஆஃப்செட் நடைமுறைக்கு வரும்). "MOVE_SPEED" குறிப்பிடப்பட்டால், கருவிஎட் நகர்வு கொடுக்கப்பட்ட வேகத்துடன் (மிமீ/வி இல்) செய்யப்படும்; இல்லையெனில் கருவிஎட் நகர்வு கடைசியாக குறிப்பிட்ட சி-குறியீடு வேகத்தைப் பயன்படுத்தும்.
zh_hans: `SET_GCODE_OFFSET [X=<pos>|X_ADJUST=<adjust>] [Y=<pos>|Y_ADJUST=<adjust>] [Z=<pos>|Z_ADJUST=<adjust>] [MOVE=1 [MOVE_SPEED=<speed>]]` 。设置一个位置偏移，以应用于未来的G代码命令。这通常用于实际改变Z床的偏移量或在切换挤出机时设置喷嘴的XY偏移量。例如，如果发送 "SET_GCODE_OFFSET Z=0.2"，那么未来的G代码移动将在其Z高度上增加0.2mm。如果使用X_ADJUST风格的参数，那么调整将被添加到任何现有的偏移上（例如，"SET_GCODE_OFFSET Z=-0.2"，然后是 "SET_GCODE_OFFSET Z_ADJUST=0.3"，将导致总的Z偏移为0.1）。如果指定了 "MOVE=1"，那么将发出一个工具头移动来应用给定的偏移量（否则偏移量将在指定给定轴的下一次绝对G-Code移动中生效）。如果指定了 "MOVE_SPEED"，那么刀头移动将以给定的速度（mm/s）执行；否则，打印头移动将使用最后指定的G-Code速度。

source: `SAVE_GCODE_STATE [NAME=<state_name>]`: Save the current g-code coordinate parsing state. Saving and restoring the g-code state is useful in scripts and macros. This command saves the current g-code absolute coordinate mode (G90/G91), absolute extrude mode (M82/M83), origin (G92), offset (SET_GCODE_OFFSET), speed override (M220), extruder override (M221), move speed, current XYZ position, and relative extruder "E" position. If NAME is provided it allows one to name the saved state to the given string. If NAME is not provided it defaults to "default".
ta: `Save_gcode_state [பெயர் = <state_name>]`: தற்போதைய சி-குறியீடு ஒருங்கிணைப்பு பாகுபடுத்தும் நிலையைச் சேமிக்கவும். சி-கோட் நிலையைச் சேமிப்பது மற்றும் மீட்டமைப்பது ச்கிரிப்டுகள் மற்றும் மேக்ரோக்களில் பயனுள்ளதாக இருக்கும். இந்த கட்டளை தற்போதைய சி-குறியீடு முழுமையான ஒருங்கிணைப்பு பயன்முறை (G90/G91), முழுமையான எக்ச்ட்ரூட் பயன்முறை (M82/M83), தோற்றம் (G92), ஆஃப்செட் (SET_GCODE_OFFSET), விரைவு மேலெழுதல் (M220), எக்ச்ட்ரூடர் ஓவர்ரைடு (M221), நகரும் வேகத்தை சேமிக்கிறது , தற்போதைய XYZ நிலை, மற்றும் உறவினர் எக்ச்ட்ரூடர் "இ" நிலை. பெயர் வழங்கப்பட்டால், சேமித்த நிலையை கொடுக்கப்பட்ட சரத்திற்கு பெயரிட ஒருவர் அனுமதிக்கிறது. பெயர் வழங்கப்படாவிட்டால் அது "இயல்புநிலை" க்கு இயல்புநிலையாகும்.
zh_hans: `SAVE_GCODE_STATE [NAME=<state_name>]`：保存当前的g-code坐标解析状态。保存和恢复g-code状态在脚本和宏中很有用。该命令保存当前g-code绝对坐标模式（G90/G91）绝对挤出模式（M82/M83）原点（G92）偏移量（SET_GCODE_OFFSET）速度覆盖（M220）挤出机覆盖（M221）移动速度。当前XYZ位置和相对挤出机 "E "位置。如果提供NAME，它允许人们将保存的状态命名为给定的字符串。如果没有提供NAME，则默认为 "default"

source: `RESTORE_GCODE_STATE [NAME=<state_name>] [MOVE=1 [MOVE_SPEED=<speed>]]`: Restore a state previously saved via SAVE_GCODE_STATE. If "MOVE=1" is specified then a toolhead move will be issued to move back to the previous XYZ position. If "MOVE_SPEED" is specified then the toolhead move will be performed with the given speed (in mm/s); otherwise the toolhead move will use the restored g-code speed.
ta: `Restore_gcode_state [name = <state_name>] [move = 1 [move_speed = <weotive>]]`: முன்னர் சேமிக்கப்பட்ட நிலையை Save_gcode_state வழியாக மீட்டெடுக்கவும். "நகர்வு = 1" குறிப்பிடப்பட்டால், முந்தைய XYZ நிலைக்கு திரும்புவதற்கு ஒரு கருவி நகர்வு வழங்கப்படும். "MOVE_SPEED" குறிப்பிடப்பட்டால், கருவிஎட் நகர்வு கொடுக்கப்பட்ட வேகத்துடன் (மிமீ/வி இல்) செய்யப்படும்; இல்லையெனில் கருவிஎட் நகர்வு மீட்டெடுக்கப்பட்ட சி-குறியீடு வேகத்தைப் பயன்படுத்தும்.
zh_hans: `RESTORE_GCODE_STATE [NAME=<state_name>] [MOVE=1 [MOVE_SPEED=<speed>]]`：恢复之前通过 SAVE_GCODE_STATE 保存的状态。如果指定“MOVE=1”，则将发出刀头移动以返回到先前的 XYZ 位置。如果指定了“MOVE_SPEED”，则刀头移动将以给定的速度（以mm/s为单位）执行；否则工具头移动将使用恢复的G-Code速度。

source: `PID_CALIBRATE HEATER=<config_name> TARGET=<temperature> [WRITE_FILE=1]`: Perform a PID calibration test. The specified heater will be enabled until the specified target temperature is reached, and then the heater will be turned off and on for several cycles. If the WRITE_FILE parameter is enabled, then the file /tmp/heattest.txt will be created with a log of all temperature samples taken during the test.
ta: `Pid_calibrate heter = <config_name> இலக்கு = <வெப்பநிலை> [write_file = 1]`: PID அளவுத்திருத்த சோதனையைச் செய்யுங்கள். குறிப்பிட்ட இலக்கு வெப்பநிலை அடையும் வரை குறிப்பிட்ட ஈட்டர் இயக்கப்படும், பின்னர் ஈட்டர் அணைக்கப்படும் மற்றும் பல சுழற்சிகளுக்கு. WRITE_FILE அளவுரு இயக்கப்பட்டிருந்தால், சோதனையின் போது எடுக்கப்பட்ட அனைத்து வெப்பநிலை மாதிரிகளின் பதிவோடு /tmp/heattest.txt கோப்பு உருவாக்கப்படும்.
zh_hans: `PID_CALIBRATE HEATER=<config_name> TARGET=<temperature> [WRITE_FILE=1]`：执行一个PID校准测试。指定的加热器将被启用，直到达到指定的目标温度，然后加热器将被关闭和开启几个周期。如果WRITE_FILE参数被启用，那么将创建文件/tmp/heattest.txt，其中包含测试期间所有温度样本的日志。

source: `TURN_OFF_HEATERS`: Turn off all heaters.
ta: `டர்ன்_ஆஃப்_ஈட்டர்ச்`: அனைத்து ஈட்டர்களையும் அணைக்கவும்.

source: `TEMPERATURE_WAIT SENSOR=<config_name> [MINIMUM=<target>] [MAXIMUM=<target>]`: Wait until the given temperature sensor is at or above the supplied MINIMUM and/or at or below the supplied MAXIMUM.
ta: `வெப்பநிலை_ வெயிட் சென்சார் = <config_name> [குறைந்தபட்சம் = <இலக்கு>] [அதிகபட்சம் = <arget>]`: கொடுக்கப்பட்ட வெப்பநிலை சென்சார் வழங்கப்பட்ட குறைந்தபட்ச மற்றும்/அல்லது அதற்கு மேல் அல்லது அதற்கு மேல் வழங்கப்பட்ட அதிகபட்சம் வரை காத்திருக்கவும்.

source: `SET_HEATER_TEMPERATURE HEATER=<heater_name> [TARGET=<target_temperature>]`: Sets the target temperature for a heater. If a target temperature is not supplied, the target is 0.
ta: `Set_heater_temperature heter = <seter_name> [இலக்கு = <target_temperature>]`: ஒரு ஈட்டருக்கான இலக்கு வெப்பநிலையை அமைக்கிறது. இலக்கு வெப்பநிலை வழங்கப்படாவிட்டால், இலக்கு 0 ஆகும்.

source: `SET_STEPPER_ENABLE STEPPER=<config_name> ENABLE=[0|1]`: Enable or disable only the given stepper. This is a diagnostic and debugging tool and must be used with care. Disabling an axis motor does not reset the homing information. Manually moving a disabled stepper may cause the machine to operate the motor outside of safe limits. This can lead to damage to axis components, hot ends, and print surface.
ta: `Set_stepper_enable ச்டெபர் = <config_name> இயக்கு = [0 | 1]`: கொடுக்கப்பட்ட ச்டெப்பரை மட்டும் இயக்கவும் அல்லது முடக்கவும். இது ஒரு கண்டறியும் மற்றும் பிழைத்திருத்த கருவியாகும், மேலும் கவனத்துடன் பயன்படுத்தப்பட வேண்டும். ஒரு அச்சு மோட்டாரை முடக்குவது ஓமிங் தகவல்களை மீட்டமைக்காது. ஒரு ஊனமுற்ற ச்டெப்பரை கைமுறையாக நகர்த்துவது இயந்திரத்தை பாதுகாப்பான வரம்புகளுக்கு வெளியே மின்னோடி இயக்க காரணமாக இருக்கலாம். இது அச்சு கூறுகள், சூடான முனைகள் மற்றும் அச்சு மேற்பரப்பு ஆகியவற்றிற்கு சேதம் விளைவிக்கும்.

source: `STEPPER_BUZZ STEPPER=<config_name>`: Move the given stepper forward one mm and then backward one mm, repeated 10 times. This is a diagnostic tool to help verify stepper connectivity.
ta: `STEPPER_BUZZ STEPPER = <config_name>`: கொடுக்கப்பட்ட ச்டெப்பரை ஒரு மிமீ முன்னோக்கி நகர்த்தவும், பின்னர் ஒரு மிமீ பின்னோக்கி, 10 முறை மீண்டும் மீண்டும் செய்யப்பட்டது. ச்டெப்பர் இணைப்பை சரிபார்க்க உதவும் கண்டறியும் கருவியாகும்.

source: `MANUAL_PROBE [SPEED=<speed>]`: Run a helper script useful for measuring the height of the nozzle at a given location. If SPEED is specified, it sets the speed of TESTZ commands (the default is 5mm/s). During a manual probe, the following additional commands are available:
ta: `Manual_probe [வேகம் = <வேகம்>]`: கொடுக்கப்பட்ட இடத்தில் முனை உயரத்தை அளவிட பயனுள்ள ஒரு உதவி ச்கிரிப்டை இயக்கவும். விரைவு குறிப்பிடப்பட்டால், இது டெச்ட்ச் கட்டளைகளின் வேகத்தை அமைக்கிறது (இயல்புநிலை 5 மிமீ/வி). ஒரு கையேடு ஆய்வின் போது, பின்வரும் கூடுதல் கட்டளைகள் கிடைக்கின்றன:
zh_hans: `MANUAL_PROBE [SPEED=<speed>]`：运行一个辅助脚本，对测量给定位置的喷嘴高度有用。如果指定了速度，它将设置TESTZ命令的速度（默认为5mm/s）。在手动探测过程中，可使用以下附加命令：

source: `ACCEPT`: This command accepts the current Z position and concludes the manual probing tool.
ta: `ஏற்றுக்கொள்`: இந்த கட்டளை தற்போதைய சட் நிலையை ஏற்றுக்கொண்டு கையேடு ஆய்வு கருவியை முடிக்கிறது.
zh_hans: `ACCEPT`：该命令接受当前的Z位置，并结束手动探测工具。

source: `ABORT`: This command terminates the manual probing tool.
ta: `ABORT`: இந்த கட்டளை கையேடு ஆய்வு கருவியை நிறுத்துகிறது.
zh_hans: `ABORT`：该命令终止手动探测工具。

source: `TESTZ Z=<value>`: This command moves the nozzle up or down by the amount specified in "value". For example, `TESTZ Z=-.1` would move the nozzle down .1mm while `TESTZ Z=.1` would move the nozzle up .1mm. The value may also be `+`, `-`, `++`, or `--` to move the nozzle up or down an amount relative to previous attempts.
ta: `டெச்ட்ச் சட் = <மதிப்பு>`: இந்த கட்டளை "மதிப்பு" இல் குறிப்பிடப்பட்டுள்ள தொகையால் முனை மேலே அல்லது கீழ்நோக்கி நகர்த்துகிறது. எடுத்துக்காட்டாக, `டெச்ட்ச் சட் =-. 1` முனை .1 மி.மீ. மதிப்பு `+`, `-`,` ++ `, அல்லது`-`முந்தைய முயற்சிகளுடன் தொடர்புடைய ஒரு தொகையை மேலே நகர்த்தவும்.

source: `Z_ENDSTOP_CALIBRATE [SPEED=<speed>]`: Run a helper script useful for calibrating a Z position_endstop config setting. See the MANUAL_PROBE command for details on the parameters and the additional commands available while the tool is active.
ta: `Z_endstop_calibrate [வேகம் = <speed>]`: ஒரு சட் pasition_endstop கட்டமைப்பு அமைப்பை அளவீடு செய்வதற்கு பயனுள்ள உதவி ச்கிரிப்டை இயக்கவும். கருவி செயலில் இருக்கும்போது அளவுருக்கள் மற்றும் கூடுதல் கட்டளைகள் குறித்த விவரங்களுக்கு கையேடு_பிரோப் கட்டளையைப் பார்க்கவும்.

source: `SET_DISPLAY_GROUP [DISPLAY=<display>] GROUP=<group>`: Set the active display group of an lcd display. This allows to define multiple display data groups in the config, e.g. `[display_data <group> <elementname>]` and switch between them using this extended gcode command. If DISPLAY is not specified it defaults to "display" (the primary display).
ta: `Set_display_group [display = <splay>] குழு = <group>`: எல்சிடி காட்சியின் செயலில் காட்சி குழுவை அமைக்கவும். இது கட்டமைப்பில் பல காட்சி தரவுக் குழுக்களை வரையறுக்க அனுமதிக்கிறது, எ.கா. `[display_data <group> <ilementname>]` மற்றும் இந்த நீட்டிக்கப்பட்ட GCODE கட்டளையைப் பயன்படுத்தி அவற்றுக்கு இடையில் மாறவும். காட்சி குறிப்பிடப்படவில்லை என்றால், அது "காட்சி" (முதன்மை காட்சி) க்கு இயல்புநிலையாகிறது.
zh_hans: `SET_DISPLAY_GROUP [DISPLAY=<display>] GROUP=<group>`:设置一个lcd显示器的活动显示组。这允许在配置中定义多个显示数据组，例如`[display_data <group> <elementname>]`并使用这个扩展的gcode命令在它们之间切换。如果没有指定DISPLAY，则默认为 "display"（主显示）。

source: `SET_IDLE_TIMEOUT [TIMEOUT=<timeout>]`: Allows the user to set the idle timeout (in seconds).
ta: `Set_idle_timeout [timeout = <timeout>]`: செயலற்ற காலக்கெடுவை (நொடிகளில்) அமைக்க பயனரை அனுமதிக்கிறது.

source: `RESTART`: This will cause the host software to reload its config and perform an internal reset. This command will not clear error state from the micro-controller (see FIRMWARE_RESTART) nor will it load new software (see [the FAQ](FAQ.md#how-do-i-upgrade-to-the-latest-software)).
ta: `மறுதொடக்கம்`: இது புரவலன் மென்பொருளை அதன் கட்டமைப்பை மீண்டும் ஏற்றி உள் மீட்டமைப்பைச் செய்யும். இந்த கட்டளை மைக்ரோ-கன்ட்ரோலரிலிருந்து பிழை நிலையை அழிக்காது (ஃபார்ம்வேர்_ரெச்டார்ட்டைப் பார்க்கவும்) அல்லது புதிய மென்பொருளை ஏற்றாது ([கேள்விகள்] (faq.md#எப்படி-செய்ய-ஐ-பெக்ரேட்-க்கு-லாடெச்ட்-ச்கோஃப்ட்வேர்))) .
zh_hans: `RESTART`：这将导致主机软件重新加载其配置并执行内部重置。此命令不会从微控制器清除错误状态（请参阅 FIRMWARE_RESTART），也不会加载新软件（请参阅 [常见问题](FAQ.md#how-do-i-upgrade-to-the-latest-software)） .

source: `FIRMWARE_RESTART`: This is similar to a RESTART command, but it also clears any error state from the micro-controller.
ta: `ஃபார்ம்வேர்_ரெச்டார்ட்`: இது மறுதொடக்கம் கட்டளைக்கு ஒத்ததாகும், ஆனால் இது மைக்ரோ-கன்ட்ரோலரிடமிருந்து எந்த பிழை நிலையையும் அழிக்கிறது.
zh_hans: `FIRMWARE_RESTART`：这类似于重启命令，但它也清除了微控制器的任何错误状态。

source: `SAVE_CONFIG`: This command will overwrite the main printer config file and restart the host software. This command is used in conjunction with other calibration commands to store the results of calibration tests.
ta: `Save_config`: இந்த கட்டளை முதன்மையான அச்சுப்பொறி கட்டமைப்பு கோப்பை மேலெழுதும் மற்றும் புரவலன் மென்பொருளை மறுதொடக்கம் செய்யும். அளவுத்திருத்த சோதனைகளின் முடிவுகளை சேமிக்க இந்த கட்டளை மற்ற அளவுத்திருத்த கட்டளைகளுடன் இணைந்து பயன்படுத்தப்படுகிறது.
zh_hans: `SAVE_CONFIG`：该命令将覆盖打印机的主配置文件，并重新启动主机软件。该命令与其他校准命令一起使用，用于存储校准测试的结果。

source: `STATUS`: Report the Klipper host software status.
ta: `நிலை`: கிளிப்பர் புரவலன் மென்பொருள் நிலையைப் புகாரளிக்கவும்.

source: `HELP`: Report the list of available extended G-Code commands.
ta: `உதவி`: கிடைக்கக்கூடிய நீட்டிக்கப்பட்ட சி-கோட் கட்டளைகளின் பட்டியலைப் புகாரளிக்கவும்.
zh_hans: `HELP`：报告可用的扩展G-Code命令列表。

source: `SET_GCODE_VARIABLE MACRO=<macro_name> VARIABLE=<name> VALUE=<value>`: This command allows one to change the value of a gcode_macro variable at run-time. The provided VALUE is parsed as a Python literal.
ta: `Set_gcode_variable பெரியவைகள் = <acroge_name> மாறி = <aname> மதிப்பு = <மதிப்பு>`: இந்த கட்டளை ரன்-நேரத்தில் ஒரு gcode_macro மாறியின் மதிப்பை மாற்ற அனுமதிக்கிறது. வழங்கப்பட்ட மதிப்பு ஒரு பைதான் மொழியாக பாகுபடுத்தப்படுகிறது.
zh_hans: `SET_GCODE_VARIABLE MACRO=<macro_name> VARIABLE=<name> VALUE=<value>`：这条命令允许人们在运行时改变 gcode_macro 变量的值。所提供的 VALUE 会被解析为一个 Python 字面。
