Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/G-Codes.po
Languages: ta, zh_hans

source: The following commands are available when a [probe config section](Config_Reference.md#probe) or [bltouch config section](Config_Reference.md#bltouch) is enabled (also see the [probe calibrate guide](Probe_Calibrate.md)).
ta: [ஆய்வு கட்டமைப்பு பிரிவு] (config_reference.md#probe) அல்லது [bltouch கட்டமைப்பு பிரிவு] (config_reference.md#bltouch) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளைகள் கிடைக்கின்றன ([ஆய்வு அளவீடு வழிகாட்டி] (probe_calibrate.md) ஐப் பார்க்கவும்).

source: PROBE
ta: தேட்டி

source: The query_endstops module is automatically loaded. The following standard G-Code commands are currently available, but using them is not recommended:
ta: Query_endstops தொகுதி தானாக ஏற்றப்படும். பின்வரும் நிலையான சி-குறியீடு கட்டளைகள் தற்போது கிடைக்கின்றன, ஆனால் அவற்றைப் பயன்படுத்துவது பரிந்துரைக்கப்படவில்லை:

source: The following commands are available when a [resonance_tester config section](Config_Reference.md#resonance_tester) is enabled (also see the [measuring resonances guide](Measuring_Resonances.md)).
ta: ஒரு [அதிர்வு_டெச்டர் கட்டமைப்பு பிரிவு] (config_reference.md#reconance_tester) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கின்றன ([அளவீட்டு அதிர்வு வழிகாட்டி] (meaturing_resonances.md) ஐயும் பார்க்கவும்).

source: MEASURE_AXES_NOISE
ta: அளவீடு_அக்ச்_நோயிச்

source: The following standard G-Code commands are available when the [respond config section](Config_Reference.md#respond) is enabled:
ta: [பதிலளிக்கும் கட்டமைப்பு பிரிவு] (config_reference.md#பதில்) இயக்கப்பட்டால் பின்வரும் நிலையான சி-குறியீடு கட்டளைகள் கிடைக்கின்றன:

source: RESPOND
ta: பதிலளிக்கவும்

source: `RESPOND TYPE=command MSG="<message>"`: echo the message prepended with `// `. OctoPrint can be configured to respond to these messages (e.g. `RESPOND TYPE=command MSG=action:pause`).
ta: `பதிலளிக்கவும் வகை = கட்டளை msg =" <seagnition> "`: `//` உடன் தயாரிக்கப்பட்ட செய்தியை எதிரொலிக்கவும். இந்த செய்திகளுக்கு பதிலளிக்க ஆக்டோப்ரின்ட்டை கட்டமைக்க முடியும் (எ.கா. `பதிலளிக்கும் வகை = கட்டளை msg = செயல்: இடைநிறுத்தம்`).

source: The following command is enabled if a [save_variables config section](Config_Reference.md#save_variables) has been enabled.
ta: [Save_variables கட்டமைப்பு பிரிவு] (config_reference.md#save_variables) இயக்கப்பட்டிருந்தால் பின்வரும் கட்டளை இயக்கப்பட்டது.

source: The following commands are available when the [screws_tilt_adjust config section](Config_Reference.md#screws_tilt_adjust) is enabled (also see the [manual level guide](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe)).
ta: [ச்க்ரூச்_பில்ட்_ஆட்சச்ட் கட்டமைப்பு பிரிவு] (config_reference.md#திருகு_tilt_adjust) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளைகள் கிடைக்கின்றன ([கையேடு நிலை வழிகாட்டி] (கையேடு_லெவல். )).

source: SCREWS_TILT_CALCULATE
ta: திருகுகள்_TILT_CALCULATE

source: When the [sdcard_loop config section](Config_Reference.md#sdcard_loop) is enabled, the following extended commands are available.
ta: [SDCARD_LOOP கட்டமைப்பு பிரிவு] (config_reference.md#sdcard_loop) இயக்கப்பட்டால், பின்வரும் நீட்டிக்கப்பட்ட கட்டளைகள் கிடைக்கின்றன.

source: `SDCARD_LOOP_BEGIN COUNT=<count>`: Begin a looped section in the SD print. A count of 0 indicates that the section should be looped indefinitely.
ta: `Sdcard_loop_begin எண்ணுங்கள் = <count>`: எச்டி அச்சில் ஒரு வளையப் பகுதியைத் தொடங்குங்கள். 0 இன் எண்ணிக்கை பகுதியை காலவரையின்றி வளைய வேண்டும் என்பதைக் குறிக்கிறது.

source: The following commands are available when a [servo config section](Config_Reference.md#servo) is enabled.
ta: [SERVO கட்டமைப்பு பிரிவு] (config_reference.md#servo) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: The following commands are available when the [skew_correction config section](Config_Reference.md#skew_correction) is enabled (also see the [Skew Correction](Skew_Correction.md) guide).
ta: [SKEW_CORRECTION கட்டமைப்பு பிரிவு] (config_reference.md#skew_correction) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளைகள் கிடைக்கின்றன ([SKEW திருத்தம்] (skew_correction.md) வழிகாட்டியையும் பார்க்கவும்).

source: `SKEW_PROFILE [LOAD=<name>] [SAVE=<name>] [REMOVE=<name>]`: Profile management for skew_correction. LOAD will restore skew state from the profile matching the supplied name. SAVE will save the current skew state to a profile matching the supplied name. Remove will delete the profile matching the supplied name from persistent memory. Note that after SAVE or REMOVE operations have been run the SAVE_CONFIG gcode must be run to make the changes to persistent memory permanent.
ta: `Skew_profile [load = <amen>] [சேமி = <amen>] [அகற்று = <amen>]`: skew_correction க்கான சுயவிவர மேலாண்மை. வழங்கப்பட்ட பெயருடன் பொருந்தக்கூடிய சுயவிவரத்திலிருந்து சுமை வளைவு நிலையை மீட்டெடுக்கும். சேமிப்பு தற்போதைய வளைவு நிலையை வழங்கப்பட்ட பெயருடன் பொருந்தக்கூடிய சுயவிவரத்திற்கு சேமிக்கும். தொடர்ச்சியான நினைவகத்திலிருந்து வழங்கப்பட்ட பெயருடன் பொருந்தக்கூடிய சுயவிவரத்தை அகற்று நீக்கிவிடும். சேமிப்பு அல்லது அகற்றப்பட்ட செயல்பாடுகள் இயக்கப்பட்ட பிறகு, தொடர்ச்சியான நினைவகத்திற்கான மாற்றங்களை நிரந்தரமாக்குவதற்கு Save_config Gcode இயக்க வேண்டும் என்பதை நினைவில் கொள்க.

source: The stepper_enable module is automatically loaded.
ta: ச்டெபர்_இனபிள் தொகுதி தானாக ஏற்றப்படும்.

source: The following command is available when a [temperature_fan config section](Config_Reference.md#temperature_fan) is enabled.
ta: [வெப்பநிலை_பான் கட்டமைப்பு பிரிவு] (config_reference.md#வெப்பநிலை_ஃபான்) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: `SET_TEMPERATURE_FAN_TARGET temperature_fan=<temperature_fan_name> [target=<target_temperature>] [min_speed=<min_speed>] [max_speed=<max_speed>]`: Sets the target temperature for a temperature_fan. If a target is not supplied, it is set to the specified temperature in the config file. If speeds are not supplied, no change is applied.
ta: `Set_temperature_fan_target வெப்பநிலை_பான் = <வெப்பநிலை_பான்_நாம்> [இலக்கு = <target_temperature>] [min_speed = <min_speed>] [max_speed = <ax_speed>]`: வெப்பநிலை_பானுக்கான இலக்கு வெப்பநிலையை அமைக்கிறது. ஒரு இலக்கு வழங்கப்படாவிட்டால், அது கட்டமைப்பு கோப்பில் குறிப்பிட்ட வெப்பநிலைக்கு அமைக்கப்பட்டுள்ளது. விரைவு வழங்கப்படாவிட்டால், எந்த மாற்றமும் பயன்படுத்தப்படாது.

source: The following commands are available when any of the [tmcXXXX config sections](Config_Reference.md#tmc-stepper-driver-configuration) are enabled.
ta: [TMCXXXX கட்டமைப்பு பிரிவுகள்] (config_reference.md#TMC- ச்டெப்பர்-டிரைவர்-உள்ளமைவு) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கின்றன.

source: `INIT_TMC STEPPER=<name>`: This command will initialize the TMC registers. Needed to re-enable the driver if power to the chip is turned off then back on.
ta: `Init_tmc stepper = <amen>`: இந்த கட்டளை TMC பதிவேடுகளைத் தொடங்கும். சிப்பின் மின்சாரம் அணைக்கப்பட்டால் மீண்டும் இயக்கத்தை மீண்டும் இயக்க வேண்டும்.

source: [toolhead]
ta: [கருவித்தொகை]

source: The toolhead module is automatically loaded.
ta: கருவிஎட் தொகுதி தானாக ஏற்றப்படும்.

source: [tuning_tower]
ta: [ட்யூனிங்_டவர்]

source: The tuning_tower module is automatically loaded.
ta: ட்யூனிங்_டவர் தொகுதி தானாக ஏற்றப்படும்.

source: TUNING_TOWER
ta: ட்யூனிங்_டவர்

source: `FACTOR`: The value changes at a rate of `factor` per millimeter. The formula used is: `value = start + factor * z_height`. You can plug the optimum Z height directly into the formula to determine the optimum parameter value.
ta: `காரணி`: ஒரு மில்லிமீட்டருக்கு` காரணி` என்ற விகிதத்தில் மதிப்பு மாறுகிறது. பயன்படுத்தப்படும் சூத்திரம்: `மதிப்பு = தொடக்க + காரணி * z_height`. உகந்த அளவுரு மதிப்பை தீர்மானிக்க உகந்த சட் உயரத்தை நேரடியாக சூத்திரத்தில் செருகலாம்.

source: `FACTOR` and `BAND`: The value changes at an average rate of `factor` per millimeter, but in discrete bands where the adjustment will only be made every `BAND` millimeters of Z height. The formula used is: `value = start + factor * ((floor(z_height / band) + .5) * band)`.
ta: `காரணி` மற்றும்` பேண்ட்`: மதிப்பு ஒரு மில்லிமீட்டருக்கு சராசரியாக `காரணி` விகிதத்தில் மாறுகிறது, ஆனால் சரிசெய்தல் ஒவ்வொரு` பேண்ட்` மில்லிமீட்டர் சட் உயரமும் மட்டுமே செய்யப்படும். பயன்படுத்தப்படும் சூத்திரம்: `மதிப்பு = தொடக்க + காரணி * ((தளம் (z_height / band) + .5) * band)`.

source: `STEP_DELTA` and `STEP_HEIGHT`: The value changes by `STEP_DELTA` every `STEP_HEIGHT` millimeters. The formula used is: `value = start + step_delta * floor(z_height / step_height)`. You can simply count bands or read tuning tower labels to determine the optimum value.
ta: `Step_delta` மற்றும்` step_height`: மதிப்பு `step_delta` ஒவ்வொரு` step_height` மில்லிமீட்டர்களால் மாறுகிறது. பயன்படுத்தப்படும் சூத்திரம்: `மதிப்பு = தொடங்கு + step_delta * தளம் (z_height / step_height)`. உகந்த மதிப்பைத் தீர்மானிக்க நீங்கள் வெறுமனே பட்டைகள் எண்ணலாம் அல்லது ட்யூனிங் டவர் லேபிள்களைப் படிக்கலாம்.

source: Klipper supports the following standard G-Code commands if the [virtual_sdcard config section](Config_Reference.md#virtual_sdcard) is enabled:
ta: Klipper supports the following தரநிலை G-Code கட்டளைகள் if the [virtual_sdcard கட்டமைப்பு section](Config_Reference.md#virtual_sdcard) is enabled:

source: In addition, the following extended commands are available when the "virtual_sdcard" config section is enabled.
ta: கூடுதலாக, "மெய்நிகர்_ச்ட்கார்டு" கட்டமைப்பு பிரிவு இயக்கப்பட்டிருக்கும் போது பின்வரும் நீட்டிக்கப்பட்ட கட்டளைகள் கிடைக்கின்றன.

source: `SDCARD_PRINT_FILE FILENAME=<filename>`: Load a file and start SD print.
ta: `SDCARD_PRINT_FILE கோப்புப்பெயர் = <fileName>`: ஒரு கோப்பை ஏற்றி SD அச்சிடத் தொடங்கவும்.

source: `SDCARD_RESET_FILE`: Unload file and clear SD state.
ta: `SDCARD_RESET_FILE`: கோப்பை இறக்கி எச்டி நிலையை அழிக்கவும்.

source: The following commands are available when the [z_tilt config section](Config_Reference.md#z_tilt) is enabled.
ta: [Z_tilt கட்டமைப்பு பிரிவு] (config_reference.md#z_tilt) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: Klipper's goal is to support the G-Code commands produced by common 3rd party software (eg, OctoPrint, Printrun, Slic3r, Cura, etc.) in their standard configurations. It is not a goal to support every possible G-Code command. Instead, Klipper prefers human readable ["extended G-Code commands"](#additional-commands). Similarly, the G-Code terminal output is only intended to be human readable - see the [API Server document](API_Server.md) if controlling Klipper from external software.
ta: பொதுவான 3 வது தரப்பு மென்பொருளால் (எ.கா., ஆக்டோபிரிண்ட், பிரிண்ட்ரூன், ச்லிக் 3 ஆர், குரா போன்றவை) தயாரித்த சி-கோட் கட்டளைகளை அவற்றின் நிலையான உள்ளமைவுகளில் ஆதரிப்பதே கிளிப்பரின் குறிக்கோள். சாத்தியமான ஒவ்வொரு சி-கோட் கட்டளையையும் ஆதரிப்பது குறிக்கோள் அல்ல. அதற்கு பதிலாக, கிளிப்பர் மனிதனின் படிக்கக்கூடிய ["நீட்டிக்கப்பட்ட சி-குறியீட்டு கட்டளைகள்"] (#கூடுதல்-கட்டளைகள்) விரும்புகிறார். இதேபோல், ஐயா -கோட் முனைய வெளியீடு மனிதனைப் படிக்கக்கூடியதாக மட்டுமே கருதப்படுகிறது - வெளிப்புற மென்பொருளிலிருந்து கிளிப்பரைக் கட்டுப்படுத்தினால் [API சேவையக ஆவணம்] (API_SERVER.MD) ஐப் பார்க்கவும்.

source: `GET_POSITION`: Return information on the current location of the toolhead. See the developer documentation of [GET_POSITION output](Code_Overview.md#coordinate-systems) for more information.
ta: `Get_position`: கருவியின் தற்போதைய இருப்பிடத்தில் தகவல்களைத் தரவும். மேலும் தகவலுக்கு [get_position வெளியீடு] (code_overview.md#ஒருங்கிணைப்பு-அமைப்புகள்) இன் உருவாக்குபவர் ஆவணங்களைப் பார்க்கவும்.

source: `ACTIVATE_EXTRUDER EXTRUDER=<config_name>`: In a printer with multiple [extruder](Config_Reference.md#extruder) config sections, this command changes the active hotend.
ta: `Activate_extruder extruder = <config_name>`: பல [எக்ச்ட்ரூடர்] (config_reference.md#extruder) கட்டமைப்பு பிரிவுகளைக் கொண்ட அச்சுப்பொறியில், இந்த கட்டளை செயலில் உள்ள ஓட்டெண்டை மாற்றுகிறது.

source: The following commands are available when an [angle config section](Config_Reference.md#angle) is enabled.
ta: [கோண கட்டமைப்பு பிரிவு] (config_reference.md#கோணம்) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: ANGLE_CALIBRATE
ta: Anglor_calibrate

source: `ANGLE_CALIBRATE CHIP=<chip_name>`: Perform angle calibration on the given sensor (there must be an `[angle chip_name]` config section that has specified a `stepper` parameter). IMPORTANT - this tool will command the stepper motor to move without checking the normal kinematic boundary limits. Ideally the motor should be disconnected from any printer carriage before performing calibration. If the stepper can not be disconnected from the printer, make sure the carriage is near the center of its rail before starting calibration. (The stepper motor may move forwards or backwards two full rotations during this test.) After completing this test use the `SAVE_CONFIG` command to save the calibration data to the config file. In order to use this tool the Python "numpy" package must be installed (see the [measuring resonance document](Measuring_Resonances.md#software-installation) for more information).
ta: `Anglage_calibrate chip = <iph_name>`: கொடுக்கப்பட்ட சென்சாரில் கோண அளவுத்திருத்தத்தை செய்யுங்கள் (`ச்டெப்பர்` அளவுருவைக் குறிப்பிட்டுள்ள ஒரு` [கோண சிப்_பேம்] `கட்டமைப்பு பிரிவு இருக்க வேண்டும்). முக்கியமானது - இந்த கருவி சாதாரண இயக்கவியல் எல்லை வரம்புகளைச் சரிபார்க்காமல் நகர்த்துவதற்கு ச்டெப்பர் மோட்டாருக்கு கட்டளையிடும். அளவுத்திருத்தத்தை செய்வதற்கு முன் எந்த அச்சுப்பொறி வண்டியிலிருந்தும் மின்னோடி துண்டிக்கப்பட வேண்டும். அச்சுப்பொறியில் இருந்து ச்டெப்பரை துண்டிக்க முடியாவிட்டால், அளவுத்திருத்தத்தைத் தொடங்குவதற்கு முன் வண்டி அதன் ரயிலின் மையத்திற்கு அருகில் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். . இந்த கருவியைப் பயன்படுத்த, பைதான் "நம்பி" தொகுப்பு நிறுவப்பட வேண்டும் (மேலும் தகவலுக்கு [அளவீட்டு அதிர்வு ஆவணம்] (அளவிடுதல்_ரேசனன்ச்.ம்டி#மென்பொருள்-நிறுவல்) ஐப் பார்க்கவும்).

source: ANGLE_DEBUG_READ
ta: ஆங்கிள்_டெபக்_ரெட்

source: `ANGLE_DEBUG_READ CHIP=<config_name> REG=<register>`: Queries sensor register "register" (e.g. 44 or 0x2C). Can be useful for debugging purposes. This is only available for tle5012b chips.
ta: `Anglag_debug_read chip = <config_name> reg = <பதிவு>`: வினவல்கள் சென்சார் பதிவு "பதிவு" (எ.கா. 44 அல்லது 0x2C). பிழைத்திருத்த நோக்கங்களுக்காக பயனுள்ளதாக இருக்கும். இது TLE5012B சில்லுகளுக்கு மட்டுமே கிடைக்கிறது.

source: ANGLE_DEBUG_WRITE
ta: ஆங்கிள்_டெபக்_ரைட்

source: `ANGLE_DEBUG_WRITE CHIP=<config_name> REG=<register> VAL=<value>`: Writes raw "value" into register "register". Both "value" and "register" can be a decimal or a hexadecimal integer. Use with care, and refer to sensor data sheet for the reference. This is only available for tle5012b chips.
ta: `Anglag_debug_write chip = <config_name> reg = <egarge> val = <value>`: மூல "மதிப்பை" பதிவேட்டில் "பதிவு" என்று எழுதுகிறார். "மதிப்பு" மற்றும் "பதிவு" இரண்டும் ஒரு தசம அல்லது எக்சாடெசிமல் முழு எண்ணாக இருக்கலாம். கவனத்துடன் பயன்படுத்தவும், குறிப்புக்கு சென்சார் தரவு தாளைப் பார்க்கவும். இது TLE5012B சில்லுகளுக்கு மட்டுமே கிடைக்கிறது.

source: The following command is available when any of the [led config sections](Config_Reference.md#leds) are enabled.
ta: [எல்.ஈ.டி கட்டமைப்பு பிரிவுகள்] (config_reference.md#LED கள்) இயக்கப்படும்போது பின்வரும் கட்டளை கிடைக்கும்.

source: `SET_LED LED=<config_name> RED=<value> GREEN=<value> BLUE=<value> WHITE=<value> [INDEX=<index>] [TRANSMIT=0] [SYNC=1]`: This sets the LED output. Each color `<value>` must be between 0.0 and 1.0. The WHITE option is only valid on RGBW LEDs. If the LED supports multiple chips in a daisy-chain then one may specify INDEX to alter the color of just the given chip (1 for the first chip, 2 for the second, etc.). If INDEX is not provided then all LEDs in the daisy-chain will be set to the provided color. If TRANSMIT=0 is specified then the color change will only be made on the next SET_LED command that does not specify TRANSMIT=0; this may be useful in combination with the INDEX parameter to batch multiple updates in a daisy-chain. By default, the SET_LED command will sync it's changes with other ongoing gcode commands. This can lead to undesirable behavior if LEDs are being set while the printer is not printing as it will reset the idle timeout. If careful timing is not needed, the optional SYNC=0 parameter can be specified to apply the changes without resetting the idle timeout.
ta: `Set_led led = <config_name> சிவப்பு = <மதிப்பு> பச்சை = <மதிப்பு> நீலம் = <மதிப்பு> வெள்ளை = <value> [index = <endex>] [டிரான்ச்மிட் = 0] [ஒத்திசைவு = 1]`: இது எல்.ஈ. வெளியீடு. ஒவ்வொரு வண்ணமும் `<மதிப்பு>` 0.0 முதல் 1.0 வரை இருக்க வேண்டும். வெள்ளை விருப்பம் RGBW எல்.ஈ.டிகளில் மட்டுமே செல்லுபடியாகும். எல்.ஈ. குறியீட்டு வழங்கப்படாவிட்டால், டெய்சி-சங்கிலியில் உள்ள அனைத்து எல்.ஈ.டிகளும் வழங்கப்பட்ட வண்ணத்திற்கு அமைக்கப்படும். டிரான்ச்மிட் = 0 குறிப்பிடப்பட்டால், டிரான்ச்மிட் = 0 ஐக் குறிப்பிடாத அடுத்த செட்_ல்ட் கட்டளையில் மட்டுமே வண்ண மாற்றம் செய்யப்படும்; டெய்சி-சங்கிலியில் பல புதுப்பிப்புகளை தொகுக்க குறியீட்டு அளவுருவுடன் இணைந்து இது பயனுள்ளதாக இருக்கும். இயல்பாக, SET_LED கட்டளை அதன் மாற்றங்களை மற்ற GCODE கட்டளைகளுடன் ஒத்திசைக்கும். அச்சுப்பொறி அச்சிடாதபோது எல்.ஈ.டிக்கள் அமைக்கப்பட்டால் இது விரும்பத்தகாத நடத்தைக்கு வழிவகுக்கும், ஏனெனில் இது செயலற்ற காலக்கெடுவை மீட்டமைக்கும். கவனமாக நேரம் தேவையில்லை என்றால், செயலற்ற காலக்கெடுவை மீட்டமைக்காமல் மாற்றங்களைப் பயன்படுத்த விருப்ப ஒத்திசைவு = 0 அளவுருவைக் குறிப்பிடலாம்.

source: `SET_LED_TEMPLATE LED=<led_name> TEMPLATE=<template_name> [<param_x>=<literal>] [INDEX=<index>]`: Assign a [display_template](Config_Reference.md#display_template) to a given [LED](Config_Reference.md#leds). For example, if one defined a `[display_template my_led_template]` config section then one could assign `TEMPLATE=my_led_template` here. The display_template should produce a comma separated string containing four floating point numbers corresponding to red, green, blue, and white color settings. The template will be continuously evaluated and the LED will be automatically set to the resulting colors. One may set display_template parameters to use during template evaluation (parameters will be parsed as Python literals). If INDEX is not specified then all chips in the LED's daisy-chain will be set to the template, otherwise only the chip with the given index will be updated. If TEMPLATE is an empty string then this command will clear any previous template assigned to the LED (one can then use `SET_LED` commands to manage the LED's color settings).
ta: `Set_led_template led = <ed_name> வார்ப்புரு = <ementuplate_name> [<carm_x> = <iteral>] [index = <index>]`. .md#LEDS). எடுத்துக்காட்டாக, ஒருவர் `[display_template my_led_template]` கட்டமைப்பு பிரிவை வரையறுத்தால், ஒருவர் `வார்ப்புரு = my_led_template` ஐ இங்கே ஒதுக்கலாம். டிச்ப்ளே_டெம்ப்ளேட் சிவப்பு, பச்சை, நீலம் மற்றும் வெள்ளை வண்ண அமைப்புகளுடன் தொடர்புடைய நான்கு மிதக்கும் புள்ளி எண்களைக் கொண்ட கமா பிரிக்கப்பட்ட சரத்தை உருவாக்க வேண்டும். வார்ப்புரு தொடர்ந்து மதிப்பீடு செய்யப்படும் மற்றும் எல்.ஈ.டி தானாகவே அதன் விளைவாக வரும் வண்ணங்களுக்கு அமைக்கப்படும். வார்ப்புரு மதிப்பீட்டின் போது பயன்படுத்த வேண்டிய காட்சி_டெம்ப்ளேட் அளவுருக்களை ஒருவர் அமைக்கலாம் (அளவுருக்கள் பைதான் லிட்டரர்களாக பாகுபடுத்தப்படும்). குறியீடு குறிப்பிடப்படவில்லை எனில், எல்.ஈ.டி.யின் டெய்சி-சங்கிலியில் உள்ள அனைத்து சில்லுகளும் வார்ப்புருவுக்கு அமைக்கப்படும், இல்லையெனில் கொடுக்கப்பட்ட குறியீட்டைக் கொண்ட சிப் மட்டுமே புதுப்பிக்கப்படும். வார்ப்புரு ஒரு வெற்று சரம் என்றால், இந்த கட்டளை எல்.ஈ.

source: The query_adc module is automatically loaded.
ta: Query_ADC தொகுதி தானாக ஏற்றப்படும்.

source: Several commands are available when a [smart_effector config section](Config_Reference.md#smart_effector) is enabled. Be sure to check the official documentation for the Smart Effector on the [Duet3D Wiki](https://duet3d.dozuki.com/Wiki/Smart_effector_and_carriage_adapters_for_delta_printer) before changing the Smart Effector parameters. Also check the [probe calibration guide](Probe_Calibrate.md).
ta: [ச்மார்ட்_ஃபெக்டர் கட்டமைப்பு பிரிவு] (config_reference.md#stard_effector) இயக்கப்பட்டால் பல கட்டளைகள் கிடைக்கின்றன. அறிவுள்ள செயல்திறன் அளவுருக்களை மாற்றுவதற்கு முன் [டூய்ட் 3 டி விக்கி] (https://duet3d.dozuki.com/wiki/smart_effector_andapters_for_delta_printer) அறிவுள்ள செயல்திறனுக்கான அதிகாரப்பூர்வ ஆவணங்களை சரிபார்க்கவும். [ஆய்வு அளவுத்திருத்த வழிகாட்டி] (probe_calibrate.md) ஐயும் சரிபார்க்கவும்.

source: `SET_SMART_EFFECTOR [SENSITIVITY=<sensitivity>] [ACCEL=<accel>] [RECOVERY_TIME=<time>]`: Set the Smart Effector parameters. When `SENSITIVITY` is specified, the respective value is written to the SmartEffector EEPROM (requires `control_pin` to be provided). Acceptable `<sensitivity>` values are 0..255, the default is 50. Lower values require less nozzle contact force to trigger (but there is a higher risk of false triggering due to vibrations during probing), and higher values reduce false triggering (but require larger contact force to trigger). Since the sensitivity is written to EEPROM, it is preserved after the shutdown, and so it does not need to be configured on every printer startup. `ACCEL` and `RECOVERY_TIME` allow to override the corresponding parameters at run-time, see the [config section](Config_Reference.md#smart_effector) of Smart Effector for more info on those parameters.
ta: `Set_smart_effector [உணர்திறன் = <sensitivity>] [முடி = <ched>] [மீட்பு_ நேரம் = <time>]`: அறிவுள்ள செயல்திறன் அளவுருக்களை அமைக்கவும். `உணர்திறன்` குறிப்பிடப்படும்போது, அந்தந்த மதிப்பு ச்மார்ட்ஃபெக்டர் EEPROM க்கு எழுதப்படுகிறது (வழங்கப்பட வேண்டும்` control_pin` தேவை). ஏற்றுக்கொள்ளக்கூடிய `<உணர்திறன்>` மதிப்புகள் 0..255, இயல்புநிலை 50 ஆகும். குறைந்த மதிப்புகளுக்கு தூண்டுவதற்கு குறைந்த முனை தொடர்பு ஆற்றல் தேவைப்படுகிறது (ஆனால் ஆய்வு செய்யும் போது அதிர்வுகளால் தவறான தூண்டுதல் அதிக இடர் உள்ளது), மற்றும் அதிக மதிப்புகள் தவறான தூண்டுதலைக் குறைக்கின்றன (ஆனால் தூண்டுவதற்கு பெரிய தொடர்பு ஆற்றல் தேவை). உணர்திறன் EEPROM க்கு எழுதப்பட்டிருப்பதால், அது பணிநிறுத்தத்திற்குப் பிறகு பாதுகாக்கப்படுகிறது, எனவே ஒவ்வொரு அச்சுப்பொறி தொடக்கத்திலும் கட்டமைக்க தேவையில்லை. `முடி மற்றும்` மீட்பு_ நேரம்` ரன்-நேரத்தில் தொடர்புடைய அளவுருக்களை மேலெழுத அனுமதிக்கவும், அந்த அளவுருக்கள் பற்றிய கூடுதல் தகவலுக்கு அறிவுள்ள செயல்திறனின் [கட்டமைப்பு பிரிவு] (config_reference.md#stard_effector) ஐப் பார்க்கவும்.

source: `RESET_SMART_EFFECTOR`: Resets Smart Effector sensitivity to its factory settings. Requires `control_pin` to be provided in the config section.
ta: `Reset_smart_effector`: அறிவுள்ள செயல்திறன் உணர்திறனை அதன் தொழிற்சாலை அமைப்புகளுக்கு மீட்டமைக்கிறது. கட்டமைப்பு பிரிவில் வழங்கப்பட வேண்டும்.

source: This section is organized by Klipper module name, which generally follows the section names specified in the [printer configuration file](Config_Reference.md). Note that some modules are automatically loaded.
ta: இந்த பிரிவு கிளிப்பர் தொகுதி பெயரால் ஒழுங்கமைக்கப்பட்டுள்ளது, இது பொதுவாக [அச்சுப்பொறி உள்ளமைவு கோப்பு] (config_reference.md) இல் குறிப்பிடப்பட்டுள்ள பிரிவு பெயர்களைப் பின்பற்றுகிறது. சில தொகுதிகள் தானாக ஏற்றப்படும் என்பதை நினைவில் கொள்க.

source: The following commands are available when an [exclude_object config section](Config_Reference.md#exclude_object) is enabled (also see the [exclude object guide](Exclude_Object.md)):
ta: ஒரு [விலக்கு_ஆப்செக்ட் கட்டமைப்பு பிரிவு] (config_reference.md#excoude_object) இயக்கப்பட்டிருக்கும் போது பின்வரும் கட்டளைகள் கிடைக்கும் ([விலக்கு பொருள் வழிகாட்டியை விலக்கு] (விலக்கு_ஆப்செக்ட்.எம்டி) ஐப் பார்க்கவும்):

source: `EXCLUDE_OBJECT`
ta: `விலக்கு_ஆப்செக்ட்`

source: `EXCLUDE_OBJECT [NAME=object_name] [CURRENT=1] [RESET=1]`: With no parameters, this will return a list of all currently excluded objects.
ta: `விலக்கு_ஆப்செக்ட் [பெயர் = பொருள்_பெயர்] [நடப்பு = 1] [மீட்டமை = 1]`: அளவுருக்கள் இல்லாமல், இது தற்போது விலக்கப்பட்ட அனைத்து பொருட்களின் பட்டியலையும் தரும்.

source: When the `NAME` parameter is given, the named object will be excluded from printing.
ta: `பெயர்` அளவுரு வழங்கப்படும்போது, பெயரிடப்பட்ட பொருள் அச்சிடுவதிலிருந்து விலக்கப்படும்.

source: When the `CURRENT` parameter is given, the current object will be excluded from printing.
ta: `தற்போதைய` அளவுரு வழங்கப்படும்போது, தற்போதைய பொருள் அச்சிடுவதிலிருந்து விலக்கப்படும்.
