Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/G-Codes.po
Languages: ta, zh_hans

source: `SET_SERVO SERVO=config_name [ANGLE=<degrees> | WIDTH=<seconds>]`: Set the servo position to the given angle (in degrees) or pulse width (in seconds). Use `WIDTH=0` to disable the servo output.
ta: `Set_servo servo = config_name [கோணம் = <டிகிரி> | அகலம் = <விநாடிகள்>] `: சேவையக நிலையை கொடுக்கப்பட்ட கோணத்திற்கு (டிகிரிகளில்) அல்லது துடிப்பு அகலம் (விநாடிகளில்) அமைக்கவும். சர்வோ வெளியீட்டை முடக்க `அகலம் = 0` ஐப் பயன்படுத்தவும்.

source: `MANUAL_STEPPER STEPPER=config_name [ENABLE=[0|1]] [SET_POSITION=<pos>] [SPEED=<speed>] [ACCEL=<accel>] [MOVE=<pos> [STOP_ON_ENDSTOP=[1|2|-1|-2]] [SYNC=0]]`: This command will alter the state of the stepper. Use the ENABLE parameter to enable/disable the stepper. Use the SET_POSITION parameter to force the stepper to think it is at the given position. Use the MOVE parameter to request a movement to the given position. If SPEED and/or ACCEL is specified then the given values will be used instead of the defaults specified in the config file. If an ACCEL of zero is specified then no acceleration will be performed. If STOP_ON_ENDSTOP=1 is specified then the move will end early should the endstop report as triggered (use STOP_ON_ENDSTOP=2 to complete the move without error even if the endstop does not trigger, use -1 or -2 to stop when the endstop reports not triggered). Normally future G-Code commands will be scheduled to run after the stepper move completes, however if a manual stepper move uses SYNC=0 then future G-Code movement commands may run in parallel with the stepper movement.
ta: `Manual_stepper Stepper = config_name [enable = [0 | 1]] 1 | -2]]] [ஒத்திசைவு = 0]] `: இந்த கட்டளை ச்டெப்பரின் நிலையை மாற்றும். ச்டெப்பரை இயக்க/முடக்குவதற்கு இயக்க அளவுருவைப் பயன்படுத்தவும். STEPER கொடுக்கப்பட்ட நிலையில் இருப்பதாக நினைக்கும்படி கட்டாயப்படுத்த SET_POSITION அளவுருவைப் பயன்படுத்தவும். கொடுக்கப்பட்ட நிலைக்கு ஒரு இயக்கத்தைக் கோர நகர்வு அளவுருவைப் பயன்படுத்தவும். விரைவு மற்றும்/அல்லது முடி குறிப்பிடப்பட்டால், கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள இயல்புநிலைகளுக்கு பதிலாக கொடுக்கப்பட்ட மதிப்புகள் பயன்படுத்தப்படும். பூச்சியத்தின் முடி குறிப்பிடப்பட்டால், முடுக்கம் எதுவும் செய்யப்படாது. STOP_ON_ENDSTOP = 1 குறிப்பிடப்பட்டால், எண்ட்ச்டாப் அறிக்கை தூண்டப்பட்டதாக இருக்க வேண்டும் (ச்டாப்_ஓஎன்_என்ச்டாப் = 2 ஐப் பயன்படுத்தவும், எண்ட்ச்டாப் தூண்டவில்லை என்றாலும், பிழையில்லாமல் நகர்வை முடிக்க, எண்ட்ச்டாப் அறிக்கைகள் இல்லாதபோது நிறுத்த -1 அல்லது -2 ஐப் பயன்படுத்தவும் தூண்டப்பட்டது). பொதுவாக எதிர்கால சி-கோட் கட்டளைகள் ச்டெப்பர் நகர்வு முடிந்ததும் இயங்க திட்டமிடப்படும், இருப்பினும் ஒரு கையேடு ச்டெப்பர் நகர்வு ஒத்திசைவு = 0 ஐப் பயன்படுத்தினால், எதிர்கால சி-கோட் இயக்கம் கட்டளைகள் ச்டெப்பர் இயக்கத்திற்கு இணையாக இயங்கக்கூடும்.
zh_hans: `MANUAL_STEPPER STEPPER=config_name [ENABLE=[0|1]] [SET_POSITION=<pos>] [SPEED=<speed>] [ACCEL=<accel>] [MOVE=<pos> [STOP_ON_ENDSTOP=[1|2|-1|-2]] [SYNC=0]]`：该命令将改变步进器的状态。使用ENABLE参数来启用/禁用步进。使用SET_POSITION参数，迫使步进认为它处于给定的位置。使用MOVE参数，要求移动到给定位置。如果指定了SPEED或者ACCEL，那么将使用给定的值而不是配置文件中指定的默认值。如果指定ACCEL为0，那么将不执行加速。如果STOP_ON_ENDSTOP=1被指定，那么如果止动器报告被触发，动作将提前结束（使用STOP_ON_ENDSTOP=2来完成动作，即使止动器没有被触发也不会出错，使用-1或-2来在止动器报告没有被触发时停止）。通常情况下，未来的G-Code命令将被安排在步进运动完成后运行，但是如果手动步进运动使用SYNC=0，那么未来的G-Code运动命令可能与步进运动平行运行。

source: `PROBE [PROBE_SPEED=<mm/s>] [LIFT_SPEED=<mm/s>] [SAMPLES=<count>] [SAMPLE_RETRACT_DIST=<mm>] [SAMPLES_TOLERANCE=<mm>] [SAMPLES_TOLERANCE_RETRIES=<count>] [SAMPLES_RESULT=median|average]`: Move the nozzle downwards until the probe triggers. If any of the optional parameters are provided they override their equivalent setting in the [probe config section](Config_Reference.md#probe).
ta: `ஆய்வு [probe_speed = <mm/s>] [lift_speed = <mm/s>] [மாதிரிகள் = <count>] [salem_retract_dist = <mm>] [sample_tolerance = <mm>] [samples_tolerance_retries = <count>] [samples_result = சராசரி | சராசரி] `: ஆய்வு தூண்டும் வரை முனை கீழ்நோக்கி நகர்த்தவும். ஏதேனும் விருப்ப அளவுருக்கள் வழங்கப்பட்டால், அவை [ஆய்வு கட்டமைப்பு பிரிவு] (config_reference.md#ஆய்வு) இல் அவற்றின் சமமான அமைப்பை மேலெழுதும்.
zh_hans: `PROBE [PROBE_SPEED=<mm/s>] [LIFT_SPEED=<mm/s>] [SAMPLES=<count>] [SAMPLE_RETRACT_DIST=<mm>] [SAMPLES_TOLERANCE=<mm>] [SAMPLES_TOLERANCE_RETRIES=<count>] [SAMPLES_RESULT=median|average]`：向下移动喷嘴直到探针触发。如果提供了任何可选参数，它们将覆盖 [probe config section](Config_Reference.md#probe) 中的等效设置。

source: `QUERY_PROBE`: Report the current status of the probe ("triggered" or "open").
ta: `QUERY_PROBE`: ஆய்வின் தற்போதைய நிலையைப் புகாரளிக்கவும் (" தூண்டப்பட்டது "அல்லது" திறந்த ").
zh_hans: `QUERY_PROBE`:报告探针的当前状态（"triggered"或 "open"）。

source: `PROBE_ACCURACY [PROBE_SPEED=<mm/s>] [SAMPLES=<count>] [SAMPLE_RETRACT_DIST=<mm>]`: Calculate the maximum, minimum, average, median, and standard deviation of multiple probe samples. By default, 10 SAMPLES are taken. Otherwise the optional parameters default to their equivalent setting in the probe config section.
ta: `Probe_accuracy [probe_speed = <mm/s>] [மாதிரிகள் = <count>] [salem_retract_dist = <mm>]`: பல ஆய்வு மாதிரிகளின் அதிகபட்ச, குறைந்தபட்ச, சராசரி, சராசரி மற்றும் நிலையான விலகலைக் கணக்கிடுங்கள். இயல்பாக, 10 மாதிரிகள் எடுக்கப்படுகின்றன. இல்லையெனில், விருப்ப அளவுருக்கள் ஆய்வு கட்டமைப்பு பிரிவில் அவற்றின் சமமான அமைப்பிற்கு இயல்புநிலையாக இருக்கும்.
zh_hans: `PROBE_ACCURACY [PROBE_SPEED=<mm/s>] [SAMPLES=<count>] [SAMPLE_RETRACT_DIST=<mm>]`：计算多个探针样本的最大、最小、平均、中位数和标准偏差。默认情况下采样10次。否则可选参数默认为探针配置部分的同等设置。

source: `PROBE_CALIBRATE [SPEED=<speed>] [<probe_parameter>=<value>]`: Run a helper script useful for calibrating the probe's z_offset. See the PROBE command for details on the optional probe parameters. See the MANUAL_PROBE command for details on the SPEED parameter and the additional commands available while the tool is active. Please note, the PROBE_CALIBRATE command uses the speed variable to move in XY direction as well as Z.
ta: `Probe_calibrate [வேகம் = <speed>] [<probe_parameter> = <மதிப்பு>]`: ஆய்வின் z_offset ஐ அளவீடு செய்வதற்கு பயனுள்ள உதவி ச்கிரிப்டை இயக்கவும். விருப்ப ஆய்வு அளவுருக்கள் குறித்த விவரங்களுக்கு ஆய்வு கட்டளையைப் பார்க்கவும். கருவி செயலில் இருக்கும்போது வேக அளவுரு மற்றும் கூடுதல் கட்டளைகள் குறித்த விவரங்களுக்கு கையேடு_பிரோப் கட்டளையைப் பார்க்கவும். தயவுசெய்து கவனிக்கவும், probe_calibrate கட்டளை வேக மாறியைப் பயன்படுத்தி XY திசையிலும் சட்.
zh_hans: `PROBE_CALIBRATE [SPEED=<speed>] [<probe_parameter>=<value>] `:运行一个对校准测头的z_offset有用的辅助脚本。有关可选测头参数的详细信息，请参见PROBE命令。参见MANUAL_PROBE命令，了解SPEED参数和工具激活时可用的附加命令的详细信息。请注意，PROBE_CALIBRATE命令使用速度变量在XY方向以及Z方向上移动。

source: `BLTOUCH_STORE MODE=<output_mode>`: This stores an output mode in the EEPROM of a BLTouch V3.1 Available output_modes are: `5V`, `OD`
ta: `Bltouch_store பயன்முறை = <uption_mode>`: இது ஒரு வெளியீட்டு பயன்முறையை ஒரு Bltouch v3.1 இன் EEPROM இல் சேமிக்கிறது.
zh_hans: `BLTOUCH_STORE MODE=<output_mode>`:这将在BLTouch V3.1的EEPROM中存储一个输出模式 可用的输出模式有`5V`, `OD`

source: `DELTA_ANALYZE`: This command is used during enhanced delta calibration. See [Delta Calibrate](Delta_Calibrate.md) for details.
ta: `டெல்டா_அனலைச்`: மேம்பட்ட டெல்டா அளவுத்திருத்தத்தின் போது இந்த கட்டளை பயன்படுத்தப்படுகிறது. விவரங்களுக்கு [டெல்டா அளவீடு] (டெல்டா_கலிபிரேட். எம்.டி) ஐப் பார்க்கவும்.
zh_hans: `DELTA_ANALYZE`:这个命令在增强的delta校准过程中使用。详情见[Delta Calibrate](Delta_Calibrate.md)。

source: `BED_MESH_MAP`: Like to BED_MESH_OUTPUT, this command prints the current state of the mesh to the terminal. Instead of printing the values in a human readable format, the state is serialized in json format. This allows octoprint plugins to easily capture the data and generate height maps approximating the bed's surface.
ta: `Bed_mesh_map`: bed_mesh_output ஐ விரும்புகிறேன், இந்த கட்டளை கண்ணி தற்போதைய நிலையை முனையத்திற்கு அச்சிடுகிறது. மதிப்புகளை மனித படிக்கக்கூடிய வடிவத்தில் அச்சிடுவதற்கு பதிலாக, மாநிலம் சாதொபொகு வடிவத்தில் வரிசைப்படுத்தப்பட்டுள்ளது. இது ஆக்டோப்ரண்ட் செருகுநிரல்களை தரவை எளிதில் கைப்பற்றவும், படுக்கையின் மேற்பரப்பை தோராயமாக உயர வரைபடங்களை உருவாக்கவும் அனுமதிக்கிறது.
zh_hans: `BED_MESH_MAP`：类似 BED_MESH_OUTPUT，这个命令在终端中显示网格的当前状态。它不以人类可读格式打印，而是被序列化为 json 格式。这允许 Octoprint 插件捕获数据并生成描绘打印床表面的高度图。

source: `BED_MESH_CLEAR`: This command clears the mesh and removes all z adjustment. It is recommended to put this in your end-gcode.
ta: `Bed_mesh_clear`: இந்த கட்டளை கண்ணி அழித்து அனைத்து சட் சரிசெய்தலையும் நீக்குகிறது. இதை உங்கள் இறுதி-GCODE இல் வைக்க பரிந்துரைக்கப்படுகிறது.
zh_hans: `BED_MESH_CLEAR`：此命令清除床网并移除所有 z 调整。建议把它放在你的 end-gcode （结束G代码）中。

source: `BED_SCREWS_ADJUST`: This command will invoke the bed screws adjustment tool. It will command the nozzle to different locations (as defined in the config file) and allow one to make adjustments to the bed screws so that the bed is a constant distance from the nozzle.
ta: `Bed_screws_adjust`: இந்த கட்டளை படுக்கை திருகுகள் சரிசெய்தல் கருவியை அழைக்கும். இது முனை வெவ்வேறு இடங்களுக்கு (கட்டமைப்பு கோப்பில் வரையறுக்கப்பட்டுள்ளபடி) கட்டளையிடும் மற்றும் படுக்கை திருகுகளில் சரிசெய்தல் செய்ய ஒருவரை அனுமதிக்கும், இதனால் படுக்கை முனை இருந்து நிலையான தூரம்.
zh_hans: `BED_SCREWS_ADJUST`：该命令将调用打印床螺丝调整工具。它将命令喷嘴移动到不同的位置（在配置文件中定义），并允许对打印床螺丝进行手动调整，使打印床与喷嘴的距离保持不变。

source: `ENDSTOP_PHASE_CALIBRATE [STEPPER=<config_name>]`: If no STEPPER parameter is provided then this command will reports statistics on endstop stepper phases during past homing operations. When a STEPPER parameter is provided it arranges for the given endstop phase setting to be written to the config file (in conjunction with the SAVE_CONFIG command).
ta: `Endstop_phase_calibrate [stepper = <config_name>]`: ச்டெப்பர் அளவுரு எதுவும் வழங்கப்படவில்லை என்றால், இந்த கட்டளை கடந்த கால செயல்பாடுகளின் போது எண்ட்ச்டாப் ச்டெப்பர் கட்டங்களில் புள்ளிவிவரங்களைப் புகாரளிக்கும். ஒரு ச்டெபர் அளவுரு வழங்கப்படும்போது, கொடுக்கப்பட்ட எண்ட்ச்டாப் கட்ட அமைப்பை கட்டமைப்பு கோப்பில் எழுத ஏற்பாடு செய்கிறது (Save_config கட்டளையுடன் இணைந்து).
zh_hans: `ENDSTOP_PHASE_CALIBRATE [STEPPER=<config_name>]` 。如果没有提供STEPPER参数，那么该命令将报告在过去的归位操作中对端停步进相的统计。当提供STEPPER参数时，它会安排将给定的终点站相位设置写入配置文件中（与SAVE_CONFIG命令一起使用）。

source: `FORCE_MOVE STEPPER=<config_name> DISTANCE=<value> VELOCITY=<value> [ACCEL=<value>]`: This command will forcibly move the given stepper the given distance (in mm) at the given constant velocity (in mm/s). If ACCEL is specified and is greater than zero, then the given acceleration (in mm/s^2) will be used; otherwise no acceleration is performed. No boundary checks are performed; no kinematic updates are made; other parallel steppers on an axis will not be moved. Use caution as an incorrect command could cause damage! Using this command will almost certainly place the low-level kinematics in an incorrect state; issue a G28 afterwards to reset the kinematics. This command is intended for low-level diagnostics and debugging.
ta: `Force_move stepper = <config_name> தூரம் = <மதிப்பு> விரைவு = <மதிப்பு> [முடி = <மதிப்பு>]`: கொடுக்கப்பட்ட நிலையான வேகத்தில் (மிமீ/ இல் மிமீ) இந்த கட்டளை வலுக்கட்டாயமாக நகர்த்தப்படும் கள்). முடி குறிப்பிடப்பட்டால் மற்றும் பூச்சியத்தை விட அதிகமாக இருந்தால், கொடுக்கப்பட்ட முடுக்கம் (மிமீ/எச்^2 இல்) பயன்படுத்தப்படும்; இல்லையெனில் முடுக்கம் எதுவும் செய்யப்படவில்லை. எல்லை சோதனைகள் எதுவும் செய்யப்படவில்லை; இயக்கவியல் புதுப்பிப்புகள் எதுவும் செய்யப்படவில்லை; ஒரு அச்சில் உள்ள பிற இணையான ச்டெப்பர்கள் நகர்த்தப்படாது. தவறான கட்டளை சேதத்தை ஏற்படுத்தும் என்பதால் எச்சரிக்கையுடன் பயன்படுத்தவும்! இந்த கட்டளையைப் பயன்படுத்துவது நிச்சயமாக குறைந்த அளவிலான இயக்கவியலை தவறான நிலையில் வைக்கும்; இயக்கவியலை மீட்டமைக்க G28 ஐ பின்னர் வழங்கவும். இந்த கட்டளை குறைந்த அளவிலான கண்டறிதல் மற்றும் பிழைத்திருத்தத்திற்காக வடிவமைக்கப்பட்டுள்ளது.
zh_hans: `FORCE_MOVE STEPPER=<config_name> DISTANCE=<value> VELOCITY=<value> [ACCEL=<value>]` 。该命令将以给定的恒定速度（mm/s）强制移动给定的步进器，移动距离（mm）。如果指定了ACCEL并且大于零，那么将使用给定的加速度（单位：mm/s^2）；否则不进行加速。不执行边界检查；不进行运动学更新；一个轴上的其他平行步进器将不会被移动。请谨慎使用，因为不正确的命令可能会导致损坏使用该命令几乎肯定会使低级运动学处于不正确的状态；随后发出G28命令以重置运动学。该命令用于低级别的诊断和调试。

source: `SET_KINEMATIC_POSITION [X=<value>] [Y=<value>] [Z=<value>]`: Force the low-level kinematic code to believe the toolhead is at the given cartesian position. This is a diagnostic and debugging command; use SET_GCODE_OFFSET and/or G92 for regular axis transformations. If an axis is not specified then it will default to the position that the head was last commanded to. Setting an incorrect or invalid position may lead to internal software errors. This command may invalidate future boundary checks; issue a G28 afterwards to reset the kinematics.
ta: `Set_kinematic_position [x = <மதிப்பு>] [y = <மதிப்பு>] [z = <மதிப்பு>]`: கருவியின்எட் கொடுக்கப்பட்ட கார்ட்டீசியன் நிலையில் இருப்பதாக நம்புவதற்கு குறைந்த அளவிலான இயக்கக் குறியீட்டை கட்டாயப்படுத்தவும். இது ஒரு கண்டறியும் மற்றும் பிழைத்திருத்த கட்டளை; வழக்கமான அச்சு மாற்றங்களுக்கு SET_GCODE_OFFSET மற்றும்/அல்லது G92 ஐப் பயன்படுத்தவும். ஒரு அச்சு குறிப்பிடப்படாவிட்டால், அது கடைசியாக கட்டளையிடப்பட்ட நிலைக்கு இயல்புநிலையாக இருக்கும். தவறான அல்லது தவறான நிலையை அமைப்பது உள் மென்பொருள் பிழைகளுக்கு வழிவகுக்கும். இந்த கட்டளை எதிர்கால எல்லை சோதனைகளை செல்லாது; இயக்கவியலை மீட்டமைக்க G28 ஐ பின்னர் வழங்கவும்.

source: `SDCARD_LOOP_END`: End a looped section in the SD print.
ta: `SDCARD லூப் எண்ட்`: எச்டி அச்சில் ஒரு லூப் பகுதியை முடிக்கவும்.
zh_hans: `SDCARD_LOOP_END`：结束SD打印中的一个循环部分。

source: `SDCARD_LOOP_DESIST`: Complete existing loops without further iterations.
ta: `SDCARD_LOOP_DESIST`: மேலும் மறு செய்கைகள் இல்லாமல் இருக்கும் சுழல்களை முடிக்கவும்.
zh_hans: `SDCARD_LOOP_DESIST`：完成现有的循环，不再继续迭代。

source: `M118 <message>`: echo the message prepended with the configured default prefix (or `echo: ` if no prefix is configured).
ta: `M118 <seaght>`: கட்டமைக்கப்பட்ட இயல்புநிலை முன்னொட்டுடன் தயாரிக்கப்பட்ட செய்தியை எதிரொலிக்கவும் (அல்லது `எதிரொலி:` எந்த முன்னொட்டு கட்டமைக்கப்படாவிட்டால்).
zh_hans: `M118 <message>`：回显配置了默认前缀的信息（如果没有配置前缀，则返回`echo: `）。

source: `RESPOND MSG="<message>"`: echo the message prepended with the configured default prefix (or `echo: ` if no prefix is configured).
ta: `பதிலளிக்கவும் msg =" <seagnie> "`: கட்டமைக்கப்பட்ட இயல்புநிலை முன்னொட்டுடன் தயாரிக்கப்பட்ட செய்தியை எதிரொலிக்கவும் (அல்லது `எதிரொலி:` எந்த முன்னொட்டு கட்டமைக்கப்படாவிட்டால்).

source: `RESPOND TYPE=echo MSG="<message>"`: echo the message prepended with `echo: `.
ta: `பதிலளிக்கவும் வகை = எதிரொலி msg =" <seagnition> "`: `எதிரொலி:` உடன் தயாரிக்கப்பட்ட செய்தியை எதிரொலிக்கவும்.

source: `RESPOND TYPE=error MSG="<message>"`: echo the message prepended with `!! `.
ta: `பதிலளிக்கும் வகை = பிழை msg =" <seagnitel> "`: `உடன் தயாரிக்கப்பட்ட செய்தியை எதிரொலிக்கவும் !! `.

source: `RESPOND PREFIX=<prefix> MSG="<message>"`: echo the message prepended with `<prefix>`. (The `PREFIX` parameter will take priority over the `TYPE` parameter)
ta: `பதிலளிக்கவும் முன்னொட்டு = <முன்னொட்டு> msg =" <seaghte> "` `:` <முன்னொட்டு> with உடன் தயாரிக்கப்பட்ட செய்தியை எதிரொலிக்கவும். (`முன்னொட்டு` அளவுரு` வகை` அளவுருவை விட முன்னுரிமை பெறும்)
zh_hans: `RESPOND PREFIX=<prefix> MSG="<message>"`: 回应以`<prefix>`为前缀的信息。(`PREFIX`参数将优先于`TYPE`参数)

source: The following commands are available when the [pause_resume config section](Config_Reference.md#pause_resume) is enabled:
ta: [Pause_resume கட்டமைப்பு பிரிவு] (config_reference.md#pause_resume) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கின்றன:

source: `PAUSE`: Pauses the current print. The current position is captured for restoration upon resume.
ta: `இடைநிறுத்தம்`: தற்போதைய அச்சிடலை இடைநிறுத்துகிறது. தற்போதைய நிலை விண்ணப்பத்தை மீட்டெடுப்பதற்காக கைப்பற்றப்படுகிறது.
zh_hans: `PAUSE`：暂停当前的打印。当前的位置被报错以便在恢复时恢复。

source: `RESUME [VELOCITY=<value>]`: Resumes the print from a pause, first restoring the previously captured position. The VELOCITY parameter determines the speed at which the tool should return to the original captured position.
ta: `மீண்டும் தொடங்கு [வேகம் = <மதிப்பு>]`: இடைநிறுத்தத்திலிருந்து அச்சிடலை மீண்டும் தொடங்குகிறது, முதலில் கைப்பற்றப்பட்ட நிலையை மீட்டெடுக்கிறது. விரைவு அளவுரு கருவி அசல் கைப்பற்றப்பட்ட நிலைக்கு திரும்ப வேண்டிய வேகத்தை தீர்மானிக்கிறது.
zh_hans: `RESUME [VELOCITY=<value>]`：从暂停中恢复打印，首先恢复以前保持的位置。VELOCITY参数决定了工具返回到原始捕捉位置的速度。

source: `CLEAR_PAUSE`: Clears the current paused state without resuming the print. This is useful if one decides to cancel a print after a PAUSE. It is recommended to add this to your start gcode to make sure the paused state is fresh for each print.
ta: `Clear_Pause`: அச்சிடலை மீண்டும் தொடங்காமல் தற்போதைய இடைநிறுத்தப்பட்ட நிலையை அழிக்கிறது. இடைநிறுத்தத்திற்குப் பிறகு ஒரு அச்சை ரத்து செய்ய முடிவு செய்தால் இது பயனுள்ளதாக இருக்கும். ஒவ்வொரு அச்சுக்கும் இடைநிறுத்தப்பட்ட நிலை புதியது என்பதை உறுதிப்படுத்த உங்கள் தொடக்க GCODE இல் இதைச் சேர்க்க பரிந்துரைக்கப்படுகிறது.
zh_hans: `CLEAR_PAUSE`:清除当前的暂停状态而不恢复打印。如果一个人决定在暂停后取消打印，这很有用。建议将其添加到你的启动代码中，以确保每次打印时的暂停状态是新的。

source: `CANCEL_PRINT`: Cancels the current print.
ta: `CANCEL_PRINT`: தற்போதைய அச்சிடலை ரத்து செய்கிறது.
zh_hans: `CANCEL_PRINT`：取消当前的打印。

source: `SET_FILAMENT_SENSOR SENSOR=<sensor_name> ENABLE=[0|1]`: Sets the filament sensor on/off. If ENABLE is set to 0, the filament sensor will be disabled, if set to 1 it is enabled.
ta: `Set_filament_sensor உணரி = <sensor_name> enable = [0 | 1]`: ஃபிலமென்ட் சென்சார் ஆன்/ஆஃப் அமைக்கிறது. செயல்படுத்த 0 என அமைக்கப்பட்டால், இழை சென்சார் முடக்கப்படும், 1 ஆக அமைக்கப்பட்டால் அது இயக்கப்பட்டிருக்கும்.
zh_hans: `SET_FILAMENT_SENSOR SENSOR=<sensor_name> ENABLE=[0|1]` ：设置灯丝传感器的开/关。如果 ENABLE 设置为 0，耗材传感器将被禁用，如果设置为 1是启用。

source: `SET_RETRACTION [RETRACT_LENGTH=<mm>] [RETRACT_SPEED=<mm/s>] [UNRETRACT_EXTRA_LENGTH=<mm>] [UNRETRACT_SPEED=<mm/s>]`: Adjust the parameters used by firmware retraction. RETRACT_LENGTH determines the length of filament to retract and unretract. The speed of retraction is adjusted via RETRACT_SPEED, and is typically set relatively high. The speed of unretraction is adjusted via UNRETRACT_SPEED, and is not particularly critical, although often lower than RETRACT_SPEED. In some cases it is useful to add a small amount of additional length on unretraction, and this is set via UNRETRACT_EXTRA_LENGTH. SET_RETRACTION is commonly set as part of slicer per-filament configuration, as different filaments require different parameter settings.
ta: `Set_retraction [retact_length = <mm>] [retact_speed = <mm/s>] [Unertract_extra_length = <mm>] [Unertract_speed = <mm/s>]`: ஃபார்ம்வேர் பின்வாங்கலால் பயன்படுத்தப்படும் அளவுருக்களை சரிசெய்யவும். Retact_length பின்வாங்குவதற்கும், கட்டுப்பாடற்றதற்கும் இழைகளின் நீளத்தை தீர்மானிக்கிறது. பின்வாங்கலின் விரைவு ரெட்ராக்ட்_ச்பீட் வழியாக சரிசெய்யப்படுகிறது, மேலும் இது பொதுவாக ஒப்பீட்டளவில் அதிகமாக அமைக்கப்படுகிறது. ஒத்திசைவின் விரைவு Unretract_speed வழியாக சரிசெய்யப்படுகிறது, மேலும் இது குறிப்பாக முக்கியமானதல்ல, இருப்பினும் பெரும்பாலும் ரெட்ராக்ட்_ச்பீட்டை விட குறைவாக இருந்தாலும். சில சந்தர்ப்பங்களில், ஒரு சிறிய அளவு கூடுதல் நீளத்தை ஒத்திசைவதில் சேர்ப்பது பயனுள்ளதாக இருக்கும், மேலும் இது Unretract_extra_length வழியாக அமைக்கப்படுகிறது. Set_Retraction பொதுவாக ஒவ்வொரு-நிரப்புதல் உள்ளமைவின் ஒரு பகுதியாக அமைக்கப்படுகிறது, ஏனெனில் வெவ்வேறு இழைகளுக்கு வெவ்வேறு அளவுரு அமைப்புகள் தேவைப்படுகின்றன.

source: `GET_RETRACTION`: Queries the current parameters used by firmware retraction and displays them on the terminal.
ta: `Get_retraction`: ஃபார்ம்வேர் பின்வாங்கினால் பயன்படுத்தப்படும் தற்போதைய அளவுருக்களை வினவுகிறது மற்றும் அவற்றை முனையத்தில் காண்பிக்கும்.
zh_hans: `GET_RETRACTION`:查询当前固件回抽所使用的参数并在终端显示。

source: `G10`: Retracts the extruder using the currently configured parameters.
ta: `சி 10`: தற்போது உள்ளமைக்கப்பட்ட அளவுருக்களைப் பயன்படுத்தி எக்ச்ட்ரூடரைத் திரும்பப் பெறுகிறது.
zh_hans: `G10`：使用当前配置的参数回抽挤出机。

source: `G11`: Unretracts the extruder using the currently configured parameters.
ta: `சி 11`: தற்போது உள்ளமைக்கப்பட்ட அளவுருக்களைப் பயன்படுத்தி எக்ச்ட்ரூடரை வெளியிடுகிறது.
zh_hans: `G11`：不使用当前配置的参数回抽挤出机。

source: `SET_SKEW [XY=<ac_length,bd_length,ad_length>] [XZ=<ac,bd,ad>] [YZ=<ac,bd,ad>] [CLEAR=<0|1>]`: Configures the [skew_correction] module with measurements (in mm) taken from a calibration print. One may enter measurements for any combination of planes, planes not entered will retain their current value. If `CLEAR=1` is entered then all skew correction will be disabled.
ta: `Set_skew [xy = <ac_length, bd_length, ad_length>] [xz = <ac, bd, ad>] [yz = <c, bd, ad>] [தெளிவான = <0 | 1>]`: [skew_correction ஐ கட்டமைக்கிறது ] அளவுத்திருத்த அச்சிலிருந்து எடுக்கப்பட்ட அளவீடுகளுடன் (மிமீ) தொகுதி. விமானங்களின் எந்தவொரு கலவைக்கும் ஒருவர் அளவீடுகளை உள்ளிடலாம், உள்ளிடப்படாத விமானங்கள் அவற்றின் தற்போதைய மதிப்பைத் தக்க வைத்துக் கொள்ளும். `தெளிவான = 1` உள்ளிட்டால், அனைத்து வளைவு திருத்தம் முடக்கப்படும்.

source: `GET_CURRENT_SKEW`: Reports the current printer skew for each plane in both radians and degrees. The skew is calculated based on parameters provided via the `SET_SKEW` gcode.
ta: `Get_current_skew`: ஒவ்வொரு விமானத்திற்கும் தற்போதைய அச்சுப்பொறி வளைவை ரேடியன்கள் மற்றும் டிகிரி இரண்டிலும் தெரிவிக்கிறது. `Set_skew` gcode வழியாக வழங்கப்பட்ட அளவுருக்களின் அடிப்படையில் வளைவு கணக்கிடப்படுகிறது.
zh_hans: `GET_CURRENT_SKEW`:以弧度和度数报告每个平面的当前打印机偏移。斜度是根据通过`SET_SKEW`代码提供的参数计算的。

source: `UPDATE_DELAYED_GCODE [ID=<name>] [DURATION=<seconds>]`: Updates the delay duration for the identified [delayed_gcode] and starts the timer for gcode execution. A value of 0 will cancel a pending delayed gcode from executing.
ta: `Update_delayed_gcode [id = <amane>] [காலம் = <விநாடிகள்>]`: அடையாளம் காணப்பட்ட [தாமதமான_சி கோட்] தாமத காலத்தைப் புதுப்பித்து, GCODE செயல்படுத்தலுக்கான டைமரைத் தொடங்குகிறது. 0 இன் மதிப்பு நிலுவையில் உள்ள தாமதமான GCODE ஐ செயல்படுத்துவதிலிருந்து ரத்து செய்யும்.

source: `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>`: Saves the variable to disk so that it can be used across restarts. All stored variables are loaded into the `printer.save_variables.variables` dict at startup and can be used in gcode macros. The provided VALUE is parsed as a Python literal.
ta: `Save_variable variact = <aname> மதிப்பு = <மதிப்பு>`: மாறி வட்டில் சேமிக்கிறது, இதனால் மறுதொடக்கங்கள் முழுவதும் பயன்படுத்தப்படலாம். சேமிக்கப்பட்ட அனைத்து மாறிகள் தொடக்கத்தில் `அச்சுப்பொறி.சேவ்_வார்பிள்கள். வழங்கப்பட்ட மதிப்பு ஒரு பைதான் மொழியாக பாகுபடுத்தப்படுகிறது.
zh_hans: `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>`：将变量保存到磁盘，以便在重新启动时使用。所有存储的变量都会在启动时加载到 `printer.save_variables.variables` 目录中，并可以在 gcode 宏中使用。所提供的 VALUE 会被解析为一个 Python 字面。

source: `SET_INPUT_SHAPER [SHAPER_FREQ_X=<shaper_freq_x>] [SHAPER_FREQ_Y=<shaper_freq_y>] [DAMPING_RATIO_X=<damping_ratio_x>] [DAMPING_RATIO_Y=<damping_ratio_y>] [SHAPER_TYPE=<shaper>] [SHAPER_TYPE_X=<shaper_type_x>] [SHAPER_TYPE_Y=<shaper_type_y>]`: Modify input shaper parameters. Note that SHAPER_TYPE parameter resets input shaper for both X and Y axes even if different shaper types have been configured in [input_shaper] section. SHAPER_TYPE cannot be used together with either of SHAPER_TYPE_X and SHAPER_TYPE_Y parameters. See [config reference](Config_Reference.md#input_shaper) for more details on each of these parameters.
ta: `Set_input_shaper [shaper_freq_x = <shaper_freq_x>] x>] [சேப்பர்_ டைப்_ஒய் = <சேப்பர்_ டைப்_ஒய்> ] `: உள்ளீட்டு சேப்பர் அளவுருக்களை மாற்றவும். [Input_shaper] பிரிவில் வெவ்வேறு சேப்பர் வகைகள் கட்டமைக்கப்பட்டிருந்தாலும் கூட, ஃச் மற்றும் ஒய் அச்சுகள் இரண்டிற்கும் உள்ளீட்டு சேப்பரை சேப்பர்_ டைப் அளவுரு மீட்டமைக்கிறது என்பதை நினைவில் கொள்க. சேப்பர்_பீ_எக்ச் மற்றும் சேப்பர்_ டைப்_ஒய் அளவுருக்கள் ஆகியவற்றுடன் சேப்பர்_ டைப்பைப் பயன்படுத்த முடியாது. இந்த ஒவ்வொரு அளவுருக்கள் பற்றிய கூடுதல் விவரங்களுக்கு [கட்டமைப்பு குறிப்பு] (config_reference.md#input_shaper) ஐப் பார்க்கவும்.

source: `MEASURE_AXES_NOISE`: Measures and outputs the noise for all axes of all enabled accelerometer chips.
ta: `அளவீடு_அக்ச்_நோயிச்`: இயக்கப்பட்ட அனைத்து முடுக்கமானி சில்லுகளின் அனைத்து அச்சுகளுக்கும் சத்தத்தை அளவிடுகிறது மற்றும் வெளியிடுகிறது.
zh_hans: `MEASURE_AXES_NOISE`：测量并输出所有启用的加速度计芯片的所有轴的噪声。

source: `PALETTE_CONNECT`: This command initializes the connection with the Palette 2.
ta: `தட்டு_கனெக்ட்`: இந்த கட்டளை தட்டு 2 உடனான இணைப்பைத் தொடங்குகிறது.
zh_hans: `PALETTE_CONNECT`：该命令初始化与Palette 2的连接。
