Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/G-Codes.po
Languages: ta, zh_hans

source: `SET_DUAL_CARRIAGE CARRIAGE=[0|1] [MODE=[PRIMARY|COPY|MIRROR]]`: This command will change the mode of the specified carriage. If no `MODE` is provided it defaults to `PRIMARY`. Setting the mode to `PRIMARY` deactivates the other carriage and makes the specified carriage execute subsequent G-Code commands as-is. `COPY` and `MIRROR` modes are supported only for `CARRIAGE=1`. When set to either of these modes, carriage 1 will then track the subsequent moves of the carriage 0 and either copy relative movements of it (in `COPY` mode) or execute them in the opposite (mirror) direction (in `MIRROR` mode).
ta: `Set_dual_carriage வண்டி = [0 | 1] [பயன்முறை = [முதன்மை | நகல் | கண்ணாடி]]`: இந்த கட்டளை குறிப்பிட்ட வண்டியின் பயன்முறையை மாற்றும். `பயன்முறை` வழங்கப்படாவிட்டால், அது` முதன்மை` இயல்புநிலையாகும். பயன்முறையை `முதன்மை` அமைப்பது மற்ற வண்டியை செயலிழக்கச் செய்கிறது மற்றும் குறிப்பிட்ட வண்டியை அடுத்தடுத்த சி-குறியீட்டு கட்டளைகளை இயக்குகிறது. `நகல்` மற்றும்` மிரர்` முறைகள் `வண்டி = 1` க்கு மட்டுமே ஆதரிக்கப்படுகின்றன. இந்த முறைகளில் ஏதேனும் அமைக்கப்படும்போது, வண்டி 1 பின்னர் வண்டி 0 இன் அடுத்தடுத்த நகர்வுகளைக் கண்காணிக்கும் மற்றும் அதன் தொடர்புடைய இயக்கங்களை (`நகல்` பயன்முறையில்) நகலெடுக்கும் அல்லது அவற்றை எதிர் (கண்ணாடி) திசையில் (` மிரர்` பயன்முறையில் இயக்கும் ).

source: `SAVE_DUAL_CARRIAGE_STATE [NAME=<state_name>]`: Save the current positions of the dual carriages and their modes. Saving and restoring DUAL_CARRIAGE state can be useful in scripts and macros, as well as in homing routine overrides. If NAME is provided it allows one to name the saved state to the given string. If NAME is not provided it defaults to "default".
ta: `Save_dual_carriage_state [பெயர் = <state_name>]`: இரட்டை வண்டிகளின் தற்போதைய நிலைகளையும் அவற்றின் முறைகளையும் சேமிக்கவும். டூயல்_ காரேச் நிலையைச் சேமிப்பது மற்றும் மீட்டமைப்பது ச்கிரிப்ட்கள் மற்றும் மேக்ரோக்களிலும், அதே போல் வழக்கமான மீறல் ஆகியவற்றிலும் பயனுள்ளதாக இருக்கும். பெயர் வழங்கப்பட்டால், சேமித்த நிலையை கொடுக்கப்பட்ட சரத்திற்கு பெயரிட ஒருவர் அனுமதிக்கிறது. பெயர் வழங்கப்படாவிட்டால் அது "இயல்புநிலை" க்கு இயல்புநிலையாகும்.

source: `RESTORE_DUAL_CARRIAGE_STATE [NAME=<state_name>] [MOVE=[0|1] [MOVE_SPEED=<speed>]]`: Restore the previously saved positions of the dual carriages and their modes, unless "MOVE=0" is specified, in which case only the saved modes will be restored, but not the positions of the carriages. If positions are being restored and "MOVE_SPEED" is specified, then the toolhead moves will be performed with the given speed (in mm/s); otherwise the toolhead move will use the rail homing speed. Note that the carriages restore their positions only over their own axis, which may be necessary to correctly restore COPY and MIRROR mode of the dual carraige.
ta: `Restore_dual_carriage_state [name = <state_name>] [mov = [0 | 1] [move_speed = <speed> சேமிக்கப்பட்ட முறைகள் மட்டுமே மீட்டெடுக்கப்படும், ஆனால் வண்டிகளின் நிலைகள் அல்ல. நிலைகள் மீட்டெடுக்கப்பட்டு, "MOVE_SPEED" குறிப்பிடப்பட்டால், கருவிஎட் நகர்வுகள் கொடுக்கப்பட்ட வேகத்துடன் (மிமீ/வி இல்) செய்யப்படும்; இல்லையெனில் கருவித்தொகை நகர்வு ரயில் ஓமிங் வேகத்தைப் பயன்படுத்தும். வண்டிகள் தங்கள் நிலைகளை அவற்றின் சொந்த அச்சில் மட்டுமே மீட்டெடுக்கின்றன என்பதை நினைவில் கொள்க, இது இரட்டை கேரிசின் நகல் மற்றும் கண்ணாடி பயன்முறையை சரியாக மீட்டெடுக்க அவசியமாக இருக்கலாம்.

source: `SHAPER_CALIBRATE [AXIS=<axis>] [NAME=<name>] [FREQ_START=<min_freq>] [FREQ_END=<max_freq>] [HZ_PER_SEC=<hz_per_sec>] [CHIPS=<adxl345_chip_name>] [MAX_SMOOTHING=<max_smoothing>]`: Similarly to `TEST_RESONANCES`, runs the resonance test as configured, and tries to find the optimal parameters for the input shaper for the requested axis (or both X and Y axes if `AXIS` parameter is unset). If `MAX_SMOOTHING` is unset, its value is taken from `[resonance_tester]` section, with the default being unset. See the [Max smoothing](Measuring_Resonances.md#max-smoothing) of the measuring resonances guide for more information on the use of this feature. The results of the tuning are printed to the console, and the frequency responses and the different input shapers values are written to a CSV file(s) `/tmp/calibration_data_<axis>_<name>.csv`. Unless specified, NAME defaults to the current time in "YYYYMMDD_HHMMSS" format. Note that the suggested input shaper parameters can be persisted in the config by issuing `SAVE_CONFIG` command, and if `[input_shaper]` was already enabled previously, these parameters take effect immediately.
ta: `Shaper_calibrate [அச்சு = <six>] [பெயர் = <பெயர்>] [freq_start = <min_freq>] [freq_end = <ax_freq>] [hz_per_sec = <hz_per_sec>] [chips = <adxl345_chip_namemolothen = max_namem>] ; `Max_smoothing` அமைக்கப்படவில்லை என்றால், அதன் மதிப்பு` [அதிர்வு_டெச்டர்] `பிரிவில் இருந்து எடுக்கப்படுகிறது, இயல்புநிலை அமைக்கப்படாதது. இந்த அம்சத்தைப் பயன்படுத்துவது குறித்த கூடுதல் தகவலுக்கு அளவீட்டு அதிர்வு வழிகாட்டியின் [அதிகபட்ச மென்மையான] (அளவீட்டு_ரெசோனன்ச். ட்யூனிங்கின் முடிவுகள் கன்சோலுக்கு அச்சிடப்படுகின்றன, மேலும் அதிர்வெண் பதில்கள் மற்றும் வெவ்வேறு உள்ளீட்டு சேப்பர்ச் மதிப்புகள் ஒரு காபிம கோப்பு (கள்) `/TMP/அளவுத்திருத்த_டேட்டா_ <inx> _ <amen> .csv` க்கு எழுதப்பட்டுள்ளன. குறிப்பிடப்படாவிட்டால், பெயர் "YYYYMMDD_HHMMS" வடிவத்தில் தற்போதைய நேரத்திற்கு இயல்புநிலை. பரிந்துரைக்கப்பட்ட உள்ளீட்டு சேப்பர் அளவுருக்கள் `Save_config` கட்டளையை வழங்குவதன் மூலம் கட்டமைப்பில் தொடரலாம், மேலும்` [INPUT_SHAPER] `முன்பு ஏற்கனவே இயக்கப்பட்டிருந்தால், இந்த அளவுருக்கள் உடனடியாக நடைமுறைக்கு வரும்.

source: The following commands are available when the [axis_twist_compensation config section](Config_Reference.md#axis_twist_compensation) is enabled.
ta: [AXIS_TWIST_COMPENSATION கட்டமைப்பு பிரிவு] (config_reference.md#axin_twist_compensation) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: `AXIS_TWIST_COMPENSATION_CALIBRATE [SAMPLE_COUNT=<value>]`: Initiates the X twist calibration wizard. `SAMPLE_COUNT` specifies the number of points along the X axis to calibrate at and defaults to 3.
ta: `Axis_twist_compensation_calibrate [salem_count = <value>]`: ஃச் ட்விச்ட் அளவுத்திருத்த வழிகாட்டி தொடங்குகிறது. `மாதிரி_கவுண்ட்` ஃச் அச்சில் உள்ள புள்ளிகளின் எண்ணிக்கையை அளவீடு செய்ய மற்றும் இயல்புநிலையாக 3 க்கு குறிப்பிடுகிறது.

source: `BED_MESH_CALIBRATE [PROFILE=<name>] [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=1] [ADAPTIVE_MARGIN=<value>]`: This command probes the bed using generated points specified by the parameters in the config. After probing, a mesh is generated and z-movement is adjusted according to the mesh. The mesh will be saved into a profile specified by the `PROFILE` parameter, or `default` if unspecified. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file. If ADAPTIVE=1 is specified then the objects defined by the Gcode file being printed will be used to define the probed area. The optional `ADAPTIVE_MARGIN` value overrides the `adaptive_margin` option specified in the config file.
ta: `Bed_mesh_calibrate [சுயவிவரம் = <பெயர்>] [முறை = கையேடு] [கிடைமட்ட_மோவ்_செச் = <மதிப்பு>] [<probe_parameter> = <மதிப்பு>] [<mesh_parameter> = <மதிப்பு>] [தகவமைப்பு = 1] [தகவமைப்பு_மார்சின் = <மதிப்பு> ] `: இந்த கட்டளை கட்டமைப்பில் உள்ள அளவுருக்களால் குறிப்பிடப்பட்ட உருவாக்கப்பட்ட புள்ளிகளைப் பயன்படுத்தி படுக்கையை ஆராய்கிறது. ஆராய்ந்த பிறகு, ஒரு கண்ணி உருவாக்கப்பட்டு, கண்ணி படி z- இயக்கம் சரிசெய்யப்படுகிறது. குறிப்பிடப்படாவிட்டால் `சுயவிவரம்` அளவுருவால் குறிப்பிடப்பட்ட சுயவிவரத்தில் கண்ணி சேமிக்கப்படும். விருப்ப ஆய்வு அளவுருக்கள் குறித்த விவரங்களுக்கு ஆய்வு கட்டளையைப் பார்க்கவும். முறை = கையேடு குறிப்பிடப்பட்டால், கையேடு ஆய்வு கருவி செயல்படுத்தப்படுகிறது - இந்த கருவி செயலில் இருக்கும்போது கிடைக்கும் கூடுதல் கட்டளைகள் குறித்த விவரங்களுக்கு மேலே உள்ள கையேடு_பிரோப் கட்டளையைப் பார்க்கவும். விருப்பமான `கிடைமட்ட_மோவ்_செச்` மதிப்பு கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள` கிடைமட்ட_மோவ்_செச்` விருப்பத்தை மீறுகிறது. தகவமைப்பு = 1 குறிப்பிடப்பட்டால், அச்சிடப்பட்ட GCODE கோப்பால் வரையறுக்கப்பட்ட பொருள்கள் ஆய்வு செய்யப்பட்ட பகுதியை வரையறுக்க பயன்படுத்தப்படும். விருப்ப `அடாப்டிவ்_மார்சின்` மதிப்பு கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள` அடாப்டிவ்_மார்சின்` விருப்பத்தை மீறுகிறது.

source: `BED_MESH_OFFSET [X=<value>] [Y=<value>] [ZFADE=<value]`: Applies X, Y, and/or ZFADE offsets to the mesh lookup. This is useful for printers with independent extruders, as an offset is necessary to produce correct Z adjustment after a tool change. Note that a ZFADE offset does not apply additional z-adjustment directly, it is used to correct the `fade` calculation when a `gcode offset` has been applied to the Z axis.
ta: `Bed_mesh_offset [x = <மதிப்பு>] [y = <மதிப்பு>] [zfade = <value]`: கண்ணி தேடலுக்கு ஃச், ஒய் மற்றும்/அல்லது zfade ஆஃப்செட்களைப் பயன்படுத்துகிறது. சுயாதீன எக்ச்ட்ரூடர்களைக் கொண்ட அச்சுப்பொறிகளுக்கு இது பயனுள்ளதாக இருக்கும், ஏனெனில் ஒரு கருவி மாற்றத்திற்குப் பிறகு சரியான சட் சரிசெய்தலை உருவாக்க ஆஃப்செட் தேவை. ஒரு ZFADE ஆஃப்செட் கூடுதல் Z- சரிசெய்தலை நேரடியாகப் பயன்படுத்தாது என்பதை நினைவில் கொள்க, சட் அச்சுக்கு `GCode ஆஃப்செட்` பயன்படுத்தப்படும்போது` மங்கலான` கணக்கீட்டை சரிசெய்ய இது பயன்படுகிறது.

source: `SET_PIN PIN=config_name VALUE=<value>`: Set the pin to the given output `VALUE`. VALUE should be 0 or 1 for "digital" output pins. For PWM pins, set to a value between 0.0 and 1.0, or between 0.0 and `scale` if a scale is configured in the output_pin config section.
ta: `Set_pin முள் = config_name மதிப்பு = <மதிப்பு>`: கொடுக்கப்பட்ட வெளியீட்டிற்கு முள் அமைக்கவும் `மதிப்பு`. "டிசிட்டல்" வெளியீட்டு ஊசிகளுக்கு மதிப்பு 0 அல்லது 1 ஆக இருக்க வேண்டும். PWM ஊசிகளுக்கு, 0.0 மற்றும் 1.0 க்கு இடையில் ஒரு மதிப்புக்கு அமைக்கவும், அல்லது 0.0 மற்றும் `அளவுகோல்` க்கு இடையில் ஒரு அளவு கட்டமைக்கப்பட்டிருந்தால்.

source: The following command is available when a [pwm_cycle_time config section](Config_Reference.md#pwm_cycle_time) is enabled.
ta: ஒரு [PWM_CYCLE_TIME கட்டமைப்பு பிரிவு] (config_reference.md#pwm_cycle_time) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: `SET_PIN PIN=config_name VALUE=<value> [CYCLE_TIME=<cycle_time>]`: This command works similarly to [output_pin](#output_pin) SET_PIN commands. The command here supports setting an explicit cycle time using the CYCLE_TIME parameter (specified in seconds). Note that the CYCLE_TIME parameter is not stored between SET_PIN commands (any SET_PIN command without an explicit CYCLE_TIME parameter will use the `cycle_time` specified in the pwm_cycle_time config section).
ta: `Set_pin முள் = config_name மதிப்பு = <value> [cycol_time = <ycoly_time>]`: இந்த கட்டளை [output_pin] (#output_pin) set_pin கட்டளைகளுக்கு ஒத்ததாக செயல்படுகிறது. சுழற்சி_ நேர அளவுருவைப் பயன்படுத்தி வெளிப்படையான சுழற்சி நேரத்தை அமைப்பதை இங்கே கட்டளை ஆதரிக்கிறது (விநாடிகளில் குறிப்பிடப்பட்டுள்ளது). Sycl_pin கட்டளை Set_Pin கட்டளைகளுக்கு இடையில் சேமிக்கப்படவில்லை என்பதை நினைவில் கொள்க (வெளிப்படையான சுழற்சி_ நேர அளவுரு இல்லாமல் எந்த SET_PIN கட்டளையும் PWM_CYCLE_TIME கட்டமைப்பு பிரிவில் குறிப்பிடப்பட்டுள்ள `சுழற்சி_ நேரம்` ஐப் பயன்படுத்தும்).

source: `SET_VELOCITY_LIMIT [VELOCITY=<value>] [ACCEL=<value>] [MINIMUM_CRUISE_RATIO=<value>] [SQUARE_CORNER_VELOCITY=<value>]`: This command can alter the velocity limits that were specified in the printer config file. See the [printer config section](Config_Reference.md#printer) for a description of each parameter.
ta: `Set_velocity_limit [வேகம் = <மதிப்பு>] [முடி = <மதிப்பு>] [குறைந்தபட்ச_ க்ரூச்_ராட்டியோ = <மதிப்பு>] [சதுர_கார்ன்_வெலோசிட்டி = <மதிப்பு>]`: இந்த கட்டளை அச்சுப்பொறி கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்ட திசைவேக வரம்புகளை மாற்ற முடியும். ஒவ்வொரு அளவுருவின் விளக்கத்திற்கு [அச்சுப்பொறி கட்டமைப்பு பிரிவு] (config_reference.md#அச்சுப்பொறி) ஐப் பார்க்கவும்.

source: The following commands are available when a [probe_eddy_current config section](Config_Reference.md#probe_eddy_current) is enabled.
ta: [Probe_eddy_current கட்டமைப்பு பிரிவு] (config_reference.md#probe_eddy_current) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: `PROBE_EDDY_CURRENT_CALIBRATE CHIP=<config_name>`: This starts a tool that calibrates the sensor resonance frequencies to corresponding Z heights. The tool will take a couple of minutes to complete. After completion, use the SAVE_CONFIG command to store the results in the printer.cfg file.
ta: `Probe_eddy_current_calibrate chip = <config_name>`: இது சென்சார் அதிர்வு அதிர்வெண்களை தொடர்புடைய சட் உயரங்களுக்கு அளவீடு செய்யும் ஒரு கருவியைத் தொடங்குகிறது. கருவி முடிக்க இரண்டு நிமிடங்கள் ஆகும். முடிந்ததும், save_config கட்டளையைப் பயன்படுத்தவும்.

source: `LDC_CALIBRATE_DRIVE_CURRENT CHIP=<config_name>` This tool will calibrate the ldc1612 DRIVE_CURRENT0 register. Prior to using this tool, move the sensor so that it is near the center of the bed and about 20mm above the bed surface. Run this command to determine an appropriate DRIVE_CURRENT for the sensor. After running this command use the SAVE_CONFIG command to store that new setting in the printer.cfg config file.
ta: `LDC_CALIBRATE_DRIVE_CURRENT CHIP = <CONTIG_NAME>` இந்த கருவி LDC1612 டிரைவ்_கரண்ட் 0 பதிவேட்டை அளவீடு செய்யும். இந்த கருவியைப் பயன்படுத்துவதற்கு முன்பு, சென்சார் படுக்கையின் மையத்திற்கு அருகிலும், படுக்கை மேற்பரப்பில் சுமார் 20 மி.மீ. சென்சாருக்கு பொருத்தமான டிரைவ்_கரண்ட் தீர்மானிக்க இந்த கட்டளையை இயக்கவும். இந்த கட்டளையை இயக்கிய பிறகு, அந்த புதிய அமைப்பை அச்சுப்பொறியில் சேமிக்க SAVE_CONFIG கட்டளையைப் பயன்படுத்தவும்.

source: The following commands are available when a [temperature_probe config section](Config_Reference.md#temperature_probe) is enabled.
ta: [வெப்பநிலை_பிரோப் கட்டமைப்பு பிரிவு] (config_reference.md#வெப்பநிலை_பிரோப்) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கும்.

source: TEMPERATURE_PROBE_CALIBRATE
ta: வெப்பநிலை_பிரோப்_கலிபிரேட்

source: `TEMPERATURE_PROBE_CALIBRATE [PROBE=<probe name>] [TARGET=<value>] [STEP=<value>]`: Initiates probe drift calibration for eddy current based probes. The `TARGET` is a target temperature for the last sample. When the temperature recorded during a sample exceeds the `TARGET` calibration will complete. The `STEP` parameter sets temperature delta (in C) between samples. After a sample has been taken, this delta is used to schedule a call to `TEMPERATURE_PROBE_NEXT`. The default `STEP` is 2.
ta: `வெப்பநிலை_பிரோப்_கலிப்ரேட் [ஆய்வு = <ஆய்வு பெயர்>] [இலக்கு = <மதிப்பு>] [படி = <மதிப்பு>]`: எடி தற்போதைய அடிப்படையிலான ஆய்வுகளுக்கான ஆய்வு சறுக்கல் அளவுத்திருத்தத்தைத் தொடங்குகிறது. `இலக்கு` என்பது கடைசி மாதிரியின் இலக்கு வெப்பநிலை. ஒரு மாதிரியின் போது பதிவுசெய்யப்பட்ட வெப்பநிலை `இலக்கு` அளவுத்திருத்தத்தை மீறும் போது. `படி` அளவுரு மாதிரிகளுக்கு இடையில் வெப்பநிலை டெல்டாவை (சி இல்) அமைக்கிறது. ஒரு மாதிரி எடுக்கப்பட்ட பிறகு, இந்த டெல்டா `வெப்பநிலை_பிரோப்_நெக்ச்ட்` என்ற அழைப்பை திட்டமிடப் பயன்படுகிறது. இயல்புநிலை `படி` 2.

source: TEMPERATURE_PROBE_NEXT
ta: வெப்பநிலை_பிரோப்_நெக்ச்ட்

source: `TEMPERATURE_PROBE_NEXT`: After calibration has started this command is run to take the next sample. It is automatically scheduled to run when the delta specified by `STEP` has been reached, however its also possible to manually run this command to force a new sample. This command is only available during calibration.
ta: `வெப்பநிலை_பிரோப்_நெக்ச்ட்`: அளவுத்திருத்தம் தொடங்கிய பிறகு இந்த கட்டளை அடுத்த மாதிரியை எடுக்க இயக்கப்படுகிறது. `படி` குறிப்பிட்ட டெல்டாவை எட்டியபோது இது தானாகவே இயக்க திட்டமிடப்பட்டுள்ளது, இருப்பினும் ஒரு புதிய மாதிரியை கட்டாயப்படுத்த இந்த கட்டளையை கைமுறையாக இயக்கவும் முடியும். இந்த கட்டளை அளவுத்திருத்தத்தின் போது மட்டுமே கிடைக்கும்.

source: TEMPERATURE_PROBE_COMPLETE:
ta: வெப்பநிலை_பிரோப்_ கமி:

source: `TEMPERATURE_PROBE_COMPLETE`: Can be used to end calibration and save the current result before the `TARGET` temperature is reached. This command is only available during calibration.
ta: `வெப்பநிலை_பிரோப்_ கமோப்லெட்`:` இலக்கு` வெப்பநிலை அடைவதற்கு முன்பு அளவுத்திருத்தத்தை முடிவுக்குக் கொண்டுவருவதற்கும் தற்போதைய முடிவை சேமிப்பதற்கும் பயன்படுத்தலாம். இந்த கட்டளை அளவுத்திருத்தத்தின் போது மட்டுமே கிடைக்கும்.

source: ABORT
ta: கருக்கலைப்பு

source: `ABORT`: Aborts the calibration process, discarding the current results. This command is only available during drift calibration.
ta: `கருக்கலைப்பு`: அளவுத்திருத்த செயல்முறையை நிறுத்தி, தற்போதைய முடிவுகளை நிராகரிக்கிறது. இந்த கட்டளை சறுக்கல் அளவுத்திருத்தத்தின் போது மட்டுமே கிடைக்கிறது.

source: TEMPERATURE_PROBE_ENABLE
ta: வெப்பநிலை_பிரோப்_இனபிள்

source: `TEMPERATURE_PROBE_ENABLE ENABLE=[0|1]`: Sets temperature drift compensation on or off. If ENABLE is set to 0, drift compensation will be disabled, if set to 1 it is enabled.
ta: `வெப்பநிலை_பிரோப்_இனபிள் இயக்கு = [0 | 1]`: வெப்பநிலை சறுக்கல் இழப்பீட்டை ஆன் அல்லது ஆஃப் அமைக்கிறது. இயக்கு 0 என அமைக்கப்பட்டால், சறுக்கல் இழப்பீடு முடக்கப்படும், 1 ஆக அமைக்கப்பட்டால் அது இயக்கப்பட்டிருந்தால்.

source: Klipper's goal is to support the G-Code commands produced by common 3rd party software (eg, OctoPrint, Printrun, Slic3r, Cura, etc.) in their standard configurations. It is not a goal to support every possible G-Code command. Instead, Klipper prefers human readable ["extended G-Code commands"](#extended-g-code-commands).
zh_hans: Klipper的目标是支持普通第三方软件（如OctoPrint、Printrun、Slic3r、Cura等）在其标准配置中产生的G-Code命令。支持所有可能的G-Code命令并不是我们的目标。相反，Klipper更倾向于使用人类可读的["extended G-Code commands"](#extended-g-code-commands).

source: G-Code SD card commands
zh_hans: G-Code SD卡命令

source: Klipper also supports the following standard G-Code commands if the [virtual_sdcard config section](Config_Reference.md#virtual_sdcard) is enabled:
zh_hans: 如果[virtual_sdcard config section](Config_Reference.md#virtual_sdcard)被启用，Klipper也支持以下标准G-Code命令。

source: In addition, the following extended commands are availble when the "virtual_sdcard" config section is enabled.
zh_hans: 此外，当 "virtual_sdcard "配置部分被启用时，可以使用以下扩展命令。

source: Load a file and start SD print: `SDCARD_PRINT_FILE FILENAME=<filename>`
zh_hans: 加载文件并且开始SD卡打印：`SDCARD_PRINT_FILE FILENAME=<filename>`

source: G-Code arcs
zh_hans: G-Code弧

source: Controlled Arc Move (G2 or G3): `G2 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<speed>] I<value> J<value>`
zh_hans: 受控弧线移动（G2或G3）。`G2 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<speed>] I<value> J<value>` 。

source: G-Code firmware retraction
zh_hans: G-Code固件回抽

source: Retract: `G10`
zh_hans: 回抽：`G10`

source: G-Code display commands
zh_hans: G-Code 显示命令

source: Other available G-Code commands
zh_hans: 其他可用的G-Code命令

source: Extended G-Code Commands
zh_hans: 扩展的G-Code 命令

source: `GET_POSITION`: Return information on the current location of the toolhead.
zh_hans: `GET_POSITION`：返回工具当前位置信息

source: `ACTIVATE_EXTRUDER EXTRUDER=<config_name>`: In a printer with multiple extruders this command is used to change the active extruder.
zh_hans: `ACTIVATE_EXTRUDER EXTRUDER=<config_name>`：这个命令在具有多个挤出机的打印机中用于更改活动挤出机。

source: `SET_EXTRUDER_STEP_DISTANCE [EXTRUDER=<config_name>] [DISTANCE=<distance>]`: Set a new value for the provided extruder's "step distance". The "step distance" is `rotation_distance/(full_steps_per_rotation*microsteps)`. Value is not retained on Klipper reset. Use with caution, small changes can result in excessive pressure between extruder and hot end. Do proper calibration steps with filament before use. If 'DISTANCE' value is not included command will return current step distance.
zh_hans: `SET_EXTRUDER_STEP_DISTANCE [EXTRUDER=<config_name>] [DISTANCE=<distance>]`。为所提供的挤出机的 "步距 "设置一个新值。"步距 "是 `rotation_distance/(full_steps_per_rotation*microsteps)`。Klipper复位时，该值不会被保留。谨慎使用，小的变化会导致挤出机和热端之间的压力过大。在使用前，请用打印材料做适当的校准步骤。如果不包括'DISTANCE'值，命令将返回当前步距。

source: G-Code Macro Commands
zh_hans: G-Code宏命令

source: Custom Pin Commands
zh_hans: 自定义引脚命令

source: Note: Hardware PWM does not currently support the CYCLE_TIME parameter and will use the cycle time defined in the config.
zh_hans: 注意：硬件PWM目前不支持CYCLE_TIME参数，将使用配置中定义的周期时间。

source: Manually Controlled Fans Commands
zh_hans: 手动控制风扇命令

source: `SET_FAN_SPEED FAN=config_name SPEED=<speed>` This command sets the speed of a fan. <speed> must be between 0.0 and 1.0.
zh_hans: `SET_FAN_SPEED FAN=config_name SPEED=<speed>` 此命令设置风扇的速度。<speed>必须在0.0和1.0之间。

source: Neopixel and Dotstar Commands
zh_hans: Neopixel 和 Dotstar 命令

source: Servo Commands
zh_hans: 舵机命令

source: Manual stepper Commands
zh_hans: 手动步进电机命令

source: Extruder stepper Commands
zh_hans: 挤出机步进电机命令

source: Probe
zh_hans: 探针

source: `BLTOUCH_DEBUG COMMAND=<command>`: This sends a command to the BLTouch. It may be useful for debugging. Available commands are: `pin_down`, `touch_mode`, `pin_up`, `self_test`, `reset`, (*1): `set_5V_output_mode`, `set_OD_output_mode`, `output_mode_store`
zh_hans: `BLTOUCH_DEBUG COMMAND=<command>`:这将向BLTouch发送一个命令。这可能对调试很有用。可用的命令有 `pin_down`, `touch_mode`, `pin_up`, `self_test`, `reset`, (*1): `set_5V_output_mode`, `set_OD_output_mode`, `output_mode_store`

source: *** Note that the commands marked by (*1) are solely supported by a BL-Touch V3.0 or V3.1(+)
zh_hans: *** 注意，标有（*1）的命令仅由BL-TOUCH V3.0或V3.1（+）支持。

source: Delta Calibration
zh_hans: 三角洲校准

source: `DELTA_CALIBRATE [METHOD=manual] [<probe_parameter>=<value>]`: This command will probe seven points on the bed and recommend updated endstop positions, tower angles, and radius. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active.
zh_hans: `DELTA_CALIBRATE [Method=manual] [<probe_parameter>=<value>] `:这条命令将探测床身的七个点，并建议更新限位位置、塔架角度和半径。有关可选探测参数的详细信息，请参见PROBE命令。如果指定METHOD=manual，那么手动探测工具将被激活 - 关于该工具激活时可用的附加命令的详细信息，请参见上面的MANUAL_PROBE命令。

source: Bed Tilt
zh_hans: 打印床倾斜

source: `BED_TILT_CALIBRATE [METHOD=manual] [<probe_parameter>=<value>]`: This command will probe the points specified in the config and then recommend updated x and y tilt adjustments. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active.
zh_hans: `BED_TILT_CALIBRATE [Method=manual] [<probe_parameter>=<value>] `:该命令将探测配置中指定的点，然后建议更新X和Y的倾斜调整。有关可选探测参数的详细信息，请参见PROBE命令。如果指定METHOD=manual，那么手动探测工具就会被激活 - 关于该工具激活时可用的附加命令，请参见上面的MANUAL_PROBE命令。

source: Mesh Bed Leveling
zh_hans: 网床调平

source: `BED_MESH_CALIBRATE [METHOD=manual] [<probe_parameter>=<value>] [<mesh_parameter>=<value>]`: This command probes the bed using generated points specified by the parameters in the config. After probing, a mesh is generated and z-movement is adjusted according to the mesh. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active.
zh_hans: `BED_MESH_CALIBRATE [METHOD=manual] [<probe_parameter>=<value>] [<mesh_parameter>=<value>]`: 此命令使用通过配置参数指定并生成的探测点探测打印床。在探测后，一个网格将被生成，z 轴移动将根据网格调整。有关可选探测参数，请见 PROBE命令。如果指定 METHOD=manual ，则会启动手动探测工具 - 有关此工具活跃时可用的额外命令，详见 MANUAL_PROBE 命令。

source: `BED_MESH_OUTPUT PGP=[<0:1>]`: This command outputs the current probed z values and current mesh values to the terminal. If PGP=1 is specified the x,y coordinates generated by bed_mesh, along with their associated indices, will be output to the terminal.
zh_hans: `BED_MESH_OUTPUT PGP=[<0:1>]`：此命令输出当前探测的 z 值和当前网格数值们到终端。如果指定 PGP=1 则 bed_mesh 生成的 x,y 坐标和它们相关联的索引将被输出到终端。
