Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/G-Codes.po
Languages: ta, zh_hans

source: When the `RESET` parameter is given, the list of excluded objects will be cleared. Additionally including `NAME` will only reset the named object. This **can** cause print failures, if layers were already skipped.
ta: `மீட்டமை` அளவுரு வழங்கப்படும்போது, விலக்கப்பட்ட பொருட்களின் பட்டியல் அழிக்கப்படும். கூடுதலாக `பெயர்` உட்பட பெயரிடப்பட்ட பொருளை மட்டுமே மீட்டமைக்கும். அடுக்குகள் ஏற்கனவே தவிர்க்கப்பட்டால், இது ** அச்சு தோல்விகளை ஏற்படுத்தும்.

source: `EXCLUDE_OBJECT_DEFINE`
ta: `விலக்கு_ஆப்செக்ட்_ டிஃபைன்`

source: `EXCLUDE_OBJECT_DEFINE [NAME=object_name [CENTER=X,Y] [POLYGON=[[x,y],...]] [RESET=1] [JSON=1]`: Provides a summary of an object in the file.
ta: `விலக்கு_OBJECT_DEFINE [பெயர் = பொருள்_பெயர் [மையம் = ஃச், y] [பலகோணம் = [[x, y], ...]] [மீட்டமை = 1] [json = 1]`: கோப்பில் ஒரு பொருளின் சுருக்கத்தை வழங்குகிறது.

source: With no parameters provided, this will list the defined objects known to Klipper. Returns a list of strings, unless the `JSON` parameter is given, when it will return object details in json format.
ta: அளவுருக்கள் எதுவும் வழங்கப்படாமல், இது கிளிப்பருக்கு அறியப்பட்ட வரையறுக்கப்பட்ட பொருள்களை பட்டியலிடும். `Json` அளவுரு வழங்கப்படாவிட்டால், அது சாதொபொகு வடிவத்தில் பொருள் விவரங்களைத் தரும் போது, சரங்களின் பட்டியலை வழங்குகிறது.

source: When the `NAME` parameter is included, this defines an object to be excluded.
ta: `பெயர்` அளவுரு சேர்க்கப்படும்போது, இது விலக்கப்பட வேண்டிய ஒரு பொருளை வரையறுக்கிறது.

source: `NAME`: This parameter is required. It is the identifier used by other commands in this module.
ta: `பெயர்`: இந்த அளவுரு தேவை. இது இந்த தொகுதியில் உள்ள பிற கட்டளைகளால் பயன்படுத்தப்படும் அடையாளங்காட்டியாகும்.

source: `CENTER`: An X,Y coordinate for the object.
ta: `மையம்`: ஒரு ஃச், ஒய் பொருளுக்கு ஒருங்கிணைப்பு.

source: `POLYGON`: An array of X,Y coordinates that provide an outline for the object.
ta: `பலகோணம்`: ஃச், ஒய் ஆயத்தொகுப்புகள் பொருளுக்கு ஒரு அவுட்லைன் வழங்கும்.

source: When the `RESET` parameter is provided, all defined objects will be cleared, and the `[exclude_object]` module will be reset.
ta: `மீட்டமை` அளவுரு வழங்கப்படும்போது, வரையறுக்கப்பட்ட அனைத்து பொருட்களும் அழிக்கப்படும், மேலும்` [விலக்கு_ஆப்செக்ட்] `தொகுதி மீட்டமைக்கப்படும்.

source: `EXCLUDE_OBJECT_START`
ta: `விலக்கு_ஆப்செக்ட்_ச்டார்ட்`

source: `EXCLUDE_OBJECT_START NAME=object_name`: This command takes a `NAME` parameter and denotes the start of the gcode for an object on the current layer.
ta: `விலக்கு_ஆப்செக்ட்_ச்டார்ட் பெயர் = பொருள்_பெயர்`: இந்த கட்டளை` பெயர்` அளவுருவை எடுத்து தற்போதைய அடுக்கில் ஒரு பொருளுக்கான GCODE இன் தொடக்கத்தைக் குறிக்கிறது.

source: `EXCLUDE_OBJECT_END`
ta: `விலக்கு_ஆப்செக்ட்_எண்ட்`

source: `EXCLUDE_OBJECT_END [NAME=object_name]`: Denotes the end of the object's gcode for the layer. It is paired with `EXCLUDE_OBJECT_START`. A `NAME` parameter is optional, and will only warn when the provided name does not match the current object.
ta: `விலக்கு_ஆப்செக்ட்_என்ட் [பெயர் = பொருள்_பெயர்]`: அடுக்குக்கான பொருளின் GCODE இன் முடிவைக் குறிக்கிறது. இது `விலக்கு_ஆப்செக்ட்_ச்டார்ட்` உடன் இணைக்கப்பட்டுள்ளது. ஒரு `பெயர்` அளவுரு விருப்பமானது, வழங்கப்பட்ட பெயர் தற்போதைய பொருளுடன் பொருந்தாதபோது மட்டுமே எச்சரிக்கும்.

source: `SET_PRESSURE_ADVANCE [EXTRUDER=<config_name>] [ADVANCE=<pressure_advance>] [SMOOTH_TIME=<pressure_advance_smooth_time>]`: Set pressure advance parameters of an extruder stepper (as defined in an [extruder](Config_Reference.md#extruder) or [extruder_stepper](Config_Reference.md#extruder_stepper) config section). If EXTRUDER is not specified, it defaults to the stepper defined in the active hotend.
ta: `Set_pressure_advance [extruder = <config_name>] [அட்வான்ச் = <பிரசென்_அட்வன்ச்>] Extruder_stepper] (config_reference.md#extruder_stepper) கட்டமைப்பு பிரிவு). எக்ச்ட்ரூடர் குறிப்பிடப்படாவிட்டால், அது செயலில் உள்ள ஆட்எண்டில் வரையறுக்கப்பட்ட ச்டெப்பருக்கு இயல்புநிலையாகும்.

source: `SET_EXTRUDER_ROTATION_DISTANCE EXTRUDER=<config_name> [DISTANCE=<distance>]`: Set a new value for the provided extruder stepper's "rotation distance" (as defined in an [extruder](Config_Reference.md#extruder) or [extruder_stepper](Config_Reference.md#extruder_stepper) config section). If the rotation distance is a negative number then the stepper motion will be inverted (relative to the stepper direction specified in the config file). Changed settings are not retained on Klipper reset. Use with caution as small changes can result in excessive pressure between extruder and hotend. Do proper calibration with filament before use. If 'DISTANCE' value is not provided then this command will return the current rotation distance.
ta: `Set_extruder_rotation_distance extruder = <config_name> [தூரம் = <தூரம்>]`: வழங்கப்பட்ட எக்ச்ட்ரூடர் ச்டெப்பரின் "சுழற்சி தூரம்" (ஒரு [எக்ச்ட்ரூடர்] (config_reference.md#extruder) அல்லது [config_stepper] இல் வரையறுக்கப்பட்டுள்ளபடி புதிய மதிப்பை அமைக்கவும் .md#extruder_stepper) கட்டமைப்பு பிரிவு). சுழற்சி தூரம் எதிர்மறை எண்ணாக இருந்தால், ச்டெப்பர் இயக்கம் தலைகீழாக இருக்கும் (கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ச்டெப்பர் திசையுடன் தொடர்புடையது). கிளிப்பர் மீட்டமைப்பில் மாற்றப்பட்ட அமைப்புகள் தக்கவைக்கப்படவில்லை. சிறிய மாற்றங்கள் எக்ச்ட்ரூடர் மற்றும் ஆட்எண்டிற்கு இடையில் அதிக அழுத்தத்தை ஏற்படுத்தும் என்பதால் எச்சரிக்கையுடன் பயன்படுத்துங்கள். பயன்பாட்டிற்கு முன் இழை மூலம் சரியான அளவுத்திருத்தம் செய்யுங்கள். 'தூரம்' மதிப்பு வழங்கப்படாவிட்டால், இந்த கட்டளை தற்போதைய சுழற்சி தூரத்தை திருப்பித் தரும்.

source: `SYNC_EXTRUDER_MOTION EXTRUDER=<name> MOTION_QUEUE=<name>`: This command will cause the stepper specified by EXTRUDER (as defined in an [extruder](Config_Reference.md#extruder) or [extruder_stepper](Config_Reference.md#extruder_stepper) config section) to become synchronized to the movement of an extruder specified by MOTION_QUEUE (as defined in an [extruder](Config_Reference.md#extruder) config section). If MOTION_QUEUE is an empty string then the stepper will be desynchronized from all extruder movement.
ta: `Sync_extruder_motion extruder = <ame> motion_queue = <ame>`: இந்த கட்டளை எக்ச்ட்ரூடரால் குறிப்பிடப்பட்ட ச்டெப்பரை ஏற்படுத்தும் ([எக்ச்ட்ரூடர்] (config_reference.md#extruder) அல்லது [extruder_stepper] (config_seference.md#extruder_stepper) பிரிவு) மோசன்_க்யூவால் குறிப்பிடப்பட்ட எக்ச்ட்ரூடரின் இயக்கத்திற்கு ஒத்திசைக்க (ஒரு [எக்ச்ட்ரூடர்] (config_reference.md#extruder) கட்டமைப்பு பிரிவு). மோசன்_க்யூ ஒரு வெற்று சரம் என்றால், ச்டெப்பர் அனைத்து எக்ச்ட்ரூடர் இயக்கத்திலிருந்தும் தேய்மானம் செய்யப்படும்.

source: The force_move module is automatically loaded, however some commands require setting `enable_force_move` in the [printer config](Config_Reference.md#force_move).
ta: ஃபோர்ச்_மோவ் தொகுதி தானாகவே ஏற்றப்படும், இருப்பினும் சில கட்டளைகளுக்கு [அச்சுப்பொறி கட்டமைப்பில்] `enable_force_move` ஐ அமைக்க வேண்டும் (config_reference.md#force_move).

source: `TEST_RESONANCES AXIS=<axis> OUTPUT=<resonances,raw_data> [NAME=<name>] [FREQ_START=<min_freq>] [FREQ_END=<max_freq>] [HZ_PER_SEC=<hz_per_sec>] [CHIPS=<adxl345_chip_name>] [POINT=x,y,z] [INPUT_SHAPING=[<0:1>]]`: Runs the resonance test in all configured probe points for the requested "axis" and measures the acceleration using the accelerometer chips configured for the respective axis. "axis" can either be X or Y, or specify an arbitrary direction as `AXIS=dx,dy`, where dx and dy are floating point numbers defining a direction vector (e.g. `AXIS=X`, `AXIS=Y`, or `AXIS=1,-1` to define a diagonal direction). Note that `AXIS=dx,dy` and `AXIS=-dx,-dy` is equivalent. `adxl345_chip_name` can be one or more configured adxl345 chip,delimited with comma, for example `CHIPS="adxl345, adxl345 rpi"`. Note that `adxl345` can be omitted from named adxl345 chips. If POINT is specified it will override the point(s) configured in `[resonance_tester]`. If `INPUT_SHAPING=0` or not set(default), disables input shaping for the resonance testing, because it is not valid to run the resonance testing with the input shaper enabled. `OUTPUT` parameter is a comma-separated list of which outputs will be written. If `raw_data` is requested, then the raw accelerometer data is written into a file or a series of files `/tmp/raw_data_<axis>_[<chip_name>_][<point>_]<name>.csv` with (`<point>_` part of the name generated only if more than 1 probe point is configured or POINT is specified). If `resonances` is specified, the frequency response is calculated (across all probe points) and written into `/tmp/resonances_<axis>_<name>.csv` file. If unset, OUTPUT defaults to `resonances`, and NAME defaults to the current time in "YYYYMMDD_HHMMSS" format.
ta: `Test_resonances அச்சு = <six> வெளியீடு = <அதிர்வுகள், RAW_DATA> [பெயர் = <பெயர்>] [FREQ_START = <MIN_FREQ>] புள்ளி = ஃச், ஒய், z] [input_shapeing = [<0: 1>>]] `: கோரப்பட்ட" அச்சு "க்கான அனைத்து கட்டமைக்கப்பட்ட ஆய்வு புள்ளிகளிலும் அதிர்வு சோதனையை இயக்குகிறது மற்றும் அந்தந்த அச்சுக்கு கட்டமைக்கப்பட்ட முடுக்கமானி சில்லுகளைப் பயன்படுத்தி முடுக்கம் அளவிடுகிறது. "அச்சு" ஃச் அல்லது ஒய் ஆக இருக்கலாம், அல்லது தன்னிச்சையான திசையை `அச்சு = dx, dy` எனக் குறிப்பிடலாம், அங்கு dx மற்றும் dy ஆகியவை திசை திசையன் வரையறுக்கும் புள்ளி எண்களை மிதக்கின்றன (எ.கா.` அச்சு = x`, `அச்சு = y`, அல்லது மூலைவிட்ட திசையை வரையறுக்க `அச்சு = 1, -1`). `அச்சு = dx, dy` மற்றும்` அச்சு = -dx, -dy` சமம் என்பதை நினைவில் கொள்க. `ADXL345_CHIP_NAME` கமாவுடன் பிரிக்கப்பட்ட ஒன்று அல்லது அதற்கு மேற்பட்ட கட்டமைக்கப்பட்ட ADXL345 CHIP ஆக இருக்கலாம், எடுத்துக்காட்டாக` CHIPS = "ADXL345, ADXL345 RPI" `. `ADXL345` என்று பெயரிடப்பட்ட ADXL345 சில்லுகளிலிருந்து தவிர்க்கலாம் என்பதை நினைவில் கொள்க. புள்ளி குறிப்பிடப்பட்டால், அது `[அதிர்வு_டெச்டர்]` இல் கட்டமைக்கப்பட்ட புள்ளி (களை) மேலெழுதும். `உள்ளீடு_சேப்பிங் = 0` அல்லது அமைக்கப்படாவிட்டால் (இயல்புநிலை), அதிர்வு சோதனைக்கு உள்ளீட்டு வடிவமைப்பை முடக்குகிறது, ஏனெனில் இயக்கப்பட்ட உள்ளீட்டு வடிவத்துடன் அதிர்வு சோதனையை இயக்குவது செல்லுபடியாகாது. `வெளியீடு` அளவுரு என்பது கமாவால் பிரிக்கப்பட்ட பட்டியலாகும், இதன் வெளியீடுகள் எழுதப்படும். `RAW_DATA` கோரப்பட்டால், மூல முடுக்கமானி தரவு ஒரு கோப்பு அல்லது தொடர்ச்சியான கோப்புகளில் எழுதப்பட்டுள்ளது . `அதிர்வுகள்` குறிப்பிடப்பட்டால், அதிர்வெண் பதில் கணக்கிடப்படுகிறது (எல்லா ஆய்வு புள்ளிகளிலும்) மற்றும்`/tmp/அதிர்வு_ <inx> _ <aname> .csv` கோப்பில் எழுதப்பட்டுள்ளது. அமைக்கப்படாவிட்டால், வெளியீடு இயல்புநிலையாக `அதிர்வுகளுக்கு`, மற்றும் பெயர் இயல்புநிலை தற்போதைய நேரத்திற்கு" yyyymmdd_hhmmss "வடிவத்தில் உள்ளது.

source: Also provided is the following extended G-Code command:
ta: பின்வரும் நீட்டிக்கப்பட்ட சி-கோட் கட்டளையும் வழங்கப்பட்டுள்ளது:

source: `SET_DISPLAY_TEXT MSG=<message>`: Performs the equivalent of M117, setting the supplied `MSG` as the current display message. If `MSG` is omitted the display will be cleared.
ta: `Set_display_text msg = <seagnive>`: M117 க்கு சமமானதைச் செய்கிறது, வழங்கப்பட்ட `msg` ஐ தற்போதைய காட்சி செய்தியாக அமைக்கிறது. `Msg` தவிர்க்கப்பட்டால் காட்சி அழிக்கப்படும்.

source: `RESPOND TYPE=echo_no_space MSG="<message>"`: echo the message prepended with `echo:` without a space between prefix and message, helpful for compatibility with some octoprint plugins that expect very specific formatting.
ta: `பதிலளிக்கவும் வகை = எதிரொலி_என்ஓ_ச்பேச் msg =" <seagnition> "` `:` எதிரொலியுடன் தயாரிக்கப்பட்ட செய்தியை எதிரொலிக்கவும்: `முன்னொட்டு மற்றும் செய்திக்கு இடையில் ஒரு இடம் இல்லாமல், சில ஆக்டோப்ரிண்ட் செருகுநிரல்களுடன் பொருந்தக்கூடியது, மிகவும் குறிப்பிட்ட வடிவமைப்பை எதிர்பார்க்கும்.

source: The following command is available when a [mcp4018 config section](Config_Reference.md#mcp4018) is enabled.
ta: ஒரு [MCP4018 கட்டமைப்பு பிரிவு] (config_reference.md#mcp4018) இயக்கப்பட்டால் பின்வரும் கட்டளை கிடைக்கும்.

source: `SET_DIGIPOT DIGIPOT=config_name WIPER=<value>`: This command will change the current value of the digipot. This value should typically be between 0.0 and 1.0, unless a 'scale' is defined in the config. When 'scale' is defined, then this value should be between 0.0 and 'scale'.
ta: `Set_digipot digipot = config_name wiper = <value>`: இந்த கட்டளை டிசிபோட்டின் தற்போதைய மதிப்பை மாற்றும். இந்த மதிப்பு பொதுவாக 0.0 முதல் 1.0 வரை இருக்க வேண்டும், கட்டமைப்பில் ஒரு 'அளவுகோல்' வரையறுக்கப்படாவிட்டால். 'அளவுகோல்' வரையறுக்கப்படும்போது, இந்த மதிப்பு 0.0 மற்றும் 'அளவுகோல்' வரை இருக்க வேண்டும்.

source: The print_stats module is automatically loaded.
ta: Print_stats தொகுதி தானாக ஏற்றப்படும்.

source: `SET_PRINT_STATS_INFO [TOTAL_LAYER=<total_layer_count>] [CURRENT_LAYER= <current_layer>]`: Pass slicer info like layer act and total to Klipper. Add `SET_PRINT_STATS_INFO [TOTAL_LAYER=<total_layer_count>]` to your slicer start gcode section and `SET_PRINT_STATS_INFO [CURRENT_LAYER= <current_layer>]` at the layer change gcode section to pass layer information from your slicer to Klipper.
ta: `Set_print_stats_info [மொத்தம்_லேயர் = <மொத்தம்_லேர்_சவுண்ட்>]] `Set_print_stats_info [மொத்தம்_லேயர் = <மொத்த_லேயர்_சவுண்ட்>]` உங்கள் ச்லைசர் தொடக்க GCODE பிரிவு மற்றும் `set_print_stats_info [நடப்பு_லேயர் = <aruntry_layer>]` `set_print_stats_info இல் சேர்க்கவும்.

source: The following commands are available when the [z_thermal_adjust config section](Config_Reference.md#z_thermal_adjust) is enabled.
ta: [Z_thermal_adjust கட்டமைப்பு பிரிவு] (config_reference.md#z_thermal_adjust) இயக்கப்பட்டால் பின்வரும் கட்டளைகள் கிடைக்கின்றன.

source: `SET_Z_THERMAL_ADJUST [ENABLE=<0:1>] [TEMP_COEFF=<value>] [REF_TEMP=<value>]`: Enable or disable the Z thermal adjustment with `ENABLE`. Disabling does not remove any adjustment already applied, but will freeze the current adjustment value - this prevents potentially unsafe downward Z movement. Re-enabling can potentially cause upward tool movement as the adjustment is updated and applied. `TEMP_COEFF` allows run-time tuning of the adjustment temperature coefficient (i.e. the `TEMP_COEFF` config parameter). `TEMP_COEFF` values are not saved to the config. `REF_TEMP` manually overrides the reference temperature typically set during homing (for use in e.g. non-standard homing routines) - will be reset automatically upon homing.
ta: `Set_z_thermal_adjust [enable = <0: 1>] [temp_coeff = <value>] [ref_temp = <மதிப்பு>]`: சட் வெப்ப சரிசெய்தலை `இயக்கு` உடன் இயக்கவும் அல்லது முடக்கவும். முடக்குவது ஏற்கனவே பயன்படுத்தப்படும் எந்த சரிசெய்தலையும் அகற்றாது, ஆனால் தற்போதைய சரிசெய்தல் மதிப்பை முடக்கிவிடும் - இது பாதுகாப்பற்ற கீழ்நோக்கி சட் இயக்கத்தைத் தடுக்கிறது. சரிசெய்தல் புதுப்பிக்கப்பட்டு பயன்படுத்தப்படுவதால் மீண்டும் இயக்குவது மேல்நோக்கி கருவி இயக்கத்தை ஏற்படுத்தும். `Temp_coeff` சரிசெய்தல் வெப்பநிலை குணகத்தின் ரன்-டைம் ட்யூனிங்கை அனுமதிக்கிறது (அதாவது` TEMP_COEFF` கட்டமைப்பு அளவுரு). `Temp_coeff` மதிப்புகள் உள்ளமைவுக்கு சேமிக்கப்படவில்லை. `Ref_temp` ஓமிங்கின் போது பொதுவாக அமைக்கப்பட்ட குறிப்பு வெப்பநிலையை கைமுறையாக மேலெழுதும் (எ.கா. தரமற்ற ஓமிங் நடைமுறைகளில் பயன்படுத்த) - ஓமிங் செய்யும் போது தானாக மீட்டமைக்கப்படும்.

source: Arc Move Clockwise (G2), Arc Move Counter-clockwise (G3): `G2|G3 [X<pos>] [Y<pos>] [Z<pos>] [E<pos>] [F<speed>] I<value> J<value>|I<value> K<value>|J<value> K<value>`
ta: ஆர்க் நகர்வு கடிகார திசையில் (சி 2), ஆர்க் நகரும் எதிர்-கடிகார திசையில் (சி 3): `சி 2 | ஐயா 3 [எக்ச் <போச்>] [ஒய் <போச்>] [இசட் <போச்>] [இ <pos>] [எஃப் <speed>] நான் <மதிப்பு> சே <மதிப்பு> | நான் <மதிப்பு> கே <மதிப்பு> | சே <மதிப்பு> கே <மதிப்பு> `

source: Arc Plane Select: G17 (XY plane), G18 (XZ plane), G19 (YZ plane)
ta: ஆர்க் வானூர்தி தேர்ந்தெடு: G17 (XY விமானம்), G18 (XZ விமானம்), G19 (YZ விமானம்)

source: `BED_TILT_CALIBRATE [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will probe the points specified in the config and then recommend updated x and y tilt adjustments. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
ta: `Bed_tilt_calibrate [முறை = கையேடு] [கிடைமட்ட_மோவ்_செச் = <மதிப்பு>] [<probe_parameter> = <மதிப்பு>]`: இந்த கட்டளை கட்டமைப்பில் குறிப்பிடப்பட்டுள்ள புள்ளிகளை ஆராய்ந்து பின்னர் புதுப்பிக்கப்பட்ட ஃச் மற்றும் ஒய் சாய் சரிசெய்தல் பரிந்துரைக்கும். விருப்ப ஆய்வு அளவுருக்கள் குறித்த விவரங்களுக்கு ஆய்வு கட்டளையைப் பார்க்கவும். முறை = கையேடு குறிப்பிடப்பட்டால், கையேடு ஆய்வு கருவி செயல்படுத்தப்படுகிறது - இந்த கருவி செயலில் இருக்கும்போது கிடைக்கும் கூடுதல் கட்டளைகள் குறித்த விவரங்களுக்கு மேலே உள்ள கையேடு_பிரோப் கட்டளையைப் பார்க்கவும். விருப்பமான `கிடைமட்ட_மோவ்_செச்` மதிப்பு கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள` கிடைமட்ட_மோவ்_செச்` விருப்பத்தை மீறுகிறது.

source: `DELTA_CALIBRATE [METHOD=manual] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will probe seven points on the bed and recommend updated endstop positions, tower angles, and radius. See the PROBE command for details on the optional probe parameters. If METHOD=manual is specified then the manual probing tool is activated - see the MANUAL_PROBE command above for details on the additional commands available while this tool is active. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
ta: `Delta_calibrate [முறை = கையேடு] [கிடைமட்ட_மோவ்_செச் = <மதிப்பு>] [<probe_parameter> = <மதிப்பு>]`: இந்த கட்டளை படுக்கையில் ஏழு புள்ளிகளை ஆராய்ந்து புதுப்பிக்கப்பட்ட எண்ட்ச்டாப் நிலைகள், கோபுர கோணங்கள் மற்றும் ஆரம் ஆகியவற்றை பரிந்துரைக்கும். விருப்ப ஆய்வு அளவுருக்கள் குறித்த விவரங்களுக்கு ஆய்வு கட்டளையைப் பார்க்கவும். முறை = கையேடு குறிப்பிடப்பட்டால், கையேடு ஆய்வு கருவி செயல்படுத்தப்படுகிறது - இந்த கருவி செயலில் இருக்கும்போது கிடைக்கும் கூடுதல் கட்டளைகள் குறித்த விவரங்களுக்கு மேலே உள்ள கையேடு_பிரோப் கட்டளையைப் பார்க்கவும். விருப்பமான `கிடைமட்ட_மோவ்_செச்` மதிப்பு கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள` கிடைமட்ட_மோவ்_செச்` விருப்பத்தை மீறுகிறது.

source: `SCREWS_TILT_CALCULATE [DIRECTION=CW|CCW] [MAX_DEVIATION=<value>] [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will invoke the bed screws adjustment tool. It will command the nozzle to different locations (as defined in the config file) probing the z height and calculate the number of knob turns to adjust the bed level. If DIRECTION is specified, the knob turns will all be in the same direction, clockwise (CW) or counterclockwise (CCW). See the PROBE command for details on the optional probe parameters. IMPORTANT: You MUST always do a G28 before using this command. If MAX_DEVIATION is specified, the command will raise a gcode error if any difference in the screw height relative to the base screw height is greater than the value provided. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
ta: `ச்க்ரூச்_பில்ட்_காலிகேட் [திசை = சி.டபிள்யூ | இது சட் உயரத்தை ஆய்வு செய்யும் வெவ்வேறு இடங்களுக்கு (கட்டமைப்பு கோப்பில் வரையறுக்கப்பட்டுள்ளபடி) முனை கட்டளையிடும் மற்றும் படுக்கை அளவை சரிசெய்ய குமிழ் திருப்பங்களின் எண்ணிக்கையைக் கணக்கிடும். திசை குறிப்பிடப்பட்டால், குமிழ் திருப்பங்கள் அனைத்தும் ஒரே திசையில், கடிகார திசையில் (சி.டபிள்யூ) அல்லது எதிரெதிர் திசையில் (சி.சி.டபிள்யூ) இருக்கும். விருப்ப ஆய்வு அளவுருக்கள் குறித்த விவரங்களுக்கு ஆய்வு கட்டளையைப் பார்க்கவும். முக்கியமானது: இந்த கட்டளையைப் பயன்படுத்துவதற்கு முன்பு நீங்கள் எப்போதும் G28 செய்ய வேண்டும். MAX_DEVIATION குறிப்பிடப்பட்டால், அடிப்படை திருகு உயரத்துடன் தொடர்புடைய திருகு உயரத்தில் ஏதேனும் வேறுபாடு வழங்கப்பட்ட மதிப்பை விட அதிகமாக இருந்தால் கட்டளை GCODE பிழையை உயர்த்தும். விருப்பமான `கிடைமட்ட_மோவ்_செச்` மதிப்பு கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள` கிடைமட்ட_மோவ்_செச்` விருப்பத்தை மீறுகிறது.

source: `DUMP_TMC STEPPER=<name> [REGISTER=<name>]`: This command will read all TMC driver registers and report their values. If a REGISTER is provided, only the specified register will be dumped.
ta: `DIMB_TMC STEPPER = <aname> [பதிவு = <பெயர்>]`: இந்த கட்டளை அனைத்து TMC இயக்கி பதிவேடுகளையும் படித்து அவற்றின் மதிப்புகளைப் புகாரளிக்கும். ஒரு பதிவு வழங்கப்பட்டால், குறிப்பிட்ட பதிவு மட்டுமே கொட்டப்படும்.

source: `SET_TMC_CURRENT STEPPER=<name> CURRENT=<amps> HOLDCURRENT=<amps>`: This will adjust the run and hold currents of the TMC driver. `HOLDCURRENT` is not applicable to tmc2660 drivers. When used on a driver which has the `globalscaler` field (tmc5160 and tmc2240), if StealthChop2 is used, the stepper must be held at standstill for >130ms so that the driver executes the AT#1 calibration.
ta: `Set_tmc_current stepper = <ame> மின்னோட்ட்ம், ஓட்டம் = <mps> holdcurrent = <mps>`: இது டிஎம்சி டிரைவரின் ஓட்டத்தை சரிசெய்து வைத்திருக்கும். TMC2660 இயக்கிகளுக்கு `ஓல்ட்கரண்ட்` பொருந்தாது. `குளோபல்ச்கேலர்` புலம் (டி.எம்.சி 5160 மற்றும் டி.எம்.சி 2240) கொண்ட ஓட்டுநரில் பயன்படுத்தும்போது, ச்டெல்த் சேப் 2 பயன்படுத்தப்பட்டால், ச்டெப்பரை> 130 எம்.எச்.

source: `SET_TMC_FIELD STEPPER=<name> FIELD=<field> VALUE=<value> VELOCITY=<value>`: This will alter the value of the specified register field of the TMC driver. This command is intended for low-level diagnostics and debugging only because changing the fields during run-time can lead to undesired and potentially dangerous behavior of your printer. Permanent changes should be made using the printer configuration file instead. No sanity checks are performed for the given values. A VELOCITY can also be specified instead of a VALUE. This velocity is converted to the 20bit TSTEP based value representation. Only use the VELOCITY argument for fields that represent velocities.
ta: `Set_tmc_field Stepper = <amen> புலம் = <field> மதிப்பு = <மதிப்பு> விரைவு = <மதிப்பு>`: இது TMC இயக்கியின் குறிப்பிட்ட பதிவு புலத்தின் மதிப்பை மாற்றும். இந்த கட்டளை குறைந்த அளவிலான கண்டறியும் மற்றும் பிழைத்திருத்தத்திற்காக மட்டுமே வடிவமைக்கப்பட்டுள்ளது, ஏனெனில் ரன்-டைம் போது புலங்களை மாற்றுவது உங்கள் அச்சுப்பொறியின் விரும்பத்தகாத மற்றும் ஆபத்தான நடத்தைக்கு வழிவகுக்கும். அதற்கு பதிலாக அச்சுப்பொறி உள்ளமைவு கோப்பைப் பயன்படுத்தி நிரந்தர மாற்றங்கள் செய்யப்பட வேண்டும். கொடுக்கப்பட்ட மதிப்புகளுக்கு நல்லறிவு சோதனைகள் எதுவும் செய்யப்படவில்லை. மதிப்புக்கு பதிலாக ஒரு வேகத்தையும் குறிப்பிடலாம். இந்த விரைவு 20 பிட் TSTEP அடிப்படையிலான மதிப்பு பிரதிநிதித்துவமாக மாற்றப்படுகிறது. வேகங்களைக் குறிக்கும் புலங்களுக்கு மட்டுமே திசைவேக வாதத்தைப் பயன்படுத்துங்கள்.

source: `Z_TILT_ADJUST [HORIZONTAL_MOVE_Z=<value>] [<probe_parameter>=<value>]`: This command will probe the points specified in the config and then make independent adjustments to each Z stepper to compensate for tilt. See the PROBE command for details on the optional probe parameters. The optional `HORIZONTAL_MOVE_Z` value overrides the `horizontal_move_z` option specified in the config file.
ta: `Z_tilt_adjust [கிடைமட்ட_மோவ்_இச் = <மதிப்பு>] [<probe_parameter> = <மதிப்பு>]`: இந்த கட்டளை கட்டமைப்பில் குறிப்பிடப்பட்டுள்ள புள்ளிகளை ஆராய்ந்து பின்னர் ஒவ்வொரு சட் ச்டெப்பரிலும் சுயாதீனமான மாற்றங்களைச் செய்யும். விருப்ப ஆய்வு அளவுருக்கள் குறித்த விவரங்களுக்கு ஆய்வு கட்டளையைப் பார்க்கவும். விருப்பமான `கிடைமட்ட_மோவ்_செச்` மதிப்பு கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள` கிடைமட்ட_மோவ்_செச்` விருப்பத்தை மீறுகிறது.
