Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Installation.po
Languages: pt_br, ta, uk

source: Building and flashing the micro-controller
pt_br: Configurando e atualizando o microcontrolador
ta: மைக்ரோ-கன்ட்ரோலரை உருவாக்கி ஒளிரச் செய்தல்
uk: Будівництво та миготливий мікроконтролер

source: It should report something similar to the following:
pt_br: Deve relatar algo semelhante ao exemplo:
ta: இது பின்வருவனவற்றைப் போன்ற ஒன்றைப் புகாரளிக்க வேண்டும்:
uk: Повідомляти щось схоже на наступне:

source: Be sure to update the FLASH_DEVICE with the printer's unique serial port name.
pt_br: Certifique-se de atualizar o FLASH_DEVICE com o nome exclusivo da porta serial da impressora.
ta: அச்சுப்பொறியின் தனித்துவமான சீரியல் துறைமுகம் பெயருடன் Flash_device ஐ புதுப்பிக்க மறக்காதீர்கள்.
uk: Будьте впевнені, що оновлення FLASH_DEVICE з унікальною серійною назвою принтера.

source: Configuring Klipper
pt_br: Configurando Klipper
ta: வெட்டுக்களை உள்ளமைக்கும்
uk: Налаштування кліппера

source: cd ~/klipper/ make menuconfig
uk: cd ~ / клиппер / налаштування меню

source: make
uk: зроби

source: ls /dev/serial/by-id/*
uk: ls /dev/serial/by-id/ ім'я *

source: sudo service klipper stop make flash FLASH_DEVICE=/dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0 sudo service klipper start
uk: sudo обслуговування klipper стоп зробити флеш FLASH_DEVICE=/dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0 sudo сервіс klipper старт

source: cp ~/klipper/config/example-cartesian.cfg ~/printer.cfg nano ~/printer.cfg
uk: javascript licenses api веб-сайт go1.13.8 ~/принтер.cfg javascript licenses api веб-сайт go1.13.8

source: [mcu] serial: /dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0
uk: [mcu] Серія: /dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0

source: Installation
pt_br: Instalação
ta: நிறுவல்
uk: Встановлення

source: Obtain a Klipper Configuration File
pt_br: Obter um arquivo de configuração do Klipper
ta: கிளிப்பர் உள்ளமைவு கோப்பைப் பெறுங்கள்
uk: Отримання файлу конфігурації кліппера

source: If there isn't an appropriate printer configuration file in the Klipper config directory then try searching the printer manufacturer's website to see if they have an appropriate Klipper configuration file.
pt_br: Se não houver um arquivo de configuração de impressora apropriado no diretório do Klipper, tente pesquisar no site do fabricante da impressora para ver se existe algum arquivo de configuração apropriado.
ta: கிளிப்பர் கட்டமைப்பு கோப்பகத்தில் பொருத்தமான அச்சுப்பொறி உள்ளமைவு கோப்பு இல்லையென்றால், அச்சுப்பொறி உற்பத்தியாளரின் வலைத்தளத்தைத் தேட முயற்சிக்கவும், அவற்றில் பொருத்தமான கிளிப்பர் உள்ளமைவு கோப்பு இருக்கிறதா என்று பார்க்கவும்.
uk: Якщо ви не є відповідним файлом конфігурації принтера в каталозі Klipper, то спробуйте шукати сайт виробника принтера, щоб побачити, якщо у них є відповідний файл конфігурації Klipper.

source: If no configuration file for the printer can be found, but the type of printer control board is known, then look for an appropriate [config file](../config/) starting with a "generic-" prefix. These example printer board files should allow one to successfully complete the initial installation, but will require some customization to obtain full printer functionality.
pt_br: Se nenhum arquivo de configuração adequado puder ser encontrado, mas o tipo de placa de controle da impressora for conhecido, então procure por um [config file](../config/) apropriado começando com um prefixo "generic-". Esses arquivos de exemplo devem permitir que se conclua com sucesso a instalação inicial, mas exigirão alguma personalização para obter o funcionamento completa da impressora.
ta: அச்சுப்பொறிக்கான உள்ளமைவு கோப்பைக் காண முடியாவிட்டால், ஆனால் அச்சுப்பொறி கட்டுப்பாட்டு பலகையின் வகை அறியப்பட்டால், "பொதுவான-" முன்னொட்டுடன் தொடங்கி பொருத்தமான [கட்டமைப்பு கோப்பு] (../ கட்டமைப்பு/) ஐத் தேடுங்கள். இந்த எடுத்துக்காட்டு அச்சுப்பொறி பலகை கோப்புகள் ஆரம்ப நிறுவலை வெற்றிகரமாக முடிக்க அனுமதிக்க வேண்டும், ஆனால் முழு அச்சுப்பொறி செயல்பாட்டைப் பெற சில தனிப்பயனாக்கம் தேவைப்படும்.
uk: Якщо не вдається знайти файл конфігурації для принтера, але відомий тип плати керування принтером, знайдіть відповідний [файл конфігурації](../config/), який починається з префікса "generic-". Ці приклади файлів плати принтера повинні дозволити успішно завершити початкову інсталяцію, але потребують певних налаштувань для отримання повної функціональності принтера.

source: It is also possible to define a new printer configuration from scratch. However, this requires significant technical knowledge about the printer and its electronics. It is recommended that most users start with an appropriate configuration file. If creating a new custom printer configuration file, then start with the closest example [config file](../config/) and use the Klipper [config reference](Config_Reference.md) for further information.
pt_br: Também é possível definir uma nova configuração do zero. No entanto, isso requer conhecimento técnico sobre a impressora e seus componentes eletrônicos. É recomendado que a maioria dos usuários comece com um arquivo de configuração apropriado. Se estiver criando um novo arquivo de configuração personalizado, comece com o exemplo mais próximo [config file](../config/) e use a [config reference](Config_Reference.md) do Klipper para obter informações.
ta: புதிதாக ஒரு புதிய அச்சுப்பொறி உள்ளமைவை வரையறுக்கவும் முடியும். இருப்பினும், இதற்கு அச்சுப்பொறி மற்றும் அதன் மின்னணுவியல் பற்றிய குறிப்பிடத்தக்க தொழில்நுட்ப அறிவு தேவைப்படுகிறது. பெரும்பாலான பயனர்கள் பொருத்தமான உள்ளமைவு கோப்புடன் தொடங்க பரிந்துரைக்கப்படுகிறது. புதிய தனிப்பயன் அச்சுப்பொறி உள்ளமைவு கோப்பை உருவாக்கினால், மிக நெருக்கமான எடுத்துக்காட்டு [கட்டமைப்பு கோப்பு] (../ config/) உடன் தொடங்கி மேலும் தகவலுக்கு கிளிப்பர் [கட்டமைப்பு குறிப்பு] (config_reference.md) ஐப் பயன்படுத்தவும்.
uk: Також можна визначити нову конфігурацію принтера з нуля. Однак для цього потрібні значні технічні знання про принтер та його електроніку. Рекомендується, щоб більшість користувачів починали з відповідного файлу конфігурації. Якщо ви створюєте новий власний файл конфігурації принтера, почніть із найближчого прикладу [конфігураційного файлу](../config/) і скористайтеся Klipper [конфігураційним посиланням](Config_Reference.md) для отримання додаткової інформації.

source: The comments at the top of the [printer configuration file](#obtain-a-klipper-configuration-file) should describe the settings that need to be set during "make menuconfig". Open the file in a web browser or text editor and look for these instructions near the top of the file. Once the appropriate "menuconfig" settings have been configured, press "Q" to exit, and then "Y" to save. Then run:
pt_br: Os comentários no topo de [printer configuration file](#obtain-a-klipper-configuration-file) deve descrever o que deve ser configurado durante "make menuconfig". Abra o arquivo em um navegador/editor e procure por estas instruções perto do topo do arquivo. Depois de ajustar tudo com "menuconfig", pressione "Q" para sair e, em seguida, "Y" para salvar. Em seguida, execute:
ta: [அச்சுப்பொறி உள்ளமைவு கோப்பின்] மேலே உள்ள கருத்துகள் (#A-KLIPPER-CONFIGURATION-FILE ஐப் பெறுங்கள்) "மெனுகான்ஃபிக் செய்யுங்கள்" போது அமைக்க வேண்டிய அமைப்புகளை விவரிக்க வேண்டும். ஒரு வலை உலாவி அல்லது உரை திருத்தியில் கோப்பைத் திறந்து, கோப்பின் மேற்புறத்தில் இந்த வழிமுறைகளைத் தேடுங்கள். பொருத்தமான "மெனுகான்ஃபிக்" அமைப்புகள் கட்டமைக்கப்பட்டவுடன், வெளியேற "Q" ஐ அழுத்தவும், பின்னர் சேமிக்க "ஒய்" ஐ அழுத்தவும். பின்னர் ஓடு:
uk: У коментарях у верхній частині файлу конфігурації [printer](#obtain-a-klipper-configuration-file) слід описати налаштування, які необхідно встановити під час меню "makeconfig". Відкрийте файл у веб-браузері або текстовому редакторі та ознайомтеся з цими інструкціями у верхній частині файлу. Після того, як було налаштовано відповідні налаштування "menuconfig", натисніть кнопку "Q" для виходу, а потім "Y" для збереження. Далі запустіть:

source: If the comments at the top of the [printer configuration file](#obtain-a-klipper-configuration-file) describe custom steps for "flashing" the final image to the printer control board then follow those steps and then proceed to [configuring OctoPrint](#configuring-octoprint-to-use-klipper).
pt_br: Se os comentários na parte superior do [printer configuration file](#obtain-a-klipper-configuration-file) descreverem etapas personalizadas para "transmitir" a imagem final para a placa controladora, siga essas etapas e prossiga para [configuring OctoPrint](#configuring-octoprint-to-use-klipper).
ta: [அச்சுப்பொறி உள்ளமைவு கோப்பின் மேலே உள்ள கருத்துகள்] (#A-KLIPPER-உள்ளமைவு-கோப்பு பெறுதல்) அச்சுப்பொறி கட்டுப்பாட்டு வாரியத்திற்கு இறுதி படத்தை "ஒளிரும்" செய்வதற்கான தனிப்பயன் படிகளை விவரிக்கவும், பின்னர் அந்த படிகளைப் பின்பற்றி [உள்ளமைக்கவும் ஆக்டோப்ரின்ட்] (#கட்டமைத்தல்-ஆக்டோப்ரிண்ட்-டு-யூச்-கிளிப்பர்).
uk: Якщо коментарі у верхній частині файлу конфігурації [printer](#obtain-a-klipper-configuration-file) описують користувацькі кроки для "flashing" кінцевого зображення до панелі керування принтером, а потім приступайте до [configuring OctoPrint](#configuring-octoprint-to-use-klipper).

source: Otherwise, the following steps are often used to "flash" the printer control board. First, it is necessary to determine the serial port connected to the micro-controller. Run the following:
pt_br: Caso contrário, as etapas a seguir são frequentemente usadas para atualizar (flash) a placa controladora. Primeiro, é necessário determinar a porta serial conectada ao microcontrolador. Execute o seguinte:
ta: இல்லையெனில், அச்சுப்பொறி கட்டுப்பாட்டு பலகையை "ஃபிளாச்" செய்ய பின்வரும் படிகள் பெரும்பாலும் பயன்படுத்தப்படுகின்றன. முதலாவதாக, மைக்ரோ-கன்ட்ரோலருடன் இணைக்கப்பட்ட தொடர் துறைமுகத்தை தீர்மானிக்க வேண்டியது தேவை. பின்வருவனவற்றை இயக்கவும்:
uk: В іншому випадку часто використовуються наступні дії для "flash" обробної дошки. Спочатку необхідно визначити послідовний порт, підключений до мікроконтролера. Запустити наступне:

source: It's common for each printer to have its own unique name for the micro-controller. The name may change after flashing Klipper, so rerun these steps again even if they were already done when flashing. Run:
pt_br: É comum que cada impressora tenha seu próprio nome exclusivo para o microcontrolador. O nome pode mudar após o flash do Klipper, então execute novamente essas etapas mesmo que elas já tenham sido feitas. Execute:
ta: ஒவ்வொரு அச்சுப்பொறியும் மைக்ரோ-கன்ட்ரோலருக்கு அதன் தனித்துவமான பெயரைக் கொண்டிருப்பது பொதுவானது. கிளிப்பரை ஒளிரச் செய்தபின் பெயர் மாறக்கூடும், எனவே இந்த படிகள் ஒளிரும் போது அவை ஏற்கனவே செய்யப்பட்டிருந்தாலும் மீண்டும் மீண்டும் இயக்கவும். ரன்:
uk: Для кожного принтера необхідно мати власну унікальну назву мікроконтролера. Ім'я може змінитися після того, як миготливий кліппер, так що повторно виконайте ці кроки, навіть якщо вони вже робилися при флешці. Запуск:

source: Then update the config file with the unique name. For example, update the `[mcu]` section to look something similar to:
pt_br: Após, atualize o arquivo de configuração com o nome adequado. Por exemplo, atualize a seção `[mcu]` para algo parecido com:
ta: பின்னர் கட்டமைப்பு கோப்பை தனித்துவமான பெயருடன் புதுப்பிக்கவும். எடுத்துக்காட்டாக, இதேபோன்ற ஒன்றைக் காண `[MCU]` பகுதியைப் புதுப்பிக்கவும்:
uk: Потім оновити файл config з унікальною назвою. Наприклад, оновити розділ `[mcu]`, щоб подивитися щось схоже на:

source: When customizing the printer config file, it is not uncommon for Klipper to report a configuration error. If an error occurs, make any necessary corrections to the printer config file and issue "restart" until "status" reports the printer is ready.
pt_br: Ao personalizar o arquivo de configuração, não é incomum que o Klipper relate um erro. Se ocorrer, faça as correções necessárias no arquivo e execute "restart" até que "status" informe que a impressora está pronta.
ta: அச்சுப்பொறி கட்டமைப்பு கோப்பைத் தனிப்பயனாக்கும்போது, க்ளிப்பர் ஒரு உள்ளமைவு பிழையைப் புகாரளிப்பது வழக்கமல்ல. பிழை ஏற்பட்டால், அச்சுப்பொறி கட்டமைப்பு கோப்பில் தேவையான திருத்தங்களைச் செய்து, அச்சுப்பொறி தயாராக இருப்பதாக "நிலை" புகாரளிக்கும் வரை "மறுதொடக்கம்" ஐ வழங்கவும்.
uk: Коли налаштовує файл налаштування принтера, це не рідкість для Klipper, щоб повідомити помилку конфігурації. Якщо виникає помилка, зробіть будь-які необхідні корективи до файлу налаштувань принтера і виписку «рештарт» до звіту «статус».

source: After Klipper reports that the printer is ready, proceed to the [config check document](Config_checks.md) to perform some basic checks on the definitions in the config file. See the main [documentation reference](Overview.md) for other information.
pt_br: Após o Klipper relatar que a impressora está pronta, prossiga para o [config check document](Config_checks.md) para executar algumas verificações básicas no arquivo de configuração. Veja [documentation reference](Overview.md) para outras informações.
ta: அச்சுப்பொறி தயாராக இருப்பதாக கிளிப்பர் புகாரளித்த பிறகு, கட்டமைப்பு கோப்பில் உள்ள வரையறைகளில் சில அடிப்படை சோதனைகளைச் செய்ய [கட்டமைப்பு காசோலை ஆவணம்] (config_checks.md) க்குச் செல்லவும். பிற தகவல்களுக்கு முதன்மையான [ஆவணப்படுத்தல் குறிப்பு] (கண்ணோட்டம். எம்.டி) ஐப் பார்க்கவும்.
uk: Після того, як Klipper повідомляє, що принтер готовий, приступайте до [config check документ](Config_checks.md) для виконання деяких базових перевірок на визначеннях у файлі конфігурації. Головна [Довідник](Overview.md) для іншої інформації.

source: These instructions assume the software will run on a linux based host running a Klipper compatible front end. It is recommended that a SBC(Small Board Computer) such as a Raspberry Pi or Debian based Linux device be used as the host machine (see the [FAQ](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) for other options).
ta: கிளிப்பர் இணக்கமான முன் இறுதியில் இயங்கும் லினக்ச் அடிப்படையிலான ஓச்டில் மென்பொருள் இயங்கும் என்று இந்த வழிமுறைகள் கருதுகின்றன. ராச்பெர்ரி பிஐ அல்லது டெபியன் அடிப்படையிலான லினக்ச் சாதனம் போன்ற ஒரு எச்.பி.சி (சிறிய போர்டு கணினி) புரவலன் இயந்திரமாகப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது ([கேள்விகள்] (faq.md#can-i-run-klipper-on- ஏதோ பார்க்கவும் பிற விருப்பங்களுக்கு ஒரு-ராச்பெர்ரி-பிஐ -3 ஐ விட மற்ற விருப்பங்களுக்கு).
uk: Ці інструкції припускають програмне забезпечення, яке буде працювати на основі Linux, що працює Klipper сумісний передній кінець. Рекомендовано, що SBC (Маленькі дошки комп'ютерів), такі як малиновий Pi або Debian на основі Linux пристрій використовується як хост машина (див. [FAQ](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) для інших варіантів).

source: For the purposes of these instructions host relates to the Linux device and mcu relates to the printboard. SBC relates to the term Small Board Computer such as the Raspberry Pi.
ta: இந்த அறிவுறுத்தல்களின் நோக்கங்களுக்காக புரவலன் லினக்ச் சாதனம் மற்றும் ச்பிரிங்போர்டு தொடர்பான எம்.சி.யு ஆகியவற்றுடன் தொடர்புடையது. எச்.பி.சி ராச்பெர்ரி பை போன்ற சிறிய பலகை கணினி என்ற சொல்லுடன் தொடர்புடையது.
uk: Для цілей цих інструкцій, що належать до пристрою Linux і mcu, відноситься до друкованої плати. SBC відноситься до терміну Малої дошки комп'ютер, такі як Малина Пі.

source: Most Klipper settings are determined by a "printer configuration file" printer.cfg, that will be stored on the host. An appropriate configuration file can often be found by looking in the Klipper [config directory](../config/) for a file starting with a "printer-" prefix that corresponds to the target printer. The Klipper configuration file contains technical information about the printer that will be needed during the installation.
ta: பெரும்பாலான கிளிப்பர் அமைப்புகள் "அச்சுப்பொறி உள்ளமைவு கோப்பு" அச்சுப்பொறியால் தீர்மானிக்கப்படுகின்றன, அவை ஓச்டில் சேமிக்கப்படும். இலக்கு அச்சுப்பொறிக்கு ஒத்த "அச்சுப்பொறி" முன்னொட்டுடன் தொடங்கும் கோப்பிற்கான கிளிப்பர் [கட்டமைப்பு அடைவு] (../ கட்டமைப்பு/) இல் பார்ப்பதன் மூலம் பொருத்தமான உள்ளமைவு கோப்பைக் காணலாம். கிளிப்பர் உள்ளமைவு கோப்பில் நிறுவலின் போது தேவைப்படும் அச்சுப்பொறி பற்றிய தொழில்நுட்ப தகவல்கள் உள்ளன.
uk: Більшість параметрів Klipper визначається «файлом конфігурації принтера» printer.cfg, який зберігатиметься на хості. Відповідний файл конфігурації часто можна знайти, переглянувши [каталог конфігурації](../config/) Klipper для файлу, який починається з префікса «printer-», який відповідає цільовому принтеру. Файл конфігурації Klipper містить технічну інформацію про принтер, яка знадобиться під час встановлення.

source: Interacting with Klipper
ta: கிளிப்பருடன் தொடர்புகொள்வது
uk: Інтерактивація з клиппером

source: Klipper is a 3d printer firmware, so it needs some way for the user to interact with it.
ta: கிளிப்பர் ஒரு 3D அச்சுப்பொறி ஃபார்ம்வேர், எனவே பயனருடன் தொடர்பு கொள்ள சில வழி தேவை.
uk: Klipper - це прошивка принтера 3d, тому вона потребує певного способу взаємодії з ним.

source: Currently the best choices are front ends that retrieve information through the [Moonraker web API](https://moonraker.readthedocs.io/) and there is also the option to use [Octoprint](https://octoprint.org/) to control Klipper.
ta: தற்போது சிறந்த தேர்வுகள் [மூன்ராகேக்கர் வலை ஏபிஐ] (https://monraker.readthedocs.io/) மூலம் தகவல்களை மீட்டெடுக்கும் முன் முனைகள் மற்றும் [ஆக்டோப்ரின்ட்] (https://octoprint.org/) பயன்படுத்த விருப்பமும் உள்ளது கிளிப்பரைக் கட்டுப்படுத்த.
uk: В даний час кращі варіанти є передніми кінцями, які отримують інформацію через [Moonraker web API](https://moonraker.readthedocs.io/) і є також можливість використовувати [Octoprint](https://octoprint.org/) для управління Klipper.

source: The choice is up to the user on what to use, but the underlying Klipper is the same in all cases. We encourage users to research the options available and make an informed decision.
ta: தேர்வு எதைப் பயன்படுத்த வேண்டும் என்பது பயனரின் தான், ஆனால் அடிப்படை கிளிப்பர் எல்லா நிகழ்வுகளிலும் ஒரே மாதிரியாக இருக்கும். கிடைக்கக்கூடிய விருப்பங்களை ஆராய்ச்சி செய்து தகவலறிந்த முடிவை எடுக்க பயனர்களை நாங்கள் ஊக்குவிக்கிறோம்.
uk: Вибір є користувачем на те, що використовувати, але основний кліппер є однаковим у всіх випадках. Ми заохочуємо користувачів до дослідження варіантів, доступних і прийняття рішення.

source: Obtaining an OS image for SBC's
ta: எச்.பி.சி.க்கு ஒரு OS படத்தைப் பெறுதல்
uk: Отримання образу ОС для SBC

source: There are many ways to obtain an OS image for Klipper for SBC use, most depend on what front end you wish to use. Some manafactures of these SBC boards also provide their own Klipper-centric images.
ta: எச்.பி.சி பயன்பாட்டிற்காக கிளிப்பருக்கான OS படத்தைப் பெற பல வழிகள் உள்ளன, பெரும்பாலானவை நீங்கள் எந்த முன் இறுதியில் பயன்படுத்த விரும்புகிறீர்கள் என்பதைப் பொறுத்தது. இந்த எச்.பி.சி போர்டுகளின் சில மனாஃபாக்சர்கள் அவற்றின் சொந்த கிளிப்பர்-மைய படங்களை வழங்குகின்றன.
uk: Існує багато способів отримання образу ОС для кріплень для використання SBC, більшість залежать від того, що передній кінець ви хочете використовувати. Деякі манфакси цих панелей SBC також надають свої власні Кліппер-центричні зображення.

source: The two main Moonraker based front ends are [Fluidd](https://docs.fluidd.xyz/) and [Mainsail](https://docs.mainsail.xyz/), the latter of which has a premade install image ["MainsailOS"](http://docs.mainsailOS.xyz), this has the option for Raspberry Pi and some OrangePi varianta.
ta: இரண்டு முக்கிய மூன்ராகேக்கர் அடிப்படையிலான முன் முனைகள் [Flifimd] (https://docs.fluidd.xyz/) மற்றும் [மெயின்செயில்] (https://docs.mainesail.xyz/), இதில் பிந்தையது முன்கூட்டியே நிறுவப்பட்ட படத்தைக் கொண்டுள்ளது [ "மெயின்சைலோச்"]] (http://docs.mainesailos.xyz), இது ராச்பெர்ரி பை மற்றும் சில ஆரஞ்ச்பி மாறுபாட்டிற்கான விருப்பத்தைக் கொண்டுள்ளது.
uk: Два основних Moonraker на основі передніх кінців [Fluidd](https://docs.fluidd.xyz/) і [Mainsail](https://docs.mainsail.xyz/), останнє з яких має попередньо встановлене зображення [MainsailOS"](http://docs.mainsailOS.xyz), це має варіант для Raspberry Pi і деякі варіанти OrangePi.

source: Fluidd can be installed via KIAUH(Klipper Install And Update Helper), which is explained below and is a 3rd party installer for all things Klipper.
ta: KIAUH (கிளிப்பர் நிறுவல் மற்றும் புதுப்பிப்பு உதவியாளர்) வழியாக FILIGDD ஐ நிறுவலாம், இது கீழே விளக்கப்பட்டுள்ளது மற்றும் எல்லாவற்றிற்கும் 3 வது தரப்பு நிறுவி கிளிப்பர் ஆகும்.
uk: Фрідд можна встановити через KIAUH(Klipper Install І Update Helper), який пояснюється нижче і є 3-й вечірній інсталятор для всіх речей Klipper.

source: OctoPrint can be installed via the popular OctoPi image or via KIAUH, this process is explained in <OctoPrint.md>
ta: பிரபலமான ஆக்டோபி படம் வழியாக அல்லது கியாவ் வழியாக ஆக்டோப்ரிண்ட் நிறுவப்படலாம், இந்த செயல்முறை <octoprint.md> இல் விளக்கப்பட்டுள்ளது
uk: OctoPrint може бути встановлений за допомогою популярного OctoPi зображення або через KIAUH, цей процес пояснюється <OctoPrint.md>

source: Installing via KIAUH
ta: கியாவ் வழியாக நிறுவுகிறது
uk: Встановлення через КІАУХ

source: Normally you would start with a base image for your SBC, RPiOS Lite for example, or in the case of a x86 Linux device, Ubuntu Server. Please note that Desktop variants are not recommended due to certain helper programs that can stop some Klipper functions working and even mask access to some print boards.
ta: பொதுவாக நீங்கள் உங்கள் எச்.பி.சி, ஆர்.பி.ஓ.எச் லைட்டிற்கான அடிப்படை படத்துடன் தொடங்குவீர்கள், எடுத்துக்காட்டாக, அல்லது ஃச் 86 லினக்ச் சாதனம், உபுண்டு சேவையகத்தின் விசயத்தில். சில கிளிப்பர் செயல்பாடுகளைத் தடுக்கக்கூடிய சில உதவி நிரல்களால் டெச்க்டாப் வகைகள் பரிந்துரைக்கப்படவில்லை என்பதை நினைவில் கொள்க, சில அச்சு பலகைகளுக்கு அணுகலை கூட மறைக்கவும்.
uk: Зазвичай ви почнете з базовим зображенням для вашого SBC, RPiOS Lite, наприклад, або у випадку пристрою x86 Linux, Ubuntu Server. Будь ласка, зверніть увагу, що варіанти робочого столу не рекомендуються через певні програми, які можуть зупинити деякі функції Klipper, які працюють і навіть маскувати доступ до деяких друкованих плат.

source: KIAUH can be used to install Klipper and its associated programs on a variety of Linux based systems that run a form of Debian. More information can be found at https://github.com/dw-0/kiauh
ta: கிளிப்பர் மற்றும் அதனுடன் தொடர்புடைய நிரல்களை ஒரு வகையான டெபியனை இயக்கும் பல்வேறு லினக்ச் அடிப்படையிலான அமைப்புகளில் நிறுவ கியாவைப் பயன்படுத்தலாம். மேலும் தகவல்களை https://github.com/dw-0/kiauh இல் காணலாம்
uk: KIAUH може використовуватися для установки Klipper та його пов'язаних програм на різних Linux базових системах, які виконують форму Debian. Більше інформації можна знайти на https://github.com/dw-0/kiauh

source: To compile the micro-controller code, start by running these commands on your host device:
ta: மைக்ரோ-கன்ட்ரோலர் குறியீட்டை தொகுக்க, உங்கள் புரவலன் சாதனத்தில் இந்த கட்டளைகளை இயக்குவதன் மூலம் தொடங்கவும்:
uk: Щоб компілювати код мікроконтролера, запустіть ці команди на пристрої хосту:
