Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Installation.po
Languages: pt_br, ta, uk

source: It's common for each printer to have its own unique serial port name. This unique name will be used when flashing the micro-controller. It's possible there may be multiple lines in the above output - if so, choose the line corresponding to the micro-controller. If many items are listed and the choice is ambiguous, unplug the board and run the command again, the missing item will be your print board(see the [FAQ](FAQ.md#wheres-my-serial-port) for more information).
ta: ஒவ்வொரு அச்சுப்பொறியும் அதன் தனித்துவமான சீரியல் துறைமுகம் பெயரைக் கொண்டிருப்பது பொதுவானது. மைக்ரோ-கன்ட்ரோலரை ஒளிரும் போது இந்த தனித்துவமான பெயர் பயன்படுத்தப்படும். மேலே உள்ள வெளியீட்டில் பல கோடுகள் இருக்கலாம் - அப்படியானால், மைக்ரோ -கன்ட்ரோலருடன் தொடர்புடைய வரியைத் தேர்வுசெய்க. பல உருப்படிகள் பட்டியலிடப்பட்டு, தேர்வு தெளிவற்றதாக இருந்தால், பலகையை அவிழ்த்துவிட்டு மீண்டும் கட்டளையை இயக்கினால், காணாமல் போன உருப்படி உங்கள் அச்சு பலகையாக இருக்கும் (மேலும் தகவலுக்கு [கேள்விகள்] (கேள்விகள்) (கேள்விகள்) ).
uk: Це загальний для кожного принтера, щоб мати свою унікальну назву серійного порту. Це унікальне ім'я буде використовуватися при митті мікроконтролера. Можливо, є декілька рядків у вищевказаному виході - якщо так, виберіть рядок, що відповідає мікроконтролю. Якщо багато елементів вказані і вибір неоднозначні, розгорніть дошку і запустіть команду знову, відсутній пункт буде вашим друкованим дошкою (див. [FAQ](FAQ.md#wheres-my-serial-port) для отримання додаткової інформації).

source: For common micro-controllers with STM32 or clone chips, LPC chips and others it is usual that these need an initial Klipper flash via SD card.
ta: STM32 அல்லது நகலி சில்லுகள், எல்பிசி சில்லுகள் மற்றும் பிறவற்றைக் கொண்ட பொதுவான மைக்ரோ-கன்ட்ரோலர்களுக்கு, எச்டி அட்டை வழியாக ஆரம்ப கிளிப்பர் ஃபிளாச் தேவை என்பது வழக்கம்.
uk: Для звичайних мікроконтролерів з чіпсами STM32 або клоном, чіпсами LPC та іншими стандартно, що ці дані потребують початкового спалаху Klipper через SD-карту.

source: When flashing with this method, it is important to make sure that the print board is not connected with USB to the host, due to some boards being able to feed power back to the board and stopping a flash from occuring.
ta: இந்த முறையுடன் ஒளிரும் போது, சில பலகைகள் பலகைகளுக்கு மீண்டும் பலகைக்கு உணவளிக்க முடியும் மற்றும் ஒரு ஃபிளாச் ஏற்படாமல் நிறுத்துவதால், அச்சு பலகை யூ.எச்.பி உடன் ஓச்டுடன் இணைக்கப்படவில்லை என்பதை உறுதிப்படுத்துவது முதன்மை.
uk: Якщо миготливий з цим методом, важливо переконатися, що друкована плата не підключена з USB до хосту, через деякі дошки, які здатні годувати живлення дошки і зупинити спалах від виникання.

source: For common micro-controllers using Atmega chips, for example the 2560, the code can be flashed with something similar to:
ta: ATMEGA சில்லுகளைப் பயன்படுத்தி பொதுவான மைக்ரோ-கன்ட்ரோலர்களுக்கு, எடுத்துக்காட்டாக 2560, குறியீட்டை ஒத்த ஒன்றைக் கொண்டு ஒளிரச் செய்யலாம்:
uk: Для звичайних мікроконтролерів з використанням чіпсів Atmega, наприклад, 2560, код може бути спалахований чимось схожим на:

source: For common micro-controllers using RP2040 chips, the code can be flashed with something similar to:
ta: RP2040 சில்லுகளைப் பயன்படுத்தும் பொதுவான மைக்ரோ-கன்ட்ரோலர்களுக்கு, குறியீட்டை ஒத்த ஒன்றைக் கொண்டு ஒளிரச் செய்யலாம்:
uk: Для звичайних мікроконтролерів з використанням чіпсів RP2040, код може бути спалахований чимось схожим на:

source: sudo service klipper stop make flash FLASH_DEVICE=first sudo service klipper start
uk: sudo обслуговування klipper стоп зробити флеш FLASH_DEVICE=перший sudo сервіс klipper старт

source: It is important to note that RP2040 chips may need to be put into Boot mode before this operation.
ta: இந்த செயல்பாட்டிற்கு முன் RP2040 சில்லுகள் துவக்க பயன்முறையில் வைக்கப்பட வேண்டும் என்பதை கவனத்தில் கொள்ள வேண்டும்.
uk: Важливо відзначити, що чіпси RP2040 можуть знадобитися вводити в режим завантаження до цієї операції.

source: The next step is to copy the [printer configuration file](#obtain-a-klipper-configuration-file) to the host.
ta: அடுத்த கட்டம் [அச்சுப்பொறி உள்ளமைவு கோப்பை] (#a-klipper-configuration-file) ஓச்டுக்கு நகலெடுப்பது.
uk: Наступним кроком є копіювання файлу конфігурації [printer](#obtain-a-klipper-configuration-file) до хосту.

source: Arguably the easiest way to set the Klipper configuration file is using the built in editors in Mainsail or Fluidd. These will allow the user to open the configuration examples and save them to be printer.cfg.
ta: கிளிப்பர் உள்ளமைவு கோப்பை அமைப்பதற்கான எளிதான வழி மெயின்செயில் அல்லது ஃப்ளூய்டில் உள்ள ஆசிரியர்களில் கட்டமைக்கப்பட்டதைப் பயன்படுத்துகிறது. இவை பயனரை உள்ளமைவு எடுத்துக்காட்டுகளைத் திறந்து அவற்றை அச்சுப்பொறியாக சேமிக்க அனுமதிக்கும்.
uk: Важко найпростіший спосіб встановити файл конфігурації Klipper за допомогою вбудованих редакторів в Mainsail або Fluidd. Це дозволить користувачеві відкрити приклади конфігурації і зберегти їх на принтері.cfg.

source: Another option is to use a desktop editor that supports editing files over the "scp" and/or "sftp" protocols. There are freely available tools that support this (eg, Notepad++, WinSCP, and Cyberduck). Load the printer config file in the editor and then save it as a file named "printer.cfg" in the home directory of the pi user (ie, /home/pi/printer.cfg).
ta: மற்றொரு விருப்பம் என்னவென்றால், "SCP" மற்றும்/அல்லது "SFTP" நெறிமுறைகளில் கோப்புகளைத் திருத்துவதை ஆதரிக்கும் டெச்க்டாப் எடிட்டரைப் பயன்படுத்துவது. இதை ஆதரிக்கும் இலவசமாக கிடைக்கக்கூடிய கருவிகள் உள்ளன (எ.கா., நோட்பேட் ++, வின்ச்கிபி மற்றும் சைபர்டக்). எடிட்டரில் அச்சுப்பொறி கட்டமைப்பு கோப்பை ஏற்றவும், பின்னர் அதை PI பயனரின் வீட்டு கோப்பகத்தில் (IE, /home/pi/printer.cfg) "அச்சுப்பொறி. CFG" என்ற கோப்பாக சேமிக்கவும்.
uk: Ще одним варіантом є використання настільного редактора, який підтримує редагування файлів за протоколами "шприц" та/або "шрифт". Доступні інструменти, які підтримують це (наприклад, Notepad++, WinSCP та Cyberduck). Завантажте файл конфігурації принтера в редакторі, а потім збережіть його як файл, названий "printer.cfg" в домашньому каталозі користувача pi (тобто /home/pi/printer.cfg).

source: Alternatively, one can also copy and edit the file directly on the host via ssh. That may look something like the following (be sure to update the command to use the appropriate printer config filename):
ta: மாற்றாக, ஒருவர் பாஓடு வழியாக ஓச்டில் நேரடியாக கோப்பை நகலெடுத்து திருத்தலாம். இது பின்வருவனவற்றைப் போலத் தோன்றலாம் (பொருத்தமான அச்சுப்பொறி கட்டமைப்பு கோப்பு பெயரைப் பயன்படுத்த கட்டளையைப் புதுப்பிக்க மறக்காதீர்கள்):
uk: Крім того, можна скопіювати і редагувати файл безпосередньо на сайті ssh. Що може виглядати щось схоже на наступне (обов'язково оновити команду, щоб використовувати відповідне ім'я конфігурації принтера):

source: After creating and editing the file it will be necessary to issue a "restart" command in the command console to load the config. A "status" command will report the printer is ready if the Klipper config file is successfully read and the micro-controller is successfully found and configured.
ta: கோப்பை உருவாக்கி திருத்திய பின் கட்டளை கன்சோலில் "மறுதொடக்கம்" கட்டளையை வழங்க வேண்டியது தேவை. கிளிப்பர் கட்டமைப்பு கோப்பு வெற்றிகரமாக வாசிக்கப்பட்டு மைக்ரோ-கன்ட்ரோலர் வெற்றிகரமாக கண்டுபிடிக்கப்பட்டு கட்டமைக்கப்பட்டால் அச்சுப்பொறி தயாராக இருப்பதாக ஒரு "நிலை" கட்டளை தெரிவிக்கும்.
uk: Після створення та редагування файлу потрібно буде випустити команду «решта» в консолі команди для завантаження конфігурації. Команда «статус» повідомить принтер готовим, якщо файл налаштування Klipper успішно читається, а мікроконтролер успішно знайдений і налаштований.

source: Klipper reports error messages via the command console and via pop up in Fluidd and Mainsail. The "status" command can be used to re-report error messages. A log is available and usually located in ~/printer_data/logs this is named klippy.log
ta: க்ளிப்பர் கட்டளை கன்சோல் வழியாகவும், ஃப்ளூயிட் மற்றும் மெயின்செயிலில் பாப் அப் வழியாகவும் பிழை செய்திகளைப் புகாரளிக்கிறது. பிழை செய்திகளை மீண்டும் பதிவு செய்ய "நிலை" கட்டளை பயன்படுத்தப்படலாம். ஒரு பதிவு கிடைக்கிறது மற்றும் வழக்கமாக ~/printur_data/பதிவுகளில் அமைந்துள்ளது இதற்கு klippy.log என்று பெயரிடப்பட்டுள்ளது
uk: Klipper повідомляє повідомлення про помилки через консолі команд і через додаток в Fluidd і Mainsail. Команда «статус» може використовуватися для повторних повідомлень про помилки. Журнал доступний і зазвичай знаходиться в ~/printer_data/logs це називається klippy. Увійти

source: These instructions assume the software will run on a Raspberry Pi computer in conjunction with OctoPrint. It is recommended that a Raspberry Pi 2, 3, or 4 computer be used as the host machine (see the [FAQ](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) for other machines).
pt_br: Estas instruções assumem que o software irá ser executado num computador Raspberry Pi em conjunto com OctoPrint. É recomendado que seja usado um Raspberry Pi 2, 3 ou 4 como host (verificar [FAQ](FAQ.md#posso-correr-klipper-sem-ser-num-Raspberry-Pi-3) para outras máquinas).

source: Prepping an OS image
pt_br: Preparando imagem do SO

source: After installing OctoPi and upgrading OctoPrint, it will be necessary to ssh into the target machine to run a handful of system commands. If using a Linux or MacOS desktop, then the "ssh" software should already be installed on the desktop. There are free ssh clients available for other desktops (eg, [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Use the ssh utility to connect to the Raspberry Pi (ssh pi@octopi -- password is "raspberry") and run the following commands:
pt_br: Depois de instalar o OctoPi e atualizar o OctoPrint, é necessário ligar-se à máquina usando ssh para executar alguns comandos de sistema. Usando um computador Linux ou MacOS, então o software para "ssh" já deverá estar instalado. Há alguns outros clientes ssh disponíveis para outros computadores (ex, [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Use a ferramenta ssh para se conectar ao Raspberry Pi (ssh pi@octopi --password is "raspberry") e corra os seguintes comandos:

source: The above will download Klipper, install some system dependencies, setup Klipper to run at system startup, and start the Klipper host software. It will require an internet connection and it may take a few minutes to complete.
pt_br: Acima fará o download do Klipper, instalará algumas dependências do sistema, configurará o Klipper para iniciar na inicialização do sistema e iniciará o software do Klipper. Será necessária uma conexão com a internet e pode levar alguns minutos pra ser concluído.

source: To compile the micro-controller code, start by running these commands on the Raspberry Pi:
pt_br: Para compilar o código do microcontrolador, comece executando estes comandos na Raspberry Pi:

source: It's common for each printer to have its own unique serial port name. This unique name will be used when flashing the micro-controller. It's possible there may be multiple lines in the above output - if so, choose the line corresponding to the micro-controller (see the [FAQ](FAQ.md#wheres-my-serial-port) for more information).
pt_br: É comum que cada impressora tenha seu próprio nome de porta serial exclusivo. Esse nome exclusivo será usado ao atualizar o microcontrolador. É possível que haja várias linhas no output acima - se houver, escolha a linha correspondente ao microcontrolador (veja o [FAQ](FAQ.md#wheres-my-serial-port) para mais informações).

source: For common micro-controllers, the code can be flashed with something similar to:
pt_br: Para microcontroladores comuns, o código pode ser atualizado com algo semelhante a:

source: When flashing for the first time, make sure that OctoPrint is not connected directly to the printer (from the OctoPrint web page, under the "Connection" section, click "Disconnect").
pt_br: Ao atualizar (realizar um flash) pela primeira vez, certifique-se de que o OctoPrint não está conectado diretamente à impressora (na página da web do OctoPrint, na seção "Conexão" ("Connection"), clique em "Desconectar" ("Disconnect")).

source: Configuring OctoPrint to use Klipper
pt_br: Configurando o OctoPrint com o Klipper

source: The OctoPrint web server needs to be configured to communicate with the Klipper host software. Using a web browser, login to the OctoPrint web page and then configure the following items:
pt_br: O servidor web OctoPrint precisa ser configurado para se comunicar com o Klipper. Usando um navegador, faça login na página do OctoPrint e então configure os seguintes itens:

source: Navigate to the Settings tab (the wrench icon at the top of the page). Under "Serial Connection" in "Additional serial ports" add "/tmp/printer". Then click "Save".
pt_br: Navegue até a aba Configurações. Em "Conexão serial" ("Serial Connection") em "Portas seriais adicionais" (""Additional serial ports""), adicione "/tmp/printer". Então clique em "Salvar" ("Save").

source: Enter the Settings tab again and under "Serial Connection" change the "Serial Port" setting to "/tmp/printer".
pt_br: Entre na aba Configurações novamente e em "Conexão serial" (Serial Connection), e altere a configuração de Porta serial para "/tmp/printer".

source: In the Settings tab, navigate to the "Behavior" sub-tab and select the "Cancel any ongoing prints but stay connected to the printer" option. Click "Save".
pt_br: Na aba de Configurações, navegue até "Comportamento" (Behavior) e selecione a opção "Cancelar quaisquer impressões em andamento, mas permanecer conectado à impressora" (Cancel any ongoing prints but stay connected to the printer). Depois, clique em salvar.

source: From the main page, under the "Connection" section (at the top left of the page) make sure the "Serial Port" is set to "/tmp/printer" and click "Connect". (If "/tmp/printer" is not an available selection then try reloading the page.)
pt_br: Na página principal, na seção "Conexão" (Connection) (no canto superior esquerdo da página), certifique-se de que a Porta serial esteja definida como "/tmp/printer" e clique em "Conectar" (Connect). (Se "/tmp/printer" não for uma opção disponível, tente recarregar a página.)

source: Once connected, navigate to the "Terminal" tab and type "status" (without the quotes) into the command entry box and click "Send". The terminal window will likely report there is an error opening the config file - that means OctoPrint is successfully communicating with Klipper. Proceed to the next section.
pt_br: Uma vez conectado, navegue até a aba "Terminal" e digite "status" (sem aspas) na caixa de entrada de comando e clique para enviar. A janela do terminal provavelmente informará que há um erro ao abrir o arquivo de configuração - isso significa que o OctoPrint está se comunicando com o Klipper. Prossiga para a próxima seção.

source: Klipper reports error messages via the OctoPrint terminal tab. The "status" command can be used to re-report error messages. The default Klipper startup script also places a log in **/tmp/klippy.log** which provides more detailed information.
pt_br: O Klipper relata mensagens de erro por meio do terminal do OctoPrint. O comando "status" pode ser usado para relatar mensagens de erro. O script de inicialização padrão do Klipper também coloca um log em **/tmp/klippy.log** que fornece mais informações.

source: Start by installing [OctoPi](https://github.com/guysoft/OctoPi) on the Raspberry Pi computer. Use OctoPi v0.17.0 or later - see the [OctoPi releases](https://github.com/guysoft/OctoPi/releases) for release information. One should verify that OctoPi boots and that the OctoPrint web server works. After connecting to the OctoPrint web page, follow the prompt to upgrade OctoPrint to v1.4.2 or later.
pt_br: Comece instalando o [OctoPi](https://github.com/guysoft/OctoPi) no Raspberry Pi. Use o OctoPi v0.17.0 ou posterior - veja [OctoPi releases](https://github.com/guysoft/OctoPi/releases) para obter informações sobre a versão. Verifique se o OctoPi inicia e se o servidor web do OctoPrint funciona. Após conectar-se à página do OctoPrint, siga o prompt para atualizar o OctoPrint para a v1.4.2 ou superior.

source: Most Klipper settings are determined by a "printer configuration file" that will be stored on the Raspberry Pi. An appropriate configuration file can often be found by looking in the Klipper [config directory](../config/) for a file starting with a "printer-" prefix that corresponds to the target printer. The Klipper configuration file contains technical information about the printer that will be needed during the installation.
pt_br: A maioria das configurações do Klipper são determinadas por um arquivo de configuração da impressora que será armazenado na Raspberry Pi. Um arquivo de configuração apropriado pode ser encontrado procurando no diretório [config](../config/) do Klipper por um arquivo que comece com um prefixo "printer-" que corresponda à impressora. O arquivo de configuração do Klipper contém informações sobre a impressora que serão necessárias durante a instalação.

source: The next step is to copy the [printer configuration file](#obtain-a-klipper-configuration-file) to the Raspberry Pi.
pt_br: O próximo passo é copiar o [printer configuration file](#obtain-a-klipper-configuration-file) para a Raspberry Pi.

source: Arguably the easiest way to set the Klipper configuration file is to use a desktop editor that supports editing files over the "scp" and/or "sftp" protocols. There are freely available tools that support this (eg, Notepad++, WinSCP, and Cyberduck). Load the printer config file in the editor and then save it as a file named "printer.cfg" in the home directory of the pi user (ie, /home/pi/printer.cfg).
pt_br: Provavelmente a maneira mais fácil de definir o arquivo de configuração do Klipper é usar um editor que suporte a edição de arquivos pelos protocolos "scp" e/ou "sftp". Existem ferramentas disponíveis gratuitamente que suportam isso (por exemplo, Notepad++, WinSCP e Cyberduck). Carregue o arquivo de configuração no editor e salve-o como um arquivo chamado "printer.cfg" no diretório home do usuário pi (ou seja, /home/pi/printer.cfg).

source: Alternatively, one can also copy and edit the file directly on the Raspberry Pi via ssh. That may look something like the following (be sure to update the command to use the appropriate printer config filename):
pt_br: Também é possível copiar e editar o arquivo diretamente no Raspberry Pi via SSH. Isso pode parecer algo como (certifique-se de atualizar o comando para usar o nome de arquivo de configuração apropriado):

source: After creating and editing the file it will be necessary to issue a "restart" command in the OctoPrint web terminal to load the config. A "status" command will report the printer is ready if the Klipper config file is successfully read and the micro-controller is successfully found and configured.
pt_br: Após criar e editar o arquivo, será necessário emitir um comando "restart" no terminal do OctoPrint para funcionar. Um comando "status" informará que a impressora está pronta se o arquivo de configuração do Klipper for lido com sucesso e o microcontrolador for encontrado e configurado.
