Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Manual_Level.po
Languages: bg, ta

source: The `DIRECTION` parameter is useful if you can turn your bed adjustment screws in one direction only. For example, you might have screws that start tightened in their lowest (or highest) possible position, which can only be turned in a single direction, to raise (or lower) the bed. If you can only turn the screws clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CW`. If you can only turn them counter-clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CCW`. A suitable reference point will be chosen such that the bed can be leveled by turning all the screws in the given direction.
bg: Параметърът `ДИРЕКЦИЯ` е полезен, ако можете да въртите винтовете за регулиране на леглото само в една посока. Например, може да имате винтове, които започват да се затягат в най-ниското (или най-високото) възможно положение, които могат да се въртят само в една посока, за да се повдигне (или спусне) леглото. Ако можете да завъртите винтовете само по посока на часовниковата стрелка, изпълнете `SCREWS_TILT_CALCULATE DIRECTION=CW`. Ако можете да ги въртите само в посока, обратна на часовниковата стрелка, стартирайте `SCREWS_TILT_CALCULATE DIRECTION=CCW`. Ще бъде избрана подходяща референтна точка, така че леглото да може да бъде изравнено чрез завъртане на всички винтове в дадената посока.
ta: உங்கள் படுக்கை சரிசெய்தல் திருகுகளை ஒரு திசையில் மட்டுமே திருப்ப முடிந்தால் `திசை` அளவுரு பயனுள்ளதாக இருக்கும். எடுத்துக்காட்டாக, படுக்கையை உயர்த்த (அல்லது கீழ்) ஒரு திசையில் மட்டுமே திருப்ப முடியும், அவற்றின் மிகக் குறைந்த (அல்லது மிக உயர்ந்த) சாத்தியமான நிலையில் இறுக்கத் தொடங்கும் திருகுகள் உங்களிடம் இருக்கலாம். நீங்கள் திருகுகளை மட்டுமே கடிகார திசையில் திருப்ப முடிந்தால், `திருகுகள்_பில்ட்_கல்குலேட் திசை = சி.டபிள்யூ. நீங்கள் அவற்றை எதிர்-கடிகார திசையில் மட்டுமே திருப்ப முடிந்தால், `திருகு_பில்ட்_காலிகுலேட் திசை = ccw` ஐ இயக்கவும். கொடுக்கப்பட்ட திசையில் அனைத்து திருகுகளையும் திருப்புவதன் மூலம் படுக்கையை சமன் செய்யக்கூடிய பொருத்தமான குறிப்பு புள்ளி தேர்வு செய்யப்படும்.

source: Manual leveling
bg: Ръчно нивелиране
ta: கையேடு சமநிலை

source: front left screw is the reference point you must not change it.
bg: предният ляв винт е референтната точка, която не трябва да променяте.
ta: முன் இடது திருகு என்பது நீங்கள் அதை மாற்றக்கூடாது.

source: front right screw must be turned clockwise 1 full turn and a quarter turn
bg: предният десен винт трябва да се завърти по посока на часовниковата стрелка с 1 пълен оборот и една четвърт оборот
ta: முன் வலது திருகு கடிகார திசையில் 1 முழு திருப்பம் மற்றும் கால் திருப்பமாக மாற வேண்டும்

source: rear right screw must be turned counter-clockwise 50 minutes
bg: задният десен винт трябва да се завърти обратно на часовниковата стрелка 50 минути
ta: பின்புற வலது திருகு எதிர்-கடிகார திசையில் 50 நிமிடங்கள் மாற்றப்பட வேண்டும்

source: rear left screw must be turned clockwise 2 minutes (not need it's ok)
bg: задният ляв винт трябва да се завърти по посока на часовниковата стрелка за 2 минути (не е необходимо, всичко е наред)
ta: பின்புற இடது திருகு கடிகார திசையில் 2 நிமிடங்கள் மாற்றப்பட வேண்டும் (தேவையில்லை அது சரி)

source: Note that "minutes" refers to "minutes of a clock face". So, for example, 15 minutes is a quarter of a full turn.
bg: Обърнете внимание, че "минути" се отнася за "минути от циферблата на часовника". Така например 15 минути са една четвърт от цял оборот.
ta: "நிமிடங்கள்" என்பது "ஒரு கடிகார முகத்தின் நிமிடங்கள்" என்பதைக் குறிக்கிறது என்பதை நினைவில் கொள்க. எனவே, எடுத்துக்காட்டாக, 15 நிமிடங்கள் முழு திருப்பத்தின் கால்.
