Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Manual_Level.po
Languages: bg, ta

source: This document describes tools for calibrating a Z endstop and for performing adjustments to bed leveling screws.
bg: Този документ описва инструменти за калибриране на Z-краен ограничител и за извършване на настройки на винтовете за нивелиране на леглото.
ta: இந்த ஆவணம் ஒரு சட் எண்ட்ச்டாப்பை அளவீடு செய்வதற்கான கருவிகளை விவரிக்கிறது மற்றும் படுக்கை சமப்படுத்தும் திருகுகளுக்கு மாற்றங்களைச் செய்வதற்கானது.

source: Calibrating a Z endstop
bg: Калибриране на краен ограничител Z
ta: ஒரு சட் எண்ட்ச்டாப்பை அளவீடு செய்கிறது

source: An accurate Z endstop position is critical to obtaining high quality prints.
bg: Точната позиция на крайния ограничител Z е от решаващо значение за получаването на висококачествени разпечатки.
ta: உயர்தர அச்சிட்டுகளைப் பெறுவதற்கு ஒரு துல்லியமான சட் எண்ட்ச்டாப் நிலை முக்கியமானது.

source: Note, though, the accuracy of the Z endstop switch itself can be a limiting factor. If one is using Trinamic stepper motor drivers then consider enabling [endstop phase](Endstop_Phase.md) detection to improve the accuracy of the switch.
bg: Имайте предвид обаче, че точността на самия превключвател на Z-крайника може да бъде ограничаващ фактор. Ако използвате драйвери за стъпкови двигатели Trinamic, помислете дали да не включите откриването на [endstop phase](Endstop_Phase.md), за да подобрите точността на превключвателя.
ta: குறிப்பு, இருப்பினும், சட் எண்ட்ச்டாப் சுவிட்சின் துல்லியம் ஒரு கட்டுப்படுத்தும் காரணியாக இருக்கலாம். ஒருவர் டிரினாமிக் ச்டெப்பர் மின்னோடி டிரைவர்களைப் பயன்படுத்துகிறார் என்றால், சுவிட்சின் துல்லியத்தை மேம்படுத்த [எண்ட்ச்டாப் கட்டம்] (EndStop_phase.md) கண்டறிதலை இயக்குவதைக் கவனியுங்கள்.

source: To perform a Z endstop calibration, home the printer, command the head to move to a Z position that is at least five millimeters above the bed (if it is not already), command the head to move to an XY position near the center of the bed, then navigate to the OctoPrint terminal tab and run:
bg: За да извършите калибриране на крайната точка Z, включете принтера в изходно положение, заповядайте на главата да се премести в позиция Z, която е поне пет милиметра над леглото (ако вече не е), заповядайте на главата да се премести в позиция XY близо до центъра на леглото, след което преминете към раздела на терминала OctoPrint и стартирайте:
ta: ஒரு சட் எண்ட்ச்டாப் அளவுத்திருத்தத்தைச் செய்ய, அச்சுப்பொறியை வீட்டிற்கு கொண்டு, படுக்கைக்கு மேலே குறைந்தது ஐந்து மில்லிமீட்டர் கொண்ட ஒரு சட் நிலைக்கு செல்ல தலையை கட்டளையிடவும் (அது ஏற்கனவே இல்லையென்றால்), மையத்திற்கு அருகிலுள்ள ஒரு XY நிலைக்கு செல்ல தலையை கட்டளையிடவும் படுக்கை, பின்னர் ஆக்டோப்ரிண்ட் டெர்மினல் தாவலுக்குச் சென்று இயக்கவும்:

source: Then follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position and save the results to the config file with:
bg: След това следвайте стъпките, описани в ["the paper test"](Bed_Level.md#the-paper-test), за да определите действителното разстояние между дюзата и леглото на даденото място. След като тези стъпки бъдат завършени, можете да `АКТУАЛИЗИРАТЕ` позицията и да запишете резултатите в конфигурационния файл с:
ta: கொடுக்கப்பட்ட இடத்தில் முனை மற்றும் படுக்கைக்கு இடையிலான உண்மையான தூரத்தை தீர்மானிக்க ["காகித சோதனை"] (Bed_level.md#the-paper-test) இல் விவரிக்கப்பட்டுள்ள படிகளைப் பின்பற்றவும். அந்த படிகள் முடிந்ததும், நிலையை `ஏற்றுக்கொள்ளலாம் 'மற்றும் முடிவுகளை கட்டமைப்பு கோப்பில் சேமிக்க முடியும்:

source: It's preferable to use a Z endstop switch on the opposite end of the Z axis from the bed. (Homing away from the bed is more robust as then it is generally always safe to home the Z.) However, if one must home towards the bed it is recommended to adjust the endstop so that it triggers a small distance (eg, .5mm) above the bed. Almost all endstop switches can safely be depressed a small distance beyond their trigger point. When this is done, one should find that the `Z_ENDSTOP_CALIBRATE` command reports a small positive value (eg, .5mm) for the Z position_endstop. Triggering the endstop while it is still some distance from the bed reduces the risk of inadvertent bed crashes.
bg: За предпочитане е да се използва превключвател за спиране на Z в противоположния край на оста Z от леглото. (Отдалечаването от леглото е по-сигурно, тъй като тогава обикновено винаги е безопасно да се постави Z.) Ако обаче трябва да се насочи към леглото, се препоръчва крайният ограничител да се регулира така, че да се задейства на малко разстояние (например 0,5 mm) над леглото. Почти всички крайни ограничители могат безопасно да бъдат натиснати на малко разстояние извън точката на задействане. Когато това се направи, командата `Z_ENDSTOP_CALIBRATE` трябва да отчете малка положителна стойност (напр. .5 mm) за Z позиция_endstop. Задействането на крайния ограничител, докато той все още е на известно разстояние от леглото, намалява риска от непреднамерено падане на леглото.
ta: படுக்கையிலிருந்து சட் அச்சின் எதிர் முனையில் ஒரு சட் எண்ட்ச்டாப் சுவிட்சைப் பயன்படுத்துவது விரும்பத்தக்கது. . ) படுக்கைக்கு மேலே. ஏறக்குறைய அனைத்து எண்ட்ச்டாப் சுவிட்சுகளும் அவற்றின் தூண்டுதல் புள்ளியைத் தாண்டி ஒரு சிறிய தூரத்தை பாதுகாப்பாக மனச்சோர்வடையச் செய்யலாம். இது முடிந்ததும், `z_endstop_calibrate` கட்டளை சட் patenty_endstop க்கு ஒரு சிறிய நேர்மறை மதிப்பை (எ.கா., .5 மிமீ) தெரிவிக்கிறது என்பதை ஒருவர் கண்டுபிடிக்க வேண்டும். படுக்கையிலிருந்து சிறிது தூரம் இருக்கும்போது எண்ட்ச்டாப்பைத் தூண்டுவது கவனக்குறைவான படுக்கை செயலிழப்பின் அபாயத்தைக் குறைக்கிறது.

source: Some printers have the ability to manually adjust the location of the physical endstop switch. However, it's recommended to perform Z endstop positioning in software with Klipper - once the physical location of the endstop is in a convenient location, one can make any further adjustments by running Z_ENDSTOP_CALIBRATE or by manually updating the Z position_endstop in the configuration file.
bg: Някои принтери имат възможност за ръчно регулиране на местоположението на физическия ограничител. Въпреки това се препоръчва Z-позиционирането на крайния ограничител да се извършва софтуерно с Klipper - след като физическото местоположение на крайния ограничител е на удобно място, могат да се правят допълнителни корекции чрез стартиране на Z_ENDSTOP_CALIBRATE или чрез ръчно актуализиране на Z position_endstop в конфигурационния файл.
ta: சில அச்சுப்பொறிகள் இயற்பியல் எண்ட்ச்டாப் சுவிட்சின் இருப்பிடத்தை கைமுறையாக சரிசெய்யும் திறனைக் கொண்டுள்ளன. இருப்பினும், கிளிப்பருடன் மென்பொருளில் சட் எண்ட்ச்டாப் பொருத்துதலைச் செய்ய பரிந்துரைக்கப்படுகிறது - எண்ட்ச்டாப்பின் இயற்பியல் இருப்பிடம் வசதியான இடத்தில் இருந்தவுடன், Z_EndStop_Calibrate ஐ இயக்குவதன் மூலமோ அல்லது உள்ளமைவு கோப்பில் சட் pasition_endstop ஐ கைமுறையாக புதுப்பிப்பதன் மூலமோ மேலும் மாற்றங்களைச் செய்யலாம்.

source: Adjusting bed leveling screws
bg: Регулиране на винтовете за изравняване на леглото
ta: படுக்கை சமப்படுத்தும் திருகுகளை சரிசெய்தல்

source: The secret to getting good bed leveling with bed leveling screws is to utilize the printer's high precision motion system during the bed leveling process itself. This is done by commanding the nozzle to a position near each bed screw and then adjusting that screw until the bed is a set distance from the nozzle. Klipper has a tool to assist with this. In order to use the tool it is necessary to specify each screw XY location.
bg: Тайната на доброто нивелиране на леглото с помощта на винтове за нивелиране на леглото е да се използва високопрецизната система за движение на принтера по време на самия процес на нивелиране на леглото. Това се прави, като дюзата се командва в позиция близо до всеки винт на леглото и след това се регулира този винт, докато леглото се намира на определено разстояние от дюзата. Klipper разполага с инструмент, който помага за това. За да се използва инструментът, е необходимо да се посочи местоположението на всеки винт XY.
ta: படுக்கை சமப்படுத்தும் திருகுகளுடன் நல்ல படுக்கை சமநிலையைப் பெறுவதற்கான மறைபொருள், படுக்கை சமன் செய்யும் போது அச்சுப்பொறியின் உயர் துல்லியமான இயக்க அமைப்பைப் பயன்படுத்துவதாகும். ஒவ்வொரு படுக்கை திருகுக்கு அருகிலுள்ள ஒரு நிலைக்கு முனை கட்டளையிடுவதன் மூலமும், படுக்கை முனையிலிருந்து ஒரு குறிப்பிட்ட தூரமாக இருக்கும் வரை அந்த திருகு சரிசெய்வதன் மூலமும் இது செய்யப்படுகிறது. இதற்கு உதவ கிளிப்பருக்கு ஒரு கருவி உள்ளது. கருவியைப் பயன்படுத்த ஒவ்வொரு திருகு xy இருப்பிடத்தையும் குறிப்பிட வேண்டியது தேவை.

source: This is done by creating a `[bed_screws]` config section. For example, it might look something similar to:
bg: Това става чрез създаване на раздел от конфигурацията `[bed_screws]`. Например, тя може да изглежда по следния начин:
ta: `[BED_SCREWS]` கட்டமைப்பு பிரிவை உருவாக்குவதன் மூலம் இது செய்யப்படுகிறது. எடுத்துக்காட்டாக, இது ஒத்த ஒன்றாகத் தோன்றலாம்:

source: If a bed screw is under the bed, then specify the XY position directly above the screw. If the screw is outside the bed then specify an XY position closest to the screw that is still within the range of the bed.
bg: Ако винтът на леглото се намира под леглото, посочете позицията XY точно над винта. Ако винтът е извън леглото, посочете най-близката до него позиция XY, която все още е в обхвата на леглото.
ta: ஒரு படுக்கை திருகு படுக்கைக்கு அடியில் இருந்தால், XY நிலையை திருகுக்கு மேலே நேரடியாகக் குறிப்பிடவும். திருகு படுக்கைக்கு வெளியே இருந்தால், படுக்கையின் வரம்பிற்குள் இருக்கும் திருகுக்கு மிக நெருக்கமான ஒரு XY நிலையை குறிப்பிடவும்.

source: Once the config file is ready, run `RESTART` to load that config, and then one can start the tool by running:
bg: След като файлът с конфигурацията е готов, изпълнете `RESTART`, за да заредите тази конфигурация, и след това можете да стартирате инструмента, като изпълните:
ta: கட்டமைப்பு கோப்பு தயாரானதும், அந்த கட்டமைப்பை ஏற்ற `மறுதொடக்கம்` ஐ இயக்கவும், பின்னர் இயங்குவதன் மூலம் கருவியைத் தொடங்கலாம்:

source: This tool will move the printer's nozzle to each screw XY location and then move the nozzle to a Z=0 height. At this point one can use the "paper test" to adjust the bed screw directly under the nozzle. See the information described in ["the paper test"](Bed_Level.md#the-paper-test), but adjust the bed screw instead of commanding the nozzle to different heights. Adjust the bed screw until there is a small amount of friction when pushing the paper back and forth.
bg: Този инструмент ще премести дюзата на принтера до всяко място на винта XY и след това ще премести дюзата на височина Z=0. В този момент можете да използвате "теста с хартия", за да регулирате винта на леглото директно под дюзата. Вижте информацията, описана в ["the paper test"](Bed_Level.md#the-paper-test), но регулирайте винта на леглото, вместо да командвате дюзата на различни височини. Регулирайте винта на леглото, докато има малко триене при избутване на хартията напред и назад.
ta: இந்த கருவி அச்சுப்பொறியின் முனை ஒவ்வொரு திருகு XY இருப்பிடத்திற்கும் நகர்ந்து பின்னர் முனை ஒரு சட் = 0 உயரத்திற்கு நகர்த்தும். இந்த கட்டத்தில் ஒருவர் "காகித சோதனையை" பயன்படுத்தலாம். ["காகித சோதனை"] (bed_level.md#the-paper-test) இல் விவரிக்கப்பட்டுள்ள தகவல்களைக் காண்க, ஆனால் முனை வெவ்வேறு உயரங்களுக்கு கட்டளையிடுவதற்கு பதிலாக படுக்கை திருகு சரிசெய்யவும். காகிதத்தை முன்னும் பின்னுமாக தள்ளும்போது ஒரு சிறிய அளவு உராய்வு இருக்கும் வரை படுக்கை திருகு சரிசெய்யவும்.

source: Once the screw is adjusted so that a small amount of friction is felt, run either the `ACCEPT` or `ADJUSTED` command. Use the `ADJUSTED` command if the bed screw needed an adjustment (typically anything more than about 1/8th of a turn of the screw). Use the `ACCEPT` command if no significant adjustment is necessary. Both commands will cause the tool to proceed to the next screw. (When an `ADJUSTED` command is used, the tool will schedule an additional cycle of bed screw adjustments; the tool completes successfully when all bed screws are verified to not require any significant adjustments.) One can use the `ABORT` command to exit the tool early.
bg: След като винтът се регулира така, че да се усеща малко триене, изпълнете командата `ACCEPT` или `ADJUSTED`. Използвайте командата `ADJUSTED`, ако винтът на леглото е трябвало да се регулира (обикновено нещо повече от около 1/8 оборот на винта). Използвайте командата `ACCEPT`, ако не е необходима значителна настройка. И двете команди ще накарат инструмента да премине към следващия винт. (Когато се използва командата `ADJUSTED`, инструментът ще планира допълнителен цикъл на регулиране на винта на леглото; инструментът завършва успешно, когато се провери, че всички винтове на леглото не се нуждаят от значителни настройки.) Може да се използва командата `ABORT` за ранно прекратяване на инструмента.
ta: திருகு சரிசெய்யப்பட்டவுடன், ஒரு சிறிய அளவு உராய்வு உணரப்படும் வகையில், `ஏற்றுக்கொள் அல்லது` சரிசெய்யப்பட்ட` கட்டளையை இயக்கவும். படுக்கை திருகுக்கு ஒரு சரிசெய்தல் தேவைப்பட்டால் `சரிசெய்யப்பட்ட` கட்டளையைப் பயன்படுத்தவும் (பொதுவாக திருகு திருப்பத்தின் 1/8 வது இடத்திற்கு மேல்). குறிப்பிடத்தக்க சரிசெய்தல் தேவையில்லை என்றால் `ஏற்றுக்கொள் 'கட்டளையைப் பயன்படுத்தவும். இரண்டு கட்டளைகளும் கருவி அடுத்த திருகுக்குச் செல்ல வழிவகுக்கும். . கருவி ஆரம்பத்தில்.

source: This system works best when the printer has a flat printing surface (such as glass) and has straight rails. Upon successful completion of the bed leveling tool the bed should be ready for printing.
bg: Тази система работи най-добре, когато принтерът е с плоска печатна повърхност (например стъкло) и има прави релси. След успешното завършване на работата с инструмента за изравняване на леглото леглото трябва да е готово за печат.
ta: அச்சுப்பொறி ஒரு தட்டையான அச்சிடும் மேற்பரப்பு (கண்ணாடி போன்றவை) மற்றும் நேராக தண்டவாளங்களைக் கொண்டிருக்கும்போது இந்த அமைப்பு சிறப்பாக செயல்படுகிறது. படுக்கை சமப்படுத்தும் கருவி வெற்றிகரமாக முடிந்ததும் படுக்கை அச்சிட தயாராக இருக்க வேண்டும்.

source: Fine grained bed screw adjustments
bg: Фини настройки на винта на леглото
ta: நன்றாக தானிய படுக்கை திருகு சரிசெய்தல்

source: If the printer uses three bed screws and all three screws are under the bed, then it may be possible to perform a second "high precision" bed leveling step. This is done by commanding the nozzle to locations where the bed moves a larger distance with each bed screw adjustment.
bg: Ако принтерът използва три винта за леглото и и трите винта са под леглото, може да е възможно да се извърши втора стъпка за "високопрецизно" изравняване на леглото. Това се извършва чрез подаване на команда към дюзата на места, където леглото се премества на по-голямо разстояние при всяко регулиране на винта на леглото.
ta: அச்சுப்பொறி மூன்று படுக்கை திருகுகளைப் பயன்படுத்தினால், மூன்று திருகுகளும் படுக்கைக்கு அடியில் இருந்தால், இரண்டாவது "உயர் துல்லியமான" படுக்கை சமன் படி செய்ய முடியும். ஒவ்வொரு படுக்கை திருகு சரிசெய்தலுடனும் படுக்கை ஒரு பெரிய தூரத்தை நகர்த்தும் இடங்களுக்கு முனை கட்டளையிடுவதன் மூலம் இது செய்யப்படுகிறது.

source: For example, consider a bed with screws at locations A, B, and C:
bg: Например, разгледайте легло с винтове на местата A, B и C:
ta: எடுத்துக்காட்டாக, A, B மற்றும் C இடங்களில் திருகுகள் கொண்ட ஒரு படுக்கையை கவனியுங்கள்:

source: For each adjustment made to the bed screw at location C, the bed will swing along a pendulum defined by the remaining two bed screws (shown here as a green line). In this situation, each adjustment to the bed screw at C will move the bed at position D a further amount than directly at C. It is thus possible to make an improved C screw adjustment when the nozzle is at position D.
bg: При всяко регулиране на винта на леглото в точка С леглото се люлее по махалото, определено от останалите два винта на леглото (показани тук със зелена линия). При това положение всяка настройка на винта на леглото в положение C ще премести леглото в положение D с по-голямо количество, отколкото директно в положение C. По този начин е възможно да се направи подобрена настройка на винта C, когато дюзата е в положение D.
ta: சி இருப்பிடத்தில் உள்ள படுக்கை திருகுக்கு செய்யப்பட்ட ஒவ்வொரு சரிசெய்தலுக்கும், மீதமுள்ள இரண்டு படுக்கை திருகுகளால் வரையறுக்கப்பட்ட ஒரு ஊசல் வழியாக படுக்கை ஊசலாடும் (இங்கே ஒரு பச்சை கோட்டாக காட்டப்பட்டுள்ளது). இந்த சூழ்நிலையில், சி இல் உள்ள படுக்கை திருகுக்கு ஒவ்வொரு சரிசெய்தலும் சி -ஐ விட நேரடியாக டி நிலையில் படுக்கையை நகர்த்தும். சி.

source: To enable this feature, one would determine the additional nozzle coordinates and add them to the config file. For example, it might look like:
bg: За да активирате тази функция, трябва да определите координатите на допълнителните дюзи и да ги добавите в конфигурационния файл. Например, той може да изглежда така:
ta: இந்த அம்சத்தை இயக்க, ஒருவர் கூடுதல் முனை ஆயங்களை தீர்மானித்து அவற்றை உள்ளமைவு கோப்பில் சேர்ப்பார். உதாரணமாக, இது போல் தோன்றலாம்:

source: When this feature is enabled, the `BED_SCREWS_ADJUST` tool will first prompt for coarse adjustments directly above each screw position, and once those are accepted, it will prompt for fine adjustments at the additional locations. Continue to use `ACCEPT` and `ADJUSTED` at each position.
bg: Когато тази функция е активирана, инструментът `BED_SCREWS_ADJUST` първо ще поиска груби настройки непосредствено над всяка позиция на винта и след като те бъдат приети, ще поиска фини настройки на допълнителните места. Продължавайте да използвате `ACCEPT` и `ADJUSTED` на всяка позиция.
ta: இந்த நற்பொருத்தம் இயக்கப்பட்டால், `bed_screws_adjust` கருவி முதலில் ஒவ்வொரு திருகு நிலைக்கும் மேலே கரடுமுரடான மாற்றங்களுக்கு கேட்கப்படும், மேலும் அவை ஏற்றுக்கொள்ளப்பட்டவுடன், கூடுதல் இடங்களில் சிறந்த மாற்றங்களுக்கு இது கேட்கப்படும். ஒவ்வொரு நிலையிலும் `ஏற்றுக்கொள்` மற்றும்` சரிசெய்யப்பட்ட 'தொடர்ந்து பயன்படுத்தவும்.

source: Adjusting bed leveling screws using the bed probe
bg: Регулиране на винтовете за нивелиране на леглото с помощта на сондата на леглото
ta: படுக்கை ஆய்வைப் பயன்படுத்தி படுக்கை சமப்படுத்தும் திருகுகளை சரிசெய்தல்

source: This is another way to calibrate the bed level using the bed probe. To use it you must have a Z probe (BL Touch, Inductive sensor, etc).
bg: Това е друг начин за калибриране на нивото на леглото с помощта на сондата на леглото. За да го използвате, трябва да имате Z-сонда (BL Touch, индуктивен сензор и др.).
ta: படுக்கை ஆய்வைப் பயன்படுத்தி படுக்கை அளவை அளவீடு செய்வதற்கான மற்றொரு வழி இது. இதைப் பயன்படுத்த நீங்கள் ஒரு சட் ஆய்வு (BL தொடுதல், தூண்டல் சென்சார் போன்றவை) இருக்க வேண்டும்.

source: To enable this feature, one would determine the nozzle coordinates such that the Z probe is above the screws, and then add them to the config file. For example, it might look like:
bg: За да активирате тази функция, трябва да определите координатите на дюзата така, че Z-сондата да е над винтовете, и след това да ги добавите в конфигурационния файл. Например, той може да изглежда така:
ta: இந்த அம்சத்தை இயக்க, சட் ஆய்வு திருகுகளுக்கு மேலே உள்ள முனை ஆயங்களை ஒருவர் தீர்மானிப்பார், பின்னர் அவற்றை கட்டமைப்பு கோப்பில் சேர்க்கவும். உதாரணமாக, இது போல் தோன்றலாம்:

source: This means that:
bg: Това означава, че:
ta: இதன் பொருள்:

source: Repeat the process several times until you get a good level bed - normally when all adjustments are below 6 minutes.
bg: Повторете процеса няколко пъти, докато постигнете добро ниво на леглото - обикновено когато всички настройки са под 6 минути.
ta: நீங்கள் ஒரு நல்ல நிலை படுக்கையைப் பெறும் வரை செயல்முறையை பல முறை மீண்டும் செய்யவும் - பொதுவாக அனைத்து மாற்றங்களும் 6 நிமிடங்களுக்கு கீழே இருக்கும்போது.

source: If using a probe that is mounted on the side of the hotend (that is, it has an X or Y offset) then note that adjusting the bed tilt will invalidate any previous probe calibration that was performed with a tilted bed. Be sure to run [probe calibration](Probe_Calibrate.md) after the bed screws have been adjusted.
bg: Ако използвате сонда, която е монтирана отстрани на нагревателя (т.е. има изместване по X или Y), имайте предвид, че регулирането на наклона на леглото ще анулира всяко предишно калибриране на сондата, което е било извършено при наклонено легло. Не забравяйте да стартирате [калибриране на сонда](Probe_Calibrate.md), след като винтовете на леглото са били регулирани.
ta: ஒட்டெண்டின் பக்கத்தில் பொருத்தப்பட்ட ஒரு ஆய்வைப் பயன்படுத்தினால் (அதாவது, இது ஒரு ஃச் அல்லது ஒய் ஆஃப்செட்டைக் கொண்டுள்ளது) பின்னர் படுக்கை சாய்வை சரிசெய்வது சாய்ந்த படுக்கையுடன் நிகழ்த்தப்பட்ட முந்தைய ஆய்வு அளவுத்திருத்தத்தை செல்லாது என்பதை நினைவில் கொள்க. படுக்கை திருகுகள் சரிசெய்யப்பட்ட பிறகு [ஆய்வு அளவுத்திருத்தத்தை] (probe_calibrate.md) இயக்க மறக்காதீர்கள்.

source: The `MAX_DEVIATION` parameter is useful when a saved bed mesh is used, to ensure that the bed level has not drifted too far from where it was when the mesh was created. For example, `SCREWS_TILT_CALCULATE MAX_DEVIATION=0.01` can be added to the custom start gcode of the slicer before the mesh is loaded. It will abort the print if the configured limit is exceeded (0.01mm in this example), giving the user a chance to adjust the screws and restart the print.
bg: Параметърът `MAX_DEVIATION` е полезен, когато се използва запазена мрежа на леглото, за да се гарантира, че нивото на леглото не се е отклонило твърде много от това, което е било при създаването на мрежата. Например параметърът `SCREWS_TILT_CALCULATE MAX_DEVIATION=0,01` може да бъде добавен към потребителския стартов gcode на слайсера, преди да бъде заредена мрежата. Той ще прекъсне печатането, ако конфигурираната граница бъде надхвърлена (0,01 mm в този пример), като даде възможност на потребителя да регулира винтовете и да рестартира печатането.
ta: சேமிக்கப்பட்ட படுக்கை கண்ணி பயன்படுத்தப்படும்போது `MAX_DEVIATION` அளவுரு பயனுள்ளதாக இருக்கும், படுக்கை நிலை கண்ணி உருவாக்கப்பட்டபோது இருந்த இடத்திலிருந்து வெகு தொலைவில் இல்லை என்பதை உறுதிப்படுத்த. எடுத்துக்காட்டாக, கண்ணி ஏற்றப்படுவதற்கு முன்பு ச்லைசரின் தனிப்பயன் தொடக்க GCODE இல் `திருகு_பில்ட்_கால்குலேட் max_deviation = 0.01` சேர்க்கலாம். கட்டமைக்கப்பட்ட வரம்பு மீறினால் (இந்த எடுத்துக்காட்டில் 0.01 மிமீ) இது அச்சிடலை நிறுத்திவிடும், இது பயனருக்கு திருகுகளை சரிசெய்து அச்சிடுவதை மறுதொடக்கம் செய்ய வாய்ப்பளிக்கிறது.

source: The screw1 is always the reference point for the others, so the system assumes that screw1 is at the correct height. Always run `G28` first and then run `SCREWS_TILT_CALCULATE` - it should produce output similar to:
bg: Винт1 винаги е референтна точка за останалите, така че системата приема, че винт1 е на правилната височина. Винаги първо стартирайте `G28` и след това стартирайте `SCREWS_TILT_CALCULATE` - трябва да се получи резултат, подобен на:
ta: ச்க்ரூ 1 எப்போதும் மற்றவர்களுக்கான குறிப்பு புள்ளியாகும், எனவே ச்க்ரூ 1 சரியான உயரத்தில் இருப்பதாக கணினி கருதுகிறது. முதலில் `சி 28` ஐ இயக்கவும், பின்னர்` ச்க்ரூச்_பில்ட்_கால்குலேட்` ஐ இயக்கவும் - இது ஒத்த வெளியீட்டை உருவாக்க வேண்டும்:
