Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: ta

source: The data can be processed later by the following scripts: `scripts/graph_accelerometer.py` and `scripts/calibrate_shaper.py`. Both of them accept one or several raw csv files as the input depending on the mode. The graph_accelerometer.py script supports several modes of operation:
ta: பின்வரும் ச்கிரிப்ட்களால் தரவை பின்னர் செயலாக்க முடியும்: `ச்கிரிப்ட்கள்/வரைபடம்_சிலெரோமீட்டர்.பை` மற்றும்` ச்கிரிப்டுகள்/அளவீடு_சேப்பர்.பை`. அவை இரண்டும் ஒன்று அல்லது பல மூல சி.எச்.வி கோப்புகளை பயன்முறையைப் பொறுத்து உள்ளீடாக ஏற்றுக்கொள்கின்றன. வரைபடம்_சிலெரோமீட்டர்.பி ச்கிரிப்ட் பல செயல்பாட்டு முறைகளை ஆதரிக்கிறது:

source: plotting raw accelerometer data (use `-r` parameter), only 1 input is supported;
ta: மூல முடுக்கமானி தரவைத் திட்டமிடுவது (`-r` அளவுருவைப் பயன்படுத்தவும்), 1 உள்ளீடு மட்டுமே ஆதரிக்கப்படுகிறது;

source: plotting a frequency response (no extra parameters required), if multiple inputs are specified, the average frequency response is computed;
ta: அதிர்வெண் பதிலைத் திட்டமிடுவது (கூடுதல் அளவுருக்கள் தேவையில்லை), பல உள்ளீடுகள் குறிப்பிடப்பட்டால், சராசரி அதிர்வெண் பதில் கணக்கிடப்படுகிறது;

source: comparison of the frequency response between several inputs (use `-c` parameter); you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used);
ta: பல உள்ளீடுகளுக்கு இடையிலான அதிர்வெண் பதிலின் ஒப்பீடு (`-c` அளவுருவைப் பயன்படுத்தவும்); `-a x`,` -a y` அல்லது `-a Z` அளவுரு வழியாக எந்த முடுக்கமானி அச்சு கருத்தில் கொள்ள வேண்டும் என்பதை நீங்கள் கூடுதலாக குறிப்பிடலாம் (எதுவும் குறிப்பிடப்படவில்லை என்றால், எல்லா அச்சுகளுக்கும் அதிர்வுகளின் தொகை பயன்படுத்தப்படுகிறது);

source: plotting the spectrogram (use `-s` parameter), only 1 input is supported; you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used).
ta: ச்பெக்ட்ரோகிராம் சூழ்ச்சி (`-s` அளவுருவைப் பயன்படுத்தவும்), 1 உள்ளீடு மட்டுமே ஆதரிக்கப்படுகிறது; `-a x`,` -a y` அல்லது `-a Z` அளவுரு வழியாக எந்த முடுக்கமானி அச்சு கருத்தில் கொள்ள வேண்டும் என்பதை நீங்கள் கூடுதலாக குறிப்பிடலாம் (எதுவும் குறிப்பிடப்படவில்லை என்றால், எல்லா அச்சுகளுக்கும் அதிர்வுகளின் தொகை பயன்படுத்தப்படுகிறது).

source: Note that graph_accelerometer.py script supports only the raw_data\*.csv files and not resonances\*.csv or calibration_data\*.csv files.
ta: Raw_data \*ஐ மட்டுமே ஆதரிக்கிறது என்பதை நினைவில் கொள்க. காபிம கோப்புகளை மட்டுமே ஆதரிக்கிறது என்பதை நினைவில் கொள்க.

source: For example,
ta: உதாரணமாக,

source: will plot the comparison of several `/tmp/raw_data_x_*.csv` files for Z axis to `/tmp/resonances_x.png` file.
ta: பல `/tmp/raw_data_x _*ஐ ஒப்பிட்டுப் பார்க்கும். சட் அச்சுக்கான CSV` கோப்புகள்`/tmp/ronnances_x.png` கோப்புக்கு.

source: The shaper_calibrate.py script accepts 1 or several inputs and can run automatic tuning of the input shaper and suggest the best parameters that work well for all provided inputs. It prints the suggested parameters to the console, and can additionally generate the chart if `-o output.png` parameter is provided, or the CSV file if `-c output.csv` parameter is specified.
ta: Shaper_calibrate.py ச்கிரிப்ட் 1 அல்லது பல உள்ளீடுகளை ஏற்றுக்கொள்கிறது மற்றும் உள்ளீட்டு சேப்பரின் தானியங்கி ட்யூனிங்கை இயக்க முடியும் மற்றும் வழங்கப்பட்ட அனைத்து உள்ளீடுகளுக்கும் சிறப்பாக செயல்படும் சிறந்த அளவுருக்களை பரிந்துரைக்க முடியும். இது பரிந்துரைக்கப்பட்ட அளவுருக்களை கன்சோலுக்கு அச்சிடுகிறது, மேலும் `-o output.png` அளவுரு வழங்கப்பட்டால் அல்லது காபிம கோப்பு` -c output.csv` அளவுரு குறிப்பிடப்பட்டால் விளக்கப்படத்தை உருவாக்கலாம்.

source: Providing several inputs to shaper_calibrate.py script can be useful if running some advanced tuning of the input shapers, for example:
ta: உள்ளீட்டு சேப்பர்களின் சில மேம்பட்ட ட்யூனிங்கை இயக்கினால், சேப்பர்_லிபிரேட்..பி.பை ச்கிரிப்டுக்கு பல உள்ளீடுகளை வழங்குவது பயனுள்ளதாக இருக்கும், எடுத்துக்காட்டாக:

source: Running `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (and `Y` axis) for a single axis twice on a bed slinger printer with the accelerometer attached to the toolhead the first time, and the accelerometer attached to the bed the second time in order to detect axes cross-resonances and attempt to cancel them with input shapers.
ta: ஒரு படுக்கை ச்லிங்கர் அச்சுப்பொறியில் இரண்டு முறை முதல் முறையாக கருவித்தடத்துடன் இணைக்கப்பட்ட முடுக்கமானி, மற்றும் படுக்கையில் இரண்டாவது முறையாக இணைக்கப்பட்ட முடுக்கமானி வரிசையில் இணைக்கப்பட்டிருக்கும் `test_resonances அச்சு = ஃச் வெளியீடு = raw_data` (மற்றும்` y` அச்சு) இயங்கும் அச்சுகள் குறுக்கு அதிர்வெண்களைக் கண்டறிந்து அவற்றை உள்ளீட்டு வடிவங்களுடன் ரத்து செய்ய முயற்சிக்க.

source: Running `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` twice on a bed slinger with a glass bed and a magnetic surfaces (which is lighter) to find the input shaper parameters that work well for any print surface configuration.
ta: எந்தவொரு அச்சு மேற்பரப்பு உள்ளமைவுக்கும் நன்றாக வேலை செய்யும் உள்ளீட்டு சேப்பர் அளவுருக்களைக் கண்டுபிடிக்க ஒரு கண்ணாடி படுக்கை மற்றும் காந்த மேற்பரப்புகளுடன் (இது இலகுவானது) ஒரு படுக்கை ச்லிங்கரில் இரண்டு முறை இயங்கும் `test_resonances அச்சு = ஒய் வெளியீடு = ஒய் வெளியீடு = raw_data`.

source: Combining the resonance data from multiple test points.
ta: பல சோதனை புள்ளிகளிலிருந்து அதிர்வு தரவை இணைத்தல்.

source: Combining the resonance data from 2 axis (e.g. on a bed slinger printer to configure X-axis input_shaper from both X and Y axes resonances to cancel vibrations of the *bed* in case the nozzle 'catches' a print when moving in X axis direction).
ta: 2 அச்சிலிருந்து அதிர்வு தரவை இணைத்தல் (எ.கா. ஒரு படுக்கை ச்லிங்கர் அச்சுப்பொறியில் x- அச்சு உள்ளீடு_சேப்பரை x- அச்சு உள்ளீடு_சேப்பரை ஃச் மற்றும் ஒய் அச்சுகள் இரண்டிலிருந்தும் * படுக்கையின் அதிர்வுகளை ரத்து செய்ய * ஃச் அச்சு திசையில் நகரும் போது 'பிடிக்கும்' ஒரு அச்சு 'பிடிக்கும்' ).

source: Testing custom axes
ta: தனிப்பயன் அச்சுகளை சோதித்தல்

source: `TEST_RESONANCES` command supports custom axes. While this is not really useful for input shaper calibration, it can be used to study printer resonances in-depth and to check, for example, belt tension.
ta: `Test_resonances` கட்டளை தனிப்பயன் அச்சுகளை ஆதரிக்கிறது. உள்ளீட்டு சேப்பர் அளவுத்திருத்தத்திற்கு இது உண்மையில் பயனுள்ளதாக இல்லை என்றாலும், அச்சுப்பொறி அதிர்வுகளை ஆழமாகப் படிக்கவும், சரிபார்க்கவும் இது பயன்படுத்தப்படலாம், எடுத்துக்காட்டாக, பெல்ட் பதற்றம்.

source: To check the belt tension on CoreXY printers, execute
ta: கோர்சி அச்சுப்பொறிகளில் பெல்ட் பதற்றத்தை சரிபார்க்க, இயக்கவும்

source: and use `graph_accelerometer.py` to process the generated files, e.g.
ta: உருவாக்கப்பட்ட கோப்புகளை செயலாக்க `வரைபடம்_சிலெரோமீட்டர்.பை` ஐப் பயன்படுத்தவும், எ.கா.

source: which will generate `/tmp/resonances.png` comparing the resonances.
ta: இது அதிர்வுகளை ஒப்பிடுகையில் `/tmp/அதிர்வுகளை உருவாக்கும்.

source: For Delta printers with the default tower placement (tower A ~= 210 degrees, B ~= 330 degrees, and C ~= 90 degrees), execute
ta: இயல்புநிலை கோபுர வேலைவாய்ப்புடன் டெல்டா அச்சுப்பொறிகளுக்கு (கோபுரம் A ~ = 210 டிகிரி, பி ~ = 330 டிகிரி மற்றும் சி ~ = 90 டிகிரி), இயக்கவும்

source: and then use the same command
ta: பின்னர் அதே கட்டளையைப் பயன்படுத்துங்கள்

source: to generate `/tmp/resonances.png` comparing the resonances.
ta: அதிர்வுகளை ஒப்பிட்டு `/tmp/ronsnances.png` ஐ உருவாக்க.

source: The raw data can also be obtained by running the command `ACCELEROMETER_MEASURE` command twice during some normal printer activity - first to start the measurements, and then to stop them and write the output file. Refer to [G-Codes](G-Codes.md#adxl345) for more details.
ta: சில சாதாரண அச்சுப்பொறி செயல்பாட்டின் போது `முடுக்கமானி_மேசர்` கட்டளையை இரண்டு முறை இயக்குவதன் மூலமும் மூல தரவைப் பெறலாம் - முதலில் அளவீடுகளைத் தொடங்கவும், பின்னர் அவற்றை நிறுத்தி வெளியீட்டு கோப்பை எழுதவும். மேலும் விவரங்களுக்கு [சி-குறியீடுகள்] (சி-கோட்ச்.எம்டி#ஏடிஎக்ச்எல் 345) ஐப் பார்க்கவும்.

source: MPU-9250 pin
ta: MPU-9250 முள்

source: Note that resonance measurements and shaper auto-calibration require additional software dependencies not installed by default. First, run on your Raspberry Pi the following commands:
ta: அதிர்வு அளவீடுகள் மற்றும் சேப்பர் ஆட்டோ-அளவுத்திருத்தத்திற்கு இயல்புநிலையாக நிறுவப்படாத கூடுதல் மென்பொருள் சார்புகள் தேவை என்பதை நினைவில் கொள்க. முதலில், உங்கள் ராச்பெர்ரி பையில் பின்வரும் கட்டளைகளை இயக்கவும்:

source: Next, in order to install NumPy in the Klipper environment, run the command:
ta: அடுத்து, கிளிப்பர் சூழலில் நம்பியை நிறுவ, கட்டளையை இயக்கவும்:

source: ***Double-check your wiring before powering up to prevent damaging your MCU/Raspberry Pi or the accelerometer.***
ta: *** உங்கள் MCU/ராச்பெர்ரி பை அல்லது முடுக்கமானி சேதப்படுத்துவதைத் தடுக்க உங்கள் வயரிங் இயக்குவதற்கு முன் இருமுறை சரிபார்க்கவும். ***

source: SPI Accelerometers
ta: SPI முடுக்கமானிகள்

source: I2C Accelerometers
ta: I2C முடுக்கமானிகள்

source: Recommended connection scheme for I2C on the Raspberry Pi:
ta: ராச்பெர்ரி பையில் I2C க்கான பரிந்துரைக்கப்பட்ட இணைப்பு திட்டம்:

source: VCC
ta: வி.சி.சி.

source: RP2040 pin
ta: RP2040 முள்

source: 3v3
ta: மருத்தீடு

source: Configure ADXL345 With RPi
ta: RPI உடன் ADXL345 ஐ உள்ளமைக்கவும்

source: Add the following to the printer.cfg file:
ta: Printur.cfg கோப்பில் பின்வருவனவற்றைச் சேர்க்கவும்:

source: Configure MPU-6000/9000 series With RPi
ta: RPI உடன் MPU-6000/9000 தொடரை உள்ளமைக்கவும்

source: Make sure the Linux I2C driver is enabled and the baud rate is set to 400000 (see [Enabling I2C](RPi_microcontroller.md#optional-enabling-i2c) section for more details). Then, add the following to the printer.cfg:
ta: மேலும் விவரங்களுக்கு லினக்ச் I2C இயக்கி இயக்கப்பட்டிருப்பதை உறுதிசெய்து, பாட் வீதம் 400000 ஆக அமைக்கப்பட்டிருப்பதை உறுதிசெய்க (I2C] (RPI_MICROController.md#விருப்ப-ENABLESING-I2C) பகுதியைப் பார்க்கவும்). பின்னர், பின்வருவனவற்றை அச்சுப்பொறியில் சேர்க்கவும். Cfg:

source: Direct to Raspberry Pi
ta: ராச்பெர்ரி பைக்கு நேரடியாக

source: 3.3V DC power
ta: 3.3 வி டிசி ஆற்றல்

source: Using Raspberry Pi Pico
ta: ராச்பெர்ரி பை பிக்கோவைப் பயன்படுத்துதல்

source: You may connect the ADXL345 to your Raspberry Pi Pico and then connect the Pico to your Raspberry Pi via USB. This makes it easy to reuse the accelerometer on other Klipper devices, as you can connect via USB instead of GPIO. The Pico does not have much processing power, so make sure it is only running the accelerometer and not performing any other duties.
ta: நீங்கள் ADXL345 ஐ உங்கள் ராச்பெர்ரி பை பைக்கோவுடன் இணைக்கலாம், பின்னர் பிக்கோவை உங்கள் ராச்பெர்ரி பைவுடன் யூ.எச்.பி வழியாக இணைக்கலாம். இது மற்ற கிளிப்பர் சாதனங்களில் முடுக்கமானியை மீண்டும் பயன்படுத்துவதை எளிதாக்குகிறது, ஏனெனில் நீங்கள் GPIO க்கு பதிலாக யூ.எச்.பி வழியாக இணைக்க முடியும். பிக்கோவுக்கு அதிக செயலாக்க ஆற்றல் இல்லை, எனவே இது முடுக்கமானியை மட்டுமே இயக்குகிறது மற்றும் வேறு எந்த கடமைகளையும் செய்யாது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: In order to avoid damage to your RPi make sure to connect the ADXL345 to 3.3V only. Depending on the board's layout, a level shifter may be present, which makes 5V dangerous for your RPi.
ta: உங்கள் RPI க்கு சேதம் ஏற்படுவதைத் தவிர்ப்பதற்காக, ADXL345 ஐ 3.3V உடன் மட்டுமே இணைக்கவும். வாரியத்தின் தளவமைப்பைப் பொறுத்து, ஒரு நிலை சிஃப்ட்டர் இருக்கலாம், இது உங்கள் RPI க்கு 5V ஆபத்தானது.

source: Pico pin
ta: முள் உச்சம்

source: Pico pin name
ta: பிக்கோ முள் பெயர்

source: Wiring diagrams for some of the ADXL345 boards:
ta: சில ADXL345 பலகைகளுக்கான வயரிங் வரைபடங்கள்:

source: Configure ADXL345 With Pi Pico
ta: PI பைக்கோவுடன் ADXL345 ஐ உள்ளமைக்கவும்

source: Flash the Pico Firmware
ta: பிக்கோ ஃபார்ம்வேரை ஃபிளாச்

source: On your Raspberry Pi, compile the firmware for the Pico.
ta: உங்கள் ராச்பெர்ரி பையில், பிக்கோவிற்கான ஃபார்ம்வேரை தொகுக்கவும்.

source: Now, while holding down the `BOOTSEL` button on the Pico, connect the Pico to the Raspberry Pi via USB. Compile and flash the firmware.
ta: இப்போது, பிக்கோவில் `பூட்சல்` பொத்தானை அழுத்திப் பிடிக்கும்போது, பிக்கோவை யூ.எச்.பி வழியாக ராச்பெர்ரி பைக்கு இணைக்கவும். ஃபார்ம்வேரை தொகுத்து ஒளிரச் செய்யுங்கள்.

source: If that fails, you will be told which `FLASH_DEVICE` to use. In this example, that's `make flash FLASH_DEVICE=2e8a:0003`. ![Determine flash device](img/flash_rp2040_FLASH_DEVICE.png)
ta: அது தோல்வியுற்றால், எந்த `ஃப்ளாச்_டெவிச்` பயன்படுத்த வேண்டும் என்று உங்களுக்குத் தெரிவிக்கப்படும். இந்த எடுத்துக்காட்டில், இது `ஃப்ளாச் ஃப்ளாச்_டெவிச் = 2e8a: 0003` ஐ உருவாக்குங்கள். !

source: Configure the Connection
ta: இணைப்பை உள்ளமைக்கவும்

source: The Pico will now reboot with the new firmware and should show up as a serial device. Find the pico serial device with `ls /dev/serial/by-id/*`. You can now add an `adxl.cfg` file with the following settings:
ta: PICO இப்போது புதிய ஃபார்ம்வேருடன் மறுதொடக்கம் செய்யும், மேலும் இது ஒரு தொடர் சாதனமாகக் காண்பிக்கப்பட வேண்டும். `Ls/dev/serial/by-id/*` உடன் பைக்கோ தொடர் சாதனத்தைக் கண்டறியவும். நீங்கள் இப்போது பின்வரும் அமைப்புகளுடன் `adxl.cfg` கோப்பைச் சேர்க்கலாம்:

source: If setting up the ADXL345 configuration in a separate file, as shown above, you'll also want to modify your `printer.cfg` file to include this:
ta: ADXL345 உள்ளமைவை ஒரு தனி கோப்பில் அமைத்தால், மேலே காட்டப்பட்டுள்ளபடி, இதைச் சேர்க்க உங்கள் `printel.cfg` கோப்பையும் மாற்றவும் விரும்புவீர்கள்:

source: If you get an error like `Invalid adxl345 id (got xx vs e5)`, where `xx` is some other ID, immediately try again. There's an issue with SPI initialization. If you still get an error, it is indicative of the connection problem with ADXL345, or the faulty sensor. Double-check the power, the wiring (that it matches the schematics, no wire is broken or loose, etc.), and soldering quality.
ta: `தவறான ADXL345 ஐடி (XX vs E5 கிடைத்தது)` போன்ற பிழையைப் பெற்றால், `xx` வேறு ஏதேனும் ஐடி, உடனடியாக மீண்டும் முயற்சிக்கவும். SPI துவக்கத்தில் சிக்கல் உள்ளது. நீங்கள் இன்னும் பிழை பெற்றால், அது ADXL345 அல்லது தவறான சென்சார் ஆகியவற்றுடன் இணைப்பு சிக்கலைக் குறிக்கிறது. ஆற்றல், வயரிங் (இது திட்டவட்டத்துடன் பொருந்துகிறது, கம்பி உடைக்கப்படவில்லை அல்லது தளர்வானது போன்றவை), மற்றும் சாலிடரிங் தகுதி ஆகியவற்றை இருமுறை சரிபார்க்கவும்.

source: Note that alternatively you can run the input shaper auto-calibration from Klipper [directly](#input-shaper-auto-calibration), which can be convenient, for example, for the input shaper [re-calibration](#input-shaper-re-calibration).
ta: மாற்றாக நீங்கள் உள்ளீட்டு சேப்பரை கிளிப்பர் [நேரடியாக] (#உள்ளீட்டு-சேப்பர்-ஆட்டோ-அளவுகோல்) இலிருந்து இயக்கலாம், இது வசதியானதாக இருக்கும், எடுத்துக்காட்டாக, உள்ளீட்டு வடிவத்திற்கு [மறு அளவுத்திருத்தம்] (#உள்ளீட்டு-காட்சிக்கு -இ-அளவுத்திருத்தம்).

source: **Warning!** It is not advisable to run the shaper auto-calibration very frequently (e.g. before every print, or every day). In order to determine resonance frequencies, auto-calibration creates intensive vibrations on each of the axes. Generally, 3D printers are not designed to withstand a prolonged exposure to vibrations near the resonance frequencies. Doing so may increase wear of the printer components and reduce their lifespan. There is also an increased risk of some parts unscrewing or becoming loose. Always check that all parts of the printer (including the ones that may normally not move) are securely fixed in place after each auto-tuning.
ta: ** எச்சரிக்கை! ** சேப்பர் ஆட்டோ அளவுத்திருத்தத்தை அடிக்கடி இயக்குவது நல்லதல்ல (எ.கா. ஒவ்வொரு அச்சுக்கும் முன், அல்லது ஒவ்வொரு நாளும்). அதிர்வு அதிர்வெண்களைத் தீர்மானிக்க, ஆட்டோ அளவுத்திருத்தம் ஒவ்வொரு அச்சுகளிலும் தீவிர அதிர்வுகளை உருவாக்குகிறது. பொதுவாக, 3 டி அச்சுப்பொறிகள் அதிர்வு அதிர்வெண்களுக்கு அருகிலுள்ள அதிர்வுகளுக்கு நீண்டகாலமாக வெளிப்பாட்டைத் தாங்கும் வகையில் வடிவமைக்கப்படவில்லை. அவ்வாறு செய்வது அச்சுப்பொறி கூறுகளின் உடைகளை அதிகரிக்கலாம் மற்றும் அவற்றின் ஆயுட்காலம் குறைக்கலாம். சில பகுதிகள் அவிழ்க்க அல்லது தளர்வானதாக மாறும் அபாயமும் உள்ளது. அச்சுப்பொறியின் அனைத்து பகுதிகளும் (பொதுவாக நகராதவை உட்பட) ஒவ்வொரு ஆட்டோ-ட்யூனிங்கிற்குப் பிறகு பாதுகாப்பாக சரி செய்யப்படுகின்றன என்பதை எப்போதும் சரிபார்க்கவும்.

source: When sourcing accelerometers, be aware that there are a variety of different PCB board designs and different clones of them. If it is going to be connected to a 5V printer MCU ensure it has a voltage regulator and level shifters.
ta: முடுக்கமானிகளை வளர்க்கும் போது, பல்வேறு வகையான பிசிபி போர்டு வடிவமைப்புகள் மற்றும் அவற்றில் வெவ்வேறு குளோன்கள் உள்ளன என்பதை அறிந்து கொள்ளுங்கள். இது 5 வி அச்சுப்பொறி எம்.சி.யுவுடன் இணைக்கப் போகிறது என்றால், அதில் மின்னழுத்த சீராக்கி மற்றும் நிலை மாற்றிகள் இருப்பதை உறுதிசெய்க.

source: MCUs with Klipper I2C *fast-mode* Support
ta: கிளிப்பர் I2C * வேகமான முறை * ஆதரவுடன் MCU கள்

source: MCU Family
ta: MCU குடும்பம்

source: MCU(s) Tested
ta: MCU (கள்) சோதிக்கப்பட்டது

source: MCU(s) with Support
ta: ஆதரவுடன் MCU (கள்)

source: 3B+, Pico
ta: 3 பி+, பிக்கோ

source: 3A, 3A+, 3B, 4
ta: A, a+, heb, 4

source: AVR ATmega
ta: ஏ.வி.ஆர்

source: An ethernet cable with shielded twisted pairs (cat5e or better) is recommended for signal integrity over a long distance. If you still experience signal integrity issues (SPI/I2C errors):
ta: கேடய முறுக்கப்பட்ட சோடிகள் (CAT5E அல்லது அதற்கு மேற்பட்டவை) கொண்ட ஈத்தர்நெட் கேபிள் நீண்ட தூரத்தில் சமிக்ஞை ஒருமைப்பாட்டிற்கு பரிந்துரைக்கப்படுகிறது. நீங்கள் இன்னும் சமிக்ஞை ஒருமைப்பாடு சிக்கல்களை அனுபவித்தால் (SPI/I2C பிழைகள்):

source: Double check the wiring with a digital multimeter for:
ta: இதற்கான டிசிட்டல் மல்டிமீட்டருடன் வயரிங் இருமுறை சரிபார்க்கவும்:

source: Correct connections when turned off (continuity)
ta: அணைக்கப்படும் போது சரியான இணைப்புகள் (தொடர்ச்சி)

source: Correct power and ground voltages
ta: சரியான ஆற்றல் மற்றும் தரை மின்னழுத்தங்கள்

source: I2C only:
ta: I2c மட்டும்:

source: Check the SCL and SDA lines' resistances to 3.3V are in the range of 900 ohms to 1.8K
ta: 3.3V க்கு SCL மற்றும் SDA வரிகளின் எதிர்ப்புகள் 900 ஓம்ச் முதல் 1.8K வரை உள்ளன என்பதை சரிபார்க்கவும்

source: For full technical details consult [chapter 7 of the I2C-bus specification and user manual UM10204](https://www.pololu.com/file/0J435/UM10204.pdf) for *fast-mode*
ta: முழு தொழில்நுட்ப விவரங்களுக்கு [I2C-PUS விவரக்குறிப்பு மற்றும் பயனர் கையேடு UM10204 இன் அத்தியாயம் 7] (https://www.pololu.com/file/0j435/um10204.pdf)

source: Shorten the cable
ta: கேபிளை சுருக்கவும்

source: Connect ethernet cable shielding only to the MCU board/Pi ground.
ta: ஈத்தர்நெட் கேபிள் கேடயத்தை MCU போர்டு/PI மைதானத்துடன் மட்டுமே இணைக்கவும்.

source: Suggested twisted pair order for three twisted pairs:
ta: மூன்று முறுக்கப்பட்ட சோடிகளுக்கு பரிந்துரைக்கப்பட்ட முறுக்கப்பட்ட இணை ஆர்டர்:

source: Note that unlike a cable shield, GND must be connected at both ends.
ta: கேபிள் கேடயத்தைப் போலன்றி, சி.என்.டி இரு முனைகளிலும் இணைக்கப்பட வேண்டும் என்பதை நினைவில் கொள்க.

source: **Note: Many MCUs will work with an ADXL345 in SPI mode (e.g. Pi Pico), wiring and configuration will vary according to your specific board and available pins.**
ta: ** குறிப்பு: பல MCU கள் SPI பயன்முறையில் ADXL345 உடன் வேலை செய்யும் (எ.கா. பை பைக்கோ), வயரிங் மற்றும் உள்ளமைவு உங்கள் குறிப்பிட்ட பலகை மற்றும் கிடைக்கக்கூடிய ஊசிகளின்படி மாறுபடும். **

source: Suggested twisted pair order for three pairs (preferred):
ta: மூன்று சோடிகளுக்கு பரிந்துரைக்கப்பட்ட முறுக்கப்பட்ட இணை ஆர்டர் (விரும்பப்படுகிறது):

source: or for two pairs:
ta: அல்லது இரண்டு சோடிகளுக்கு:

source: Note that unlike a cable shield, any GND(s) should be connected at both ends.
ta: ஒரு கேபிள் கவசத்தைப் போலல்லாமல், மற்றும் சி.என்.டி) இரு முனைகளிலும் இணைக்கப்பட வேண்டும் என்பதை நினைவில் கொள்க.

source: These accelerometers have been tested to work over I2C on the RPi, RP2040 (Pico) and AVR at 400kbit/s (*fast mode*). Some MPU accelerometer modules include pull-ups, but some are too large at 10K and must be changed or supplemented by smaller parallel resistors.
ta: இந்த முடுக்கமானிகள் RPI, RP2040 (PICO) மற்றும் AVR இல் 400Kbit/s (*ஃபாச்ட் பயன்முறை*) இல் I2C க்கு மேல் வேலை செய்ய சோதிக்கப்பட்டுள்ளன. சில MPU முடுக்கமானி தொகுதிகள் புல்-அப்களை உள்ளடக்குகின்றன, ஆனால் சில 10K இல் மிகப் பெரியவை, மேலும் அவை சிறிய இணையான மின்தடையங்களால் மாற்றப்பட வேண்டும் அல்லது கூடுதலாக வழங்கப்பட வேண்டும்.

source: The RPi has buit-in 1.8K pull-ups on both SCL and SDA.
ta: ரிசர்வ் வங்கி SCL மற்றும் SDA இரண்டிலும் 1.8K புல்-அப்களை உள்ளமைக்கப்பட்டுள்ளது.

source: Recommended connection scheme for I2C (i2c0a) on the RP2040:
ta: RP2040 இல் I2C (I2C0A) க்கான பரிந்துரைக்கப்பட்ட இணைப்புத் திட்டம்:

source: RP2040 pin name
ta: RP2040 முள் பெயர்

source: The Pico does not include any built-in I2C pull-up resistors.
ta: பைக்கோவில் எந்த உள்ளமைக்கப்பட்ட I2C புல்-அப் மின்தடையங்களும் இல்லை.

source: Recommended connection scheme for I2C(TWI) on the AVR ATmega328P Arduino Nano:
ta: AVR ATMEGA328P Arduino நானோவில் I2C (TWI) க்கான பரிந்துரைக்கப்பட்ட இணைப்பு திட்டம்:

source: Atmega328P TQFP32 pin
ta: Atmege328p TQFP32 முள்

source: Atmega328P pin name
ta: ATMEGA328P முள் பெயர்

source: Arduino Nano pin
ta: அர்டுயினோ நானோ முள்

source: A4
ta: இளஞ்சிவப்பு

source: A5
ta: சகோதரர்

source: The Arduino Nano does not include any built-in pull-up resistors nor a 3.3V power pin.
ta: அர்டுயினோ நானோவில் எந்த உள்ளமைக்கப்பட்ட புல்-அப் மின்தடையங்கள் அல்லது 3.3 வி பவர் முள் இல்லை.

source: First, check and follow the instructions in the [RPi Microcontroller document](RPi_microcontroller.md) to setup the "linux mcu" on the Raspberry Pi. This will configure a second Klipper instance that runs on your Pi.
ta: முதலில், ராச்பெர்ரி பை மீது "லினக்ச் எம்.சி.யு" ஐ அமைக்க [RPI மைக்ரோகண்ட்ரோலர் ஆவணம்] (RPI_MICROController.md) இல் உள்ள வழிமுறைகளை சரிபார்த்து பின்பற்றவும். இது உங்கள் பை மீது இயங்கும் இரண்டாவது கிளிப்பர் நிகழ்வை உள்ளமைக்கும்.

source: Configure MPU-9520 Compatibles With Pico
ta: MPU-9520 ஐ பைக்கோவுடன் இணக்கமாக உள்ளமைக்கவும்

source: Pico I2C is set to 400000 on default. Simply add the following to the printer.cfg:
ta: பிக்கோ ஐ 2 சி இயல்புநிலையாக 400000 ஆக அமைக்கப்பட்டுள்ளது. அச்சுப்பொறியில் பின்வருவனவற்றைச் சேர்க்கவும். Cfg:

source: Configure MPU-9520 Compatibles with AVR
ta: AVR உடன் இணக்கமான MPU-9520 ஐ உள்ளமைக்கவும்

source: AVR I2C will be set to 400000 by the mpu9250 option. Simply add the following to the printer.cfg:
ta: AVR I2C MPU9250 விருப்பத்தால் 400000 ஆக அமைக்கப்படும். அச்சுப்பொறியில் பின்வருவனவற்றைச் சேர்க்கவும். Cfg:

source: **If you are using a MPU-9250 compatible accelerometer and it shows up as `mpu-unknown`, use with caution! They are probably refurbished chips!**
ta: . அவை புதுப்பிக்கப்பட்ட சில்லுகள்! **

source: However, you can also connect two accelerometers simultaneously, though the ADXL345 must be connected to different boards (say, to an RPi and printer MCU board), or to two different physical SPI interfaces on the same board (rarely available). Then they can be configured in the following manner:
ta: இருப்பினும், நீங்கள் ஒரே நேரத்தில் இரண்டு முடுக்கமானிகளையும் இணைக்க முடியும், இருப்பினும் ADXL345 வெவ்வேறு பலகைகளுடன் (ஒரு RPI மற்றும் அச்சுப்பொறி MCU போர்டுடன்) அல்லது ஒரே பலகையில் இரண்டு வெவ்வேறு உடல் SPI இடைமுகங்களுடன் இணைக்கப்பட வேண்டும் (அரிதாகவே கிடைக்கிறது). பின்னர் அவை பின்வரும் முறையில் கட்டமைக்கப்படலாம்:

source: Two MPUs can share one I2C bus, but they **cannot** measure simultaneously as the 400kbit/s I2C bus is not fast enough. One must have its AD0 pin pulled-down to 0V (address 104) and the other its AD0 pin pulled-up to 3.3V (address 105):
ta: இரண்டு MPU கள் ஒரு I2C பச்சைப் பகிர்ந்து கொள்ளலாம், ஆனால் 400Kbit/s I2C பச் போதுமானதாக இல்லாததால் அவை ** ஒரே நேரத்தில் அளவிட முடியாது. ஒன்று அதன் AD0 முள் 0V க்கு இழுக்கப்பட வேண்டும் (முகவரி 104), மற்றொன்று அதன் AD0 முள் 3.3V க்கு இழுக்கப்படுகிறது (முகவரி 105):

source: [Test with each MPU individually before connecting both to the bus for easy debugging.]
ta: [எளிதாக பிழைத்திருத்தத்திற்காக பச்சுடன் இணைவதற்கு முன் ஒவ்வொரு MPU உடன் தனித்தனியாக சோதிக்கவும்.]
