Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: ta

source: Keep in mind that the maximum acceleration without too much smoothing depends on the `square_corner_velocity`. The general recommendation is not to change it from its default value 5.0, and this is the value used by default by the `calibrate_shaper.py` script. If you did change it though, you should inform the script about it by passing `--square_corner_velocity=...` parameter, e.g.
ta: அதிக மென்மையாக்காமல் அதிகபட்ச முடுக்கம் `சதுர_கார்னர்_வெலோசிட்டி` ஐப் பொறுத்தது என்பதை நினைவில் கொள்ளுங்கள். பொதுவான பரிந்துரை அதன் இயல்புநிலை மதிப்பு 5.0 இலிருந்து அதை மாற்றக்கூடாது, இது இயல்புநிலையாக `அளவீடுகள்_சேப்பர்.பி` ச்கிரிப்ட் மூலம் பயன்படுத்தப்படும் மதிப்பு. நீங்கள் அதை மாற்றினால், `--சதுர_கார்ன்_வெலோசிட்டி = ...` அளவுரு, எ.கா.

source: so that it can calculate the maximum acceleration recommendations correctly. Note that the `SHAPER_CALIBRATE` command already takes the configured `square_corner_velocity` parameter into account, and there is no need to specify it explicitly.
ta: இதனால் அதிகபட்ச முடுக்கம் பரிந்துரைகளை சரியாக கணக்கிட முடியும். `சேப்பர்_லிபிரேட்` கட்டளை ஏற்கனவே கட்டமைக்கப்பட்ட` சதுர_கார்ன்_வெலோசிட்டி` அளவுருவை கணக்கில் எடுத்துக்கொள்கிறது, அதை வெளிப்படையாகக் குறிப்பிட வேண்டிய அவசியமில்லை என்பதை நினைவில் கொள்க.

source: This will generate 2 CSV files (`/tmp/resonances_x_*.csv` and `/tmp/resonances_y_*.csv`). These files can be processed with the stand-alone script on a Raspberry Pi. This script is intended to be run with a single CSV file for each axis measured, although it can be used with multiple CSV files if you desire to average the results. Averaging results can be useful, for example, if resonance tests were done at multiple test points. Delete the extra CSV files if you do not desire to average them.
ta: இது 2 காபிம கோப்புகளை (`/TMP/அதிர்வு_எக்ச் _*. CSV` மற்றும்`/TMP/அதிர்வு_ஒய் _*. CSV`) உருவாக்கும். இந்த கோப்புகளை ராச்பெர்ரி பை மீது தனித்து நிற்கும் ச்கிரிப்ட் மூலம் செயலாக்க முடியும். இந்த ச்கிரிப்ட் அளவிடப்பட்ட ஒவ்வொரு அச்சுக்கும் ஒற்றை சி.எச்.வி கோப்புடன் இயக்கப்பட வேண்டும், இருப்பினும் நீங்கள் முடிவுகளை சராசரியாக விரும்பினால் பல சி.எச்.வி கோப்புகளுடன் பயன்படுத்தலாம். சராசரி முடிவுகள் பயனுள்ளதாக இருக்கும், எடுத்துக்காட்டாக, பல சோதனை புள்ளிகளில் அதிர்வு சோதனைகள் செய்யப்பட்டால். கூடுதல் சி.எச்.வி கோப்புகளை நீங்கள் சராசரியாக விரும்பவில்லை என்றால் அவற்றை நீக்கவும்.
