Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: ta

source: Measuring Resonances
ta: அதிர்வுகளை அளவிடுதல்

source: Installation instructions
ta: நிறுவல் வழிமுறைகள்

source: Wiring
ta: வயரிங்

source: You need to connect ADXL345 to your Raspberry Pi via SPI. Note that the I2C connection, which is suggested by ADXL345 documentation, has too low throughput and **will not work**. The recommended connection scheme:
ta: SPI வழியாக உங்கள் ராச்பெர்ரி பைக்கு ADXL345 ஐ இணைக்க வேண்டும். ADXL345 ஆவணங்களால் பரிந்துரைக்கப்பட்ட I2C இணைப்பு மிகக் குறைந்த செயல்திறனைக் கொண்டுள்ளது மற்றும் ** வேலை செய்யாது **. பரிந்துரைக்கப்பட்ட இணைப்பு திட்டம்:

source: ADXL345 pin
ta: ADXL345 முள்

source: RPi pin
ta: Rpi முள்

source: RPi pin name
ta: RPI முள் பெயர்

source: 3V3 (or VCC)
ta: 3V3 (அல்லது VCC)

source: 3.3v DC power
ta: 3.3 வி டிசி ஆற்றல்

source: Ground
ta: மைதானம்

source: CS
ta: சி.எச்

source: SDO
ta: எச்.டி.ஓ

source: SDA
ta: எச்.டி.ஏ.

source: SCL
ta: எச்.சி.எல்

source: Fritzing wiring diagrams for some of the ADXL345 boards:
ta: சில ADXL345 பலகைகளுக்கான வயரிங் வரைபடங்களை உருவாக்குதல்:

source: Mounting the accelerometer
ta: முடுக்கமானியை ஏற்றுவது

source: The accelerometer must be attached to the toolhead. One needs to design a proper mount that fits their own 3D printer. It is better to align the axes of the accelerometer with the printer's axes (but if it makes it more convenient, axes can be swapped - i.e. no need to align X axis with X and so forth - it should be fine even if Z axis of accelerometer is X axis of the printer, etc.).
ta: முடுக்கமானி கருவித்தடத்துடன் இணைக்கப்பட வேண்டும். ஒருவர் தங்கள் சொந்த 3D அச்சுப்பொறிக்கு பொருந்தக்கூடிய சரியான ஏற்றத்தை வடிவமைக்க வேண்டும். அச்சுப்பொறியின் அச்சுகளுடன் முடுக்கமானியின் அச்சுகளை சீரமைப்பது நல்லது (ஆனால் அது மிகவும் வசதியானதாக இருந்தால், அச்சுகளை மாற்றலாம் - அதாவது ஃச் அச்சை ஃச் உடன் சீரமைக்க தேவையில்லை - சட் அச்சு என்றாலும் கூட நன்றாக இருக்க வேண்டும் முடுக்கமானி என்பது அச்சுப்பொறியின் ஃச் அச்சு, முதலியன).

source: An example of mounting ADXL345 on the SmartEffector:
ta: ச்மார்ட்ஃபெக்டரில் ADXL345 ஐ ஏற்றுவதற்கான எடுத்துக்காட்டு:

source: Note that on a bed slinger printer one must design 2 mounts: one for the toolhead and one for the bed, and run the measurements twice. See the corresponding [section](#bed-slinger-printers) for more details.
ta: ஒரு படுக்கை ச்லிங்கர் அச்சுப்பொறியில் ஒருவர் 2 ஏற்றங்களை வடிவமைக்க வேண்டும் என்பதை நினைவில் கொள்க: ஒன்று கருவிக்கு மற்றும் படுக்கைக்கு ஒன்று, மற்றும் இரண்டு முறை அளவீடுகளை இயக்கவும். மேலும் விவரங்களுக்கு தொடர்புடைய [பிரிவு] (#படுக்கை-ச்லிங்கர்-பிரிண்டர்கள்) ஐப் பார்க்கவும்.

source: **Attention:** make sure the accelerometer and any screws that hold it in place do not touch any metal parts of the printer. Basically, the mount must be designed such as to ensure the electrical isolation of the accelerometer from the printer frame. Failing to ensure that can create a ground loop in the system that may damage the electronics.
ta: ** கவனம்: ** முடுக்கமானி மற்றும் அதை வைத்திருக்கும் எந்த திருகுகளும் அச்சுப்பொறியின் எந்த உலோக பகுதிகளையும் தொடாது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். அடிப்படையில், அச்சுப்பொறி சட்டகத்திலிருந்து முடுக்கமானியின் மின் தனிமைப்படுத்தலை உறுதி செய்வதற்காக மவுண்ட் வடிவமைக்கப்பட வேண்டும். மின்னணுவியல் சேதப்படுத்தக்கூடிய கணினியில் ஒரு தரை வளையத்தை உருவாக்க முடியும் என்பதை உறுதிப்படுத்தத் தவறியது.

source: Software installation
ta: மென்பொருள் நிறுவல்

source: Make sure the Linux SPI driver is enabled by running `sudo raspi-config` and enabling SPI under the "Interfacing options" menu.
ta: `சுடோ ராச்பி-கான்ஃபிக்` ஐ இயக்குவதன் மூலமும்," இடைமுக விருப்பங்கள் "மெனுவின் கீழ் SPI ஐ இயக்குவதன் மூலமும் லினக்ச் எச்பிஐ இயக்கி இயக்கப்பட்டிருப்பதை உறுதிசெய்க.

source: It is advised to start with 1 probe point, in the middle of the print bed, slightly above it.
ta: அச்சு படுக்கையின் நடுவில், அதற்கு சற்று மேலே 1 ஆய்வு புள்ளியுடன் தொடங்க அறிவுறுத்தப்படுகிறது.

source: Restart Klipper via the `RESTART` command.
ta: `மறுதொடக்கம்` கட்டளை வழியாக கிளிப்பரை மறுதொடக்கம் செய்யுங்கள்.

source: Measuring the resonances
ta: அதிர்வுகளை அளவிடுதல்

source: Checking the setup
ta: அமைப்பைச் சரிபார்க்கிறது

source: Now you can test a connection.
ta: இப்போது நீங்கள் ஒரு இணைப்பை சோதிக்கலாம்.

source: For "non bed-slingers" (e.g. one accelerometer), in Octoprint, enter `ACCELEROMETER_QUERY`
ta: "படுக்கை-ச்லிங்கர்ச் அல்லாதவர்கள்" (எ.கா. ஒரு முடுக்கமானி), ஆக்டோப்ரின்ட்டில், `முடுக்கமானி_ குவேரி` ஐ உள்ளிடவும்

source: For "bed-slingers" (e.g. more than one accelerometer), enter `ACCELEROMETER_QUERY CHIP=<chip>` where `<chip>` is the name of the chip as-entered, e.g. `CHIP=bed` (see: [bed-slinger](#bed-slinger-printers)) for all installed accelerometer chips.
ta: "படுக்கை-ச்லிங்கர்ச்" க்கு (எ.கா. ஒன்றுக்கு மேற்பட்ட முடுக்கமானிகள்), `முடுக்கமானி_க் கள் சிப் = <சிப்>` எங்கே `<iph>` என்பது உள்ளிட்ட சிப்பின் பெயர், எ.கா. நிறுவப்பட்ட அனைத்து முடுக்கமானி சில்லுகளுக்கும் `சிப் = படுக்கை` (காண்க: [படுக்கை-ச்லிங்கர்] (#படுக்கை-ச்லிங்கர்-பிரிண்டர்கள்)).

source: You should see the current measurements from the accelerometer, including the free-fall acceleration, e.g.
ta: ஃப்ரீ-வீழ்ச்சி முடுக்கம் உட்பட முடுக்கமானிலிருந்து தற்போதைய அளவீடுகளை நீங்கள் காண வேண்டும், எ.கா.

source: Next, try running `MEASURE_AXES_NOISE` in Octoprint, you should get some baseline numbers for the noise of accelerometer on the axes (should be somewhere in the range of ~1-100). Too high axes noise (e.g. 1000 and more) can be indicative of the sensor issues, problems with its power, or too noisy imbalanced fans on a 3D printer.
ta: அடுத்து, ஆக்டோபிரிண்டில் `அளவீடு_அக்ச்_நோயிச்` ஐ இயக்க முயற்சிக்கவும், அச்சுகளில் முடுக்கமானி சத்தத்திற்கு சில அடிப்படை எண்களைப் பெற வேண்டும் (~ 1-100 வரம்பில் எங்காவது இருக்க வேண்டும்). மிக உயர்ந்த அச்சுகள் ஒலி (எ.கா. 1000 மற்றும் அதற்கு மேற்பட்டவை) சென்சார் சிக்கல்கள், அதன் சக்தியுடன் சிக்கல்கள் அல்லது 3D அச்சுப்பொறியில் சத்தமில்லாத சமநிலையற்ற ரசிகர்களைக் குறிக்கும்.

source: Now you can run some real-life tests. Run the following command:
ta: இப்போது நீங்கள் சில நிச வாழ்க்கை சோதனைகளை இயக்கலாம். பின்வரும் கட்டளையை இயக்கவும்:

source: Note that it will create vibrations on X axis. It will also disable input shaping if it was enabled previously, as it is not valid to run the resonance testing with the input shaper enabled.
ta: இது ஃச் அச்சில் அதிர்வுகளை உருவாக்கும் என்பதை நினைவில் கொள்க. இது முன்னர் இயக்கப்பட்டிருந்தால் உள்ளீட்டு வடிவமைப்பை முடக்கிவிடும், ஏனெனில் உள்ளீட்டு சேப்பருடன் அதிர்வு சோதனையை இயக்குவது செல்லுபடியாகாது.

source: **Attention!** Be sure to observe the printer for the first time, to make sure the vibrations do not become too violent (`M112` command can be used to abort the test in case of emergency; hopefully it will not come to this though). If the vibrations do get too strong, you can attempt to specify a lower than the default value for `accel_per_hz` parameter in `[resonance_tester]` section, e.g.
ta: . இது என்றாலும்). அதிர்வுகள் மிகவும் வலுவாக இருந்தால், `[அதிர்வு_டெச்டர்]` பிரிவில் `act_per_hz` அளவுருவுக்கான இயல்புநிலை மதிப்பை விட குறைவாக குறிப்பிட முயற்சி செய்யலாம், எ.கா.

source: If it works for X axis, run for Y axis as well:
ta: இது ஃச் அச்சுக்கு வேலை செய்தால், ஒய் அச்சுக்கும் இயக்கவும்:

source: This script will generate the charts `/tmp/shaper_calibrate_x.png` and `/tmp/shaper_calibrate_y.png` with frequency responses. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup. For example:
ta: இந்த ச்கிரிப்ட் `/tmp/shaper_calibrate_x.png` மற்றும்`/tmp/shaper_calibrate_y.png` ஆகியவற்றை அதிர்வெண் பதில்களுடன் உருவாக்கும். ஒவ்வொரு உள்ளீட்டு சேப்பருக்கும் பரிந்துரைக்கப்பட்ட அதிர்வெண்களையும் நீங்கள் பெறுவீர்கள், அதே போல் உங்கள் அமைப்பிற்கு எந்த உள்ளீட்டு சேப்பர் பரிந்துரைக்கப்படுகிறது. உதாரணமாக:

source: ![Resonances](img/calibrate-y.png)
ta: ! [அதிர்வுகள்] (IMG/அளவீடு Y.PNG)

source: The suggested configuration can be added to `[input_shaper]` section of `printer.cfg`, e.g.:
ta: பரிந்துரைக்கப்பட்ட உள்ளமைவை `[input_shaper]` printur.cfg` இன் பிரிவில் சேர்க்கலாம், எ.கா .:

source: or you can choose some other configuration yourself based on the generated charts: peaks in the power spectral density on the charts correspond to the resonance frequencies of the printer.
ta: அல்லது உருவாக்கப்பட்ட விளக்கப்படங்களின் அடிப்படையில் வேறு சில உள்ளமைவுகளை நீங்களே தேர்வு செய்யலாம்: விளக்கப்படங்களில் உள்ள ஆற்றல் நிறமாலை அடர்த்தியில் உள்ள சிகரங்கள் அச்சுப்பொறியின் அதிர்வு அதிர்வெண்களுடன் ஒத்திருக்கும்.

source: Bed-slinger printers
ta: படுக்கை-ச்லிங்கர் அச்சுப்பொறிகள்

source: If your printer is a bed slinger printer, you will need to change the location of the accelerometer between the measurements for X and Y axes: measure the resonances of X axis with the accelerometer attached to the toolhead and the resonances of Y axis - to the bed (the usual bed slinger setup).
ta: உங்கள் அச்சுப்பொறி ஒரு படுக்கை ச்லிங்கர் அச்சுப்பொறியாக இருந்தால், ஃச் மற்றும் ஒய் அச்சுகளுக்கான அளவீடுகளுக்கு இடையில் முடுக்கமானியின் இருப்பிடத்தை மாற்ற வேண்டும்: கருவித்தடத்துடன் இணைக்கப்பட்ட முடுக்கமானி மற்றும் ஒய் அச்சின் அதிர்வுகளுடன் ஃச் அச்சின் அதிர்வுகளை அளவிடவும் படுக்கை (வழக்கமான படுக்கை ச்லிங்கர் அமைப்பு).

source: Then the commands `TEST_RESONANCES AXIS=X` and `TEST_RESONANCES AXIS=Y` will use the correct accelerometer for each axis.
ta: பின்னர் `test_resonances அச்சு = x` மற்றும்` test_resonances அச்சு = y` கட்டளைகள் ஒவ்வொரு அச்சுக்கும் சரியான முடுக்கமானியைப் பயன்படுத்தும்.

source: Max smoothing
ta: அதிகபட்ச மென்மையான

source: Keep in mind that the input shaper can create some smoothing in parts. Automatic tuning of the input shaper performed by `calibrate_shaper.py` script or `SHAPER_CALIBRATE` command tries not to exacerbate the smoothing, but at the same time they try to minimize the resulting vibrations. Sometimes they can make a sub-optimal choice of the shaper frequency, or maybe you simply prefer to have less smoothing in parts at the expense of a larger remaining vibrations. In these cases, you can request to limit the maximum smoothing from the input shaper.
ta: உள்ளீட்டு சேப்பர் சில பகுதிகளை மென்மையாக்க முடியும் என்பதை நினைவில் கொள்ளுங்கள். `அளவீடுகள்_சேப்பர்.பி` ச்கிரிப்ட் அல்லது` சேப்பர்_லிபிரேட்` கட்டளை மூலம் நிகழ்த்தப்பட்ட உள்ளீட்டு சேப்பரின் தானியங்கி டியூனிங் மென்மையானதை அதிகரிக்க முயற்சிக்கிறது, ஆனால் அதே நேரத்தில் அவை ஏற்படும் அதிர்வுகளைக் குறைக்க முயற்சிக்கின்றன. சில நேரங்களில் அவை சேப்பர் அதிர்வெண்ணின் துணை உகந்த தேர்வு செய்யலாம், அல்லது ஒரு பெரிய மீதமுள்ள அதிர்வுகளின் இழப்பில் பகுதிகளில் குறைந்த மென்மையாக்குவதை நீங்கள் விரும்பலாம். இந்த சந்தர்ப்பங்களில், உள்ளீட்டு வடிவத்திலிருந்து அதிகபட்ச மென்மையை கட்டுப்படுத்த நீங்கள் கோரலாம்.

source: Let's consider the following results from the automatic tuning:
ta: தானியங்கி சரிப்படுத்தும் பின்வரும் முடிவுகளைக் கருத்தில் கொள்வோம்:

source: ![Resonances](img/calibrate-x.png)
ta: ! [அதிர்வுகள்] (IMG/அளவீடு-X.PNG)

source: Note that the reported `smoothing` values are some abstract projected values. These values can be used to compare different configurations: the higher the value, the more smoothing a shaper will create. However, these smoothing scores do not represent any real measure of smoothing, because the actual smoothing depends on [`max_accel`](#selecting-max-accel) and `square_corner_velocity` parameters. Therefore, you should print some test prints to see how much smoothing exactly a chosen configuration creates.
ta: அறிக்கையிடப்பட்ட `மென்மையான` மதிப்புகள் சில சுருக்கமான திட்டமிடப்பட்ட மதிப்புகள் என்பதை நினைவில் கொள்க. வெவ்வேறு உள்ளமைவுகளை ஒப்பிட்டுப் பார்க்க இந்த மதிப்புகள் பயன்படுத்தப்படலாம்: அதிக மதிப்பு, ஒரு சேப்பரை மிகவும் மென்மையாக்கும். இருப்பினும், இந்த மென்மையான மதிப்பெண்கள் எந்தவொரு உண்மையான அளவையும் குறிக்கவில்லை, ஏனெனில் உண்மையான மென்மையானது [`Max_accel`] (#-மேக்ச்-அக்சலைத் தேர்ந்தெடுப்பது) மற்றும்` ச்கொயர்_கார்னர்_வெலோசிட்டி` அளவுருக்களைப் பொறுத்தது. ஆகையால், தேர்ந்தெடுக்கப்பட்ட உள்ளமைவு எவ்வளவு மென்மையாக்குகிறது என்பதைக் காண சில சோதனை அச்சிட்டுகளை அச்சிட வேண்டும்.

source: In the example above the suggested shaper parameters are not bad, but what if you want to get less smoothing on the X axis? You can try to limit the maximum shaper smoothing using the following command:
ta: பரிந்துரைக்கப்பட்ட சேப்பர் அளவுருக்கள் மோசமானவை அல்ல, ஆனால் ஃச் அச்சில் குறைவாக மென்மையாக்க விரும்பினால் என்ன செய்வது? பின்வரும் கட்டளையைப் பயன்படுத்தி அதிகபட்ச சேப்பர் மென்மையாக்கலை கட்டுப்படுத்த முயற்சி செய்யலாம்:

source: which limits the smoothing to 0.2 score. Now you can get the following result:
ta: இது மென்மையானது 0.2 மதிப்பெண்ணாக கட்டுப்படுத்துகிறது. இப்போது நீங்கள் பின்வரும் முடிவைப் பெறலாம்:

source: If you compare to the previously suggested parameters, the vibrations are a bit larger, but the smoothing is significantly smaller than previously, allowing larger maximum acceleration.
ta: முன்னர் பரிந்துரைக்கப்பட்ட அளவுருக்களுடன் நீங்கள் ஒப்பிட்டுப் பார்த்தால், அதிர்வுகள் சற்று பெரியவை, ஆனால் மென்மையானது முன்பு இருந்ததை விட கணிசமாக சிறியது, இது பெரிய அதிகபட்ச முடுக்கம் அனுமதிக்கிறது.

source: When deciding which `max_smoothing` parameter to choose, you can use a trial-and-error approach. Try a few different values and see which results you get. Note that the actual smoothing produced by the input shaper depends, primarily, on the lowest resonance frequency of the printer: the higher the frequency of the lowest resonance - the smaller the smoothing. Therefore, if you request the script to find a configuration of the input shaper with the unrealistically small smoothing, it will be at the expense of increased ringing at the lowest resonance frequencies (which are, typically, also more prominently visible in prints). So, always double-check the projected remaining vibrations reported by the script and make sure they are not too high.
ta: தேர்வு செய்ய எந்த `Max_smohothing` அளவுருவை தீர்மானிக்கும்போது, நீங்கள் சோதனை மற்றும் பிழை அணுகுமுறையைப் பயன்படுத்தலாம். சில வித்தியாசமான மதிப்புகளை முயற்சித்து, நீங்கள் எந்த முடிவுகளைப் பெறுவீர்கள் என்று பாருங்கள். உள்ளீட்டு சேப்பரால் விளைவாக்கம் செய்யப்படும் உண்மையான மென்மையாக்கல், முதன்மையாக, அச்சுப்பொறியின் மிகக் குறைந்த அதிர்வு அதிர்வெண்ணைப் பொறுத்தது என்பதை நினைவில் கொள்க: மிகக் குறைந்த அதிர்வின் அதிர்வெண் - சிறியது மென்மையானது. ஆகையால், நம்பத்தகாத சிறிய மென்மையாக்கலுடன் உள்ளீட்டு வடிவத்தின் உள்ளமைவைக் கண்டுபிடிக்க ச்கிரிப்டைக் கோரினால், அது மிகக் குறைந்த அதிர்வு அதிர்வெண்களில் அதிகரித்த ஒலிக்கும் செலவில் இருக்கும் (அவை பொதுவாக, அச்சிட்டுகளில் மிகவும் முக்கியமாகத் தெரியும்). எனவே, ச்கிரிப்டால் புகாரளிக்கப்பட்ட மீதமுள்ள அதிர்வுகளை எப்போதும் இருமுறை சரிபார்த்து, அவை மிக அதிகமாக இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Note that if you chose a good `max_smoothing` value for both of your axes, you can store it in the `printer.cfg` as
ta: உங்கள் இரு அச்சுகளுக்கும் ஒரு நல்ல `அதிகபட்ச மென்மையான` மதிப்பை நீங்கள் தேர்வுசெய்தால், அதை `printel.cfg` இல் சேமிக்கலாம்

source: Then, if you [rerun](#input-shaper-re-calibration) the input shaper auto-tuning using `SHAPER_CALIBRATE` Klipper command in the future, it will use the stored `max_smoothing` value as a reference.
ta: பின்னர், எதிர்காலத்தில் `சேப்பர்_லிபிரேட்` கிளிப்பர் கட்டளையைப் பயன்படுத்தி உள்ளீட்டு சேப்பர் தானாக-ட்யூனிங் செய்தால், அது சேமிக்கப்பட்ட` மேக்ச்_மூதிங்` மதிப்பை ஒரு குறிப்பாகப் பயன்படுத்தும்.

source: Selecting max_accel
ta: Max_accel ஐத் தேர்ந்தெடுக்கும்

source: Since the input shaper can create some smoothing in parts, especially at high accelerations, you will still need to choose the `max_accel` value that does not create too much smoothing in the printed parts. A calibration script provides an estimate for `max_accel` parameter that should not create too much smoothing. Note that the `max_accel` as displayed by the calibration script is only a theoretical maximum at which the respective shaper is still able to work without producing too much smoothing. It is by no means a recommendation to set this acceleration for printing. The maximum acceleration your printer is able to sustain depends on its mechanical properties and the maximum torque of the used stepper motors. Therefore, it is suggested to set `max_accel` in `[printer]` section that does not exceed the estimated values for X and Y axes, likely with some conservative safety margin.
ta: உள்ளீட்டு சேப்பர் பகுதிகளில் சில மென்மையாக்கத்தை உருவாக்க முடியும் என்பதால், குறிப்பாக அதிக முடுக்கம் கொண்ட நிலையில், அச்சிடப்பட்ட பகுதிகளில் அதிக மென்மையாக்கப்படாத `மேக்ச்_செல்` மதிப்பை நீங்கள் இன்னும் தேர்வு செய்ய வேண்டும். ஒரு அளவுத்திருத்த ச்கிரிப்ட் `max_accel` அளவுருவுக்கான மதிப்பீட்டை வழங்குகிறது, இது அதிக மென்மையாக்கக்கூடாது. அளவுத்திருத்த ச்கிரிப்டால் காட்டப்படும் `மேக்ச்_செல்` ஒரு தத்துவார்த்த அதிகபட்சம் மட்டுமே என்பதை நினைவில் கொள்க, அந்தந்த சேப்பர் இன்னும் அதிக மென்மையாக்காமல் வேலை செய்ய முடிகிறது. அச்சிடுவதற்கு இந்த முடுக்கம் அமைப்பதற்கான பரிந்துரை இல்லை. உங்கள் அச்சுப்பொறி தக்கவைக்கக்கூடிய அதிகபட்ச முடுக்கம் அதன் இயந்திர பண்புகள் மற்றும் பயன்படுத்தப்பட்ட ச்டெப்பர் மோட்டார்கள் அதிகபட்ச முறுக்கு ஆகியவற்றைப் பொறுத்தது. ஆகையால், `Max_accel`` [அச்சுப்பொறி] `எக்ச் மற்றும் ஒய் அச்சுகளுக்கான மதிப்பிடப்பட்ட மதிப்புகளைத் தாண்டாத பிரிவில் அமைக்க பரிந்துரைக்கப்படுகிறது, இது சில பழமைவாத பாதுகாப்பு விளிம்புடன் இருக்கலாம்.

source: Alternatively, follow [this](Resonance_Compensation.md#selecting-max_accel) part of the input shaper tuning guide and print the test model to choose `max_accel` parameter experimentally.
ta: மாற்றாக, [இதை] (அதிர்வு_பென்சேசன்.

source: The same notice applies to the input shaper [auto-calibration](#input-shaper-auto-calibration) with `SHAPER_CALIBRATE` command: it is still necessary to choose the right `max_accel` value after the auto-calibration, and the suggested acceleration limits will not be applied automatically.
ta: அதே அறிவிப்பு உள்ளீட்டு சேப்பர் [ஆட்டோ-அளவுத்திருத்தம்] (#உள்ளீட்டு-சேப்பர்-ஆட்டோ-அளவுகோல்) `சேப்பர்_லிபிரேட்` கட்டளை: ஆட்டோ அளவுத்திருத்தத்திற்குப் பிறகு சரியான` மேக்ச்_அசெல்` மதிப்பைத் தேர்வு செய்வது இன்னும் தேவை, மற்றும் பரிந்துரைக்கப்பட்டவை முடுக்கம் வரம்புகள் தானாகவே பயன்படுத்தப்படாது.

source: If you are doing a shaper re-calibration and the reported smoothing for the suggested shaper configuration is almost the same as what you got during the previous calibration, this step can be skipped.
ta: நீங்கள் ஒரு சேப்பர் மறு அளவுத்திருத்தத்தை செய்கிறீர்கள் மற்றும் பரிந்துரைக்கப்பட்ட சேப்பர் உள்ளமைவுக்கு மென்மையாக்கப்படுவது முந்தைய அளவுத்திருத்தத்தின் போது உங்களுக்கு கிடைத்ததைப் போலவே இருக்கும் என்றால், இந்த நடவடிக்கையைத் தவிர்க்கலாம்.

source: Input Shaper auto-calibration
ta: உள்ளீட்டு சேப்பர் ஆட்டோ அளவுத்திருத்தமாகும்

source: Besides manually choosing the appropriate parameters for the input shaper feature, it is also possible to run the auto-tuning for the input shaper directly from Klipper. Run the following command via Octoprint terminal:
ta: உள்ளீட்டு சேப்பர் அம்சத்திற்கான பொருத்தமான அளவுருக்களை கைமுறையாகத் தேர்ந்தெடுப்பதைத் தவிர, உள்ளீட்டு சேப்பருக்கான ஆட்டோ-ட்யூனிங்கை கிளிப்பரிலிருந்து நேரடியாக இயக்கவும் முடியும். ஆக்டோபிரிண்ட் முனையம் வழியாக பின்வரும் கட்டளையை இயக்கவும்:

source: This will run the full test for both axes and generate the csv output (`/tmp/calibration_data_*.csv` by default) for the frequency response and the suggested input shapers. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup, on Octoprint console. For example:
ta: இது இரு அச்சுகளுக்கும் முழு சோதனையையும் இயக்கும் மற்றும் அதிர்வெண் மறுமொழி மற்றும் பரிந்துரைக்கப்பட்ட உள்ளீட்டு வடிவங்களுக்கு காபிம வெளியீட்டை (`/tmp/அளவுத்திருத்த_டேட்டா _*. CSV`) உருவாக்கும். ஒவ்வொரு உள்ளீட்டு சேப்பருக்கும் பரிந்துரைக்கப்பட்ட அதிர்வெண்களையும் நீங்கள் பெறுவீர்கள், அத்துடன் ஆக்டோப்ரிண்ட் கன்சோலில் உங்கள் அமைப்பிற்கு எந்த உள்ளீட்டு சேப்பர் பரிந்துரைக்கப்படுகிறது. உதாரணமாக:

source: If you agree with the suggested parameters, you can execute `SAVE_CONFIG` now to save them and restart the Klipper. Note that this will not update `max_accel` value in `[printer]` section. You should update it manually following the considerations in [Selecting max_accel](#selecting-max_accel) section.
ta: பரிந்துரைக்கப்பட்ட அளவுருக்களுடன் நீங்கள் உடன்பட்டால், அவற்றை சேமித்து கிளிப்பரை மறுதொடக்கம் செய்ய `Save_config` ஐ இப்போது இயக்கலாம். இது `[அச்சுப்பொறி]` பிரிவில் `max_accel` மதிப்பைப் புதுப்பிக்காது என்பதை நினைவில் கொள்க. [MAX_ACCEL ஐத் தேர்ந்தெடுப்பது] (#தேர்ந்தெடுப்பது-MAX_ACCEL) பிரிவில் உள்ள கருத்துகளைப் பின்பற்றி கைமுறையாக புதுப்பிக்க வேண்டும்.

source: If your printer is a bed slinger printer, you can specify which axis to test, so that you can change the accelerometer mounting point between the tests (by default the test is performed for both axes):
ta: உங்கள் அச்சுப்பொறி ஒரு படுக்கை ச்லிங்கர் அச்சுப்பொறியாக இருந்தால், எந்த அச்சை சோதிக்க வேண்டும் என்பதை நீங்கள் குறிப்பிடலாம், இதன் மூலம் சோதனைகளுக்கு இடையில் முடுக்கமானி பெருகிவரும் புள்ளியை மாற்றலாம் (இயல்புநிலையாக இரண்டு அச்சுகளுக்கும் சோதனை செய்யப்படுகிறது):

source: You can execute `SAVE_CONFIG` twice - after calibrating each axis.
ta: ஒவ்வொரு அச்சையும் அளவீடு செய்த பிறகு `Save_Config` ஐ இரண்டு முறை இயக்கலாம்.

source: However, if you connected two accelerometers simultaneously, you simply run `SHAPER_CALIBRATE` without specifying an axis to calibrate the input shaper for both axes in one go.
ta: இருப்பினும், நீங்கள் ஒரே நேரத்தில் இரண்டு முடுக்கமானிகளை இணைத்தால், ஒரே நேரத்தில் இரு அச்சுகளுக்கும் உள்ளீட்டு சேப்பரை அளவீடு செய்ய ஒரு அச்சைக் குறிப்பிடாமல் `சேப்பர்_லிபிரேட்` ஐ இயக்குகிறீர்கள்.

source: Input Shaper re-calibration
ta: உள்ளீட்டு சேப்பர் மறு அளவுத்தன்மை

source: `SHAPER_CALIBRATE` command can be also used to re-calibrate the input shaper in the future, especially if some changes to the printer that can affect its kinematics are made. One can either re-run the full calibration using `SHAPER_CALIBRATE` command, or restrict the auto-calibration to a single axis by supplying `AXIS=` parameter, like
ta: எதிர்காலத்தில் உள்ளீட்டு சேப்பரை மீண்டும் அளவீடு செய்ய `சேப்பர்_லிபிரேட்` கட்டளை பயன்படுத்தப்படலாம், குறிப்பாக அதன் இயக்கவியலைப் பாதிக்கக்கூடிய அச்சுப்பொறியில் சில மாற்றங்கள் செய்யப்பட்டால். `சேப்பர்_லிப்ரேட்` கட்டளையைப் பயன்படுத்தி முழு அளவுத்திருத்தத்தை மீண்டும் இயக்கலாம், அல்லது` அச்சு = `அளவுருவை வழங்குவதன் மூலம் தானாக அளவுத்திருத்தத்தை ஒற்றை அச்சுக்கு கட்டுப்படுத்தலாம்

source: Also, due to some noise in measurements, it is possible that the tuning results will be slightly different from one calibration run to another one. Still, it is not expected that the noise will affect the print quality too much. However, it is still advised to double-check the suggested parameters, and print some test prints before using them to confirm they are good.
ta: மேலும், அளவீடுகளில் சில ஒலி காரணமாக, ட்யூனிங் முடிவுகள் ஒரு அளவுத்திருத்தத்திலிருந்து மற்றொரு அளவிற்கு சற்று வித்தியாசமாக இருக்கும். இருப்பினும், ஒலி அச்சுத் தரத்தை அதிகம் பாதிக்கும் என்று எதிர்பார்க்கப்படவில்லை. இருப்பினும், பரிந்துரைக்கப்பட்ட அளவுருக்களை இருமுறை சரிபார்க்கவும், சில சோதனை அச்சிட்டுகளை அவற்றைப் பயன்படுத்துவதற்கு முன்பு அவை நல்லவை என்பதை உறுதிப்படுத்தவும் அறிவுறுத்தப்படுகிறது.

source: Offline processing of the accelerometer data
ta: முடுக்கமானி தரவின் இணைப்பில்லாத செயலாக்கம்

source: It is possible to generate the raw accelerometer data and process it offline (e.g. on a host machine), for example to find resonances. In order to do so, run the following commands via Octoprint terminal:
ta: மூல முடுக்கமானி தரவை உருவாக்கி அதை ஆஃப்லைனில் செயலாக்க முடியும் (எ.கா. ஒரு புரவலன் கணினியில்), எடுத்துக்காட்டாக அதிர்வுகளைக் கண்டறிய. அவ்வாறு செய்ய, பின்வரும் கட்டளைகளை ஆக்டோப்ரிண்ட் டெர்மினல் வழியாக இயக்கவும்:

source: ignoring any errors for `SET_INPUT_SHAPER` command. For `TEST_RESONANCES` command, specify the desired test axis. The raw data will be written into `/tmp` directory on the RPi.
ta: `set_input_shaper` கட்டளைக்கான ஏதேனும் பிழைகள் புறக்கணித்தல். `Test_resonances` கட்டளைக்கு, விரும்பிய சோதனை அச்சைக் குறிப்பிடவும். மூல தரவு RPI இல் `/tmp` கோப்பகத்தில் எழுதப்படும்.
