Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/OctoPrint.po
Languages: de, ta, zh_hans

source: OctoPrint for Klipper
de: OctoPrint für Klipper
ta: பாறைகளுக்கான ஆக்டோபிரிண்ட்

source: Klipper has a few options for its front ends, Octoprint was the first and original front end for Klipper. This document will give a brief overview of installing with this option.
de: Klipper hat ein paar Optionen für sein Frontend, OctoPrint war das erste und originale Frontend für Klipper. Dieses Dokument gibt eine kurze Übersicht über das Installieren mit dieser Option.
ta: கிளிப்பர் அதன் முன் முனைகளுக்கு சில விருப்பங்களைக் கொண்டுள்ளது, ஆக்டோபிரிண்ட் கிளிப்பருக்கு முதல் மற்றும் அசல் முன் இறுதியில் இருந்தது. இந்த ஆவணம் இந்த விருப்பத்துடன் நிறுவுவதற்கான சுருக்கமான கண்ணோட்டத்தை வழங்கும்.
zh_hans: Klipper 有几个不同的前端选择，Octoprint 是最早也是最原始的Klipper 前端。这篇文档会给一个大致的概览关于如何在Octoprint 上安装Klipper。

source: Install with OctoPi
de: Mit OctoPi installieren
ta: ஆக்டோபியுடன் நிறுவவும்
zh_hans: 在OctoPi 上进行安装

source: Start by installing [OctoPi](https://github.com/guysoft/OctoPi) on the Raspberry Pi computer. Use OctoPi v0.17.0 or later - see the [OctoPi releases](https://github.com/guysoft/OctoPi/releases) for release information.
de: Beginnen Sie mit der Installation von [OctoPi](https://github.com/guysoft/OctoPi) auf dem Raspberry Pi. Benutzen Sie OctoPi v0.17.0 oder neuer - sehen Sie [OctoPi releases](https://github.com/guysoft/OctoPi/releases) für Information über Releases.
ta: ராச்பெர்ரி பை கணினியில் [ஆக்டோபி] (https://github.com/guysoft/octopi) ஐ நிறுவுவதன் மூலம் தொடங்கவும். வெளியீட்டு தகவலுக்கு ஆக்டோபி V0.17.0 அல்லது அதற்குப் பிறகு [ஆக்டோபி வெளியீடுகள்] (https://github.com/guysoft/octopi/relaes) ஐப் பார்க்கவும்.
zh_hans: 首先在 Raspberry Pi 上安装 [OctoPi](https://github.com/guysoft/OctoPi)。使用 OctoPi v0.17.0 或更高版本 - 有关版本信息，请参考 [OctoPi release](https://github.com/guysoft/OctoPi/releases)。

source: One should verify that OctoPi boots and that the OctoPrint web server works. After connecting to the OctoPrint web page, follow the prompt to upgrade OctoPrint if needed.
de: Man sollte sicherstellen, dass der OctoPi hochfährt und der OctoPrint-Webserver funktioniert. Nachdem Sie sich mit der OctoPrint-Webseite verbunden haben, folgen Sie, wenn nötig, der Anweisung, OctoPrint zu aktualisieren.
ta: ஆக்டோபி பூட்ச் என்பதையும், ஆக்டோபிரிண்ட் வலை சேவையகம் செயல்படுவதையும் ஒருவர் சரிபார்க்க வேண்டும். ஆக்டோப்ரின்ட் வலைப்பக்கத்துடன் இணைந்த பிறகு, தேவைப்பட்டால் ஆக்டோப்ரோண்டை மேம்படுத்த வரியில் பின்தொடரவும்.
zh_hans: 需要确认OctoPi 正常启动并且OctoPrint 网页服务器正常工作。当连接到OctoPrint网页后，根据提示更新OctoPrint。

source: After installing OctoPi and upgrading OctoPrint, it will be necessary to ssh into the target machine to run a handful of system commands.
de: Nach der Installation und dem Upgrade von OctoPi wird es nötig sein, in das Zielgerät zu SSHen und eine Handvoll Systembefehle auszuführen.
ta: ஆக்டோபியை நிறுவி, ஆக்டோபிரிண்ட்டை மேம்படுத்திய பிறகு, ஒரு சில கணினி கட்டளைகளை இயக்க இலக்கு இயந்திரத்தில் பாஓடு க்கு தேவை.
zh_hans: 当安装完成OctoPi 并且更新完成OctoPrint 后，使用ssh 进入目标机器运行一些系统命令是有必要的。

source: Start by running these commands on your host device:
de: Beginnen Sie, indem Sie diese Befehle auf dem Host-Gerät ausführen:
ta: உங்கள் புரவலன் சாதனத்தில் இந்த கட்டளைகளை இயக்குவதன் மூலம் தொடங்கவும்:
zh_hans: 现在来在你的Host 设备上运行这些指令：

source: **If you do not have git installed, please do so with:**
de: **Wenn Sie git nicht installiert haben, tun Sie das bitte mit:**
ta: ** உங்களிடம் அறிவிலி நிறுவப்படவில்லை என்றால், தயவுசெய்து அவ்வாறு செய்யுங்கள்: **
zh_hans: **如果你没有安装git，你需要使用以下命令进行安装：**

source: then proceed:
de: dann fortfahren:
ta: பின்னர் தொடரவும்:
zh_hans: 然后使用以下命令：

source: cd ~ git clone https://github.com/Klipper3d/klipper ./klipper/scripts/install-octopi.sh
ta: cd ~ git நகலி https://github.com/klipper3d/klipper ./klipper/scripts/install-octopi.sh

source: The above will download Klipper, install the needed system dependencies, setup Klipper to run at system startup, and start the Klipper host software. It will require an internet connection and it may take a few minutes to complete.
de: Das Obenstehende wird Klipper herunterladen, die notwendigen Systemabhängigkeiten installieren, Klipper aufsetzen, sodass es beim Hochfahren startet und die Klipper Host-Software starten. Es benötigt eine Internetverbindung und kann ein paar Minuten zum Fertigstellen brauchen.
ta: மேலே உள்ளவை கிளிப்பரைப் பதிவிறக்குகின்றன, தேவையான கணினி சார்புகளை நிறுவும், கணினி தொடக்கத்தில் இயங்க கிளிப்பரை அமைக்கவும், கிளிப்பர் புரவலன் மென்பொருளைத் தொடங்கும். இதற்கு இணைய இணைப்பு தேவைப்படும், மேலும் இது முடிக்க சில நிமிடங்கள் ஆகலாம்.
zh_hans: 以上命令会下载Klipper，并且安装必要的系统依赖，配置Klipper 在系统启动时运行，以及启动Klipper Host 软件。这些操作会需要互联网连接并且可能需要几分钟来完成。

source: Installing with KIAUH
de: Installation mit KIAUH
ta: கியாவுடன் நிறுவுகிறது
zh_hans: 使用KIAUH进行安装

source: KIAUH can be used to install OctoPrint on a variety of Linux based systems that run a form of Debian. More information can be found at https://github.com/dw-0/kiauh
de: KIAUH kann verwendet werden, um OctoPrint auf einer Vielzahl an Linux-Systemen zu installieren, die auf einer Form von Debian laufen. Mehr Informationen können unter https://github.com/dw-0/kiauh gefunden werden
ta: டெபியனின் வடிவத்தை இயக்கும் பல்வேறு லினக்ச் அடிப்படையிலான அமைப்புகளில் ஆக்டோபிரிண்ட் நிறுவ கியாவைப் பயன்படுத்தலாம். மேலும் தகவல்களை https://github.com/dw-0/kiauh இல் காணலாம்
zh_hans: KIAUH 可以用来在各种基于Debian Linux 发行版上安装 OctoPrint。更多的使用细节可以在 https://github.com/dw-0/kiauh 找到

source: Configuring OctoPrint to use Klipper
de: Konfiguration von OctoPrint zur Nutzung mit Klipper
ta: கிளிப்பரைப் பயன்படுத்த ஆக்டோப்ரின்ட்டை கட்டமைத்தல்
zh_hans: 配置OctoPrint 去使用Klipper

source: The OctoPrint web server needs to be configured to communicate with the Klipper host software. Using a web browser, login to the OctoPrint web page and then configure the following items:
de: Der OctoPrint-Webserver muss konfiguriert werden, um mit der Klipper Host-Software zu kommunizieren. Loggen Sie sich mit einem Webbrowser auf der OctoPrint-Website ein und konfigurieren Sie die folgenden Einträge:
ta: கிளிப்பர் புரவலன் மென்பொருளுடன் தொடர்பு கொள்ள ஆக்டோப்ரோண்ட் வலை சேவையகத்தை கட்டமைக்க வேண்டும். வலை உலாவியைப் பயன்படுத்தி, ஆக்டோப்ரிண்ட் வலைப்பக்கத்தில் உள்நுழைந்து பின்வரும் உருப்படிகளை உள்ளமைக்கவும்:
zh_hans: OctoPrint 网页服务器需要配置和Klipper Host 软件的连接。使用浏览器登录到 OctoPrint 网页并且配置以下内容：

source: Navigate to the Settings tab (the wrench icon at the top of the page). Under "Serial Connection" in "Additional serial ports" add:
ta: அமைப்புகள் தாவலுக்கு செல்லவும் (பக்கத்தின் மேலே உள்ள குறடு ஐகான்). "கூடுதல் தொடர் துறைமுகங்கள்" இல் "தொடர் இணைப்பு" இன் கீழ் சேர்:
zh_hans: 浏览到设置界面（在网页顶部的扳手图标）。在"Serial Connection" 下的 "Additional serial ports" 添加：

source: ~/printer_data/comms/klippy.sock
ta: ~/அச்சுப்பொறி_டேட்டா/காம்ச்/கிளிப்பி.சாக்

source: Then click "Save".
ta: பின்னர் "சேமி" என்பதைக் சொடுக்கு செய்க.
zh_hans: 然后点击"保存"。

source: *In some older setups this address may be `/tmp/printer`*
de: *In einigen älteren Setups kann diese Adresse `/tmp/printer` sein*
ta: *சில பழைய அமைப்புகளில் இந்த முகவரி `/tmp/அச்சுப்பொறி`*ஆக இருக்கலாம்
zh_hans: *在比较老的配置中这个地址可能是 `/tmp/printer`*

source: Enter the Settings tab again and under "Serial Connection" change the "Serial Port" setting to the one added above.
ta: அமைப்புகள் தாவலை மீண்டும் உள்ளிடவும், "சீரியல் இணைப்பு" இன் கீழ் "சீரியல் துறைமுகம்" அமைப்பை மேலே சேர்க்கப்பட்டதை மாற்றவும்.
zh_hans: 再次进入设置界面中的 "Serial Connection" 更改 "Serial Port" 设置到上面添加的。

source: In the Settings tab, navigate to the "Behavior" sub-tab and select the "Cancel any ongoing prints but stay connected to the printer" option. Click "Save".
de: Navigieren Sie im Einstellungstab zum „Behavior“ Untertab und wählen Sie die Option „Cancel any ongoing prints but stay connected to the printer“. Klicken Sie „Speichern“.
ta: அமைப்புகள் தாவலில், "நடத்தை" துணை தாவலுக்கு செல்லவும், "நடந்துகொண்டிருக்கும் எந்த அச்சிட்டுகளையும் ரத்துசெய், ஆனால் அச்சுப்பொறியுடன் இணைந்திருங்கள்" விருப்பத்தைத் தேர்ந்தெடுக்கவும். "சேமி" என்பதைக் சொடுக்கு செய்க.
zh_hans: 在设置界面浏览到 "Behavior" 子菜单并且选择 "Cancel any ongoing prints but stay connected to the printer" 的选项。并且点击"保存"。

source: From the main page, under the "Connection" section (at the top left of the page) make sure the "Serial Port" is set to the new additional one added and click "Connect". (If it is not in the available selection then try reloading the page.)
ta: முதன்மையான பக்கத்திலிருந்து, "இணைப்பு" பிரிவின் கீழ் (பக்கத்தின் மேல் இடதுபுறத்தில்) "சீரியல் துறைமுகம்" புதிய கூடுதல் ஒன்றுக்கு அமைக்கப்பட்டிருப்பதை உறுதிசெய்து "இணைக்கவும்" என்பதைக் சொடுக்கு செய்க. (இது கிடைக்கக்கூடிய தேர்வில் இல்லாவிட்டால், பக்கத்தை மீண்டும் ஏற்ற முயற்சிக்கவும்.)
zh_hans: 在主界面的 "Connection" 下面（在界面的左上角）确定 "Serial Port" 被选择并且点击 "Connect"。（如果没有可选的可以尝试刷新界面。）

source: Once connected, navigate to the "Terminal" tab and type "status" (without the quotes) into the command entry box and click "Send". The terminal window will likely report there is an error opening the config file - that means OctoPrint is successfully communicating with Klipper.
de: Sobald Sie verbunden sind, navigieren Sie zum „Terminal“-Tab und geben sie „status“ (ohne die Anführungszeichen) in die Befehlseingabe und klicken Sie auf „Senden“. Das Terminal-Fenster wird wahrscheinlich melden, dass es einen Fehler beim Öffnen der Konfigurationsdatei gibt - das bedeutet, dass OctoPrint erfolgreich mit Klipper kommuniziert.
ta: இணைந்ததும், "முனையம்" தாவலுக்குச் சென்று "நிலை" (மேற்கோள்கள் இல்லாமல்) கட்டளை நுழைவு பெட்டியில் தட்டச்சு செய்து "அனுப்பு" என்பதைக் சொடுக்கு செய்க. கட்டமைப்பு கோப்பைத் திறப்பதில் பிழை இருப்பதாக முனைய சாளரம் புகாரளிக்கும் - அதாவது ஆக்டோபிரிண்ட் வெற்றிகரமாக கிளிப்பருடன் தொடர்பு கொள்கிறது.
zh_hans: 当成功连接，选择"Terminal" 窗口并且输入"status"（不要有括号）到命令行窗口中并且点击"Send"。命令行窗口很大的可能会显示缺少配置文件 - 这意味着OctoPrint 成功上了 Klipper。

source: Please proceed to <Installation.md> and the *Building and flashing the micro-controller* section
de: Bitte fahren Sie mit <Installation.md> und der Sektion *Building and flashing the micro-controller* fort
ta: தயவுசெய்து <இன்ச்டாலேசன்.எம்டி> மற்றும் * மைக்ரோ-கன்ட்ரோலர் * பிரிவைக் கட்டியெழுப்பவும் ஒளிரச் செய்யவும்
zh_hans: 接下来继续 <Installation.md>的 *Building and flashing the micro-controller*部分
