Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Overview.po
Languages: pt, ta

source: Welcome to the Klipper documentation. If new to Klipper, start with the [features](Features.md) and [installation](Installation.md) documents.
pt: Bem- vindo a documentação do Klipper, comece com os documentos [features](Features.md) e [installation](Installation.md) .
ta: கிளிப்பர் ஆவணத்திற்கு வருக. கிளிப்பருக்கு புதியதாக இருந்தால், [அம்சங்கள்] (அம்சங்கள். எம்.டி) மற்றும் [நிறுவல்] (நிறுவல்.எம்டி) ஆவணங்களுடன் தொடங்கவும்.

source: Overview information
pt: Visão geral
ta: கண்ணோட்டம் செய்தி

source: [Features](Features.md): A high-level list of features in Klipper.
pt: [Funcionalidades](Features.md) Uma lista de alto nível das funcionalidades do Klipper.
ta: [அம்சங்கள்] (அம்சங்கள். எம்.டி): கிளிப்பரில் அம்சங்களின் உயர் மட்ட பட்டியல்.

source: [FAQ](FAQ.md): Frequently asked questions.
pt: [FAQ](FAQ.md): Questões frequentes perguntadas.
ta: [கேள்விகள்] (கேள்விகள்): அடிக்கடி கேட்கப்படும் கேள்விகள்.

source: [Releases](Releases.md): The history of Klipper releases.
pt: [Versões](Releases.md): Histórico de versões do Klipper.
ta: [வெளியீடுகள்] (வெளியீடுகள். எம்.டி): கிளிப்பர் வெளியீடுகளின் வரலாறு.

source: [Config changes](Config_Changes.md): Recent software changes that may require users to update their printer config file.
pt: [Alterações de Configuração](Config_Changes.md): Atualizações recentes ao software que podem precisar que os utilizadores atualizem o ficheiro de configuração da sua impressora.
ta: [கட்டமைப்பு மாற்றங்கள்] (கட்டமைப்பு மாற்றங்கள். மற்றும்): பயனர்கள் தங்கள் அச்சுப்பொறி கட்டமைப்பு கோப்பைப் புதுப்பிக்க வேண்டிய அண்மைக் கால மென்பொருள் மாற்றங்கள்.

source: [Contact](Contact.md): Information on bug reporting and general communication with the Klipper developers.
pt: [Contactos](Contact.md): Informação sobre denúncia de bugs e comunicação geral com os desenvolvedores do Klipper.
ta: [தொடர்பு] (தொடர்பு.

source: [Installation](Installation.md): Guide to installing Klipper.
pt: [Instalação](Installation.md): Guia de instalação do Klipper.
ta: [நிறுவல்] (Installation.md): கிளிப்பரை நிறுவுவதற்கான வழிகாட்டி.

source: [Config Reference](Config_Reference.md): Description of config parameters.
pt: [Referência de configuração](Config_Reference.md): Descrição de parâmetros de configuração.
ta: [கட்டமைப்பு குறிப்பு] (config_reference.md): கட்டமைப்பு அளவுருக்களின் விளக்கம்.

source: [Rotation Distance](Rotation_Distance.md): Calculating the rotation_distance stepper parameter.
pt: [Rotation Distance](Rotation_Distance.md): Calculando o parâmetro stepper rotation_distance.
ta: [சுழற்சி தூரம்] (சுழற்சி_டிச்டன்ச்.

source: [Config checks](Config_checks.md): Verify basic pin settings in the config file.
pt: [Config checks](Config_checks.md): Verifique as configurações básicas dos pinos no arquivo de configuração.
ta: [கட்டமைப்பு காசோலைகள்] (config_checks.md): கட்டமைப்பு கோப்பில் அடிப்படை முள் அமைப்புகளை சரிபார்க்கவும்.

source: [Bed level](Bed_Level.md): Information on "bed leveling" in Klipper.
pt: [Bed level](Bed_Level.md): Informações sobre "nivelamento da mesa" no Klipper.
ta: [படுக்கை நிலை] (படுக்கை நிலை. மற்றும்): கிளிப்பரில் "படுக்கை சமன் செய்தல்" பற்றிய செய்தி.

source: [Delta calibrate](Delta_Calibrate.md): Calibration of delta kinematics.
pt: [Delta calibrate](Delta_Calibrate.md): Calibração de cinemática delta.
ta: [Delta calibrate](Delta_Calibrate.md): Calibration of டெல்டா kinematics.

source: [Probe calibrate](Probe_Calibrate.md): Calibration of automatic Z probes.
pt: [Calibração da sonda](Probe_Calibrate.md): Calibração de sondas automáticas Z.
ta: [ஆய்வு அளவீடு] (probe_calibrate.md): தானியங்கி சட் ஆய்வுகளின் அளவுத்திருத்தம்.

source: [BL-Touch](BLTouch.md): Configure a "BL-Touch" Z probe.
pt: [BL-Touch](BLTouch.md): Configure uma sonda Z "BL-Touch".
ta: [BL-Touch](BLTouch.md): Configure a "BL-Touch" சட் probe.

source: [Manual level](Manual_Level.md): Calibration of Z endstops (and similar).
pt: [Manual level](Manual_Level.md): Calibração de Z endstops (e similares). Endstops são os sensores de final de curso.
ta: [Manual level](Manual_Level.md): Calibration of சட் endstops (and similar).

source: [Bed Mesh](Bed_Mesh.md): Bed height correction based on XY locations.
pt: [Malha de cama](Bed_Mesh.md): Correção da altura da cama baseado em coordenadas XY.
ta: [படுக்கை கண்ணி] (BED_MESH.MD): XY இடங்களின் அடிப்படையில் படுக்கை உயர திருத்தம்.

source: [Endstop phase](Endstop_Phase.md): Stepper assisted Z endstop positioning.
pt: [Endstop phase](Endstop_Phase.md): Posicionamento do fim de curso Z assistido por motor de passo.
ta: [Endstop phase](Endstop_Phase.md): Stepper assisted சட் endstop positioning.

source: [Resonance compensation](Resonance_Compensation.md): A tool to reduce ringing in prints.
pt: [Resonance compensation](Resonance_Compensation.md): Uma ferramenta para reduzir o efeito "ringing" nas impressões.
ta: [அதிர்வு இழப்பீடு] (அதிர்வு_அம்பென்சேசன்.

source: [Measuring resonances](Measuring_Resonances.md): Information on using adxl345 accelerometer hardware to measure resonance.
pt: [Measuring resonances](Measuring_Resonances.md): Informações fornecidas pelo acelerômetro adxl345 para medir ressonância.
ta: [Measuring resonances](Measuring_Resonances.md): செய்தி on using adxl345 accelerometer வன்பொருள் பெறுநர் measure resonance.

source: [Pressure advance](Pressure_Advance.md): Calibrate extruder pressure.
pt: [Pressure advance](Pressure_Advance.md): Calibrar a pressão do extrusor.

source: [Slicers](Slicers.md): Configure "slicer" software for Klipper.
pt: [Slicers](Slicers.md): Configurar o software "slicer" para o Klipper.
ta: [Slicers](Slicers.md): Configure "slicer" software க்கு Klipper.

source: [Command Templates](Command_Templates.md): G-Code macros and conditional evaluation.
pt: [Modelos de comando](Command_Templates.md): Macros G-Code e avaliação condicional.
ta: [Command Templates](Command_Templates.md): G-Code பெரியவைகள் and conditional evaluation.

source: [Status Reference](Status_Reference.md): Information available to macros (and similar).
pt: [Referência de estado](Status_Reference.md): Informações disponíveis para macros (e similares).
ta: [Status Reference](Status_Reference.md): செய்தி available பெறுநர் பெரியவைகள் (and similar).

source: [TMC Drivers](TMC_Drivers.md): Using Trinamic stepper motor drivers with Klipper.
pt: [Controladores TMC](TMC_Drivers.md): Utilização de controladores de motor passo a passo Trinamic com Klipper.
ta: [TMC Drivers](TMC_Drivers.md): Using Trinamic stepper மின்னோடி drivers with Klipper.

source: [PWM tools](Using_PWM_Tools.md): Guide on how to use PWM controlled tools such as lasers or spindles.
pt: [Ferramentas PWM](Using_PWM_Tools.md): Guia sobre como utilizar ferramentas controladas por PWM, tais como lasers ou spindles.
ta: [PWM tools](Using_PWM_Tools.md): Guide on how பெறுநர் use PWM controlled கருவிகள் such அச் lasers or spindles.

source: [G-Codes](G-Codes.md): Information on commands supported by Klipper.
pt: [G-Codes](G-Codes.md): Informação sobre os comandos suportados pelo Klipper.
ta: [சி-குறியீடுகள்] (சி-கோட்ச்.எம்டி): கிளிப்பர் ஆதரிக்கும் கட்டளைகள் பற்றிய செய்தி.

source: Developer Documentation
pt: Documentação para programadores

source: [Code overview](Code_Overview.md): Developers should read this first.
pt: [Visão geral do código](Code_Overview.md): Os programadores devem ler isto primeiro.
ta: [குறியீடு கண்ணோட்டம்] (code_overview.md): உருவாக்குபவர்கள் இதை முதலில் படிக்க வேண்டும்.

source: [Kinematics](Kinematics.md): Technical details on how Klipper implements motion.
pt: [Cinemática](Kinematics.md): Detalhes técnicos sobre como o Klipper implementa o movimento.
ta: [இயக்கவியல்] (இயக்கவியல். எம்.டி): கிளிப்பர் இயக்கத்தை எவ்வாறு செயல்படுத்துகிறது என்பது குறித்த தொழில்நுட்ப விவரங்கள்.

source: [Protocol](Protocol.md): Information on the low-level messaging protocol between host and micro-controller.
pt: [Protocolo](Protocol.md): Informações sobre o protocolo de mensagens de baixo nível entre o anfitrião e o microcontrolador.
ta: [நெறிமுறை] (நெறிமுறை.

source: [API Server](API_Server.md): Information on Klipper's command and control API.
pt: [Servidor API](API_Server.md): Informação sobre a API de comando e controlo do Klipper.
ta: [API சேவையகம்] (API_SERVER.MD): கிளிப்பரின் கட்டளை மற்றும் கட்டுப்பாட்டு பநிஇ பற்றிய செய்தி.

source: [MCU commands](MCU_Commands.md): A description of low-level commands implemented in the micro-controller software.
pt: [Comandos MCU](MCU_Commands.md): Uma descrição dos comandos de baixo nível implementados no software do microcontrolador.
ta: [MCU commands](MCU_Commands.md): A விவரம் of low-level கட்டளைகள் implemented in the micro-controller software.

source: [CAN bus protocol](CANBUS_protocol.md): Klipper CAN bus message format.
pt: [Protocolo do bus CAN](CANBUS_protocol.md): Formato de mensagem do bus CAN da Klipper.
ta: [CAN bus protocol](CANBUS_protocol.md): Klipper CAN bus செய்தி format.

source: [Debugging](Debugging.md): Information on how to test and debug Klipper.
pt: [Depuração](Depuração.md): Informações sobre como testar e depurar o Klipper.
ta: [Debugging](Debugging.md): செய்தி on how பெறுநர் தேர்வு and debug Klipper.

source: [Benchmarks](Benchmarks.md): Information on the Klipper benchmark method.
pt: [Benchmarks](Benchmarks.md): Informações sobre o método de benchmark Klipper.
ta: [Benchmarks](Benchmarks.md): செய்தி on the Klipper benchmark method.

source: [Contributing](CONTRIBUTING.md): Information on how to submit improvements to Klipper.
pt: [Contribuir](CONTRIBUTING.md): Informação sobre como submeter melhorias ao Klipper.
ta: [பங்களிப்பு] (பங்களிப்பு. எம்.டி): கிளிப்பருக்கு மேம்பாடுகளை எவ்வாறு சமர்ப்பிப்பது என்பது குறித்த செய்தி.

source: [Packaging](Packaging.md): Information on building OS packages.
pt: [Empacotamento](Packaging.md): Informação sobre como criar pacotes de SO.
ta: [பேக்கேசிங்] (பேக்கேசிங்.எம்டி): OS தொகுப்புகளை உருவாக்குவது பற்றிய செய்தி.

source: Device Specific Documents
pt: Documentos de dispositivos específicos

source: [Example configs](Example_Configs.md): Information on adding an example config file to Klipper.
pt: [Configurações exemplo](Example_Configs.md): Informação sobre como adicionar um ficheiro de configuração exemplo ao Klipper.
ta: [Example configs](Example_Configs.md): செய்தி on adding an example கட்டமைப்பு கோப்பு பெறுநர் Klipper.

source: [SDCard Updates](SDCard_Updates.md): Flash a micro-controller by copying a binary to an sdcard in the micro-controller.
pt: [Atualizações por Cartão SD](SDCard_Updates.md): Escrever para um micro-controlador copiando um ficheiro binário para um cartão SD no micro-controlador.
ta: [SDCard Updates](SDCard_Updates.md): Flash a micro-controller by copying a இருமம் பெறுநர் an sdcard in the micro-controller.

source: [Raspberry Pi as Micro-controller](RPi_microcontroller.md): Details for controlling devices wired to the GPIO pins of a Raspberry Pi.
pt: [Raspberry Pi como um Micro-controlador](RPi_microcontroller.md): Detalhes sobre como controlar dispositivos ligados aos pinos GPIO de um Raspberry Pi.
ta: [Raspberry Pi அச் Micro-controller](RPi_microcontroller.md): Details க்கு controlling devices wired பெறுநர் the GPIO pins of a புற்றுப்பழம் Pi.

source: [Bootloaders](Bootloaders.md): Developer information on micro-controller flashing.
pt: [Bootloaders](Bootloaders.md): Informação para programadores sobre flashes de microcontroladores.
ta: [துவக்க ஏற்றி] (bootloader.md): மைக்ரோகண்ட்ரோலர் ஒளிரும் உருவாக்குபவர் செய்தி.

source: [CAN bus](CANBUS.md): Information on using CAN bus with Klipper.
pt: [CAN bus](CANBUS.md): Informações sobre a utilização do bus CAN com o Klipper.
ta: [CAN bus](CANBUS.md): செய்தி on using CAN bus with Klipper.

source: [TSL1401CL filament width sensor](TSL1401CL_Filament_Width_Sensor.md)
pt: [Sensor de largura do filamento TSL1401CL](TSL1401CL_Filament_Width_Sensor.md)
ta: [TSL1401CL தாள் width sensor](TSL1401CL_Filament_Width_Sensor.md)

source: Overview
pt: Visão geral
ta: கண்ணோட்டம்

source: Installation and Configuration
pt: Instalação e configuração

source: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing and probing using multiple micro-controllers.
pt: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing e sondagem utilizando vários microcontroladores.

source: [Skew correction](Skew_Correction.md): Adjustments for axes not perfectly square.
pt: [Correção de inclinação](Skew_Correction.md): Ajustes para eixos não perfeitamente quadrados.
ta: [Skew correction](Skew_Correction.md): Adjustments க்கு axes not perfectly square.

source: [Beaglebone](Beaglebone.md): Details for running Klipper on the Beaglebone PRU.
pt: [Beaglebone](Beaglebone.md): Detalhes para executar o Klipper no Beaglebone PRU.
ta: [Beaglebone](Beaglebone.md): Details க்கு running Klipper on the Beaglebone PRU.

source: [Hall filament width sensor](Hall_Filament_Width_Sensor.md)
pt: [Sensor de largura do filamento Hall](Hall_Filament_Width_Sensor.md)
ta: [Hall தாள் width sensor](Hall_Filament_Width_Sensor.md)

source: [Exclude Object](Exclude_Object.md): The guide to the Exclude Objects implementation.
pt: [Excluir Objeto](Exclude_Object.md): O guia para a implementação do Exclude Objects.
ta: [பொருளை விலக்கு] (விலக்கு_ஆப்செக்ட்.

source: [Axis Twist Compensation](Axis_Twist_Compensation.md): A tool to compensate for inaccurate probe readings due to twist in X gantry.
pt: [Compensação de torção do eixo](Axis_Twist_Compensation.md): Uma ferramenta para compensar leituras imprecisas da sonda devido à torção no pórtico X.
ta: [Axis Twist Compensation](Axis_Twist_Compensation.md): A கருவி பெறுநர் compensate க்கு inaccurate தேட்டி readings due பெறுநர் twist in ஃச் gantry.

source: [Bootloader Entry](Bootloader_Entry.md): Requesting the bootloader.
pt: [Entrada do Bootloader](Bootloader_Entry.md): Requesting the bootloader.

source: [CAN bus troubleshooting](CANBUS_Troubleshooting.md): Tips for troubleshooting CAN bus.
pt: [Resolução de problemas do bus CAN](CANBUS_Troubleshooting.md): Sugestões para a resolução de problemas do bus CAN.
ta: [பச் சரிசெய்தல் முடியும்] (பச் சரிசெய்தல் செய்யலாம்.

source: [Octoprint](OctoPrint.md): Guide to installing Octoprint with Klipper.
ta: [Octoprint](OctoPrint.md): Guide பெறுநர் installing Octoprint with Klipper.

source: [Eddy Current Inductive probe](Eddy_Probe.md)
ta: [எடி தற்போதைய தூண்டல் ஆய்வு] (EDDY_PROBE.MD)
