Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Packaging.po
Languages: tr, uk

source: Klipper is somewhat of a packaging anomaly among python programs, as it doesn't use setuptools to build and install. Some notes regarding how best to package it are as follows:
tr: Klipper, kurulum ve derleme için setuptools gibi araçları kullanmadığından, Python programları arasında paketleme açısından bir tür anormallik gösterir. Klipper'ı en iyi şekilde paketlemek için bazı notlar şunlardır:
uk: Klipper є дещо з упаковок аномалії серед програм python, оскільки він не використовує настройкиtools для створення та установки. Деякі ноти про те, як краще пакетувати його наступним чином:

source: C modules
tr: C modülleri
uk: C модулі

source: Klipper uses a C module to handle some kinematics calculations more quickly. This module needs to be compiled at packaging time to avoid introducing a runtime dependency on a compiler. To compile the C module, run `python2 klippy/chelper/__init__.py`.
tr: Klipper, bazı kinematik hesaplamaları daha hızlı gerçekleştirmek için bir C modülü kullanır. Derleyiciye çalışma zamanı bağımlılığının getirilmesini önlemek için bu modülün paketleme zamanında derlenmesi gerekir. C modülünü derlemek için 'python2 klippy/chelper/__init__.py' komutunu çalıştırın.
uk: Klipper використовує модуль C для обробки деяких кінематичних обчислень швидше. Цей модуль необхідно скомпільувати в часі пакування, щоб уникнути введення часової залежності від компілятора. Для компіляції модуля C `python2 klippy/chelper/__init__.py`.

source: Compiling python code
tr: Python kodu derleniyor
uk: Розрахунок python коду

source: Many distributions have a policy of compiling all python code before packaging to improve startup time. You can do this by running `python2 -m compileall klippy`.
tr: Çoğu dağıtım, başlatma süresini kısaltmak için tüm Python kodlarını paketlemeden önce derleme politikasına sahiptir. Bunu 'python2 -m compileall klippy' komutunu çalıştırarak yapabilirsiniz.
uk: Багато дистриб'юторів мають політику компіляції всіх python коду перед упаковкою для поліпшення часу запуску. Ви можете зробити це за допомогою запуску `python2 -m compileall klippy`.

source: Versioning
tr: Versiyon ayarlanıyor
uk: Редагування

source: If you are building a package of Klipper from git, it is usual practice not to ship a .git directory, so the versioning must be handled without git. To do this, use the script shipped in `scripts/make_version.py` which should be run as follows: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.
tr: Klipper paketini git ile oluşturuyorsanız sürüm oluşturma işleminin git olmadan yapılması gerekir. Bunu yapmak için, 'scripts/make_version.py' dosyasını şu betiği kullanarak çalıştırın: 'python2 scripts/make_version.py YOURDISTRONAME > klippy/.version'.
uk: Якщо ви будуєте пакет Кліппер з git, це звичайна практика не доставити каталог .git, тому версія повинна бути оброблена без git. Щоб зробити це, скористайтеся скриптом, що поставляється в `scripts/make_version.py`, який слід запустити наступним чином: `python2 `.

source: Sample packaging script
tr: Örnek pakerleme betiği
uk: Скрипт упаковки зразка

source: Packaging Klipper
tr: Klipper paketleniyor
uk: Упаковка Клиппер

source: klipper-git is packaged for Arch Linux, and has a PKGBUILD (package build script) available at [Arch User Repository](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
tr: Klipper-git Arch Linux için paketlendi. PKGBUILD (yapı betiği), [Arch User Repository](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git)'de bulunabilir.
uk: klipper-git упакована для Arch Linux, і має скрипт PKGBUILD (складання пакетів) доступний на [Arch User Repository](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
