Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Pressure_Advance.po
Languages: ta

source: This document provides information on tuning the "pressure advance" configuration variable for a particular nozzle and filament. The pressure advance feature can be helpful in reducing ooze. For more information on how pressure advance is implemented see the [kinematics](Kinematics.md) document.
ta: இந்த ஆவணம் ஒரு குறிப்பிட்ட முனை மற்றும் இழைகளுக்கான "பிரசர் அட்வான்ச்" உள்ளமைவு மாறியை சரிசெய்வது பற்றிய தகவல்களை வழங்குகிறது. அழுத்த முன்கூட்டியே நற்பொருத்தம் OSE ஐக் குறைக்க உதவியாக இருக்கும். அழுத்தம் முன்கூட்டியே எவ்வாறு செயல்படுத்தப்படுகிறது என்பது பற்றிய கூடுதல் தகவலுக்கு, [இயக்கவியல்] (இயக்கவியல்] (இயக்கவியல்.எம்டி) ஆவணத்தைப் பார்க்கவும்.

source: Tuning pressure advance
ta: அழுத்தம் முன்கூட்டியே ட்யூனிங்

source: Pressure advance does two useful things - it reduces ooze during non-extrude moves and it reduces blobbing during cornering. This guide uses the second feature (reducing blobbing during cornering) as a mechanism for tuning.
ta: பிரசர் அட்வான்ச் இரண்டு பயனுள்ள விசயங்களைச் செய்கிறது - இது வெளியேற்றமற்ற நகர்வுகளின் போது ஓசைக் குறைக்கிறது மற்றும் இது மூலைவிட்டத்தின் போது குமிழியைக் குறைக்கிறது. இந்த வழிகாட்டி இரண்டாவது அம்சத்தை (மூலைவிட்டத்தின் போது குமிழியைக் குறைத்தல்) டியூனிங்கிற்கான ஒரு பொறிமுறையாக பயன்படுத்துகிறது.

source: In order to calibrate pressure advance the printer must be configured and operational as the tuning test involves printing and inspecting a test object. It is a good idea to read this document in full prior to running the test.
ta: அழுத்தம் முன்னேற்றத்தை அளவீடு செய்ய அச்சுப்பொறி கட்டமைக்கப்பட்டு செயல்பட வேண்டும், ஏனெனில் ட்யூனிங் சோதனையில் ஒரு சோதனை பொருளை அச்சிடுவதும் ஆய்வு செய்வதும் அடங்கும். சோதனையை இயக்குவதற்கு முன்பு இந்த ஆவணத்தை முழுமையாகப் படிப்பது நல்லது.

source: Use a slicer to generate g-code for the large hollow square found in [docs/prints/square_tower.stl](prints/square_tower.stl). Use a high speed (eg, 100mm/s), zero infill, and a coarse layer height (the layer height should be around 75% of the nozzle diameter). Make sure any "dynamic acceleration control" is disabled in the slicer.
ta: [டாக்ச்/பிரிண்ட்ச்/சதுர_டவர்.எச்.டி.எல்] (அச்சிட்டு/சதுர_டவர்.எச்.டி.எல்) இல் காணப்படும் பெரிய வெற்று சதுரத்திற்கு சி-குறியீட்டை உருவாக்க ஒரு ச்லைசரைப் பயன்படுத்தவும். அதிவேக (எ.கா., 100 மிமீ/வி), சுழிய நிரப்புதல் மற்றும் ஒரு கரடுமுரடான அடுக்கு உயரம் (அடுக்கு உயரம் முனை விட்டம் 75% ஆக இருக்க வேண்டும்) பயன்படுத்தவும். ச்லைசரில் எந்த "மாறும் முடுக்கம் கட்டுப்பாடு" முடக்கப்பட்டுள்ளது என்பதை உறுதிப்படுத்தவும்.

source: Prepare for the test by issuing the following G-Code command:
ta: பின்வரும் சி-குறியீட்டு கட்டளையை வழங்குவதன் மூலம் சோதனைக்குத் தயாராகுங்கள்:

source: This command makes the nozzle travel slower through corners to emphasize the effects of extruder pressure. Then for printers with a direct drive extruder run the command:
ta: எக்ச்ட்ரூடர் அழுத்தத்தின் விளைவுகளை வலியுறுத்துவதற்காக இந்த கட்டளை முனை பயணத்தை மூலைகள் வழியாக மெதுவாக ஆக்குகிறது. டைரக்ட் இயக்கி எக்ச்ட்ரூடர் கொண்ட அச்சுப்பொறிகளுக்கு கட்டளையை இயக்கவும்:

source: For long bowden extruders use:
ta: நீண்ட போடன் எக்ச்ட்ரூடர்கள் பயன்படுத்த:

source: Then print the object. When fully printed the test print looks like:
ta: பின்னர் பொருளை அச்சிடுங்கள். முழுமையாக அச்சிடும்போது சோதனை அச்சு போல் தெரிகிறது:

source: The above TUNING_TOWER command instructs Klipper to alter the pressure_advance setting on each layer of the print. Higher layers in the print will have a larger pressure advance value set. Layers below the ideal pressure_advance setting will have blobbing at the corners, and layers above the ideal setting can lead to rounded corners and poor extrusion leading up to the corner.
ta: மேலே உள்ள ட்யூனிங்_டவர் கட்டளை அச்சின் ஒவ்வொரு அடுக்கிலும் பிரசர்_அட்வன்ச் அமைப்பை மாற்ற கிளிப்பருக்கு அறிவுறுத்துகிறது. அச்சில் அதிக அடுக்குகள் ஒரு பெரிய அழுத்த முன்கூட்டியே மதிப்பு தொகுப்பைக் கொண்டிருக்கும். சிறந்த அழுத்தம்_அட்வன்ச் அமைப்பிற்குக் கீழே உள்ள அடுக்குகள் மூலைகளில் குமிழ்ந்துவிடும், மேலும் சிறந்த அமைப்பிற்கு மேலே உள்ள அடுக்குகள் வட்டமான மூலைகளுக்கும், மூலையில் செல்லும் மோசமான வெளியேற்றத்திற்கும் வழிவகுக்கும்.

source: One can cancel the print early if one observes that the corners are no longer printing well (and thus one can avoid printing layers that are known to be above the ideal pressure_advance value).
ta: மூலைகள் இனி நன்றாக அச்சிடவில்லை என்பதை ஒருவர் கவனித்தால் ஒருவர் ஆரம்பத்தில் அச்சிடலை ரத்து செய்யலாம் (இதனால் சிறந்த அழுத்தம்_அட்வன்ச் மதிப்புக்கு மேலே இருப்பதாக அறியப்படும் அடுக்குகளை அச்சிடுவதைத் தவிர்க்கலாம்).

source: Inspect the print and then use a digital calipers to find the height that has the best quality corners. When in doubt, prefer a lower height.
ta: அச்சிடலை ஆய்வு செய்து, பின்னர் சிறந்த தரமான மூலைகளைக் கொண்ட உயரத்தைக் கண்டறிய டிசிட்டல் காலிப்பர்களைப் பயன்படுத்தவும். ஐயம் இருக்கும்போது, குறைந்த உயரத்தை விரும்புங்கள்.

source: The pressure_advance value can then be calculated as `pressure_advance = <start> + <measured_height> * <factor>`. (For example, `0 + 12.90 * .020` would be `.258`.)
ta: PRESSER_ADVANCE மதிப்பை `Pression_advance = <start> + <அளவிடப்பட்ட_ஐட்> * <காரணி>` என கணக்கிடலாம். (எடுத்துக்காட்டாக, `0 + 12.90 * .020`` .258` ஆக இருக்கும்.)

source: It is possible to choose custom settings for START and FACTOR if that helps identify the best pressure advance setting. When doing this, be sure to issue the TUNING_TOWER command at the start of each test print.
ta: சிறந்த அழுத்தம் முன்கூட்டியே அமைப்பை அடையாளம் காண உதவினால், தொடக்க மற்றும் காரணிக்கான தனிப்பயன் அமைப்புகளைத் தேர்வுசெய்ய முடியும். இதைச் செய்யும்போது, ஒவ்வொரு சோதனை அச்சின் தொடக்கத்திலும் ட்யூனிங்_டவர் கட்டளையை வழங்க மறக்காதீர்கள்.

source: Typical pressure advance values are between 0.050 and 1.000 (the high end usually only with bowden extruders). If there is no significant improvement with a pressure advance up to 1.000, then pressure advance is unlikely to improve the quality of prints. Return to a default configuration with pressure advance disabled.
ta: வழக்கமான அழுத்த முன்கூட்டியே மதிப்புகள் 0.050 முதல் 1.000 வரை இருக்கும் (உயர் இறுதியில் பொதுவாக போடன் எக்ச்ட்ரூடர்களுடன் மட்டுமே). 1.000 வரை அழுத்தம் முன்னேற்றத்துடன் குறிப்பிடத்தக்க முன்னேற்றம் இல்லை என்றால், அழுத்த முன்கூட்டியே அச்சிட்டுகளின் தரத்தை மேம்படுத்த வாய்ப்பில்லை. அழுத்தம் முன்கூட்டியே முடக்கப்பட்டுள்ள இயல்புநிலை உள்ளமைவுக்குத் திரும்புக.

source: Although this tuning exercise directly improves the quality of corners, it's worth remembering that a good pressure advance configuration also reduces ooze throughout the print.
ta: இந்த ட்யூனிங் உடற்பயிற்சி நேரடியாக மூலைகளின் தரத்தை மேம்படுத்துகிறது என்றாலும், ஒரு நல்ல அழுத்த முன்கூட்டியே உள்ளமைவும் அச்சு முழுவதும் ஓசைக் குறைக்கிறது என்பதை நினைவில் கொள்வது மதிப்பு.

source: At the completion of this test, set `pressure_advance = <calculated_value>` in the `[extruder]` section of the configuration file and issue a RESTART command. The RESTART command will clear the test state and return the acceleration and cornering speeds to their normal values.
ta: இந்த சோதனையின் முடிவில், `[எக்ச்ட்ரூடர்]` உள்ளமைவு கோப்பின் பிரிவில் `pression_advance = <colatical_value>` ஐ அமைத்து மறுதொடக்கம் கட்டளையை வழங்கவும். மறுதொடக்கம் கட்டளை சோதனை நிலையை அழித்து, முடுக்கம் மற்றும் மூலைவிட்ட வேகத்தை அவற்றின் இயல்பான மதிப்புகளுக்கு திருப்பித் தரும்.

source: Important Notes
ta: முக்கியமான குறிப்புகள்

source: The pressure advance value is dependent on the extruder, the nozzle, and the filament. It is common for filament from different manufactures or with different pigments to require significantly different pressure advance values. Therefore, one should calibrate pressure advance on each printer and with each spool of filament.
ta: அழுத்தம் முன்கூட்டியே மதிப்பு எக்ச்ட்ரூடர், முனை மற்றும் இழை ஆகியவற்றைப் பொறுத்தது. வெவ்வேறு உற்பத்திகளிலிருந்து அல்லது வெவ்வேறு நிறமிகளுடன் இழுப்பதற்கு இது பொதுவானது. எனவே, ஒவ்வொரு அச்சுப்பொறியிலும் மற்றும் ஒவ்வொரு இழைகளின் ஒவ்வொரு ச்பூலிலும் அழுத்தம் முன்னேற்றத்தை அளவிட வேண்டும்.

source: Printing temperature and extrusion rates can impact pressure advance. Be sure to tune the [extruder rotation_distance](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) and [nozzle temperature](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature) prior to tuning pressure advance.
ta: அச்சிடும் வெப்பநிலை மற்றும் வெளியேற்ற விகிதங்கள் அழுத்தம் முன்கூட்டியே பாதிக்கும். .

source: The test print is designed to run with a high extruder flow rate, but otherwise "normal" slicer settings. A high flow rate is obtained by using a high printing speed (eg, 100mm/s) and a coarse layer height (typically around 75% of the nozzle diameter). Other slicer settings should be similar to their defaults (eg, perimeters of 2 or 3 lines, normal retraction amount). It can be useful to set the external perimeter speed to be the same speed as the rest of the print, but it is not a requirement.
ta: சோதனை அச்சு அதிக எக்ச்ட்ரூடர் ஓட்ட விகிதத்துடன் இயக்க வடிவமைக்கப்பட்டுள்ளது, ஆனால் இல்லையெனில் "சாதாரண" ச்லைசர் அமைப்புகள். அதிக அச்சிடும் விரைவு (எ.கா., 100 மிமீ/வி) மற்றும் கரடுமுரடான அடுக்கு உயரம் (பொதுவாக முனை விட்டம் 75%) பயன்படுத்துவதன் மூலம் அதிக ஓட்ட விகிதம் பெறப்படுகிறது. பிற ச்லைசர் அமைப்புகள் அவற்றின் இயல்புநிலைகளுக்கு ஒத்ததாக இருக்க வேண்டும் (எ.கா., 2 அல்லது 3 வரிகளின் சுற்றளவு, சாதாரண பின்வாங்கல் அளவு). வெளிப்புற சுற்றளவு வேகத்தை மீதமுள்ள அச்சின் அதே வேகமாக அமைப்பது பயனுள்ளதாக இருக்கும், ஆனால் அது தேவையில்லை.

source: It is common for the test print to show different behavior on each corner. Often the slicer will arrange to change layers at one corner which can result in that corner being significantly different from the remaining three corners. If this occurs, then ignore that corner and tune pressure advance using the other three corners. It is also common for the remaining corners to vary slightly. (This can occur due to small differences in how the printer's frame reacts to cornering in certain directions.) Try to choose a value that works well for all the remaining corners. If in doubt, prefer a lower pressure advance value.
ta: சோதனை அச்சு ஒவ்வொரு மூலையிலும் வெவ்வேறு நடத்தைகளைக் காண்பிப்பது பொதுவானது. பெரும்பாலும் ச்லைசர் ஒரு மூலையில் அடுக்குகளை மாற்ற ஏற்பாடு செய்யும், இதன் விளைவாக அந்த மூலையில் மீதமுள்ள மூன்று மூலைகளிலிருந்து கணிசமாக வேறுபடுகிறது. இது ஏற்பட்டால், அந்த மூலையை புறக்கணித்து மற்ற மூன்று மூலைகளைப் பயன்படுத்தி அழுத்தம் முன்னேற்றத்தை டியூன் செய்யுங்கள். மீதமுள்ள மூலைகள் சற்று மாறுபடுவதும் பொதுவானது. (அச்சுப்பொறியின் சட்டகம் சில திசைகளில் மூலைவிட்டத்திற்கு எவ்வாறு பிரதிபலிக்கிறது என்பதில் சிறிய வேறுபாடுகள் காரணமாக இது ஏற்படலாம்.) மீதமுள்ள அனைத்து மூலைகளுக்கும் நன்றாக வேலை செய்யும் மதிப்பைத் தேர்வு செய்ய முயற்சிக்கவும். ஐயம் இருந்தால், குறைந்த அழுத்த முன்கூட்டியே மதிப்பை விரும்புங்கள்.

source: If a high pressure advance value (eg, over 0.200) is used then one may find that the extruder skips when returning to the printer's normal acceleration. The pressure advance system accounts for pressure by pushing in extra filament during acceleration and retracting that filament during deceleration. With a high acceleration and high pressure advance the extruder may not have enough torque to push the required filament. If this occurs, either use a lower acceleration value or disable pressure advance.
ta: உயர் அழுத்த முன்கூட்டியே மதிப்பு (எ.கா., 0.200 க்கு மேல்) பயன்படுத்தப்பட்டால், அச்சுப்பொறியின் இயல்பான முடுக்கத்திற்குத் திரும்பும்போது எக்ச்ட்ரூடர் தவிர்ப்பதைக் காணலாம். அழுத்தம் அட்வான்ச் சிச்டம் முடுக்கத்தின் போது கூடுதல் இழைகளைத் தள்ளுவதன் மூலமும், அந்த இழைகளை வீழ்த்துவதன் மூலமும் அழுத்தத்தை ஏற்படுத்துகிறது. அதிக முடுக்கம் மற்றும் உயர் அழுத்த முன்னேற்றத்துடன், எக்ச்ட்ரூடருக்கு தேவையான இழைகளைத் தள்ள போதுமான முறுக்கு இருக்காது. இது ஏற்பட்டால், குறைந்த முடுக்கம் மதிப்பைப் பயன்படுத்தவும் அல்லது அழுத்தம் முன்னேற்றத்தை முடக்கவும்.

source: Once pressure advance is tuned in Klipper, it may still be useful to configure a small retract value in the slicer (eg, 0.75mm) and to utilize the slicer's "wipe on retract option" if available. These slicer settings may help counteract ooze caused by filament cohesion (filament pulled out of the nozzle due to the stickiness of the plastic). It is recommended to disable the slicer's "z-lift on retract" option.
ta: கிளிப்பரில் அழுத்தம் முன்கூட்டியே சரிசெய்யப்பட்டவுடன், ச்லைசரில் (எ.கா., 0.75 மிமீ) ஒரு சிறிய பின்வாங்கல் மதிப்பை உள்ளமைப்பது மற்றும் ச்லைசரின் "பின்வாங்கல் விருப்பத்தைத் துடைப்பது" கிடைத்தால் பயன்படுத்துவது இன்னும் பயனுள்ளதாக இருக்கும். இந்த ச்லைசர் அமைப்புகள் இழை ஒத்திசைவால் ஏற்படும் ஓசை எதிர்க்க உதவக்கூடும் (பிளாச்டிக்கின் ஒட்டும் தன்மை காரணமாக முனையிலிருந்து இழை இழுக்கப்படுகிறது). ச்லைசரின் "இசட்-லிப்ட் ஆன் ரிட்ராக்ட்" விருப்பத்தை முடக்க பரிந்துரைக்கப்படுகிறது.

source: The pressure advance system does not change the timing or path of the toolhead. A print with pressure advance enabled will take the same amount of time as a print without pressure advance. Pressure advance also does not change the total amount of filament extruded during a print. Pressure advance results in extra extruder movement during move acceleration and deceleration. A very high pressure advance setting will result in a very large amount of extruder movement during acceleration and deceleration, and no configuration setting places a limit on the amount of that movement.
ta: அழுத்தம் அட்வான்ச் சிச்டம் கருவியின் நேரம் அல்லது பாதையை மாற்றாது. அழுத்தம் முன்கூட்டியே இயக்கப்பட்ட ஒரு அச்சு அழுத்தம் முன்கூட்டியே இல்லாமல் அச்சுக்கு அதே நேரத்தை எடுக்கும். அழுத்த முன்கூட்டியே ஒரு அச்சின் போது வெளியேற்றப்பட்ட மொத்த இழைகளின் அளவையும் மாற்றாது. நகர்வு முடுக்கம் மற்றும் வீழ்ச்சியின் போது கூடுதல் எக்ச்ட்ரூடர் இயக்கத்தில் அழுத்தம் முன்கூட்டியே விளைகிறது. மிக உயர் அழுத்த முன்கூட்டியே அமைப்பு முடுக்கம் மற்றும் வீழ்ச்சியின் போது மிகப் பெரிய அளவிலான எக்ச்ட்ரூடர் இயக்கத்தை ஏற்படுத்தும், மேலும் எந்த உள்ளமைவு அமைப்பும் அந்த இயக்கத்தின் அளவிற்கு ஒரு வரம்பை ஏற்படுத்தாது.

source: SET_VELOCITY_LIMIT SQUARE_CORNER_VELOCITY=1 ACCEL=500
ta: Set_velocity_limit scrour_corner_velocity = 1 achand = 500

source: TUNING_TOWER COMMAND=SET_PRESSURE_ADVANCE PARAMETER=ADVANCE START=0 FACTOR=.005
ta: Tuning_tower கட்டளை = set_pressure_advance அளவுரு = அட்வான்ச் ச்டார்ட் = 0 காரணி = .005

source: TUNING_TOWER COMMAND=SET_PRESSURE_ADVANCE PARAMETER=ADVANCE START=0 FACTOR=.020
ta: Tuning_tower கட்டளை = set_pressure_advance அளவுரு = அட்வான்ச் ச்டார்ட் = 0 காரணி = .020
