Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: ca, ta, uk

source: The length byte contains the number of bytes in the message block including the header and trailer bytes (thus the minimum message length is 5 bytes). The maximum message block length is currently 64 bytes. The sequence byte contains a 4 bit sequence number in the low-order bits and the high-order bits always contain 0x10 (the high-order bits are reserved for future use). The content bytes contain arbitrary data and its format is described in the following section. The crc bytes contain a 16bit CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) of the message block including the header bytes but excluding the trailer bytes. The sync byte is 0x7e.
ca: El byte de longitud conté el nombre de bytes del bloc de missatges, inclosos els bytes de la capçalera i el tràiler (per tant, la longitud mínima del missatge és de 5 bytes). La longitud màxima del bloc de missatges és actualment de 64 bytes. El byte de seqüència conté un número de seqüència de 4 bits en els bits d'ordre inferior i els bits d'ordre superior sempre contenen 0x10 (els bits d'ordre superior es reserven per a un ús futur). Els bytes de contingut contenen dades arbitràries i el seu format es descriu a la secció següent. Els bytes crc contenen un CCITT [CRC] de 16 bits (https://en.wikipedia.org/wiki/Cyclic_redundancy_check) del bloc de missatges, inclosos els bytes de capçalera però exclosos els bytes del tràiler. El byte de sincronització és 0x7e.
ta: நீள பைட் தலைப்பு மற்றும் டிரெய்லர் பைட்டுகள் உள்ளிட்ட செய்தித் தொகுதியில் உள்ள பைட்டுகளின் எண்ணிக்கையைக் கொண்டுள்ளது (இதனால் குறைந்தபட்ச செய்தி நீளம் 5 பைட்டுகள்). அதிகபட்ச செய்தி தொகுதி நீளம் தற்போது 64 பைட்டுகள். வரிசை பைட் குறைந்த-வரிசை பிட்களில் 4 பிட் வரிசை எண்ணைக் கொண்டுள்ளது மற்றும் உயர்-வரிசை பிட்களில் எப்போதும் 0x10 உள்ளது (உயர்-வரிசை பிட்கள் எதிர்கால பயன்பாட்டிற்காக ஒதுக்கப்பட்டுள்ளன). உள்ளடக்க பைட்டுகள் தன்னிச்சையான தரவைக் கொண்டிருக்கின்றன மற்றும் அதன் வடிவம் பின்வரும் பிரிவில் விவரிக்கப்பட்டுள்ளது. சி.ஆர்.சி பைட்டுகளில் 16 பிட் சி.சி.ஐ.டி [சி.ஆர்.சி] (https://en.wikipedia.org/wiki/cyclic_redundancy_check) தலைப்பு பைட்டுகள் உட்பட, ஆனால் டிரெய்லர் பைட்டுகளைத் தவிர்த்து உள்ளது. ஒத்திசைவு பைட் 0x7e ஆகும்.
uk: Довжина байта містить кількість байтів в блокі повідомлень, включаючи заголовок і причепів байтів (на відстані мінімального повідомлення 5 байтів). Максимальна довжина блоку повідомлення в даний час 64 байтів. Послідовність байтів включає в себе 4 біт послідовний номер у бітах низького порядку та біти високого замовлення, які завжди містять 0x10 (приклади високого замовлення, призначені для подальшого використання). Зміст байтів містить довільні дані і його формат описано в наступному розділі. Кришка байтів містить 16bit CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) блоку повідомлень, включаючи головки байтів, але крім причепів байтів. The sync байт 0x7e.

source: The format of the message block is inspired by [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control) message frames. Like in HDLC, the message block may optionally contain an additional sync character at the start of the block. Unlike in HDLC, a sync character is not exclusive to the framing and may be present in the message block content.
ca: El format del bloc de missatges està inspirat en marcs de missatges [HDLC](https://ca.wikipedia.org/wiki/HDLC). Igual que en HDLC, el bloc de missatges pot contenir opcionalment un caràcter de sincronització addicional a l'inici del bloc. A diferència de l'HDLC, un caràcter de sincronització no és exclusiu de l'enquadrament i pot estar present al contingut del bloc de missatges.
ta: செய்தித் தொகுதியின் வடிவம் [HDLC] (https://en.wikipedia.org/wiki/high-level_data_link_control) செய்தி பிரேம்களால் ஈர்க்கப்பட்டுள்ளது. எச்.டி.எல்.சியைப் போலவே, செய்தித் தொகுதியும் விருப்பமாக தொகுதியின் தொடக்கத்தில் கூடுதல் ஒத்திசைவு எழுத்தை கொண்டிருக்கலாம். எச்.டி.எல்.சியைப் போலல்லாமல், ஒரு ஒத்திசைவு எழுத்து ஃப்ரேமிங்கிற்கு பிரத்யேகமானது அல்ல, மேலும் செய்தி தொகுதி உள்ளடக்கத்தில் இருக்கலாம்.
uk: Формат блоку повідомлень натхненний [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control) рами повідомлення. Як і в HDLC, блок повідомлень може додатково містити додатковий символ синхронізації при запуску блоку. На відміну від HDLC, символ синхронізації не ексклюзивний для обрамлення і може бути присутнім в вмісту блоку повідомлення.

source: Message Block Contents
ca: Contingut del bloc de missatges
ta: செய்தி தொகுதி உள்ளடக்கங்கள்
uk: Зміст блоку повідомлення

source: Each message block sent from host to micro-controller contains a series of zero or more message commands in its contents. Each command starts with a [Variable Length Quantity](#variable-length-quantities) (VLQ) encoded integer command-id followed by zero or more VLQ parameters for the given command.
ca: Cada bloc de missatges enviat des de l'amfitrió al microcontrolador conté una sèrie de zero o més ordres de missatge al seu contingut. Cada comanda comença amb una [Quantitat de longitud variable](#variable-length-quantities) (VLQ) identificador d'ordre enter codificat seguit de zero o més paràmetres VLQ per a l'ordre donada.
ta: ஓச்டிலிருந்து மைக்ரோ-கன்ட்ரோலருக்கு அனுப்பப்பட்ட ஒவ்வொரு செய்தித் தொகுதியிலும் அதன் உள்ளடக்கங்களில் தொடர்ச்சியான பூச்சியம் அல்லது அதற்கு மேற்பட்ட செய்தி கட்டளைகள் உள்ளன. ஒவ்வொரு கட்டளையும் [மாறி நீள அளவு] (#மாறி-நீள-அளவு) (VLQ) குறியிடப்பட்ட முழு எண் கட்டளை-ஐடி உடன் தொடங்குகிறது, அதைத் தொடர்ந்து கொடுக்கப்பட்ட கட்டளைக்கு பூச்சியம் அல்லது அதற்கு மேற்பட்ட VLQ அளவுருக்கள் உள்ளன.
uk: Кожен блок повідомлень, відправлений з хосту до мікроконтролера, містить ряд нульових або більше команд повідомлення в його вмісті. Кожна команда починається з [Варіабельна кількість довжини](#variable-length-quantities) (VLQ) закодовано цілу команду-іде з використанням нульових або більше параметрів VLQ для даної команди.

source: As an example, the following four commands might be placed in a single message block:
ca: Com a exemple, les quatre ordres següents es poden col·locar en un únic bloc de missatges:
ta: உதாரணமாக, பின்வரும் நான்கு கட்டளைகள் ஒரு செய்தித் தொகுதியில் வைக்கப்படலாம்:
uk: Як приклад, наступні чотири команди можуть бути розміщені в одному блокі повідомлення:

source: and encoded into the following eight VLQ integers:
ca: i codificats en els vuit nombres enters VLQ següents:
ta: மற்றும் பின்வரும் எட்டு VLQ முழு எண்களில் குறியாக்கம் செய்யப்பட்டுள்ளது:
uk: і закодовано в наступні вісім цілих VLQ:

source: In order to encode and parse the message contents, both the host and micro-controller must agree on the command ids and the number of parameters each command has. So, in the above example, both the host and micro-controller would know that "id_update_digital_out" is always followed by two parameters, and "id_get_config" and "id_get_clock" have zero parameters. The host and micro-controller share a "data dictionary" that maps the command descriptions (eg, "update_digital_out oid=%c value=%c") to their integer command-ids. When processing the data, the parser will know to expect a specific number of VLQ encoded parameters following a given command id.
ca: Per codificar i analitzar el contingut del missatge, tant l'amfitrió com el microcontrolador han d'acordar els identificadors de l'ordre i el nombre de paràmetres que té cada comanda. Així, a l'exemple anterior, tant l'amfitrió com el microcontrolador sabrien que "id_update_digital_out" sempre va seguit de dos paràmetres, i que "id_get_config" i "id_get_clock" tenen zero paràmetres. L'amfitrió i el microcontrolador comparteixen un "diccionari de dades" que mapeja les descripcions de les ordres (per exemple, "update_digital_out oid=%c value=%c") amb els seus identificadors d'ordres enters. En processar les dades, l'analitzador sabrà esperar un nombre específic de paràmetres codificats VLQ seguint un identificador d'ordre donat.
ta: செய்தி உள்ளடக்கங்களை குறியாக்கம் மற்றும் அலசுவதற்கு, புரவலன் மற்றும் மைக்ரோ-கன்ட்ரோலர் இரண்டும் கட்டளை ஐடிகள் மற்றும் ஒவ்வொரு கட்டளைக்கும் உள்ள அளவுருக்களின் எண்ணிக்கையை ஏற்றுக்கொள்ள வேண்டும். எனவே, மேலே உள்ள எடுத்துக்காட்டில், புரவலன் மற்றும் மைக்ரோ-கன்ட்ரோலர் இருவரும் "ID_UPDATE_DIGITAL_OUT" எப்போதும் இரண்டு அளவுருக்கள் பின்பற்றப்படுகிறார்கள், மற்றும் "ID_GET_CONFIG" மற்றும் "ID_GET_CLOCK" ஆகியவை சுழிய அளவுருக்களைக் கொண்டுள்ளன என்பதை அறிவார்கள். புரவலன் மற்றும் மைக்ரோ-கன்ட்ரோலர் கட்டளை விளக்கங்களை (எ.கா. தரவை செயலாக்கும்போது, கொடுக்கப்பட்ட கட்டளை ஐடியைத் தொடர்ந்து ஒரு குறிப்பிட்ட எண்ணிக்கையிலான VLQ குறியிடப்பட்ட அளவுருக்களை எதிர்பார்க்கலாம்.
uk: Для того, щоб закодувати і записати вміст повідомлень, як хост, так і мікроконтролер зобов'язаний погоджуватися на поведінкові поклади і кількість параметрів, які мають кожна команда. Так, в наведеному вище прикладі, як хост, так і мікроконтролер дізнався, що "id_update_digital_out" завжди слідувати двома параметрами, а "id_get_config" і "id_get_clock" мають нульові параметри. Ведучий і мікроконтролер поділяють "словник даних", який відображає опис команд (наприклад, "update_digital_out oid=%c значення=%c") на їх ціле командно-ids. При обробці даних аналізатор дізнається про те, щоб очікувати конкретної кількості параметрів VLQ закодовано за допомогою даної команди.

source: The message contents for blocks sent from micro-controller to host follow the same format. The identifiers in these messages are "response ids", but they serve the same purpose and follow the same encoding rules. In practice, message blocks sent from the micro-controller to the host never contain more than one response in the message block contents.
ca: El contingut del missatge per als blocs enviats des del microcontrolador a l'amfitrió segueix el mateix format. Els identificadors d'aquests missatges són "identificadors de resposta", però tenen el mateix propòsit i segueixen les mateixes regles de codificació. A la pràctica, els blocs de missatges enviats des del microcontrolador a l'amfitrió mai contenen més d'una resposta al contingut del bloc de missatges.
ta: மைக்ரோ-கன்ட்ரோலரிலிருந்து புரவலன் செய்ய அனுப்பப்பட்ட தொகுதிகளுக்கான செய்தி உள்ளடக்கங்கள் அதே வடிவமைப்பைப் பின்பற்றுகின்றன. இந்த செய்திகளில் உள்ள அடையாளங்காட்டிகள் "மறுமொழி ஐடிகள்", ஆனால் அவை ஒரே நோக்கத்திற்காக பணி செய்கின்றன, அதே குறியாக்க விதிகளைப் பின்பற்றுகின்றன. நடைமுறையில், மைக்ரோ-கன்ட்ரோலரிலிருந்து ஓச்டுக்கு அனுப்பப்பட்ட செய்தி தொகுதிகள் ஒருபோதும் செய்தி தொகுதி உள்ளடக்கங்களில் ஒன்றுக்கு மேற்பட்ட பதில்களைக் கொண்டிருக்கவில்லை.
uk: Вміст повідомлення для блоків, відправлених з мікроконтролера, щоб зайти до одного формату. Ідентифікатори в цих повідомленнях є "відповідними потоками", але вони служать однаковим призначенням і дотримуються однакових правил кодування. На практиці блоки повідомлень, відправлені з мікроконтролера до хосту, ніколи не містять більше одного відгуку у вмісті блоку повідомлень.

source: Variable Length Quantities
ca: Quantitats de longitud variable
ta: மாறி நீள அளவுகள்
uk: Варіабельна довжина

source: See the [wikipedia article](https://en.wikipedia.org/wiki/Variable-length_quantity) for more information on the general format of VLQ encoded integers. Klipper uses an encoding scheme that supports both positive and negative integers. Integers close to zero use less bytes to encode and positive integers typically encode using less bytes than negative integers. The following table shows the number of bytes each integer takes to encode:
ca: Consulteu l'[article de la wikipedia](https://en.wikipedia.org/wiki/Variable-length_quantity) per obtenir més informació sobre el format general dels nombres enters codificats VLQ. Klipper utilitza un esquema de codificació que admet nombres enters positius i negatius. Els enters propers a zero utilitzen menys bytes per codificar i els enters positius normalment codifiquen amb menys bytes que els enters negatius. La taula següent mostra el nombre de bytes que cada nombre sencer necessita per codificar:
ta: VLQ குறியிடப்பட்ட முழு எண்களின் பொதுவான வடிவம் குறித்த கூடுதல் தகவலுக்கு [விக்கிபீடியா கட்டுரை] (https://en.wikipedia.org/wiki/variable- நீளம்_ குவாண்டிட்டி) ஐப் பார்க்கவும். நேர்மறை மற்றும் எதிர்மறை முழு எண்களை ஆதரிக்கும் ஒரு குறியாக்க திட்டத்தை கிளிப்பர் பயன்படுத்துகிறது. பூச்சியத்திற்கு நெருக்கமான முழு எண்கள் குறியாக்க குறைந்த பைட்டுகளைப் பயன்படுத்துகின்றன மற்றும் நேர்மறை முழு எண்கள் பொதுவாக எதிர்மறை முழு எண்களைக் காட்டிலும் குறைந்த பைட்டுகளைப் பயன்படுத்தி குறியாக்கம் செய்கின்றன. பின்வரும் அட்டவணை ஒவ்வொரு முழு எண்ணையும் குறியாக்க எடுக்கும் பைட்டுகளின் எண்ணிக்கையைக் காட்டுகிறது:
uk: Дивись [пухлинна стаття](https://en.wikipedia.org/wiki/Variable-length_quantity) для отримання додаткової інформації про загальний формат VLQ закодовано ціле. Klipper використовує схему кодування, яка підтримує як позитивні, так і негативні цілі. Інтегери близько до нуля використовують менше байтів для кодування та позитивних цілих, як правило, кодування, використовуючи менше байтів, ніж негативні цілі. Наступна таблиця показує кількість байтів кожного цілого займає кодування:

source: Integer
ca: Enter
ta: முழு எண்
uk: Ціле число

source: Encoded size
ca: Mida codificada
ta: குறியிடப்பட்ட அளவு
uk: Закодований розмір

source: Variable length strings
ca: Cordes de longitud variable
ta: மாறி நீள சரங்கள்
uk: Сортовані довжини рядки

source: As an exception to the above encoding rules, if a parameter to a command or response is a dynamic string then the parameter is not encoded as a simple VLQ integer. Instead it is encoded by transmitting the length as a VLQ encoded integer followed by the contents itself:
ca: Com a excepció a les regles de codificació anteriors, si un paràmetre d'una ordre o resposta és una cadena dinàmica, aleshores el paràmetre no es codifica com un simple enter VLQ. En lloc d'això, es codifica mitjançant la transmissió de la longitud com un nombre enter codificat VLQ seguit del propi contingut:
ta: மேலே உள்ள குறியாக்க விதிகளுக்கு விதிவிலக்காக, ஒரு கட்டளை அல்லது பதிலுக்கான அளவுரு ஒரு மாறும் சரம் என்றால், அளவுரு ஒரு எளிய VLQ முழு எண்ணாக குறியிடப்படவில்லை. அதற்கு பதிலாக இது ஒரு VLQ குறியிடப்பட்ட முழு எண்ணாக நீளத்தை கடத்துவதன் மூலம் குறியாக்கம் செய்யப்படுகிறது:
uk: Як виняток до вищезазначених правил кодування, якщо параметр до команди або відповідь є динамічним рядком, то параметр не кодується як простий ціле VLQ. Замість його закодовано шляхом передачі довжини як VLQ закодовано ціле число після того, як сам вміст:

source: The command descriptions found in the data dictionary allow both the host and micro-controller to know which command parameters use simple VLQ encoding and which parameters use string encoding.
ca: Les descripcions d'ordres que es troben al diccionari de dades permeten tant a l'amfitrió com al microcontrolador saber quins paràmetres d'ordres utilitzen una codificació VLQ senzilla i quins paràmetres utilitzen la codificació de cadena.
ta: தரவு அகராதியில் காணப்படும் கட்டளை விளக்கங்கள் புரவலன் மற்றும் மைக்ரோ-கன்ட்ரோலர் இரண்டையும் எந்த கட்டளை அளவுருக்கள் எளிய VLQ குறியாக்கத்தைப் பயன்படுத்துகின்றன என்பதையும், எந்த அளவுருக்கள் சரம் குறியாக்கத்தைப் பயன்படுத்துகின்றன என்பதையும் அறிய அனுமதிக்கின்றன.
uk: Описи команд, знайдені в словнику даних, дозволяють як господаря, так і мікроконтролеру, щоб дізнатися, які параметри команд використовують простий кодування VLQ і які параметри використовують кодування рядків.

source: Data Dictionary
ca: Diccionari de dades
ta: தரவு அகராதி
uk: Словник даних

source: In order for meaningful communications to be established between micro-controller and host, both sides must agree on a "data dictionary". This data dictionary contains the integer identifiers for commands and responses along with their descriptions.
ca: Per tal que s'estableixin comunicacions significatives entre el microcontrolador i l'amfitrió, ambdues parts han d'acordar un "diccionari de dades". Aquest diccionari de dades conté els identificadors d'enters per a les ordres i les respostes juntament amb les seves descripcions.
ta: மைக்ரோ-கன்ட்ரோலருக்கும் ஓச்டுக்கும் இடையில் அர்த்தமுள்ள தகவல்தொடர்புகள் நிறுவப்படுவதற்கு, இரு தரப்பினரும் "தரவு அகராதியை" ஏற்றுக்கொள்ள வேண்டும். இந்த தரவு அகராதியில் அவற்றின் விளக்கங்களுடன் கட்டளைகள் மற்றும் பதில்களுக்கான முழு எண் அடையாளங்காட்டிகள் உள்ளன.
uk: Для того, щоб значущі комунікації були встановлені між мікроконтролером та хостом, обидві сторони повинні погоджуватися на "словник даних". Цей словник даних містить цілі ідентифікатори для команд і реагування разом з їх описами.

source: The micro-controller build uses the contents of DECL_COMMAND() and sendf() macros to generate the data dictionary. The build automatically assigns unique identifiers to each command and response. This system allows both the host and micro-controller code to seamlessly use descriptive human-readable names while still using minimal bandwidth.
ca: La construcció del microcontrolador utilitza el contingut de les macros DECL_COMMAND() i sendf() per generar el diccionari de dades. La compilació assigna automàticament identificadors únics a cada comanda i resposta. Aquest sistema permet que tant l'amfitrió com el codi del microcontrolador utilitzin noms descriptius llegibles per l'home sense problemes, sense deixar de fer servir un ample de banda mínim.
ta: தரவு அகராதியை உருவாக்க மைக்ரோ-கட்டுப்பாட்டு உருவாக்கம் டெக்_ கமாண்ட் () மற்றும் செண்ட்ஃப் () மேக்ரோக்களின் உள்ளடக்கங்களைப் பயன்படுத்துகிறது. ஒவ்வொரு கட்டளை மற்றும் பதிலுக்கும் தனித்துவமான அடையாளங்காட்டிகளை உருவாக்குவது தானாகவே ஒதுக்குகிறது. இந்த அமைப்பு புரவலன் மற்றும் மைக்ரோ-கன்ட்ரோலர் குறியீடு இரண்டையும் குறைந்தபட்ச அலைவரிசையைப் பயன்படுத்தும் போது விளக்கமான மனித-படிக்கக்கூடிய பெயர்களைப் பயன்படுத்த அனுமதிக்கிறது.
uk: Створення мікроконтролерів використовує вміст макросів DECL_COMMAND() та відправників () для створення словника даних. Створення автоматично підписує унікальні ідентифікатори до кожної команди та відповіді. Ця система дозволяє одночасно використовувати декриптивні імена людей, які мають мінімальну пропускну здатність.

source: The host queries the data dictionary when it first connects to the micro-controller. Once the host downloads the data dictionary from the micro-controller, it uses that data dictionary to encode all commands and to parse all responses from the micro-controller. The host must therefore handle a dynamic data dictionary. However, to keep the micro-controller software simple, the micro-controller always uses its static (compiled in) data dictionary.
ca: L'amfitrió consulta el diccionari de dades quan es connecta per primera vegada al microcontrolador. Una vegada que l'amfitrió descarrega el diccionari de dades del microcontrolador, fa servir aquest diccionari de dades per codificar totes les ordres i analitzar totes les respostes del microcontrolador. Per tant, l'amfitrió ha de gestionar un diccionari de dades dinàmics. Tanmateix, per mantenir el programari del microcontrolador senzill, el microcontrolador sempre utilitza el seu diccionari de dades estàtics (compilats).
ta: புரவலன் தரவு அகராதியை முதலில் மைக்ரோ-கன்ட்ரோலருடன் இணைக்கும்போது வினவுகிறது. மைக்ரோ-கன்ட்ரோலரிடமிருந்து தரவு அகராதியை புரவலன் பதிவிறக்கம் செய்தவுடன், எல்லா கட்டளைகளையும் குறியாக்கவும், மைக்ரோ-கன்ட்ரோலரிலிருந்து அனைத்து பதில்களையும் அலசவும் அந்த தரவு அகராதியைப் பயன்படுத்துகிறது. எனவே புரவலன் ஒரு மாறும் தரவு அகராதியைக் கையாள வேண்டும். இருப்பினும், மைக்ரோ-கன்ட்ரோலர் மென்பொருளை எளிமையாக வைத்திருக்க, மைக்ரோ-கன்ட்ரோலர் எப்போதும் அதன் நிலையான (தொகுக்கப்பட்ட) தரவு அகராதியைப் பயன்படுத்துகிறது.
uk: Ведучий запитує словник даних, коли він спочатку з'єднується з мікроконтролером. Після того, як хост завантажує словник даних з мікроконтролера, він використовує цей словник даних, щоб зашифрувати всі команди і записати всі відповіді від мікроконтролера. Ведуться динамічний словник даних. Тим не менш, для зберігання мікроконтролерів програмне забезпечення простий, мікроконтролер завжди використовує свій статичний (упорядкований) словник даних.

source: The data dictionary is queried by sending "identify" commands to the micro-controller. The micro-controller will respond to each identify command with an "identify_response" message. Since these two commands are needed prior to obtaining the data dictionary, their integer ids and parameter types are hard-coded in both the micro-controller and the host. The "identify_response" response id is 0, the "identify" command id is 1. Other than having hard-coded ids the identify command and its response are declared and transmitted the same way as other commands and responses. No other command or response is hard-coded.
ca: El diccionari de dades es consulta enviant ordres "identifica" al microcontrolador. El microcontrolador respondrà a cada ordre d'identificació amb un missatge "identificar_resposta". Com que aquestes dues ordres són necessàries abans d'obtenir el diccionari de dades, els seus identificadors enters i tipus de paràmetres estan codificats tant al microcontrolador com a l'amfitrió. L'identificador de resposta "identificar_resposta" és 0, l'identificador de l'ordre "identificar" és 1. A part de tenir identificadors codificats, l'ordre d'identificació i la seva resposta es declaren i es transmeten de la mateixa manera que altres ordres i respostes. No hi ha cap altra ordre o resposta codificada.
ta: மைக்ரோ-கன்ட்ரோலருக்கு "அடையாளம் காணுங்கள்" கட்டளைகளை அனுப்புவதன் மூலம் தரவு அகராதி வினவப்படுகிறது. மைக்ரோ-கன்ட்ரோலர் ஒவ்வொரு அடையாள கட்டளைக்கும் "அடையாளம்_ ரெச்போன்ச்" செய்தியுடன் பதிலளிக்கும். தரவு அகராதியைப் பெறுவதற்கு முன்னர் இந்த இரண்டு கட்டளைகளும் தேவைப்படுவதால், அவற்றின் முழு எண் ஐடிகள் மற்றும் அளவுரு வகைகள் மைக்ரோ-கன்ட்ரோலர் மற்றும் புரவலன் இரண்டிலும் கடின குறியீட்டு செய்யப்பட்டுள்ளன. "அடையாளம்_ரெச்போன்ச்" மறுமொழி ஐடி 0, "அடையாளம்" கட்டளை ஐடி 1 ஆகும். கடின குறியீட்டு ஐடிகளைத் தவிர்த்து அடையாளம் காணும் கட்டளை மற்றும் அதன் பதில் பிற கட்டளைகள் மற்றும் பதில்களைப் போலவே அறிவிக்கப்பட்டு அனுப்பப்படுகிறது. வேறு எந்த கட்டளை அல்லது பதிலும் கடின குறியீட்டு அல்ல.
uk: Словник даних передається шляхом відправки "ідентифікувати" команд до мікроконтролера. Мікроконтролер відреагує на кожну команду з повідомленням "identify_response". Оскільки ці дві команди потрібні до отримання словника даних, їх ціла кришка і типи параметрів важко закодовані як в мікроконтролері, так і ведучий. "identify_response" відповідь id є 0, "ідентифікувати" команди id є 1. Крім того, у випадку, якщо у вас виникли труднощі, виявляти команду та її відповідь будуть оголошені та передані таким чином, як інші команди та відповіді. Немає іншої команди або відповідь на жорсткий-код.
