Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: ca, ta, uk

source: The Klipper messaging protocol is used for low-level communication between the Klipper host software and the Klipper micro-controller software. At a high level the protocol can be thought of as a series of command and response strings that are compressed, transmitted, and then processed at the receiving side. An example series of commands in uncompressed human-readable format might look like:
ca: El protocol de missatgeria Klipper s'utilitza per a la comunicació de baix nivell entre el programari amfitrió Klipper i el programari del microcontrolador Klipper. A un alt nivell, el protocol es pot pensar com una sèrie de cadenes d'ordres i resposta que es comprimeixen, es transmeten i després es processen al costat receptor. Una sèrie d'exemple d'ordres en format llegible per humans sense comprimir podria semblar:
ta: கிளிப்பர் புரவலன் மென்பொருளுக்கும் கிளிப்பர் மைக்ரோ-கன்ட்ரோலர் மென்பொருளுக்கும் இடையில் குறைந்த அளவிலான தகவல்தொடர்புக்கு கிளிப்பர் செய்தி நெறிமுறை பயன்படுத்தப்படுகிறது. ஒரு உயர் மட்டத்தில் நெறிமுறையை சுருக்கமாகவும், கடத்தப்பட்ட, பின்னர் பெறும் பக்கத்தில் செயலாக்கப்படும் கட்டளை மற்றும் மறுமொழி சரங்களின் தொடர் என்று கருதலாம். சுருக்கப்படாத மனிதனால் படிக்கக்கூடிய வடிவத்தில் கட்டளைகளின் ஒரு எடுத்துக்காட்டு தொடர்:
uk: Протокол оміну повідомленнями Klipper використовується для низькорівневого спілкування між хостовим програмним забезпеченням Klipper та програмним забезпеченням мікро-контроллера Klipper. На вищому рівні протокол можна розглядати як серію команд та рядків відповідей які стиснуті, передані та обробленні на приймаючій стороні. ПРиклад серій команд в нестиснутому зрозщумілому людині форматі може виглядати як:

source: See the [mcu commands](MCU_Commands.md) document for information on available commands. See the [debugging](Debugging.md) document for information on how to translate a G-Code file into its corresponding human-readable micro-controller commands.
ca: Consulteu el document [mcu commands](MCU_Commands.md) per obtenir informació sobre les ordres disponibles. Consulteu el document [debugging](Debugging.md) per obtenir informació sobre com traduir un fitxer G-Code a les seves ordres de microcontrolador llegibles per humans corresponents.
ta: கிடைக்கக்கூடிய கட்டளைகள் பற்றிய தகவலுக்கு [MCU கட்டளைகள்] (MCU_COMMANDS.MD) ஆவணத்தைப் பார்க்கவும். சி-குறியீட்டு கோப்பை அதனுடன் தொடர்புடைய மனித-படிக்கக்கூடிய மைக்ரோ-கன்ட்ரோலர் கட்டளைகளில் எவ்வாறு மொழிபெயர்ப்பது என்பது குறித்த தகவலுக்கு [பிழைத்திருத்தம்] (பிழைத்திருத்தம். எம்.டி) ஆவணத்தைப் பார்க்கவும்.
uk: Дивитися [mcu команди](MCU_Commands.md) документ для інформації про доступні команди. Див. [debugging](Debugging.md) документ для інформації про те, як перевести файл G-Code в його відповідну команду мікроконтролерів.

source: This page provides a high-level description of the Klipper messaging protocol itself. It describes how messages are declared, encoded in binary format (the "compression" scheme), and transmitted.
ca: Aquesta pàgina proporciona una descripció d'alt nivell del propi protocol de missatgeria Klipper. Descriu com es declaren els missatges, es codifiquen en format binari (l'esquema de "compressió") i es transmeten.
ta: இந்த பக்கம் கிளிப்பர் செய்தியிடல் நெறிமுறையின் உயர் மட்ட விளக்கத்தை வழங்குகிறது. செய்திகள் எவ்வாறு அறிவிக்கப்படுகின்றன, பைனரி வடிவத்தில் ("சுருக்க" திட்டம்) குறியாக்கம் செய்யப்பட்டு, கடத்தப்படுகின்றன என்பதை இது விவரிக்கிறது.
uk: Ця сторінка забезпечує високий рівень опису протоколу обміну повідомленнями Klipper. Розглянуто, як заявлені повідомлення, закодовані у бінарному форматі (система «компресія», передається.

source: The goal of the protocol is to enable an error-free communication channel between the host and micro-controller that is low-latency, low-bandwidth, and low-complexity for the micro-controller.
ca: L'objectiu del protocol és habilitar un canal de comunicació sense errors entre l'amfitrió i el microcontrolador que sigui de baixa latència, baix ample de banda i poca complexitat per al microcontrolador.
ta: நெறிமுறையின் குறிக்கோள், புரவலன் மற்றும் மைக்ரோ-கன்ட்ரோலருக்கு இடையில் பிழை இல்லாத தகவல்தொடர்பு சேனலை இயக்குவதாகும், இது குறைந்த லேடிசன், குறைந்த-அலைவரிசை மற்றும் மைக்ரோ-கன்ட்ரோலருக்கு குறைந்த இணக்கத்தன்மை கொண்டது.
uk: Мета протоколу – увімкнути безпомилковий канал зв’язку між хостом та мікроконтролерами, що є низькою пропускною спроможністю, низькою пропускною здатністю та низькою сумісністю для мікроконтролерів.

source: Micro-controller Interface
ca: Interfície de microcontrolador
ta: மைக்ரோ-கன்ட்ரோலர் இடைமுகம்
uk: Мікроконтролер Інтерфейс

source: The Klipper transmission protocol can be thought of as a [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) mechanism between micro-controller and host. The micro-controller software declares the commands that the host may invoke along with the response messages that it can generate. The host uses that information to command the micro-controller to perform actions and to interpret the results.
ca: El protocol de transmissió Klipper es pot pensar com un mecanisme [RPC](https://ca.wikipedia.org/wiki/Remote_Procedure_Call) entre el microcontrolador i l'amfitrió. El programari del microcontrolador declara les ordres que l'amfitrió pot invocar juntament amb els missatges de resposta que pot generar. L'amfitrió utilitza aquesta informació per ordenar al microcontrolador que realitzi accions i que interpreti els resultats.
ta: கிளிப்பர் டிரான்ச்மிசன் நெறிமுறை மைக்ரோ-கன்ட்ரோலர் மற்றும் ஓச்டுக்கு இடையிலான ஒரு [RPC] (https://en.wikipedia.org/wiki/remote_procedure_call) பொறிமுறையாக கருதலாம். மைக்ரோ-கன்ட்ரோலர் மென்பொருள் புரவலன் அதை உருவாக்கக்கூடிய மறுமொழி செய்திகளுடன் அழைக்கக்கூடிய கட்டளைகளை அறிவிக்கிறது. செயல்களைச் செய்வதற்கும் முடிவுகளை விளக்குவதற்கும் மைக்ரோ-கன்ட்ரோலரைக் கட்டளையிட புரவலன் அந்த தகவலைப் பயன்படுத்துகிறது.
uk: Протокол передачі Klipper може бути подуманий як [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) механізму між мікроконтролером і хостом. Програмне забезпечення мікроконтролера заявляє команди, що хост може викликати повідомлення про відповідь, що він може генерувати. Ведуться використання інформації для командування мікроконтролера для виконання дій та інтерпретації результатів.

source: Declaring commands
ca: Declaració d'ordres
ta: கட்டளைகளை அறிவித்தல்
uk: Декларування команд

source: The micro-controller software declares a "command" by using the DECL_COMMAND() macro in the C code. For example:
ca: El programari del microcontrolador declara una "ordre" mitjançant la macro DECL_COMMAND() al codi C. Per exemple:
ta: மைக்ரோ-கண்ட்ரோலர் மென்பொருள் சி குறியீட்டில் உள்ள டெக்_ கமாண்ட் () மேக்ரோவைப் பயன்படுத்தி ஒரு "கட்டளை" அறிவிக்கிறது. உதாரணமாக:
uk: Програмне забезпечення мікроконтролера заявляє «команду» за допомогою макросису DECL_COMMAND() у коді C. Наприклад:

source: The above declares a command named "update_digital_out". This allows the host to "invoke" this command which would cause the command_update_digital_out() C function to be executed in the micro-controller. The above also indicates that the command takes two integer parameters. When the command_update_digital_out() C code is executed, it will be passed an array containing these two integers - the first corresponding to the 'oid' and the second corresponding to the 'value'.
ca: L'anterior declara una ordre anomenada "update_digital_out". Això permet que l'amfitrió "invoqui" aquesta ordre que provocaria que la funció C command_update_digital_out() s'executi al microcontrolador. L'anterior també indica que l'ordre pren dos paràmetres enters. Quan s'executa el codi command_update_digital_out() C, se li passarà una matriu que conté aquests dos nombres enters: el primer correspon a l''oid' i el segon al 'valor'.
ta: மேலே உள்ளவை "Update_digital_out" என்ற கட்டளையை அறிவிக்கிறது. இது இந்த கட்டளையை "செயல்படுத்த" அனுமதிக்கிறது, இது கட்டளை_அப்டேட்_டிசிட்டல்_அவுட் () சி செயல்பாட்டை மைக்ரோ-கன்ட்ரோலரில் செயல்படுத்தும். கட்டளை இரண்டு முழு எண் அளவுருக்களை எடுக்கும் என்பதையும் மேலே குறிப்பிடுகிறது. கட்டளை_பிடேட்_டிசிட்டல்_வுட் () சி குறியீடு செயல்படுத்தப்படும்போது, இந்த இரண்டு முழு எண்களைக் கொண்ட ஒரு வரிசையை அது அனுப்பும் - முதலாவது 'OID' உடன் தொடர்புடையது மற்றும் இரண்டாவது 'மதிப்பு' உடன் தொடர்புடையது.
uk: Визначено команду «update_digital_out». Це дозволяє хосту "вкликати" цю команду, яка призведе до команди_update_digital_out() Функція C виконується в мікроконтролері. Вказаний вище вказується, що команда приймає два цілих параметри. Коли команда_update_digital_out() Код C виконаний, він буде пропущений масив, що містить ці два цілих - перше відповідне 'oid' і другий відповідне 'value'.

source: In general, the parameters are described with printf() style syntax (eg, "%u"). The formatting directly corresponds to the human-readable view of commands (eg, "update_digital_out oid=7 value=1"). In the above example, "value=" is a parameter name and "%c" indicates the parameter is an integer. Internally, the parameter name is only used as documentation. In this example, the "%c" is also used as documentation to indicate the expected integer is 1 byte in size (the declared integer size does not impact the parsing or encoding).
ca: En general, els paràmetres es descriuen amb la sintaxi d'estil printf() (per exemple, "%u"). El format correspon directament a la vista llegible per l'home de les ordres (per exemple, "update_digital_out oid=7 value=1"). A l'exemple anterior, "value=" és un nom de paràmetre i "%c" indica que el paràmetre és un nombre enter. Internament, el nom del paràmetre només s'utilitza com a documentació. En aquest exemple, el "%c" també s'utilitza com a documentació per indicar que l'enter esperat té una mida d'1 byte (la mida de l'enter declarada no afecta l'anàlisi o la codificació).
ta: பொதுவாக, அளவுருக்கள் printf () பாணி தொடரியல் (எ.கா., "%u") உடன் விவரிக்கப்பட்டுள்ளன. வடிவமைப்பு நேரடியாக கட்டளைகளின் மனிதனால் படிக்கக்கூடிய பார்வைக்கு ஒத்திருக்கிறது (எ.கா. மேலே உள்ள எடுத்துக்காட்டில், "மதிப்பு =" என்பது ஒரு அளவுரு பெயர் மற்றும் "%C" அளவுரு ஒரு முழு எண் என்பதைக் குறிக்கிறது. உள்நாட்டில், அளவுரு பெயர் ஆவணங்களாக மட்டுமே பயன்படுத்தப்படுகிறது. இந்த எடுத்துக்காட்டில், எதிர்பார்க்கப்படும் முழு எண் 1 பைட் அளவு என்பதைக் குறிக்க "%சி" ஆவணங்களாகவும் பயன்படுத்தப்படுகிறது (அறிவிக்கப்பட்ட முழு எண் அளவு பாகுபடுத்தல் அல்லது குறியாக்கத்தை பாதிக்காது).
uk: В цілому параметри описуються з принтом () синтаксисом стилю (наприклад, "%u"). Форматування безпосередньо відповідає людському вигляду команд (наприклад, "update_digital_out oid=7 значення=1). У наведеному вище прикладі "value=" є ім'ям параметра і "%c" вказує на параметр є цілим. Внутрішня назва параметра використовується тільки як документація. У цьому прикладі "%c" також використовується як документація, щоб вказати очікуване ціле 1байт у розмірах (задекларований загальний розмір не впливає на парсінг або кодування).

source: The micro-controller build will collect all commands declared with DECL_COMMAND(), determine their parameters, and arrange for them to be callable.
ca: La construcció del microcontrolador recopilarà totes les ordres declarades amb DECL_COMMAND(), determinarà els seus paràmetres i disposarà que es puguin cridar.
ta: மைக்ரோ-கட்டுப்பாட்டு உருவாக்கம் டெக்_காமண்ட் () உடன் அறிவிக்கப்பட்ட அனைத்து கட்டளைகளையும் சேகரிக்கும், அவற்றின் அளவுருக்களைத் தீர்மானிக்கும், மேலும் அவை அழைக்கப்பட வேண்டும் என்று ஏற்பாடு செய்யும்.
uk: Мікроконтролери збирають всі команди, заявлені DECL_COMMAND(), визначать їх параметри та влаштовують для них, щоб бути прийнятними.

source: Declaring responses
ca: Declaració de respostes
ta: பதில்களை அறிவித்தல்
uk: Зниження відповіді

source: To send information from the micro-controller to the host a "response" is generated. These are both declared and transmitted using the sendf() C macro. For example:
ca: Per enviar informació del microcontrolador a l'amfitrió es genera una "resposta". Tots dos es declaren i es transmeten mitjançant la macro C sendf(). Per exemple:
ta: மைக்ரோ-கன்ட்ரோலரிடமிருந்து தகவல்களை ஓச்டுக்கு அனுப்ப ஒரு "பதில்" உருவாக்கப்படுகிறது. இவை இரண்டும் Sendf () C மேக்ரோவைப் பயன்படுத்தி அறிவிக்கப்பட்டு கடத்தப்படுகின்றன. உதாரணமாக:
uk: Для надсилання інформації від мікроконтролера до хосту створюється «відповідна». Ці як заявлені, так і передані за допомогою відправника() C макрос. Наприклад:

source: The above transmits a "status" response message that contains two integer parameters ("clock" and "status"). The micro-controller build automatically finds all sendf() calls and generates encoders for them. The first parameter of the sendf() function describes the response and it is in the same format as command declarations.
ca: L'anterior transmet un missatge de resposta "estat" que conté dos paràmetres sencers ("rellotge" i "estat"). La construcció del microcontrolador troba automàticament totes les trucades sendf() i genera codificadors per a elles. El primer paràmetre de la funció sendf() descriu la resposta i té el mateix format que les declaracions d'ordres.
ta: மேலே உள்ள இரண்டு முழு எண் அளவுருக்கள் ("கடிகாரம்" மற்றும் "நிலை") கொண்ட "நிலை" மறுமொழி செய்தியை அனுப்புகிறது. மைக்ரோ-கன்ட்ரோலர் பில்ட் தானாகவே அனைத்து sendf () அழைப்புகளைக் கண்டுபிடித்து அவற்றுக்கான குறியாக்கிகளை உருவாக்குகிறது. Sendf () செயல்பாட்டின் முதல் அளவுரு பதிலை விவரிக்கிறது, மேலும் இது கட்டளை அறிவிப்புகளின் அதே வடிவத்தில் உள்ளது.
uk: Над передає "статус" відповідь повідомлення, що містить два цілих параметри ("clock" і "status"). Мікроконтролер автоматично знаходить всі дзвінки відправника () і генерує кодатори для них. Перший параметр функції відправника () описує відповідь і він знаходиться в одному форматі, як командні декларації.

source: The host can arrange to register a callback function for each response. So, in effect, commands allow the host to invoke C functions in the micro-controller and responses allow the micro-controller software to invoke code in the host.
ca: L'amfitrió pot organitzar el registre d'una funció de devolució de trucada per a cada resposta. Així, en efecte, les ordres permeten a l'amfitrió invocar funcions C al microcontrolador i les respostes permeten que el programari del microcontrolador invoqui codi a l'amfitrió.
ta: ஒவ்வொரு பதிலுக்கும் ஒரு அழைப்பு செயல்பாட்டை பதிவு செய்ய புரவலன் ஏற்பாடு செய்யலாம். எனவே, இதன் விளைவாக, மைக்ரோ-கன்ட்ரோலரில் சி செயல்பாடுகளை அழைக்க ஓச்டை கட்டளைகள் அனுமதிக்கின்றன மற்றும் பதில்கள் மைக்ரோ-கான்ரோலர் மென்பொருளை ஓச்டில் குறியீட்டைப் பயன்படுத்த அனுமதிக்கின்றன.
uk: Ведучий може організувати реєстрацію функції зворотного дзвінка для кожного відгуку. Таким чином, в ефекті команди дозволяють хост викликати функції C в мікроконтролері і відповіді дозволяють програмне забезпечення мікроконтролера викликати код в хості.

source: The sendf() macro should only be invoked from command or task handlers, and it should not be invoked from interrupts or timers. The code does not need to issue a sendf() in response to a received command, it is not limited in the number of times sendf() may be invoked, and it may invoke sendf() at any time from a task handler.
ca: La macro sendf() només s'ha d'invocar des dels controladors d'ordres o tasques, i no s'ha d'invocar des d'interrupcions o temporitzadors. El codi no necessita emetre un sendf() en resposta a una ordre rebuda, no està limitat en el nombre de vegades que es pot invocar sendf() i pot invocar sendf() en qualsevol moment des d'un gestor de tasques.
ta: Sendf () மேக்ரோ கட்டளை அல்லது பணி கையாளுபவர்களிடமிருந்து மட்டுமே பயன்படுத்தப்பட வேண்டும், மேலும் இது குறுக்கீடுகள் அல்லது டைமர்களிடமிருந்து பயன்படுத்தப்படக்கூடாது. பெறப்பட்ட கட்டளைக்கு பதிலளிக்கும் விதமாக குறியீடு ஒரு sendf () ஐ வழங்க தேவையில்லை, இது sendf () எத்தனை முறை செயல்படுத்தப்படலாம் என்பதில் மட்டுப்படுத்தப்படவில்லை, மேலும் இது ஒரு பணி கையாளுபவரிடமிருந்து எந்த நேரத்திலும் Sendf () ஐ அழைக்கலாம்.
uk: Відправка () макрос повинна бути викликана тільки з командних або завдань обробників, і не повинна бути викликана від перерв або таймерів. Код не потрібно випустити відправника() у відповідь на отриману команду, вона не обмежується в кількості разів відправника () може бути викликана, і це може викликати відправника() в будь-який час від обробника завдання.

source: Output responses
ca: Respostes de sortida
ta: வெளியீட்டு பதில்கள்
uk: Вихідні відповіді

source: To simplify debugging, there is also an output() C function. For example:
ca: Per simplificar la depuració, també hi ha una funció C output(). Per exemple:
ta: பிழைத்திருத்தத்தை எளிமைப்படுத்த, ஒரு வெளியீடு () சி செயல்பாடும் உள்ளது. உதாரணமாக:
uk: Для спрощення відключення є також вихід() Функція C. Наприклад:

source: The output() function is similar in usage to printf() - it is intended to generate and format arbitrary messages for human consumption.
ca: La funció output() és similar en l'ús a printf(): té la intenció de generar i formatar missatges arbitraris per als humans.
ta: வெளியீடு () செயல்பாடு அச்சுப்பொறிக்கு () பயன்பாட்டில் ஒத்திருக்கிறது - இது மனித நுகர்வுக்கு தன்னிச்சையான செய்திகளை உருவாக்கி வடிவமைக்கும் நோக்கம் கொண்டது.
uk: Функція виведення () схожа на використання для друкуf() - призначена для створення та форматування довільних повідомлень для споживання людиною.

source: Declaring enumerations
ca: Declaració d'enumeraments
ta: கணக்கீடுகளை அறிவித்தல்
uk: Декларування енгенерацій

source: Enumerations allow the host code to use string identifiers for parameters that the micro-controller handles as integers. They are declared in the micro-controller code - for example:
ca: Les enumeracions permeten que el codi amfitrió utilitzi identificadors de cadena per als paràmetres que el microcontrolador gestiona com a nombres enters. Es declaren al codi del microcontrolador, per exemple:
ta: மைக்ரோ-கான்ரோடோலர் முழு எண்களாக கையாளும் அளவுருக்களுக்கு சரம் அடையாளங்காட்டிகளைப் பயன்படுத்த புரவலன் குறியீட்டை கணக்கிடுகிறது. அவை மைக்ரோ -கன்ட்ரோலர் குறியீட்டில் அறிவிக்கப்படுகின்றன - எடுத்துக்காட்டாக:
uk: Увімкнення дозволяють хост-коду використовувати ідентифікатори рядків для параметрів, які обробляє мікроконтролер як цілі. Вони заявляють в мікроконтролерному коді - наприклад:

source: If the first example, the DECL_ENUMERATION() macro defines an enumeration for any command/response message with a parameter name of "spi_bus" or parameter name with a suffix of "_spi_bus". For those parameters the string "spi" is a valid value and it will be transmitted with an integer value of zero.
ca: Si el primer exemple, la macro DECL_ENUMERATION() defineix una enumeració per a qualsevol missatge d'ordre/resposta amb un nom de paràmetre "spi_bus" o un nom de paràmetre amb un sufix de "_spi_bus". Per a aquests paràmetres, la cadena "spi" és un valor vàlid i es transmetrà amb un valor enter de zero.
ta: முதல் எடுத்துக்காட்டு என்றால், "SPI_BUS" இன் அளவுரு பெயருடன் அல்லது "_SPI_BUS" என்ற பின்னொட்டுடன் எந்த கட்டளை/மறுமொழி செய்திக்கான ஒரு கணக்கீட்டை Dect_enumeration () மேக்ரோ வரையறுக்கிறது. அந்த அளவுருக்களுக்கு "SPI" என்ற சரம் செல்லுபடியாகும் மதிப்பு மற்றும் அது பூச்சியத்தின் முழு மதிப்புடன் கடத்தப்படும்.
uk: Якщо на першому прикладі, то макросика DECL_ENUMERATION() визначає ентуерацію для будь-якого командного/відповідного повідомлення з назвою параметра "spi_bus" або ім'ям параметра з суфіксом "_spi_bus". Для тих параметрів рядок "spi" є дійсним значенням і він буде передаватися з цілим значенням нуля.

source: It's also possible to declare an enumeration range. In the second example, a "pin" parameter (or any parameter with a suffix of "_pin") would accept PC0, PC1, PC2, ..., PC7 as valid values. The strings will be transmitted with integers 16, 17, 18, ..., 23.
ca: També és possible declarar un rang d'enumeració. En el segon exemple, un paràmetre "pin" (o qualsevol paràmetre amb un sufix de "_pin") acceptaria PC0, PC1, PC2, ..., PC7 com a valors vàlids. Les cadenes es transmetran amb nombres enters 16, 17, 18, ..., 23.
ta: ஒரு கணக்கீட்டு வரம்பை அறிவிக்க முடியும். இரண்டாவது எடுத்துக்காட்டில், ஒரு "முள்" அளவுரு (அல்லது "_pin" என்ற பின்னொட்டுடன் கூடிய எந்த அளவுருவும்) பிசி 0, பிசி 1, பிசி 2, ..., பிசி 7 ஐ சரியான மதிப்புகளாக ஏற்றுக் கொள்ளும். 16, 17, 18, ..., 23 எண்களுடன் சரங்கள் அனுப்பப்படும்.
uk: Також можна задекларувати діапазон винагород. У другому прикладі параметр "pin" (або будь-який параметр з суфіксом "_pin") приймається PC0, PC1, PC2, ..., PC7 як діє значення. Рядки будуть передаватися з цілими 16, 17, 18, ..., 23.

source: Declaring constants
ca: Declaració de constants
ta: மாறிலிகளை அறிவித்தல்
uk: Викривлення констанцій

source: Constants can also be exported. For example, the following:
ca: També es poden exportar constants. Per exemple, el següent:
ta: மாறிலிகளையும் ஏற்றுமதி செய்யலாம். உதாரணமாக, பின்வருபவை:
uk: Константи можна також експортувати. Наприклад, наступні:

source: would export a constant named "SERIAL_BAUD" with a value of 250000 from the micro-controller to the host. It is also possible to declare a constant that is a string - for example:
ca: exportaria una constant anomenada "SERIAL_BAUD" amb un valor de 250000 des del microcontrolador a l'amfitrió. També és possible declarar una constant que sigui una cadena, per exemple:
ta: மைக்ரோ-கன்ட்ரோலரிலிருந்து ஓச்டுக்கு 250000 மதிப்புடன் "சீரியல்_பாட்" என்ற பெயரில் நிலையான ஏற்றுமதி செய்யும். ஒரு சரம் என்று ஒரு மாறிலியை அறிவிக்க முடியும் - எடுத்துக்காட்டாக:
uk: експортувати постійну назву "СERIAL_BAUD" з значенням 250000 від мікроконтролера до господаря. Також можна заявити про констанцію, яка є рядком - наприклад:

source: Low-level message encoding
ca: Codificació de missatges de baix nivell
ta: குறைந்த அளவிலான செய்தி குறியாக்கம்
uk: Низький рівень кодування повідомлень

source: To accomplish the above RPC mechanism, each command and response is encoded into a binary format for transmission. This section describes the transmission system.
ca: Per aconseguir el mecanisme RPC anterior, cada comanda i resposta es codifica en un format binari per a la transmissió. En aquesta secció es descriu el sistema de transmissió.
ta: மேலே உள்ள RPC பொறிமுறையை நிறைவேற்ற, ஒவ்வொரு கட்டளையும் பதிலும் பரிமாற்றத்திற்கான பைனரி வடிவத்தில் குறியாக்கம் செய்யப்படுகிறது. இந்த பிரிவு பரிமாற்ற அமைப்பை விவரிக்கிறது.
uk: Для виконання вищевказаного механізму RPC, кожна команда та відповідь закодовано в бінарний формат для передачі. Цей розділ описує систему передачі.

source: Message Blocks
ca: Blocs de missatges
ta: செய்தி தொகுதிகள்
uk: Блоки повідомлень

source: All data sent from host to micro-controller and vice-versa are contained in "message blocks". A message block has a two byte header and a three byte trailer. The format of a message block is:
ca: Totes les dades enviades des de l'amfitrió al microcontrolador i viceversa estan contingudes en "blocs de missatges". Un bloc de missatges té una capçalera de dos bytes i un tràiler de tres bytes. El format d'un bloc de missatges és:
ta: ஓச்டிலிருந்து மைக்ரோ-கன்ட்ரோலருக்கு அனுப்பப்பட்ட அனைத்து தரவும் "செய்தி தொகுதிகள்" இல் உள்ளன. ஒரு செய்தி தொகுதிக்கு இரண்டு பைட் தலைப்பு மற்றும் மூன்று பைட் டிரெய்லர் உள்ளது. ஒரு செய்தித் தொகுதியின் வடிவம்:
uk: Всі дані, надіслані з хосту до мікроконтролера і сп-вереса, містяться в "блоках повідомлень". Блок повідомлення має два заголовки і три причепа. Формат блоку повідомлення:
