Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: ca, ta, uk

source: The format of the transmitted data dictionary itself is a zlib compressed JSON string. The micro-controller build process generates the string, compresses it, and stores it in the text section of the micro-controller flash. The data dictionary can be much larger than the maximum message block size - the host downloads it by sending multiple identify commands requesting progressive chunks of the data dictionary. Once all chunks are obtained the host will assemble the chunks, uncompress the data, and parse the contents.
ca: El format del propi diccionari de dades transmeses és una cadena JSON comprimida zlib. El procés de creació del microcontrolador genera la cadena, la comprimeix i l'emmagatzema a la secció de text del flash del microcontrolador. El diccionari de dades pot ser molt més gran que la mida màxima del bloc de missatges: l'amfitrió el descarrega enviant diverses ordres d'identificació demanant fragments progressius del diccionari de dades. Un cop obtinguts tots els fragments, l'amfitrió els reunirà, descomprimirà les dades i analitzarà el contingut.
ta: கடத்தப்பட்ட தரவு அகராதியின் வடிவம் ஒரு ச்லிப் சுருக்கப்பட்ட சாதொபொகு சரம் ஆகும். மைக்ரோ-கட்டுப்பாட்டு உருவாக்க செயல்முறை சரத்தை உருவாக்கி, அதை சுருக்கி, மைக்ரோ-கன்ட்ரோலர் ஃபிளாச் உரை பிரிவில் சேமிக்கிறது. தரவு அகராதி அதிகபட்ச செய்தி தொகுதி அளவை விட மிகப் பெரியதாக இருக்கும் - தரவு அகராதியின் முற்போக்கான பகுதிகளைக் கோரும் பல அடையாள கட்டளைகளை அனுப்புவதன் மூலம் புரவலன் அதை பதிவிறக்குகிறது. அனைத்து துகள்களும் பெறப்பட்டவுடன், புரவலன் துகள்களைக் கூட்டி, தரவைத் துண்டிக்கும், மற்றும் உள்ளடக்கங்களை அலசும்.
uk: Формат переданого словника даних є zlib стисненим рядком JSON. Процес побудови мікроконтролерів генерує рядок, стискає її, зберігає її в текстовому розділі мікроконтролерів спалаху. Словник даних може бути набагато більше, ніж розмір блоку повідомлення - він завантажує його, відправивши кілька команд, які вимагають прогресивних шматків словника даних. Після того, як всі шматки одержують хост, збираються шматки, ненав'язують дані, і припаркують вміст.

source: In addition to information on the communication protocol, the data dictionary also contains the software version, enumerations (as defined by DECL_ENUMERATION), and constants (as defined by DECL_CONSTANT).
ca: A més de la informació sobre el protocol de comunicació, el diccionari de dades també conté la versió del programari, les enumeracions (definides per DECL_ENUMERATION) i constants (tal com les defineix DECL_CONSTANT).
ta: தகவல்தொடர்பு நெறிமுறை பற்றிய தகவல்களுக்கு மேலதிகமாக, தரவு அகராதியில் மென்பொருள் பதிப்பு, கணக்கீடுகள் (டெக்_எனமரேசனால் வரையறுக்கப்பட்டுள்ளபடி) மற்றும் மாறிலிகள் (டெக்_கான்ட்ர்ட்டால் வரையறுக்கப்பட்டவை) ஆகியவை உள்ளன.
uk: На додаток до інформації про протокол зв'язку, словник даних також містить версію програмного забезпечення, заохочення (як визначено DECL_ENUMERATION), а також константи (як визначено DECL_CONSTANT).

source: Message flow
ca: Flux de missatges
ta: செய்தி ஓட்டம்
uk: Потік повідомлення

source: Message commands sent from host to micro-controller are intended to be error-free. The micro-controller will check the CRC and sequence numbers in each message block to ensure the commands are accurate and in-order. The micro-controller always processes message blocks in-order - should it receive a block out-of-order it will discard it and any other out-of-order blocks until it receives blocks with the correct sequencing.
ca: Les ordres de missatge enviades des de l'amfitrió al microcontrolador estan pensades per estar lliures d'errors. El microcontrolador comprovarà el CRC i els números de seqüència de cada bloc de missatges per assegurar-se que les ordres són precises i en ordre. El microcontrolador sempre processa els blocs de missatges en ordre: si rep un bloc fora d'ordre, el descartarà i qualsevol altre bloc fora d'ordre fins que rebi blocs amb la seqüenciació correcta.
ta: ஓச்டிலிருந்து மைக்ரோ-கன்ட்ரோலருக்கு அனுப்பப்பட்ட செய்தி கட்டளைகள் பிழையில்லாமல் இருக்க வேண்டும். கட்டளைகள் துல்லியமானவை மற்றும் ஒழுங்காக இருப்பதை உறுதிசெய்ய ஒவ்வொரு செய்தித் தொகுதியிலும் உள்ள சி.ஆர்.சி மற்றும் வரிசை எண்களை மைக்ரோ-கன்ட்ரோலர் சரிபார்க்கிறது. மைக்ரோ-கன்ட்ரோலர் எப்போதுமே செய்தித் தொகுதிகளை-வரிசையில் செயலாக்குகிறார்-அது ஒரு தொகுதியை வெளியேற்றினால், அது சரியான வரிசைமுறையுடன் தொகுதிகள் பெறும் வரை அதை நிராகரிக்கும்.
uk: Команди повідомлень, які надсилаються від хосту до мікроконтролю, призначені для того, щоб бути безпомилково. Мікроконтролер перевірить CRC і послідовність чисел в кожному блокі повідомлення, щоб забезпечити команди є точними і в порядку. Мікроконтролер завжди обробляє блоки повідомлень в порядку - повинен він отримувати блок поза замовлення, він буде відкинути його і будь-які інші блоки зовнішнього замовлення, поки він отримує блоки з правильним віджиманням.

source: The low-level host code implements an automatic retransmission system for lost and corrupt message blocks sent to the micro-controller. To facilitate this, the micro-controller transmits an "ack message block" after each successfully received message block. The host schedules a timeout after sending each block and it will retransmit should the timeout expire without receiving a corresponding "ack". In addition, if the micro-controller detects a corrupt or out-of-order block it may transmit a "nak message block" to facilitate fast retransmission.
ca: El codi amfitrió de baix nivell implementa un sistema de retransmissió automàtica per als blocs de missatges perduts i corruptes enviats al microcontrolador. Per facilitar-ho, el microcontrolador transmet un "bloc de missatge de confirmació" després de cada bloc de missatge rebut amb èxit. L'amfitrió programa un temps d'espera després d'enviar cada bloc i es tornarà a transmetre si el temps d'espera expira sense rebre un "ack" corresponent. A més, si el microcontrolador detecta un bloc corrupte o fora d'ordre, pot transmetre un "bloc de missatge nu" per facilitar la retransmissió ràpida.
ta: குறைந்த-நிலை புரவலன் குறியீடு மைக்ரோ-கன்ட்ரோலருக்கு அனுப்பப்பட்ட இழந்த மற்றும் ஊழல் செய்தி தொகுதிகளுக்கான தானியங்கி மறுசீரமைப்பு முறையை செயல்படுத்துகிறது. இதை எளிதாக்க, மைக்ரோ-கன்ட்ரோலர் ஒவ்வொரு வெற்றிகரமாக பெறப்பட்ட செய்தித் தொகுதியிலும் ஒரு "ACK செய்தி தொகுதியை" கடத்துகிறது. ஒவ்வொரு தொகுதியையும் அனுப்பிய பின் புரவலன் ஒரு காலக்கெடுவை திட்டமிடுகிறது, மேலும் அதனுடன் தொடர்புடைய "ACK" ஐப் பெறாமல் நேரம் முடிந்தது. கூடுதலாக, மைக்ரோ-கன்ட்ரோலர் ஒரு ஊழல் அல்லது ஆர்டர்-க்கு வெளியே உள்ள தொகுதியைக் கண்டறிந்தால், அது விரைவான மறுசீரமைப்பை எளிதாக்க ஒரு "NAK செய்தி தொகுதி" ஐ அனுப்பக்கூடும்.
uk: У низькому рівні хост-код реалізується автоматична система ретрансмісії для втрачених і пошкоджених блоків повідомлень, відправлених на мікроконтролер. Щоб полегшити це, мікроконтролер передає "блок повідомлення" після кожного успішно отримав блок повідомлень. Після відправки кожного блоку, він буде переадресувати, щоб часовий платіж без отримання відповідного "прибрати". Крім того, якщо мікроконтролер виявляє пошкоджений або позакореневий блок, він може передавати "блок повідомлень" для спрощення перепередачі.

source: An "ack" is a message block with empty content (ie, a 5 byte message block) and a sequence number greater than the last received host sequence number. A "nak" is a message block with empty content and a sequence number less than the last received host sequence number.
ca: Un "ack" és un bloc de missatges amb contingut buit (és a dir, un bloc de missatges de 5 bytes) i un número de seqüència més gran que l'últim número de seqüència d'amfitrió rebut. Un "nak" és un bloc de missatges amb contingut buit i un número de seqüència menor que l'últim número de seqüència de l'amfitrió rebut.
ta: ஒரு "ACK" என்பது வெற்று உள்ளடக்கம் (அதாவது, 5 பைட் செய்தி தொகுதி) மற்றும் கடைசியாக பெறப்பட்ட புரவலன் வரிசை எண்ணை விட அதிகமான வரிசை எண். "NAK" என்பது வெற்று உள்ளடக்கம் மற்றும் கடைசியாக பெறப்பட்ட புரவலன் வரிசை எண்ணை விட குறைவான வரிசை எண்.
uk: "не" - блок повідомлень з порожнім змістом (тобто блоком повідомлення 5) і числом послідовності більше, ніж останній отриманий номер послідовності. A "nak" являє собою блок повідомлень з порожнім вмістом і числом послідовності менше останнього отриманого номер послідовності.

source: The protocol facilitates a "window" transmission system so that the host can have many outstanding message blocks in-flight at a time. (This is in addition to the many commands that may be present in a given message block.) This allows maximum bandwidth utilization even in the event of transmission latency. The timeout, retransmit, windowing, and ack mechanism are inspired by similar mechanisms in [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).
ca: El protocol facilita un sistema de transmissió "finestra" perquè l'amfitrió pugui tenir molts blocs de missatges destacats en vol alhora. (Això s'afegeix a les moltes ordres que poden estar presents en un bloc de missatges determinat.) Això permet una utilització màxima de l'ample de banda fins i tot en cas de latència de transmissió. El temps d'espera, la retransmissió, la finestra i el mecanisme de confirmació estan inspirats en mecanismes similars a [TCP](https://ca.wikipedia.org/wiki/Transmission_Control_Protocoltocol).
ta: நெறிமுறை ஒரு "சாளரம்" பரிமாற்ற அமைப்பை எளிதாக்குகிறது, இதன்மூலம் ஓச்டுக்கு ஒரு நேரத்தில் விமானத்தில் பல சிறந்த செய்தி தொகுதிகள் இருக்க முடியும். (இது கொடுக்கப்பட்ட செய்தித் தொகுதியில் இருக்கக்கூடிய பல கட்டளைகளுக்கு கூடுதலாக உள்ளது.) இது பரிமாற்ற நேரந்தவறுகை ஏற்பட்டால் கூட அதிகபட்ச அலைவரிசை பயன்பாட்டை அனுமதிக்கிறது. [TCP] (https://en.wikipedia.org/wiki/transmission_control_protocol) இல் உள்ள ஒத்த வழிமுறைகளால் காலக்கெடு, ரெட்ரான்ச்மிட், சாளரம் மற்றும் ஏ.சி.கே.
uk: Протокол полегшує систему передачі "window" таким чином, що хост може мати багато видатних блоків повідомлень в діапазоні часу. (Це додаток до багатьох команд, які можуть бути присутніми в даній блокі повідомлень.) Це дозволяє використовувати максимальну пропускну здатність навіть у разі затримки передачі. Відправлення часу, перепередача, підвіконня, а також механізм ack натхненні аналогічними механізмами [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).

source: In the other direction, message blocks sent from micro-controller to host are designed to be error-free, but they do not have assured transmission. (Responses should not be corrupt, but they may go missing.) This is done to keep the implementation in the micro-controller simple. There is no automatic retransmission system for responses - the high-level code is expected to be capable of handling an occasional missing response (usually by re-requesting the content or setting up a recurring schedule of response transmission). The sequence number field in message blocks sent to the host is always one greater than the last received sequence number of message blocks received from the host. It is not used to track sequences of response message blocks.
ca: En l'altra direcció, els blocs de missatges enviats des del microcontrolador a l'amfitrió estan dissenyats per estar lliures d'errors, però no tenen una transmissió assegurada. (Les respostes no haurien de ser corruptes, però poden desaparèixer.) Això es fa per mantenir la implementació al microcontrolador senzilla. No hi ha un sistema de retransmissió automàtica per a les respostes: s'espera que el codi d'alt nivell sigui capaç de gestionar una resposta que falti ocasionalment (normalment tornant a sol·licitar el contingut o establir un programa recurrent de transmissió de respostes). El camp del número de seqüència dels blocs de missatges enviats a l'amfitrió sempre és un més gran que el darrer nombre de seqüències rebuts de blocs de missatges rebuts de l'amfitrió. No s'utilitza per fer un seguiment de seqüències de blocs de missatges de resposta.
ta: மற்ற திசையில், மைக்ரோ-கன்ட்ரோலரிலிருந்து ஓச்டுக்கு அனுப்பப்பட்ட செய்தி தொகுதிகள் பிழையில்லாமல் வடிவமைக்கப்பட்டுள்ளன, ஆனால் அவை உறுதியான பரிமாற்றத்தை கொண்டிருக்கவில்லை. (பதில்கள் ஊழல் நிறைந்ததாக இருக்கக்கூடாது, ஆனால் அவை காணாமல் போகக்கூடும்.) மைக்ரோ-கன்ட்ரோலரில் செயல்படுத்துவதை எளிமையாக வைத்திருக்க இது செய்யப்படுகிறது. பதில்களுக்கான தானியங்கி மறுபயன்பாட்டு அமைப்பு எதுவும் இல்லை-உயர் மட்ட குறியீடு அவ்வப்போது காணாமல் போன பதிலைக் கையாளும் திறன் கொண்டதாக இருக்கும் என்று எதிர்பார்க்கப்படுகிறது (வழக்கமாக உள்ளடக்கத்தை மீண்டும் கோருவதன் மூலம் அல்லது மறுமொழி பரிமாற்றத்தின் தொடர்ச்சியான அட்டவணையை அமைப்பதன் மூலம்). ஓச்டுக்கு அனுப்பப்பட்ட செய்தி தொகுதிகளில் உள்ள வரிசை எண் புலம் எப்போதும் ஓச்டிலிருந்து பெறப்பட்ட செய்தித் தொகுதிகளின் கடைசியாக பெறப்பட்ட வரிசை எண்ணிக்கையை விட அதிகமாகும். மறுமொழி செய்தி தொகுதிகளின் காட்சிகளைக் கண்காணிக்க இது பயன்படுத்தப்படவில்லை.
uk: У іншому напрямку блоки повідомлень, відправлені з мікроконтролера, призначені для того, щоб бути безпомилковими, але вони не мають обов'язкової передачі. (Відповідачі не повинні бути пошкоджені, але вони можуть бути відсутніми.) Це робиться для забезпечення реалізації мікроконтролерів простим. Не існує автоматичної ретрансмісійної системи для реагування - код високого рівня очікується, що може бути здатний працювати з періодичним відсутнім відгуком (зазвичай шляхом перезапитування вмісту або налаштування графіка рефлекторної передачі). Послідовне поле номеру в блоках повідомлень, які надсилаються господареві, завжди один більше, ніж останній отриманий послідовний номер блоків повідомлень, отриманих від господаря. Не використовується для відстеження послідовностей блоків повідомлень відповіді.

source: set_digital_out pin=PA3 value=1 set_digital_out pin=PA7 value=1 schedule_digital_out oid=8 clock=4000000 value=0 queue_step oid=7 interval=7458 count=10 add=331 queue_step oid=7 interval=11717 count=4 add=1281
ta: set_digital_out முள் = pa3 மதிப்பு = 1 set_digital_out முள் = pa7 மதிப்பு = 1 அட்டவணை_டிகிட்டல்_அவுட் OID = 8 கடிகாரம் = 4000000 மதிப்பு = 0 queue_step oid = 7 இடைவெளி = 7458 எண்ணிக்கை = 10 சேர் = 331 queue_step oid = 7 இடைவெளி = 11717 எண்ணிக்கை = 4 சேர் = 1281
uk: set_digital_out pin=PA3 значення=1 set_digital_out pin=PA7 значення=1 Графік роботи_Digital_out oid=8 годин=4000000 значення=0 string_step oid=7 інтервал=7458 count=10 add=331 string_step oid=7 інтервал=11717 count=4 add=1281

source: DECL_COMMAND(command_update_digital_out, "update_digital_out oid=%c value=%c");
ta: Dect_command (command_update_digital_out, "Update_digital_out oid =%c மதிப்பு =%c");

source: sendf("status clock=%u status=%c", sched_read_time(), sched_is_shutdown());
ta: அனுப்பு ("நிலை கடிகாரம் =%என்பது நிலை =%c", sall_read_time (), sall_is_shutdown ());
uk: sendf("годинник статусу=%u статус=%c", sched_read_time(), sched_is_shutdown());

source: output("The value of %u is %s with size %u.", x, buf, buf_len);
ta: வெளியீடு (" %u இன் மதிப்பு %s அளவு %u உடன் %s.", ஃச், buf, buf_len);
uk: output("Значення %u дорівнює %s із розміром %u.", x, buf, buf_len);

source: DECL_ENUMERATION("spi_bus", "spi", 0); DECL_ENUMERATION_RANGE("pin", "PC0", 16, 8);
ta: Decal_enumeration ("SPI_BUS", "SPI", 0); Dect_enumary_range ("முள்", "PC0", 16, 8);

source: DECL_CONSTANT("SERIAL_BAUD", 250000);
ta: Dect_constant ("சீரியல்_பாட்", 250000);

source: DECL_CONSTANT_STR("MCU", "pru");
ta: Dec_constant_str ("MCU", "prru");

source: <1 byte length><1 byte sequence><n-byte content><2 byte crc><1 byte sync>
ta: <1 பைட் நீளம்> <1 பைட் வரிசை> <n-பைட் உள்ளடக்கம்> <2 பைட் சி.ஆர்.சி> <1 பைட் ஒத்திசைவு>
uk: <1 byte length><1 byte end><n-byte content><2 byte crc><1 byte sync>

source: update_digital_out oid=6 value=1 update_digital_out oid=5 value=0 get_config get_clock
ta: Update_digital_out oid = 6 மதிப்பு = 1 Update_digital_out oid = 5 மதிப்பு = 0 get_config get_clock
uk: update_digital_out oid=6 значення=1 update_digital_out oid=5 значення=0 get_config get_clock

source: <id_update_digital_out><6><1><id_update_digital_out><5><0><id_get_config><id_get_clock>
ta: <id_update_digital_out> <6> <1> <id_update_digital_out> <5> <0> <disget_config> <id_get_clock>

source: <VLQ encoded length><n-byte contents>
ta: <VLQ குறியிடப்பட்ட நீளம்> <n-பைட் உள்ளடக்கங்கள்>

source: Protocol
uk: Протокол
