Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Releases.po
Languages: de

source: Enhanced CAN bus support. Support for CAN bus on rp2040, stm32g0, stm32h7, same51, and same54 chips. Support for "USB to CAN bus bridge" mode.
de: Verbesserte CAN Bus-Unterstützung. Unterstützung für CAN Bus auf rp2040, stm32g0, stm32h7, same51 und same54 Chips. Unterstützung für den Modus "USB zu CAN Bus Brücke".

source: Support for CanBoot bootloader.
de: Unterstützung für CanBoot Bootloader.

source: Support for mpu9250 and mpu6050 accelerometers.
de: Unterstützung für mpu9250 und mpu6050 Beschleunigungsmesser.

source: Improved error handling for max31856, max31855, max31865, and max6675 temperature sensors.
de: Verbesserte Fehlerbehandlung für max31856, max31855, max31865 und max6675 Temperatursensoren.

source: It is now possible to configure LEDs to update during long running G-Code commands using LED "template" support.
de: Es ist jetzt möglich, LEDs so zu konfigurieren, dass sie bei lang laufenden G-Code-Befehlen aktualisiert werden, indem LED "Vorlagen" unterstützt werden.

source: Several micro-controller improvements. New support for stm32h743, stm32h750, stm32l412, stm32g0b1, same70, same51, and same54 chips. Support for i2c reads on atsamd and stm32f0. Hardware pwm support on stm32. Linux mcu signal based event dispatch. New rp2040 support for "make flash", i2c, and rp2040-e5 USB errata.
de: Verschiedene Verbesserungen bei Mikrocontrollern. Neue Unterstützung für stm32h743, stm32h750, stm32l412, stm32g0b1, same70, same51, und same54 Chips. Unterstützung für i2c Lesevorgänge auf atsamd und stm32f0. Hardware pwm Unterstützung auf stm32. Linux mcu signalbasierter Ereignisversand. Neue rp2040 Unterstützung für "make flash", i2c und rp2040-e5 USB errata.

source: New modules added: angle, dac084S085, exclude_object, led, mpu9250, pca9632, smart_effector, z_thermal_adjust. New deltesian kinematics added. New dump_mcu tool added.
de: Neue Module hinzugefügt: angle, dac084S085, exclude_object, led, mpu9250, pca9632, smart_effector, z_thermal_adjust. Neue deltesische Kinematik hinzugefügt. Neues Werkzeug dump_mcu hinzugefügt.
