Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Releases.po
Languages: de

source: History of Klipper releases. Please see [installation](Installation.md) for information on installing Klipper.
de: Historie der Klipper-Versionen. Bitte lesen Sie [installation](Installation.md) für Informationen zur Installation von Klipper.

source: Available on 20201020. Major changes in this release:
de: Verfügbar ab 20201020. Bedeutende Änderungen in diesem Release:

source: Support for "Input Shaping" - a mechanism to counteract printer resonance. It can reduce or eliminate "ringing" in prints.
de: Unterstützung für "Input Shaping" ein Mechanismus, der Druckerresonanzen entgegenwirkt. Er kann das sogenannte"ringing" in Drucken reduzieren oder beseitigen.

source: New "Smooth Pressure Advance" system. This implements "Pressure Advance" without introducing instantaneous velocity changes. It is also now possible to tune pressure advance using a "Tuning Tower" method.
de: Neues "Smooth Pressure Advance" System. Damit wird "Pressure Advance" ohne unmittelbare Geschwindigkeitsänderungen implementiert. Es ist jetzt auch möglich, "Pressure Advance" mit einer "Tuning Tower" Methode abzustimmen.

source: New "webhooks" API server. This provides a programmable JSON interface to Klipper.
de: Neuer "webhooks" API Server. Dieser bietet eine programmierbare JSON-Schnittstelle zu Klipper.

source: The LCD display and menu are now configurable using the Jinja2 template language.
de: Die LCD-Anzeige und das Menü sind jetzt mit der Vorlagensprache Jinja2 konfigurierbar.

source: The TMC2208 stepper motor drivers can now be used in "standalone" mode with Klipper.
de: Die TMC2208 Schrittmotortreiber können jetzt im "standalone" Modus mit Klipper verwendet werden.

source: Improved BL-Touch v3 support.
de: Verbesserte BL-Touch v3-Unterstützung.

source: Improved USB identification. Klipper now has its own USB identification code and micro-controllers can now report their unique serial numbers during USB identification.
de: Verbesserte USB-Identifikation. Klipper hat jetzt seinen eigenen USB-Identifikationscode und Mikrocontroller können jetzt ihre eindeutigen Seriennummern während der USB-Identifikation melden.

source: New kinematic support for "Rotary Delta" and "CoreXZ" printers.
de: Neue kinematische Unterstützung für "Rotary Delta" und "CoreXZ" Drucker.

source: Micro-controller improvements: support for stm32f070, support for stm32f207, support for GPIO pins on "Linux MCU", stm32 "HID bootloader" support, Chitu bootloader support, MKS Robin bootloader support.
de: Mikrocontroller Verbesserungen: Unterstützung für stm32f070, Unterstützung für stm32f207, Unterstützung für GPIO Pins auf "Linux MCU", stm32 "HID Bootloader" Unterstützung, Chitu Bootloader Unterstützung, MKS Robin Bootloader Unterstützung.

source: Improved handling of Python "garbage collection" events.
de: Verbesserte Behandlung von Python-"garbage collection" Ereignissen.

source: Many additional modules added: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole
de: Viele weitere Module hinzugefügt: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole

source: Several bug fixes and code cleanups.
de: Mehrere Fehlerkorrekturen und Code-Bereinigungen.

source: Available on 20201028. Release containing only bug fixes.
de: Verfügbar ab 28.10.2020. Diese Version enthält nur Fehlerkorrekturen.

source: Available on 20191021. Major changes in this release:
de: Verfügbar ab 21.10.2019. Wichtige Änderungen in dieser Version:

source: New G-Code command template support. G-Code in the config file is now evaluated with the Jinja2 template language.
de: Neue Unterstützung für G-Code Befehlsvorlagen. G-Code in der Konfigurationsdatei wird jetzt mit der Jinja2 Vorlagensprache ausgewertet.

source: Improvements to Trinamic stepper drivers:
de: Verbesserungen an Trinamic Schritttreibern:

source: New support for TMC2209 and TMC5160 drivers.
de: Neue Unterstützung für TMC2209 und TMC5160 Treiber.

source: Improved DUMP_TMC, SET_TMC_CURRENT, and INIT_TMC G-Code commands.
de: Verbesserte DUMP_TMC, SET_TMC_CURRENT, und INIT_TMC G-Code Befehle.

source: Improved support for TMC UART handling with an analog mux.
de: Verbesserte Unterstützung für die Handhabung von TMC UART mit einem analogen mux.

source: Improved homing, probing, and bed leveling support:
de: Verbessertes "homing", "probing", und "bed leveling" unterstützung :

source: New manual_probe, bed_screws, screws_tilt_adjust, skew_correction, safe_z_home modules added.
de: Neue Module manual_probe, bed_screws, screws_tilt_adjust, skew_correction, safe_z_home hinzugefügt.

source: Enhanced multi-sample probing with median, average, and retry logic.
de: Verbessertes "multi-sample probing" mit Median-, Durchschnitts- und Wiederholungslogik.

source: Improved documentation for BL-Touch, probe calibration, endstop calibration, delta calibration, sensorless homing, and endstop phase calibration.
de: Verbesserte Dokumentation für BL-Touch, probe Kalibrierung, Endstop Kalibrierung, Delta Kalibrierung, Sensorloses homing und Endstop Phasenkalibrierung.

source: Improved homing support on a large Z axis.
de: Verbesserte "homing" auf einer großen Z-Achse.

source: Many Klipper micro-controller improvements:
de: Viele Klipper Mikrocontroller Verbesserungen:

source: Klipper ported to: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4
de: Klipper portiert auf: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4

source: New USB CDC driver implementations on SAM3X, SAM4, STM32F4.
de: Neue USB CDC Treiber Implementierungen auf SAM3X, SAM4, STM32F4.

source: Enhanced support for flashing Klipper over USB.
de: Verbesserte Unterstützung für das Flashen von Klipper über USB.

source: Software SPI support.
de: Software SPI-Unterstützung.

source: Greatly improved temperature filtering on the LPC176x.
de: Deutlich verbesserte Temperaturfilterung für LPC176x.

source: Early output pin settings can be configured in the micro-controller.
de: Ausgangs Pin Einstellungen können im Mikrocontroller konfiguriert werden.

source: New website with the Klipper documentation: http://klipper3d.org/
de: Neue Webseite mit der Klipper-Dokumentation: http://klipper3d.org/

source: Klipper now has a logo.
de: Klipper hat jetzt ein Logo.

source: Experimental support for polar and "cable winch" kinematics.
de: Experimentelle Unterstützung für "polar" und "Kabelwinden" Kinematik.

source: The config file can now include other config files.
de: Die config Datei kann jetzt andere config Dateien enthalten.

source: Many additional modules added: board_pins, controller_fan, delayed_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower
de: Viele weitere Module hinzugefügt: board_pins, controller_fan, delayed_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower

source: Many additional commands added: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET
de: Viele weitere Befehle wurden hinzugefügt: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET

source: Available on 20181220. Major changes in this release:
de: Verfügbar ab 20.12.2018. Wichtige Änderungen in dieser Version:

source: Klipper now supports "mesh" bed leveling
de: Klipper unterstützt jetzt "mesh" Bett Nivellierung

source: New support for "enhanced" delta calibration (calibrates print x/y dimensions on delta printers)
de: Neue Unterstützung für "verbesserte" Delta Kalibrierung (kalibriert Druck x/y Dimensionen auf Delta-Drucker)

source: Support for run-time configuration of Trinamic stepper motor drivers (tmc2130, tmc2208, tmc2660)
de: Unterstützung für die Laufzeitkonfiguration von Trinamic Schrittmotortreibern (tmc2130, tmc2208, tmc2660)

source: Improved temperature sensor support: MAX6675, MAX31855, MAX31856, MAX31865, custom thermistors, common pt100 style sensors
de: Verbesserte Unterstützung von Temperatursensoren: MAX6675, MAX31855, MAX31856, MAX31865, benutzerdefinierte Thermistoren, gängige pt100-Sensoren

source: Several new modules: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch
de: Mehrere neue Module: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch

source: Several new commands added: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, custom g-code macros
de: Mehrere neue Befehle hinzugefügt: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, benutzerdefinierte G-Code Makros

source: Expanded LCD display support:
de: Erweiterte LCD-Anzeigen Unterstützung:

source: Support for run-time menus
de: Unterstützung für Laufzeitmenüs

source: New display icons
de: Neue Anzeigensymbole

source: Support for "uc1701" and "ssd1306" displays
de: Unterstützung für "uc1701" und "ssd1306" Displays

source: Additional micro-controller support:
de: Zusätzliche Mikrocontroller Unterstützung:

source: Klipper ported to: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" devices), atmega32u4
de: Klipper portiert auf: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" Geräte), atmega32u4

source: New Generic USB CDC driver implemented on AVR, LPC176x, SAMD21, and STM32F103
de: Neue generische USB CDC Treiber implementiert auf AVR, LPC176x, SAMD21 und STM32F103

source: Performance improvements on ARM processors
de: Leistungsverbesserungen auf ARM-Prozessoren

source: The kinematics code was rewritten to use an "iterative solver"
de: Der Kinematik Code wurde umgeschrieben, um einen "iterativen Problemlöser" zu verwenden.

source: New automatic test cases for the Klipper host software
de: Neue automatische Testverfahren für die Klipper-Host-Software

source: Many new example config files for common off-the-shelf printers
de: Viele neue Beispiel Konfigurationsdateien für handelsübliche Drucker

source: Documentation updates for bootloaders, benchmarking, micro-controller porting, config checks, pin mapping, slicer settings, packaging, and more
de: Aktualisierte Dokumentation für Bootloader, Benchmarking, Portierung von Mikrocontrollern, Konfigurationsprüfungen, Pin Mapping, Slicer-Einstellungen, "packaging" und mehr

source: Several bug fixes and code cleanups
de: Verschiedene Fehlerbehebungen und Codebereinigungen

source: Available on 20180331. Major changes in this release:
de: Verfügbar ab 31.03.2018. Wichtige Änderungen in dieser Version:

source: Enhanced heater and thermistor hardware failure checks
de: Verbesserte Hardware Fehlerprüfung für Heizelemente und Temperatursensoren

source: Support for Z probes
de: Unterstützung für Z Sonden (Z probes)

source: Initial support for automatic parameter calibration on deltas (via a new delta_calibrate command)
de: Erstmalige Unterstützung für die automatische Parameterkalibrierung für Delta Drucker (über einen neuen Befehl delta_calibrate)

source: Initial support for bed tilt compensation (via bed_tilt_calibrate command)
de: Erstmalige Unterstützung für die Kompensation der Bettneigung (über den Befehl bed_tilt_calibrate)

source: Initial support for "safe homing" and homing overrides
de: Erstmalige Unterstützung von "safe homing" und "homing overrides"

source: Initial support for displaying status on RepRapDiscount style 2004 and 12864 displays
de: Erstmalige Unterstützung für die Anzeige des Status auf "RepRapDiscount" Displays in der Ausführung 2004 und 12864

source: New multi-extruder improvements:
de: Neue Multiextruder Verbesserungen:

source: Support for shared heaters
de: Unterstützung für gemeinsame Heizelemente

source: Initial support for dual carriages
de: Erstmalige Unterstützung für Doppelwagen (dual carriages)

source: Support for configuring multiple steppers per axis (eg, dual Z)
de: Unterstützung für die Konfiguration von mehreren Schrittmotoren pro Achse (z.B. Dual Z)

source: Support for custom digital and pwm output pins (with a new SET_PIN command)
de: Unterstützung für benutzerdefinierte digitale und pwm Ausgangspins (mit einem neuen SET_PIN Befehl)

source: Initial support for a "virtual sdcard" that allows printing directly from Klipper (helps on machines too slow to run OctoPrint well)
de: Erstmalige Unterstützung für eine "virtuelle SD-Karte", die das Drucken direkt von Klipper aus ermöglicht (hilft auf Rechnern, die zu langsam sind, um OctoPrint auszuführen)

source: Support for setting different arm lengths on each tower of a delta
de: Unterstützung für die Einstellung unterschiedlicher "Armlängen" der einzelnen Säulen eines Deltas Druckers

source: Support for G-Code M220/M221 commands (speed factor override / extrude factor override)
de: Unterstützung für G-Code M220/M221 Befehle (speed factor override / extrude factor override)

source: Several documentation updates:
de: Mehrere Dokumentations Updates:

source: New multiple MCU config example
de: Neues Beispiel für die Konfiguration mehrerer MCUs

source: New bltouch sensor config example
de: Neues Beispiel für die Konfiguration des bltouch-Sensors

source: New FAQ, config check, and G-Code documents
de: Neues FAQ, Konfigurationsprüfung und G-Code-Dokumente

source: Initial support for continuous integration testing on all github commits
de: Erstmalige Unterstützung für kontinuierliche Integrationstests für alle Github Beiträge

source: Available on 20171025. Major changes in this release:
de: Verfügbar ab 25.10.2017. Wichtige Änderungen in dieser Version:

source: Support for printers with multiple extruders.
de: Unterstützung für Drucker mit mehreren Extrudern.

source: Initial support for running on the Beaglebone PRU. Initial support for the Replicape board.
de: Erstmalige Unterstützung für den Betrieb auf Beaglebone PRU. Erstmalige Unterstützung für das Replicape-Board.

source: Initial support for running the micro-controller code in a real-time Linux process.
de: Erstmalige Unterstützung für die Ausführung des Mikrocontroller Codes in einem Echtzeit Linux-Prozess.

source: Support for multiple micro-controllers. (For example, one could control an extruder with one micro-controller and the rest of the printer with another.) Software clock synchronization is implemented to coordinate actions between micro-controllers.
de: Unterstützung für mehrere Mikrocontroller. (Zum Beispiel könnte man einen Extruder mit einem Mikrocontroller und den Rest des Druckers mit einem anderen steuern). Software Taktsynchronisierung ist implementiert, um Aktionen zwischen Mikrocontrollern zu koordinieren.

source: Stepper performance improvements (20Mhz AVRs up to 189K steps per second).
de: Verbesserte Schrittmotorenleistung (20Mhz AVRs mit bis zu 189K Schritten pro Sekunde).

source: Support for controlling servos and support for defining nozzle cooling fans.
de: Unterstützung für die Steuerung von Servos und Unterstützung für die Einrichtung von Düsenlüftern.

source: Available on 20170503. Major changes in this release:
de: Verfügbar ab 03.05.2017. Wichtige Änderungen in dieser Version:

source: Improved installation on Raspberry Pi machines. Most of the install is now scripted.
de: Verbesserte Installation auf Raspberry Pi Maschinen. Der größte Teil der Installation ist jetzt skriptgesteuert.

source: Support for corexy kinematics
de: Unterstützung für corexy Kinematik

source: Documentation updates: New Kinematics document, new Pressure Advance tuning guide, new example config files, and more
de: Aktualisierte Dokumentation: Neues Kinematik Dokument, neue Pressure Advance Tuning Anleitung, neue Beispiel Konfigurationsdateien und mehr

source: Stepper performance improvements (20Mhz AVRs over 175K steps per second, Arduino Due over 460K)
de: Verbesserung der Schrittmotorenleistung (20Mhz AVRs über 175K Schritte pro Sekunde, Arduino Due über 460K)

source: Support for automatic micro-controller resets. Support for resets via toggling USB power on Raspberry Pi.
de: Unterstützung für automatische Mikrocontroller Resets. Unterstützung für Resets durch Umschalten der USB Stromversorgung am Raspberry Pi.

source: The pressure advance algorithm now works with look-ahead to reduce pressure changes during cornering.
de: Der Algorithmus für "pressure advance" arbeitet jetzt mit "look-ahead", um Druckschwankungen bei Kurvenfahrten zu reduzieren.

source: Support for limiting the top speed of short zigzag moves
de: Unterstützung für die Begrenzung der Höchstgeschwindigkeit von kurzen Zickzack-Bewegungen

source: Support for AD595 sensors
de: Unterstützung für AD595 Sensoren

source: Available on 20161223. Major changes in this release:
de: Verfügbar ab 23.12.2016. Wichtige Änderungen in dieser Version:

source: Improved documentation
de: Verbesserte Dokumentation

source: Support for robots with delta kinematics
de: Unterstützung für Roboter mit Delta-Kinematik

source: Support for Arduino Due micro-controller (ARM cortex-M3)
de: Unterstützung für Arduino Mikrocontroller (ARM cortex-M3)

source: Support for USB based AVR micro-controllers
de: Unterstützung für USB basierte AVR-Mikrocontroller

source: Support for "pressure advance" algorithm - it reduces ooze during prints.
de: Unterstützung für den Algorithmus "pressure advance" - er reduziert das herausquellen während des Drucks.

source: New "stepper phased based endstop" feature - enables higher precision on endstop homing.
de: Neue Funktion "stepper phased based endstop" - ermöglicht eine höhere Präzision bei der Ansteuerung des Endstopps.

source: Support for "extended g-code" commands such as "help", "restart", and "status".
de: Unterstützung für "erweiterte g-code" Befehle wie "help", "restart", und "status".

source: Support for reloading the Klipper config and restarting the host software by issuing a "restart" command from the terminal.
de: Unterstützung für das Neuladen der Klipper Konfiguration und den Neustart der Host Software durch einen "restart" Befehl vom Terminal aus.

source: Stepper performance improvements (20Mhz AVRs up to 158K steps per second).
de: Verbesserte Schrittmotorenleistung (20Mhz AVRs bis zu 158K Schritte pro Sekunde).

source: Improved error reporting. Most errors now shown via the terminal along with help on how to resolve.
de: Verbesserte Fehlermeldungen. Die meisten Fehler werden jetzt über das Terminal angezeigt, zusammen mit Hinweisen zur Behebung.

source: Initial release of Klipper. Available on 20160525. Major features available in the initial release include:
de: Erste Veröffentlichung von Klipper. Verfügbar ab 25.05.2016. Zu den wichtigsten Funktionen der ersten Version gehören:

source: Basic support for cartesian printers (steppers, extruder, heated bed, cooling fan).
de: Grundlegende Unterstützung für kartesische Drucker (Stepper, Extruder, Heizbett, Kühlgebläse).

source: Support for common g-code commands. Support for interfacing with OctoPrint.
de: Unterstützung für gängige G-Code Befehle. Unterstützung für die Verbindung mit OctoPrint.

source: Acceleration and lookahead handling
de: Beschleunigung und Handhabung von Lookahead

source: Support for AVR micro-controllers via standard serial ports
de: Unterstützung für AVR-Mikrocontroller über serielle Standardschnittstellen

source: Releases
de: Veröffentlichungen

source: Available on 20210929. Major changes in this release:
de: Verfügbar ab 29.09.2021. Wichtige Änderungen in dieser Version:

source: Support for "Multi-MCU Homing". It is now possible for a stepper motor and its endstop to be wired to separate micro-controllers. This simplifies wiring of Z probes on "toolhead boards".
de: Unterstützung für "Multi-MCU Homing". Es ist jetzt möglich, einen Schrittmotor und seinen Endanschlag mit separaten Mikrocontrollern zu verdrahten. Dies vereinfacht die Verdrahtung von Z Proben auf sogenannten "toolhead boards".

source: Klipper now has a [Community Discord Server](https://discord.klipper3d.org) and a [Community Discourse Server](https://community.klipper3d.org).
de: Klipper hat jetzt einen [Community Discord Server](https://discord.klipper3d.org) und einen [Community Discourse Server](https://community.klipper3d.org).

source: The [Klipper website](https://www.klipper3d.org) now uses the "mkdocs" infrastructure. There is also a [Klipper Translations](https://github.com/Klipper3d/klipper-translations) project.
de: Die [Klipper-Webseite](https://www.klipper3d.org) verwendet jetzt die "mkdocs"-Infrastruktur. Es gibt auch ein [Klipper Übersetzungs](https://github.com/Klipper3d/klipper-translations) Projekt.

source: Automated support for flashing firmware via sdcard on many boards.
de: Automatische Unterstützung für das Flashen von Firmware über SD-Karten auf vielen Boards.

source: New kinematic support for "Hybrid CoreXY" and "Hybrid CoreXZ" printers.
de: Neue kinematische Unterstützung für "Hybrid CoreXY" und "Hybrid CoreXZ" Drucker.

source: Klipper now uses `rotation_distance` to configure stepper motor travel distances.
de: Klipper verwendet nun `rotation_distance` um die Fahrwege der Schrittmotoren zu konfigurieren.

source: The main Klipper host code can now directly communicate with micro-controllers using CAN bus.
de: Der Klipper Hauptcode kann nun direkt mit Mikrocontrollern über CAN-Bus kommunizieren.

source: New "motion analysis" system. Klipper's internal motion updates and sensor results can be tracked and logged for analysis.
de: Neues "motion analysis" System. Klippers interne Bewegungsaktualisierungen und Sensorergebnisse können verfolgt und zur Analyse aufgezeichnet werden.

source: Trinamic stepper motor drivers are now continuously monitored for error conditions.
de: Trinamic Schrittmotortreiber werden nun kontinuierlich auf Fehlerzustände überwacht.

source: Support for the rp2040 micro-controller (Raspberry Pi Pico boards).
de: Unterstützung für den Mikrocontroller rp2040 (Raspberry Pi Pico Boards).

source: The "make menuconfig" system now utilizes kconfiglib.
de: Das "make menuconfig" System verwendet jetzt kconfiglib.

source: Many additional modules added: ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu
de: Viele zusätzliche Module hinzugefügt: ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu

source: Available on 20221128. Major changes in this release:
de: Verfügbar ab 28.11.2022. Wichtige Änderungen in dieser Version:

source: Trinamic stepper motor driver "step on both edges" optimization.
de: Optimierung des Trinamic Schrittmotortreibers "step on both edges".

source: Support for Python3. The Klipper host code will run with either Python2 or Python3.
de: Unterstützung für Python3. Der Klipper-Host-Code läuft entweder mit Python2 oder Python3.
