Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: ta, uk

source: First, make sure it is not some other problem with the printer instead of ringing. If the measurements are not reliable because, say, the distance between the oscillations is not stable, it might mean that the printer has several resonance frequencies on the same axis. One may try to follow the tuning process described in [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) section and still get something out of the input shaping technique. Another possibility is to install an accelerometer, [measure](Measuring_Resonances.md) the resonances with it, and auto-tune the input shaper using the results of those measurements.
ta: முதலில், ஒலிப்பதற்கு பதிலாக அச்சுப்பொறியில் வேறு ஏதேனும் சிக்கல் இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். அளவீடுகள் நம்பகமானவை அல்ல, ஏனெனில், அலைவுகளுக்கு இடையிலான தூரம் நிலையானது அல்ல, அச்சுப்பொறியில் ஒரே அச்சில் பல அதிர்வு அதிர்வெண்கள் உள்ளன என்று பொருள். [ரிங்கிங் அதிர்வெண்களின் நம்பமுடியாத அளவீடுகள்] (#நம்பமுடியாத அளவிலான-மோதல்-வினோதங்கள்) பிரிவில் விவரிக்கப்பட்டுள்ள ட்யூனிங் செயல்முறையைப் பின்பற்ற முயற்சி செய்யலாம் மற்றும் உள்ளீட்டு வடிவமைத்தல் நுட்பத்திலிருந்து எதையாவது பெறலாம். மற்றொரு சாத்தியக்கூறு ஒரு முடுக்கமானியை நிறுவுவது, [அளவீட்டு] (அளவிடுதல்_ரெசோனன்ச்.
uk: По-перше, переконайтеся, що це не одна інша проблема з принтером замість дзвінка. Якщо вимірювання ненадійні, тому що, скажеш, відстань між коливаннями не стабільна, це може означати, що принтер має кілька резонансних частот на одній осі. Один може спробувати слідувати процесу тюнінгу, описаному в розділі [Ненадійні вимірювання частоти рингів](#безпосередньо-збережені-закриття-підготовки-фракції) і все-таки отримати щось з техніки вводу. Ще однією можливістю є встановлення акселерометра, [застосування](Measuring_Resonances.md) резонансів з ним, а також автоматичного відключення вхідного формуляра за допомогою результатів цих вимірювань.

source: After enabling [input_shaper], I get too smoothed printed parts and fine details are lost
ta: [Input_shaper] ஐ இயக்கிய பிறகு, நான் மிகவும் மென்மையாக்கப்பட்ட அச்சிடப்பட்ட பாகங்கள் மற்றும் சிறந்த விவரங்கள் இழக்கப்படுகின்றன
uk: Після надання допомоги [input_shaper] я отримав занадто гладкі друковані частини і дрібні деталі втрачені

source: Check the considerations in [Selecting max_accel](#selecting-max_accel) section. If the resonance frequency is low, one should not set too high max_accel or increase square_corner_velocity parameters. It might also be better to choose MZV or even ZV input shapers over EI (or 2HUMP_EI and 3HUMP_EI shapers).
ta: [MAX_ACCEL ஐத் தேர்ந்தெடுப்பது] (#தேர்ந்தெடுப்பது-MAX_ACCEL) பிரிவில் உள்ள கருத்தாய்வுகளைச் சரிபார்க்கவும். அதிர்வு அதிர்வெண் குறைவாக இருந்தால், ஒருவர் மிக அதிகபட்சமாக அமைக்கக்கூடாது அல்லது சதுர_சார்னர்_வெலோசிட்டி அளவுருக்களை அதிகரிக்கக்கூடாது. EI (அல்லது 2Hump_EI மற்றும் 3Hump_EI சேப்பர்கள்) வழியாக MZV அல்லது ZV உள்ளீட்டு வடிவங்களைத் தேர்ந்தெடுப்பது நல்லது.
uk: Перевірити розгляди в розділі [Вибір максимальн_accel](#selecting-max_accel) Якщо резонансна частота низька, не варто встановлювати занадто високі показники максимальної потужності або збільшити параметри квадрата_corner_velocity. Також можна вибрати MZV або навіть ZV-форматори для входу в EI (або 2HUMP_EI та 3HUMP_EI).

source: After successfully printing for some time without ringing, it appears to come back
ta: ஒலிக்காமல் சிறிது நேரம் வெற்றிகரமாக அச்சிட்ட பிறகு, அது திரும்பி வருவதாகத் தெரிகிறது
uk: Після успішного друку на деякий час без кільце, вона з'являється, щоб повернутися назад

source: It is possible that after some time the resonance frequencies have changed. E.g. maybe the belts tension has changed (belts got more loose), etc. It is a good idea to check and re-measure the ringing frequencies as described in [Ringing frequency](#ringing-frequency) section and update your config file if necessary.
ta: சிறிது நேரம் கழித்து அதிர்வு அதிர்வெண்கள் மாறிவிட்டன. எ.கா. ஒருவேளை பெல்ட்ச் பதற்றம் மாறிவிட்டது (பெல்ட்கள் மிகவும் தளர்வாகிவிட்டன) போன்றவை. .
uk: Імовірно, через деякий час резонансні частоти змінилися. наприклад можливо, змінився натяг ременів (послабилися ремені) тощо. Рекомендується перевірити та повторно виміряти частоти дзвінка, як описано в розділі [Частота дзвінка](#ringing-frequency), і за потреби оновити файл конфігурації .

source: Is dual carriage setup supported with input shapers?
ta: உள்ளீட்டு வடிவங்களுடன் இரட்டை வண்டி அமைப்பு ஆதரிக்கப்படுகிறதா?
uk: Чи підтримується подвійна настройка вагонетки з вводами?

source: Does input_shaper affect print time?
ta: Input_Shaper அச்சு நேரத்தை பாதிக்கிறதா?
uk: Чи впливає на час друку?

source: No, `input_shaper` feature has pretty much no impact on the print times by itself. However, the value of `max_accel` certainly does (tuning of this parameter described in [this section](#selecting-max_accel)).
ta: இல்லை, `input_shaper` நற்பொருத்தம் அச்சு நேரங்களில் எந்த தாக்கத்தையும் ஏற்படுத்தாது. இருப்பினும், `max_accel` இன் மதிப்பு நிச்சயமாக செய்கிறது ([இந்த பிரிவில்] விவரிக்கப்பட்டுள்ள இந்த அளவுருவின் சரிப்படுத்தும் (#-Max_accel ஐத் தேர்ந்தெடுப்பது)).
uk: Немає, `input_shaper` функція має досить багато ніякого впливу на час друку. Тим не менш, значення `max_accel`, безумовно, робить (встановлення цього параметра, описаного в розділі [Цей розділ](#selecting-max_accel)).

source: Technical details
ta: தொழில்நுட்ப விவரங்கள்
uk: Технічні характеристики

source: Input shapers
ta: உள்ளீட்டு வடிவங்கள்
uk: Вхідні форми

source: Input shapers used in Klipper are rather standard, and one can find more in-depth overview in the articles describing the corresponding shapers. This section contains a brief overview of some technical aspects of the supported input shapers. The table below shows some (usually approximate) parameters of each shaper.
ta: கிளிப்பரில் பயன்படுத்தப்படும் உள்ளீட்டு வடிவங்கள் மிகவும் நிலையானவை, மேலும் தொடர்புடைய சேப்பர்களை விவரிக்கும் கட்டுரைகளில் இன்னும் ஆழமான கண்ணோட்டத்தைக் காணலாம். இந்த பிரிவில் ஆதரிக்கப்பட்ட உள்ளீட்டு வடிவங்களின் சில தொழில்நுட்ப அம்சங்களின் சுருக்கமான கண்ணோட்டத்தைக் கொண்டுள்ளது. கீழேயுள்ள அட்டவணை ஒவ்வொரு சேப்பரின் சில (பொதுவாக தோராயமான) அளவுருக்களைக் காட்டுகிறது.
uk: Вхідні форми, що використовуються в Кліппері, є досить стандартними, і можна знайти більш глибокий огляд у статтях, що характеризують відповідні форми. Цей розділ містить короткий огляд деяких технічних аспектів підтримуваних форм. Таблиця нижче показує деякі (зазвичай приблизні) параметри кожного фігуратора.

source: Input <br> shaper
ta: உள்ளீடு <br> சேப்பர்
uk: Вхід <br> формар

source: Shaper <br> duration
ta: சேப்பர் <br> காலம்
uk: Шейпер <br> тривалість

source: Vibration reduction 20x <br> (5% vibration tolerance)
ta: அதிர்வு குறைப்பு 20x <br> (5% அதிர்வு சகிப்புத்தன்மை)
uk: Зменшення вібрації 20х <br> (5% толерантність до вібрації)

source: Vibration reduction 10x <br> (10% vibration tolerance)
ta: அதிர்வு குறைப்பு 10x <br> (10% அதிர்வு சகிப்புத்தன்மை)
uk: Зменшення вібрації 10x <br> (10% толерантність до вібрації)

source: ZV
uk: ЗВ

source: 0.5 / shaper_freq
ta: 0.5 / சேப்பர்_ஃப்ரெக்
uk: 0.5 / форма_freq

source: N/A
ta: இதற்கில்லை
uk: Невідомо

source: ± 5% shaper_freq
ta: ± 5% சேப்பர்_ஃப்ரெக்
uk: ± 5% формар_фрек

source: MZV
ta: மெகாவாட்
uk: МЗВ

source: 0.75 / shaper_freq
ta: 0.75 / சேப்பர்_ஃப்ரெக்
uk: 0 товар(ов) - 0.00 р

source: ± 4% shaper_freq
ta: ± 4% சேப்பர்_ஃப்ரெக்
uk: ± 4% формар_фрек

source: -10%...+15% shaper_freq
ta: -10% ...+15% சேப்பர்_ஃப்ரெக்
uk: -10%...+15% формар_фрек

source: ZVD
uk: ЗВД

source: 1 / shaper_freq
ta: 1 / சேப்பர்_ஃப்ரெக்
uk: 1 / формар_фрек

source: ± 15% shaper_freq
ta: ± 15% சேப்பர்_ஃப்ரெக்
uk: ± 15% формар_фрек

source: ± 22% shaper_freq
ta: ± 22% சேப்பர்_ஃப்ரெக்
uk: ± 22% формар_фрек

source: EI
ta: இல்லை
uk: ЕІ

source: ± 20% shaper_freq
ta: ± 20% சேப்பர்_ஃப்ரெக்
uk: ± 20% формар_фрек

source: ± 25% shaper_freq
ta: ± 25% சேப்பர்_ஃப்ரெக்
uk: ± 25% формар_фрек

source: 1.5 / shaper_freq
ta: 1.5 / சேப்பர்_ஃப்ரெக்
uk: 1.5 / формар_фрек

source: ± 35% shaper_freq
ta: ± 35% சேப்பர்_ஃப்ரெக்
uk: ± 35% формар_фрек

source: ± 40 shaper_freq
ta: ± 40 சேப்பர்_ஃப்ரெக்
uk: ± 40 формар_фрек

source: 2 / shaper_freq
ta: 2 / சேப்பர்_ஃப்ரெக்
uk: 2 / форма_freq

source: -45...+50% shaper_freq
ta: -45 ...+50% சேப்பர்_ஃப்ரெக்
uk: -45...+50% формар_фрек

source: -50%...+55% shaper_freq
ta: -50% ...+55% சேப்பர்_ஃப்ரெக்
uk: -50%...+55% форма_freq

source: A note on vibration reduction: the values in the table above are approximate. If the damping ratio of the printer is known for each axis, the shaper can be configured more precisely and it will then reduce the resonances in a bit wider range of frequencies. However, the damping ratio is usually unknown and is hard to estimate without a special equipment, so Klipper uses 0.1 value by default, which is a good all-round value. The frequency ranges in the table cover a number of different possible damping ratios around that value (approx. from 0.05 to 0.2).
ta: அதிர்வு குறைப்பு பற்றிய குறிப்பு: மேலே உள்ள அட்டவணையில் உள்ள மதிப்புகள் தோராயமானவை. அச்சுப்பொறியின் ஈரப்பத விகிதம் ஒவ்வொரு அச்சுக்கும் தெரிந்தால், சேப்பரை இன்னும் துல்லியமாக உள்ளமைக்க முடியும், மேலும் அது அதிர்வுகளை சற்று பரந்த அளவிலான அதிர்வெண்களில் குறைக்கும். இருப்பினும், அடர்த்தியான விகிதம் பொதுவாக அறியப்படாதது மற்றும் ஒரு சிறப்பு உபகரணங்கள் இல்லாமல் மதிப்பிடுவது கடினம், எனவே கிளிப்பர் இயல்பாக 0.1 மதிப்பைப் பயன்படுத்துகிறது, இது ஒரு நல்ல ஆல்ரவுண்ட் மதிப்பு. அட்டவணையில் உள்ள அதிர்வெண் வரம்புகள் அந்த மதிப்பைச் சுற்றியுள்ள பல சாத்தியமான ஈரப்பத விகிதங்களை உள்ளடக்கியது (தோராயமாக 0.05 முதல் 0.2 வரை).
uk: Замітка про зменшення вібрації: значення таблиці вище приблизні. Якщо коефіцієнт пошкодження принтера відомий за кожну віссю, то формар може бути налаштований більш точно, а потім зменшити резонанси в трохи ширшому діапазоні частот. Тим не менш, коефіцієнт пошкодження зазвичай невідомий і важко оцінити без спеціального обладнання, тому Klipper використовує значення 0.1 за замовчуванням, що є хорошим цілим значенням. Частота діапазонів в таблиці охоплює ряд різних можливих демпферних коефіцієнтів навколо цього значення (близько від 0,05 до 0,2).

source: Also note that EI, 2HUMP_EI, and 3HUMP_EI are tuned to reduce vibrations to 5%, so the values for 10% vibration tolerance are provided only for the reference.
ta: அதிர்வுகளை 5% ஆகக் குறைக்க EI, 2HUMP_EI, மற்றும் 3HUMP_EI ஆகியவை வடிவமைக்கப்பட்டுள்ளன, எனவே 10% அதிர்வு சகிப்புத்தன்மைக்கான மதிப்புகள் குறிப்புக்கு மட்டுமே வழங்கப்படுகின்றன.
uk: Також зверніть увагу, що EI, 2HUMP_EI, 3HUMP_ EI налаштовані для зменшення коливань до 5%, тому значення для 10% толерантності до коливань передбачені тільки для посилання.

source: **How to use this table:**
ta: ** இந்த அட்டவணையை எவ்வாறு பயன்படுத்துவது: **
uk: **Як використовувати цей стіл:**

source: Shaper duration affects the smoothing in parts - the larger it is, the more smooth the parts are. This dependency is not linear, but can give a sense of which shapers 'smooth' more for the same frequency. The ordering by smoothing is like this: ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI. Also, it is rarely practical to set shaper_freq = resonance freq for shapers 2HUMP_EI and 3HUMP_EI (they should be used to reduce vibrations for several frequencies).
ta: சேப்பர் காலம் பகுதிகளாக மென்மையாக்குவதை பாதிக்கிறது - அது பெரியது, பாகங்கள் மிகவும் மென்மையானவை. இந்த சார்பு நேரியல் அல்ல, ஆனால் ஒரே அதிர்வெண்ணுக்கு எந்த வடிவங்கள் 'மென்மையானவை' என்பதற்கான உணர்வைத் தரும். மென்மையாக்குவதன் மூலம் வரிசைப்படுத்துவது இது போன்றது: ZV <MZV <ZVD ≈ EI <2HUMP_EI <3HUMP_EI. மேலும், சேப்பர்_ஃப்ரெக் = ரெசோனன்ச் ஃப்ரீக் சேப்பர்களான 2hump_ei மற்றும் 3hump_ei (அவை பல அதிர்வெண்களுக்கான அதிர்வுகளை குறைக்க பயன்படுத்தப்பட வேண்டும்).
uk: Тривалість шейпера впливає на розгладжування деталей - чим більше він, тим більш гладкі деталі. Ця залежність не лінійна, але може дати відчуття того, що фігурники 'smooth' більш для однакової частоти. Зварювальне замовлення: ZV < MZV < ZVD ≈ < 2HUMP_EI < 3HUMP_EI. Крім того, це рідко практичне встановлення формера_freq = резонансний фрек для форматорів 2HUMP_EI і 3HUMP_EI (вони слід використовувати для зменшення коливань на кілька частот).

source: One can estimate a range of frequencies in which the shaper reduces vibrations. For example, MZV with shaper_freq = 35 Hz reduces vibrations to 5% for frequencies [33.6, 36.4] Hz. 3HUMP_EI with shaper_freq = 50 Hz reduces vibrations to 5% in range [27.5, 75] Hz.
ta: சேப்பர் அதிர்வுகளைக் குறைக்கும் அதிர்வெண்களின் வரம்பை ஒருவர் மதிப்பிடலாம். எடுத்துக்காட்டாக, சேப்பர்_ஃப்ரெக் = 35 எர்ட்ச் கொண்ட எம்.சே.வி அதிர்வெண்களுக்கு அதிர்வுகளை 5% ஆகக் குறைக்கிறது [33.6, 36.4] எர்ட்ச். சேப்பர்_ஃப்ரெக் = 50 எர்ட்ச் கொண்ட 3hump_ei அதிர்வுகளை 5% ஆகக் குறைக்கிறது [27.5, 75] எர்ட்ச்.
uk: Можна оцінити діапазон частот, в яких формар зменшує вібрації. Наприклад, MZV з форматором_freq = 35 Hz зменшує вібрації до 5% для частот [33.6, 36.4] Hz. 3HUMP_EI з форматор_freq = 50 Hz зменшує вібрації до 5% в діапазоні [27.5, 75] ХХз.

source: One can use this table to check which shaper they should be using if they need to reduce vibrations at several frequencies. For example, if one has resonances at 35 Hz and 60 Hz on the same axis: a) EI shaper needs to have shaper_freq = 35 / (1 - 0.2) = 43.75 Hz, and it will reduce resonances until 43.75 * (1 + 0.2) = 52.5 Hz, so it is not sufficient; b) 2HUMP_EI shaper needs to have shaper_freq = 35 / (1 - 0.35) = 53.85 Hz and will reduce vibrations until 53.85 * (1 + 0.35) = 72.7 Hz - so this is an acceptable configuration. Always try to use as high shaper_freq as possible for a given shaper (perhaps with some safety margin, so in this example shaper_freq ≈ 50-52 Hz would work best), and try to use a shaper with as small shaper duration as possible.
ta: பல அதிர்வெண்களில் அதிர்வுகளைக் குறைக்க வேண்டுமானால் அவர்கள் எந்த சேப்பரைப் பயன்படுத்த வேண்டும் என்பதைச் சரிபார்க்க இந்த அட்டவணையைப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, ஒருவருக்கு ஒரே அச்சில் 35 எர்ட்ச் மற்றும் 60 எர்ட்சில் அதிர்வுகள் இருந்தால்: அ) ஈ) சேப்பர்_ஃப்ரெக் = 35 / (1 - 0.2) = 43.75 எர்ட்ச் இருக்க வேண்டும், மேலும் இது 43.75 * (1 + 0.2 வரை அதிர்வுகளை குறைக்கும் ) = 52.5 எர்ட்ச், எனவே அது போதுமானதாக இல்லை; b) 2hump_ei சேப்பருக்கு சேப்பர்_ஃப்ரெக் = 35 / (1 - 0.35) = 53.85 எர்ட்ச் இருக்க வேண்டும் மற்றும் 53.85 * (1 + 0.35) = 72.7 எர்ட்ச் வரை அதிர்வுகளை குறைக்கும் - எனவே இது ஏற்றுக்கொள்ளக்கூடிய உள்ளமைவு. கொடுக்கப்பட்ட சேப்பருக்கு முடிந்தவரை உயர் சேப்பர்_ஃப்ரெக்கைப் பயன்படுத்த முயற்சிக்கவும் (ஒருவேளை சில பாதுகாப்பு விளிம்புடன், எனவே இந்த எடுத்துக்காட்டில் சேப்பர்_ஃப்ரெக் ≈ 50-52 எர்ட்ச் சிறப்பாக செயல்படும்), மேலும் முடிந்தவரை சிறிய சேப்பர் கால அளவைக் கொண்ட ஒரு சேப்பரைப் பயன்படுத்த முயற்சிக்கவும்.
uk: Можна використовувати цей столик, щоб перевірити, який форматор повинен використовуватися, якщо вони повинні зменшити вібрації на декількох частотах. Наприклад, якщо один має резонанси на 35 Гц і 60 Гц на тій же осі: a) EI формар повинен мати формар_freq = 35 / (1 - 0,2) = 43.75 Hz, і це знизить резонанси до 43.75 * (1 + 0,2) = 52.5 Hz, так що це не достатній; b) 2HUMP_EI формар повинен мати формар_freq = 35 / (1 - 0.35) = 53.85 Hz і зменшить вібрації до 53.85 * (1 + 0,35) = 72.7 Hz - так це прийнятна конфігурація. Завжди намагайтеся використовувати якомога вище формаr_freq як можна для даної форми (пергапи з деякими запасами безпеки, тому в цьому прикладі формаr_freq ≈ 50-52 Гц буде працювати краще), і спробувати використовувати фігурку з максимально невеликою тривалістю фігури.

source: If one needs to reduce vibrations at several very different frequencies (say, 30 Hz and 100 Hz), they may see that the table above does not provide enough information. In this case one may have more luck with [scripts/graph_shaper.py](../scripts/graph_shaper.py) script, which is more flexible.
ta: பல வேறுபட்ட அதிர்வெண்களில் அதிர்வுகளை குறைக்க வேண்டும் என்றால் (சொல்லுங்கள், 30 எர்ட்ச் மற்றும் 100 எர்ட்ச்), மேலே உள்ள அட்டவணை போதுமான தகவல்களை வழங்காது என்பதை அவர்கள் காணலாம். இந்த விசயத்தில் [ச்கிரிப்டுகள்/வரைபடம்_சேப்பர்.பை] (../ ச்கிரிப்ட்கள்/வரைபடம்_சேப்பர்.பை) ச்கிரிப்டுடன் அதிக அதிர்ச்டம் இருக்கலாம், இது மிகவும் நெகிழ்வானது.
uk: Якщо комусь потрібно зменшити вібрацію на кількох дуже різних частотах (скажімо, 30 Гц і 100 Гц), вони можуть побачити, що таблиця вище не надає достатньо інформації. У цьому випадку вам може пощастити більше зі сценарієм [scripts/graph_shaper.py](../scripts/graph_shaper.py), який є більш гнучким.

source: [input_shaper] shaper_freq_x: ... # frequency for the X mark of the test model shaper_freq_y: ... # frequency for the Y mark of the test model
ta: [input_shaper] Shaper_freq_x: ... # சோதனை மாதிரியின் ஃச் அடையாளத்திற்கான அதிர்வெண் shaper_freq_y: ... # சோதனை மாதிரியின் ஒய் அடையாளத்திற்கான அதிர்வெண்
uk: [input_shaper] shaper_freq_x: ... # частота для X маркування тестової моделі shaper_freq_y: ... # частота для знака Y тестової моделі

source: [input_shaper] shaper_freq_x: ... shaper_freq_y: ... shaper_type: mzv
uk: [input_shaper] shaper_freq_x: ... shaper_freq_y: ... тип_формувача: мзв

source: Basic tuning requires measuring the ringing frequencies of the printer by printing a test model.
ta: சோதனை மாதிரியை அச்சிடுவதன் மூலம் அச்சுப்பொறியின் ரிங்கிங் அதிர்வெண்களை அளவிட அடிப்படை ட்யூனிங்கிற்கு தேவைப்படுகிறது.
uk: Базове тюнінг вимагає вимірювання частоти кілець принтера шляхом друку тестової моделі.

source: If `square_corner_velocity` parameter was changed, revert it back to 5.0. It is not advised to increase it when using input shaper because it can cause more smoothing in parts - it is better to use higher acceleration value instead.
ta: `சதுர_கார்னர்_வெலோசிட்டி` அளவுரு மாற்றப்பட்டால், அதை மீண்டும் 5.0 ஆக மாற்றவும். உள்ளீட்டு சேப்பரைப் பயன்படுத்தும் போது அதை அதிகரிக்க அறிவுறுத்தப்படவில்லை, ஏனெனில் இது பகுதிகளில் அதிக மென்மையை ஏற்படுத்தும் - அதற்கு பதிலாக அதிக முடுக்கம் மதிப்பைப் பயன்படுத்துவது நல்லது.
uk: Якщо змінено параметр `square_corner_velocity`, перевернув його назад до 5.0. Не радимо збільшити його при використанні вхідної форми, тому що вона може викликати більш плавлення деталей - краще використовувати більш високу вартість прискорення замість.

source: Disable Pressure Advance: `SET_PRESSURE_ADVANCE ADVANCE=0`
ta: அழுத்த முன்கூட்டியே முடக்கு: `set_pressure_advance அட்வான்ச் = 0`
uk: Відключений тиск: `SET_PRESSURE_ADVANCE ADVANCE=0`

source: Execute the command: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` Basically, we try to make ringing more pronounced by setting different large values for acceleration. This command will increase the acceleration every 5 mm starting from 1500 mm/sec^2: 1500 mm/sec^2, 2000 mm/sec^2, 2500 mm/sec^2 and so forth up until 7000 mm/sec^2 at the last band.
ta: கட்டளையை இயக்கவும்: `ட்யூனிங்_டவர் கட்டளை = set_velocity_limit அளவுரு = முடி தொடக்க = 1500 step_delta = 500 step_height = 5` அடிப்படையில், முடுக்கத்திற்கு வெவ்வேறு பெரிய மதிப்புகளை அமைப்பதன் மூலம் ரிங்கிங் மேலும் வெளிப்படையானதாக மாற்ற முயற்சிக்கிறோம். இந்த கட்டளை ஒவ்வொரு 5 மிமீ முதல் 1500 மிமீ/நொடி^2: 1500 மிமீ/நொடி^2, 2000 மிமீ/நொடி^2, 2500 மிமீ/நொடி^2 முதல் 7000 மிமீ/நொடி^2 வரை முடுக்கம் அதிகரிக்கும் கடைசி இசைக்குழு.
uk: Виконання команди: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` В основному, ми намагаємося зробити кільце більш вираженим, встановлюючи різні великі значення для прискорення. Ця команда збільшить прискорення кожні 5 мм від 1500 мм/сек^2: 1500 мм/сек^2, 2000 мм/сек^2, 2500 мм/секек^2 і т.д. до 7000 мм/сек^2 на останню смугу.

source: Do (8) - (10) for Y mark as well.
ta: ஒய் மார்க்குக்கும் (8) - (10) செய்யுங்கள்.
uk: До (8) - (10) для марки Y.

source: Print the ringing test model as follows:
ta: ரிங்கிங் சோதனை மாதிரியை பின்வருமாறு அச்சிடுக:
uk: Друк моделі тестування кільця:

source: Restart the firmware: `RESTART`
ta: ஃபார்ம்வேரை மறுதொடக்கம் செய்யுங்கள்: `மறுதொடக்கம்`
uk: Решта прошивки: `RESTART`

source: Execute: `SET_INPUT_SHAPER SHAPER_TYPE=MZV`
ta: செயல்படுத்த: `set_input_shaper shaper_type = mzv`
uk: `SET_INPUT_SHAPER SHAPER_TYPE=MZV`

source: Execute the command: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`
ta: கட்டளையை இயக்கவும்: `ட்யூனிங்_டவர் கட்டளை = set_velocity_limit அளவுரு = முடி தொடக்க = 1500 step_delta = 500 step_height = 5`
uk: Виконання команди: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`

source: Now try EI input shaper. To try it, repeat steps (1)-(6) from above, but executing at step 4 the following command instead: `SET_INPUT_SHAPER SHAPER_TYPE=EI`.
ta: இப்போது EI உள்ளீட்டு சேப்பரை முயற்சிக்கவும். இதை முயற்சிக்க, மேலே இருந்து (1)-(6) படிகளை மீண்டும் செய்யவும், ஆனால் அதற்கு பதிலாக பின்வரும் கட்டளையை படி 4 இல் செயல்படுத்துகிறது: `set_input_shaper shaper_type = ei`.
uk: Тепер спробуйте EI вхідної форми. Щоб спробувати це, повторіть кроки (1)-(6) з вище, але виконуючи на крок 4 наступні команди замість: `SET_INPUT_SHAPER SHAPER_TYPE=EI`.

source: You should have a printed test for the shaper you chose from the previous step (if you don't, print the test model sliced with the [suggested parameters](#tuning) with the pressure advance disabled `SET_PRESSURE_ADVANCE ADVANCE=0` and with the tuning tower enabled as `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`). Note that at very high accelerations, depending on the resonance frequency and the input shaper you chose (e.g. EI shaper creates more smoothing than MZV), input shaping may cause too much smoothing and rounding of the parts. So, max_accel should be chosen such as to prevent that. Another parameter that can impact smoothing is `square_corner_velocity`, so it is not advisable to increase it above the default 5 mm/sec to prevent increased smoothing.
ta: முந்தைய படியிலிருந்து நீங்கள் தேர்ந்தெடுத்த சேப்பருக்கு அச்சிடப்பட்ட சோதனை இருக்க வேண்டும் (நீங்கள் அவ்வாறு செய்யாவிட்டால், டெச்ட் மாதிரியை [பரிந்துரைக்கப்பட்ட அளவுருக்கள்] (#ட்யூனிங்) உடன் வெட்டப்பட்ட அழுத்த முன்கூட்டியே முடக்கப்பட்ட `set_pressure_advance அட்வான்ச் = 0` மற்றும் ட்யூனிங் கோபுரம் `ட்யூனிங்_டவர் கட்டளை = set_velocity_limit அளவுரு = முடி தொடக்க = 1500 step_delta = 500 step_height = 5`). அதிர்வு அதிர்வெண் மற்றும் நீங்கள் தேர்ந்தெடுத்த உள்ளீட்டு சேப்பரைப் பொறுத்து (எ.கா. EI சேப்பர் MZV ஐ விட மென்மையாக்குகிறது), உள்ளீட்டு வடிவமைத்தல் மிகவும் மென்மையாக்குவதையும் பகுதிகளின் வட்டத்தையும் ஏற்படுத்தக்கூடும் என்பதை நினைவில் கொள்க. எனவே, அதைத் தடுக்க MAX_ACCEL ஐ தேர்வு செய்ய வேண்டும். மென்மையாக்கலை பாதிக்கக்கூடிய மற்றொரு அளவுரு `சதுர_கார்னர்_வெலோசிட்டி` ஆகும், எனவே அதிகரித்த மென்மையாக்கத்தைத் தடுக்க இயல்புநிலை 5 மிமீ/நொடியை விட அதை அதிகரிப்பது அறிவுறுத்தப்படவில்லை.
uk: Ви повинні мати друкований тест для фігуратора, який ви вибрали з попереднього кроку (якщо ви не, роздрукуйте тестову модель, зрізану з [переглянуті параметри](#tuning) з передовим відключенням тиску `SET_PRESSURE_ADVANCE ADVANCE=0` і з тюнінговою вежею, включеною як `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`). Зверніть увагу, що при дуже високих прискореннях, в залежності від частоти резонансу та обраної форми вводу (наприклад, EI-форматор створює більш гладкі, ніж MZV), вводне формування може призвести занадто багато згладжування та округлення деталей. Таким чином, максимальна кількість відключень повинна бути обрана таким чином, щоб запобігти цьому. Ще один параметр, який може вплинути на розгладжування `square_corner_velocity`, тому не бажано збільшити його над за замовчуванням 5 мм/сек, щоб запобігти збільшенню згладжування.
