Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: ta, uk

source: Resonance Compensation
uk: Компенсація резонансів

source: Klipper supports Input Shaping - a technique that can be used to reduce ringing (also known as echoing, ghosting or rippling) in prints. Ringing is a surface printing defect when, typically, elements like edges repeat themselves on a printed surface as a subtle 'echo':
ta: கிளிப்பர் உள்ளீட்டு வடிவமைப்பை ஆதரிக்கிறது - அச்சிட்டுகளில் ரிங்கிங் (எதிரொலித்தல், பேய் அல்லது சிற்றலை என்றும் அழைக்கப்படுகிறது) குறைக்க பயன்படுத்தக்கூடிய ஒரு நுட்பம். ரிங்கிங் என்பது ஒரு மேற்பரப்பு அச்சிடும் குறைபாடாகும், பொதுவாக, விளிம்புகள் போன்ற கூறுகள் ஒரு நுட்பமான 'எதிரொலி' என அச்சிடப்பட்ட மேற்பரப்பில் தங்களை மீண்டும் கூறுகின்றன:
uk: Кліпперові опори Вхідне формування - це техніка, яка може бути використана для зменшення кільця (також відомий як ехоінг, приховує або перехоплення) у принтах. Кільце - це дефект поверхневого друку, коли, як правило, елементи, такі як краї повторюють себе на друкованій поверхні, як тонкий «ехо»:

source: |![Ringing test](img/ringing-test.jpg)|![3D Benchy](img/ringing-3dbenchy.jpg)|
ta: |! [ரிங்கிங் டெச்ட்] (IMG/ரிங்கிங்-சோதனை
uk: |![Тест дзвінка](img/ringing-test.jpg)|![3D Benchy](img/ringing-3dbenchy.jpg)|

source: Ringing is caused by mechanical vibrations in the printer due to quick changes of the printing direction. Note that ringing usually has mechanical origins: insufficiently rigid printer frame, non-tight or too springy belts, alignment issues of mechanical parts, heavy moving mass, etc. Those should be checked and fixed first, if possible.
ta: அச்சிடும் திசையின் விரைவான மாற்றங்கள் காரணமாக அச்சுப்பொறியில் இயந்திர அதிர்வுகளால் ரிங்கிங் ஏற்படுகிறது. ரிங்கிங் வழக்கமாக இயந்திர தோற்றம் கொண்டது என்பதை நினைவில் கொள்க: போதுமான கடினமான கடினமான அச்சுப்பொறி சட்டகம், இறுக்கமற்ற அல்லது அதிக வசந்த பெல்ட்கள், இயந்திர பாகங்களின் சீரமைப்பு சிக்கல்கள், கனமான நகரும் நிறை போன்றவை. முடிந்தால் முதலில் சரிபார்க்கப்பட்டு சரி செய்யப்பட வேண்டும்.
uk: Кільце викликається механічними коливаннями в принтері через швидкі зміни напрямку друку. Зауважте, що кільце зазвичай має механічне походження: недостатньо жорсткі принтери рамки, нещільно або занадто пружинні ремені, вирівнюючі проблеми механічних деталей, важкої рухомої маси тощо. Якщо це можливо.

source: [Input shaping](https://en.wikipedia.org/wiki/Input_shaping) is an open-loop control technique which creates a commanding signal that cancels its own vibrations. Input shaping requires some tuning and measurements before it can be enabled. Besides ringing, Input Shaping typically reduces the vibrations and shaking of the printer in general, and may also improve the reliability of the stealthChop mode of Trinamic stepper drivers.
ta: . உள்ளீட்டு வடிவமைப்பிற்கு சில ட்யூனிங் மற்றும் அளவீடுகள் இயக்கப்படுவதற்கு முன்பு தேவை. ஒலிப்பதைத் தவிர, உள்ளீடு வடிவமைப்பது பொதுவாக அச்சுப்பொறியின் அதிர்வுகளையும் நடுங்குவதையும் குறைக்கிறது, மேலும் டிரினாமிக் ச்டெப்பர் டிரைவர்களின் ச்டெல்த்சாப் பயன்முறையின் நம்பகத்தன்மையையும் மேம்படுத்தலாம்.
uk: [Input shaping](https://en.wikipedia.org/wiki/Input_shaping) є відкритою технікою управління, яка створює сигнал, який скасовує власні вібрації. Перед тим як він може бути включений. Крім того, кільце, вхідне формування, як правило, зменшує вібрацій і погладжування принтера в цілому, а також може підвищити надійність крадіжкиChop режиму Trinamic stepper драйверів.

source: Tuning
ta: ட்யூனிங்
uk: Тюнінг

source: Slice the ringing test model, which can be found in [docs/prints/ringing_tower.stl](prints/ringing_tower.stl), in the slicer:
ta: ரிங்கிங் சோதனை மாதிரியை நறுக்கவும், இது [டாக்ச்/அச்சு/ரிங்கிங் டவர்.
uk: Вимикайте модель ринг-тесту, яку можна знайти в [docs/prints/ringing_tower.stl](prints/ringing_tower.stl), в скибочку:

source: Suggested layer height is 0.2 or 0.25 mm.
ta: பரிந்துரைக்கப்பட்ட அடுக்கு உயரம் 0.2 அல்லது 0.25 மிமீ ஆகும்.
uk: Висота шару застигається 0,2 або 0,25 мм.

source: Infill and top layers can be set to 0.
ta: இன்ஃபில் மற்றும் மேல் அடுக்குகளை 0 ஆக அமைக்கலாம்.
uk: Наповнення і верхній шари можна встановити до 0.

source: Use 1-2 perimeters, or even better the smooth vase mode with 1-2 mm base.
ta: 1-2 பெரிமீட்டர்களைப் பயன்படுத்தவும், அல்லது 1-2 மிமீ தளத்துடன் மென்மையான குவளை பயன்முறையை இன்னும் சிறப்பாகவும் பயன்படுத்தவும்.
uk: Використовуйте 1-2 периметри, або навіть краще режим гладкої вази з підставою 1-2 мм.

source: Use sufficiently high speed, around 80-100 mm/sec, for **external** perimeters.
ta: ** வெளிப்புற ** பெரிமீட்டர்களுக்கு 80-100 மிமீ/நொடி போதுமான அதிவேக வேகத்தைப் பயன்படுத்தவும்.
uk: Використовуйте досить високу швидкість, близько 80-100 мм / сек, для **зовнішній** периметри.

source: Make sure that the minimum layer time is **at most** 3 seconds.
ta: குறைந்தபட்ச அடுக்கு நேரம் ** அதிகபட்சம் ** 3 வினாடிகளில் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Переконайтеся, що мінімальний час шару ** в більшості** 3 секунди.

source: Make sure any "dynamic acceleration control" is disabled in the slicer.
ta: ச்லைசரில் எந்த "மாறும் முடுக்கம் கட்டுப்பாடு" முடக்கப்பட்டுள்ளது என்பதை உறுதிப்படுத்தவும்.
uk: Переконайтеся, що будь-який "динамічний контроль прискорення" вимкнено в скибочках.

source: Do not turn the model. The model has X and Y marks at the back of the model. Note the unusual location of the marks vs. the axes of the printer - it is not a mistake. The marks can be used later in the tuning process as a reference, because they show which axis the measurements correspond to.
ta: மாதிரியைத் திருப்ப வேண்டாம். மாதிரியின் பின்புறத்தில் ஃச் மற்றும் ஒய் மதிப்பெண்கள் உள்ளன. அச்சுப்பொறியின் அச்சுகள் எதிராக மதிப்பெண்களின் அசாதாரண இருப்பிடத்தைக் கவனியுங்கள் - இது தவறு அல்ல. மதிப்பெண்கள் பின்னர் ட்யூனிங் செயல்பாட்டில் ஒரு குறிப்பாகப் பயன்படுத்தப்படலாம், ஏனென்றால் அவை எந்த அச்சுக்கு அளவீடுகள் ஒத்துப்போகின்றன என்பதைக் காட்டுகின்றன.
uk: Не поверніть модель. Модель має позначки X і Y на спині моделі. Зверніть увагу на незвичайне розташування позначок проти осі принтера - це не помилка. Відмітки можуть бути використані пізніше в процесі тюнінгу як посилання, оскільки вони показують, що вісь виміри відповідають.

source: Ringing frequency
ta: ஒலிக்கும் அதிர்வெண்
uk: Частота кільця

source: First, measure the **ringing frequency**.
ta: முதலில், ** ரிங்கிங் அதிர்வெண் ** ஐ அளவிடவும்.
uk: По-перше, заміряйте частоту **рингінгу **.

source: If you have already added `[input_shaper]` section to the printer.cfg, execute `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0` command. If you get "Unknown command" error, you can safely ignore it at this point and continue with the measurements.
ta: நீங்கள் ஏற்கனவே `[INPUT_SHAPER]` பிரிவில் `பிரிவில் சேர்த்திருந்தால்,` set_input_shaper shaper_freq_x = 0 shaper_freq_y = 0` கட்டளையை இயக்கவும். நீங்கள் "அறியப்படாத கட்டளை" பிழையைப் பெற்றால், இந்த கட்டத்தில் அதைப் பாதுகாப்பாக புறக்கணித்து அளவீடுகளைத் தொடரலாம்.
uk: Якщо ви вже додали `[input_shaper]` розділ до принтера.cfg, виконувати `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0` команди. Якщо ви отримуєте "Невідоме командування" помилку, ви можете сміливо ігнорувати його в цій точці і продовжити вимірювання.

source: Print the test model sliced with the suggested parameters.
ta: பரிந்துரைக்கப்பட்ட அளவுருக்கள் மூலம் வெட்டப்பட்ட சோதனை மாதிரியை அச்சிடுக.
uk: Друк тестової моделі зрізаний за допомогою запропонованих параметрів.

source: You can stop the print earlier if the ringing is clearly visible and you see that acceleration gets too high for your printer (e.g. printer shakes too much or starts skipping steps).
ta: ரிங்கிங் தெளிவாகத் தெரிந்தால் நீங்கள் முந்தைய அச்சை நிறுத்தலாம், மேலும் உங்கள் அச்சுப்பொறிக்கு முடுக்கம் மிக அதிகமாக இருப்பதைக் காணலாம் (எ.கா. அச்சுப்பொறி அதிகமாக நடுங்குகிறது அல்லது படிகளைத் தவிர்க்கத் தொடங்குகிறது).
uk: Ви можете зупинити друк раніше, якщо кільце чітко видно, і ви бачите, що прискорення отримує занадто високий для вашого принтера (наприклад, принтер шейк занадто багато або починає пропустити кроки).

source: Use X and Y marks at the back of the model for reference. The measurements from the side with X mark should be used for X axis *configuration*, and Y mark - for Y axis configuration. Measure the distance *D* (in mm) between several oscillations on the part with X mark, near the notches, preferably skipping the first oscillation or two. To measure the distance between oscillations more easily, mark the oscillations first, then measure the distance between the marks with a ruler or calipers:
ta: குறிப்புக்கு மாதிரியின் பின்புறத்தில் ஃச் மற்றும் ஒய் மதிப்பெண்களைப் பயன்படுத்தவும். ஃச் குறியுடன் பக்கத்திலிருந்து அளவீடுகள் ஃச் அச்சு *உள்ளமைவு *, மற்றும் ஒய் குறி - ஒய் அச்சு உள்ளமைவுக்கு பயன்படுத்தப்பட வேண்டும். ஃச் மார்க் உடன் பல ஊசலாட்டங்களுக்கு இடையில் * டி * (மிமீ) தூரத்தை அளவிடவும், குறிப்புகளுக்கு அருகில், முன்னுரிமை முதல் அலைவு அல்லது இரண்டைத் தவிர்க்கிறது. ஊசலாட்டங்களுக்கிடையிலான தூரத்தை மிக எளிதாக அளவிட, முதலில் ஊசலாட்டங்களைக் குறிக்கவும், பின்னர் ஒரு ஆட்சியாளர் அல்லது காலிப்பர்களுடன் மதிப்பெண்களுக்கு இடையிலான தூரத்தை அளவிடவும்:
uk: Використовуйте позначки X і Y на спині моделі для посилання. Вимірювання з боку з позначкою X слід використовувати для осі X *конфігурація *, а знак Y - для налаштування осі Y. Виміряйте відстань *D* (в мм) між декількома коливаннями на складі з позначкою X, біля лавок, бажано пропустити першу коливання або два. Щоб виміряти відстань між коливаннями більш легко, спочатку позначте коливання, після чого виміряйте відстань між позначками з лінійкою або затискачами:

source: |![Mark ringing](img/ringing-mark.jpg)|![Measure ringing](img/ringing-measure.jpg)|
uk: Увійти [Маркове кільце](img/ringing-mark.jpg) }} [Measure ringing](img/ringing-measure.jpg) }}

source: Count how many oscillations *N* the measured distance *D* corresponds to. If you are unsure how to count the oscillations, refer to the picture above, which shows *N* = 6 oscillations.
ta: எத்தனை ஊசலாட்டங்கள் * n * அளவிடப்பட்ட தூரம் * டி * க்கு ஒத்திருக்கிறது. ஊசலாட்டங்களை எவ்வாறு எண்ணுவது என்பது உங்களுக்குத் தெரியாவிட்டால், மேலே உள்ள படத்தைப் பார்க்கவும், இது * n * = 6 ஊசலாட்டங்களைக் காட்டுகிறது.
uk: Кількість коливань *N* вимірюється відстань *D* відповідає. Якщо ви не впевнені, як підрахувати коливання, зверніться до зображення вище, яке показує *N* = 6 коливань.

source: Compute the ringing frequency of X axis as *V* &middot; *N* / *D* (Hz), where *V* is the velocity for outer perimeters (mm/sec). For the example above, we marked 6 oscillations, and the test was printed at 100 mm/sec velocity, so the frequency is 100 * 6 / 12.14 ≈ 49.4 Hz.
ta: ஃச் அச்சின் ரிங்கிங் அதிர்வெண்ணை * v * & middot என கணக்கிடுங்கள்; * N* /* d* (Hz), இங்கு* v* என்பது வெளிப்புற சுற்றளவு (மிமீ / நொடி) விரைவு. மேலே உள்ள எடுத்துக்காட்டுக்கு, நாங்கள் 6 ஊசலாட்டங்களைக் குறித்தோம், சோதனை 100 மிமீ / நொடி வேகத்தில் அச்சிடப்பட்டது, எனவே அதிர்வெண் 100 * 6 / 12.14 ≈ 49.4 எர்ட்ச் ஆகும்.
uk: Розгорніть частоту занурювання осі X, як *V* · *N* / *D* (Хз), де *V* є швидкістю зовнішнього периметра (мм/сек). На прикладі вище ми позначили 6 коливань, і тест був надрукований на швидкості 100 мм/сек, тому частота 100 * 6 / 12.14 ≈ 49.4 Гц.

source: Note that ringing on the test print should follow the pattern of the curved notches, as in the picture above. If it doesn't, then this defect is not really a ringing and has a different origin - either mechanical, or an extruder issue. It should be fixed first before enabling and tuning input shapers.
ta: சோதனை அச்சில் ஒலிப்பது மேலே உள்ள படத்தைப் போலவே வளைந்த குறிப்புகளின் வடிவத்தைப் பின்பற்ற வேண்டும் என்பதை நினைவில் கொள்க. அவ்வாறு இல்லையென்றால், இந்த குறைபாடு உண்மையில் ஒரு ரிங்கிங் அல்ல, மேலும் வேறுபட்ட தோற்றத்தைக் கொண்டுள்ளது - இயந்திர அல்லது எக்ச்ட்ரூடர் சிக்கல். உள்ளீட்டு வடிவங்களை இயக்குவதற்கும் டியூன் செய்வதற்கும் முன் இது முதலில் சரி செய்யப்பட வேண்டும்.
uk: Зверніть увагу, що кільце на тестовому друку слідувати шаблону вигнутих лавок, як на малюнку вище. Якщо це не так, то цей дефект не є дійсно кільцем і має різне походження - або механічне, або зовнішнє питання. Перед застосуванням та налаштуванням вводних форм.

source: If the measurements are not reliable because, say, the distance between the oscillations is not stable, it might mean that the printer has several resonance frequencies on the same axis. One may try to follow the tuning process described in [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) section instead and still get something out of the input shaping technique.
ta: அளவீடுகள் நம்பகமானவை அல்ல, ஏனெனில், அலைவுகளுக்கு இடையிலான தூரம் நிலையானது அல்ல, அச்சுப்பொறியில் ஒரே அச்சில் பல அதிர்வு அதிர்வெண்கள் உள்ளன என்று பொருள். [ரிங்கிங் அதிர்வெண்களின் நம்பமுடியாத அளவீடுகள்] (#நம்பமுடியாத அளவிலான-மோதல்-அதிர்வெண்கள்) பிரிவில் விவரிக்கப்பட்டுள்ள ட்யூனிங் செயல்முறையைப் பின்பற்ற முயற்சி செய்யலாம், மேலும் உள்ளீட்டு வடிவமைத்தல் நுட்பத்திலிருந்து எதையாவது பெறலாம்.
uk: Якщо вимірювання ненадійні через, скажімо, відстань між коливаннями нестабільна, це може означати, що принтер має кілька резонансних частот на одній осі. Натомість можна спробувати виконати процес налаштування, описаний у розділі [Ненадійні вимірювання частот дзвінків](#unreliable-measurements-of-ringing-frequencies), і все одно отримати щось із техніки формування вхідних даних.

source: Ringing frequency can depend on the position of the model within the buildplate and Z height, *especially on delta printers*; you can check if you see the differences in frequencies at different positions along the sides of the test model and at different heights. You can calculate the average ringing frequencies over X and Y axes if that is the case.
ta: ரிங்கிங் அதிர்வெண் பில்ட்பிள் மற்றும் சட் உயரத்திற்குள் மாதிரியின் நிலையைப் பொறுத்தது, *குறிப்பாக டெல்டா அச்சுப்பொறிகளில் *; சோதனை மாதிரியின் பக்கங்களிலும், வெவ்வேறு உயரங்களிலும் வெவ்வேறு நிலைகளில் அதிர்வெண்களில் உள்ள வேறுபாடுகளை நீங்கள் கண்டீர்களா என்பதை நீங்கள் சரிபார்க்கலாம். ஃச் மற்றும் ஒய் அச்சுகளுக்கு மேல் சராசரி ரிங்கிங் அதிர்வெண்களைக் கணக்கிடலாம்.
uk: Частота забору може залежати від положення моделі в межах будівельної плити і висоти Z, * особливо від принтерів delta*; ви можете перевірити, якщо ви бачите відмінності в частотах на різних позиціях по сторонах тестової моделі і на різних висотах. Ви можете розрахувати середні частоти за допомогою X і Y, якщо це випадок.

source: If the measured ringing frequency is very low (below approx 20-25 Hz), it might be a good idea to invest into stiffening the printer or decreasing the moving mass - depending on what is applicable in your case - before proceeding with further input shaping tuning, and re-measuring the frequencies afterwards. For many popular printer models there are often some solutions available already.
ta: அளவிடப்பட்ட ரிங்கிங் அதிர்வெண் மிகக் குறைவாக இருந்தால் (தோராயமாக 20-25 எர்ட்சுக்குக் கீழே), அச்சுப்பொறியை கடினப்படுத்த அல்லது நகரும் வெகுசனத்தைக் குறைப்பதில் முதலீடு செய்வது நல்ல யோசனையாக இருக்கலாம் - உங்கள் விசயத்தில் பொருந்தக்கூடியதைப் பொறுத்து - மேலும் உள்ளீட்டு வடிவத்துடன் தொடர முன் ட்யூனிங், மற்றும் அதிர்வெண்களை மீண்டும் அளவிடுதல். பல பிரபலமான அச்சுப்பொறி மாதிரிகளுக்கு பெரும்பாலும் சில தீர்வுகள் உள்ளன.
uk: Якщо виміряна частота дзвінка дуже низька (повторна приблизно 20-25 Гц), це може бути гарною ідеєю для інвестування в жорсткість принтера або зменшення рухомої маси - в залежності від того, яка застосовується у вашому випадку - перш ніж продовжити з подальшим входом на формування тюнінга, і повторно збільшуючи частоти після Для багатьох популярних моделей принтера часто є деякі рішення, доступні вже.

source: Note that the ringing frequencies can change if the changes are made to the printer that affect the moving mass or change the stiffness of the system, for example:
ta: நகரும் வெகுசனத்தை பாதிக்கும் அல்லது கணினியின் விறைப்பை மாற்றும் அச்சுப்பொறியில் மாற்றங்கள் செய்யப்பட்டால் ஒலிக்கும் அதிர்வெண்கள் மாறக்கூடும் என்பதை நினைவில் கொள்க, எடுத்துக்காட்டாக:
uk: Зауважте, що частота кільця може змінюватися, якщо зміни внесені до принтера, які впливають на рухову масу або змінюють жорсткість системи, наприклад:

source: Some tools are installed, removed or replaced on the toolhead that change its mass, e.g. a new (heavier or lighter) stepper motor for direct extruder or a new hotend is installed, heavy fan with a duct is added, etc.
ta: சில கருவிகள் அதன் வெகுசனத்தை மாற்றும் கருவித்தொகுப்பில் நிறுவப்பட்டுள்ளன, அகற்றப்படுகின்றன அல்லது மாற்றப்படுகின்றன, எ.கா. நேரடி எக்ச்ட்ரூடர் அல்லது புதிய ஆட்எண்டிற்கான புதிய (கனமான அல்லது இலகுவான) ச்டெப்பர் மின்னோடி நிறுவப்பட்டுள்ளது, ஒரு குழாய் கொண்ட கனமான விசிறி சேர்க்கப்பட்டுள்ளது.
uk: Деякі інструменти встановлюються, видалені або замінені на інструментголові, які змінюють свою масу, наприклад, новий (спадковий або запальний) кроковий двигун для прямого екструдера або нового гарячика встановлюється, важкий вентилятор з протоком додається і т.д.

source: Belts are tightened.
ta: பெல்ட்கள் இறுக்கப்படுகின்றன.
uk: Ремені затягуються.

source: Some addons to increase frame rigidity are installed.
ta: பிரேம் விறைப்புத்தன்மையை அதிகரிக்க சில துணை நிரல்கள் நிறுவப்பட்டுள்ளன.
uk: Встановлено деякі додатки для збільшення жорсткості рами.

source: Different bed is installed on a bed-slinger printer, or glass added, etc.
ta: படுக்கை-ச்லிங்கர் அச்சுப்பொறியில் வெவ்வேறு படுக்கை நிறுவப்பட்டுள்ளது, அல்லது கண்ணாடி சேர்க்கப்பட்ட கண்ணாடி போன்றவை.
uk: Додаткове ліжко встановлюється на плащовий принтер, або скло додано і т.д.

source: If such changes are made, it is a good idea to at least measure the ringing frequencies to see if they have changed.
ta: இத்தகைய மாற்றங்கள் செய்யப்பட்டால், ஒலிக்கும் அதிர்வெண்கள் மாறிவிட்டனவா என்பதைப் பார்க்க குறைந்தபட்சம் அளவிடுவது நல்லது.
uk: Якщо такі зміни внесені, це хороша ідея, щоб принаймні виміряти частоту дзвінка, щоб побачити, якщо вони змінилися.

source: Input shaper configuration
ta: உள்ளீட்டு சேப்பர் உள்ளமைவு
uk: Конфігурація формувача

source: After the ringing frequencies for X and Y axes are measured, you can add the following section to your `printer.cfg`:
ta: ஃச் மற்றும் ஒய் அச்சுகளுக்கான ரிங்கிங் அதிர்வெண்கள் அளவிடப்பட்ட பிறகு, பின்வரும் பகுதியை உங்கள் `printel.cfg` இல் சேர்க்கலாம்:
uk: Після вимірюваних частот кільця для X і Y ви можете додати наступний розділ до вашого `printer.cfg`:

source: For the example above, we get shaper_freq_x/y = 49.4.
ta: மேலே உள்ள எடுத்துக்காட்டுக்கு, நாங்கள் சேப்பர்_ஃப்ரெக்_எக்ச்/ஒய் = 49.4 ஐப் பெறுகிறோம்.
uk: На прикладі вище ми отримуємо формувальну_freq_x/y = 49.4.

source: Choosing input shaper
ta: உள்ளீட்டு சேப்பரைத் தேர்ந்தெடுப்பது
uk: Вибір вхідної форми

source: Klipper supports several input shapers. They differ in their sensitivity to errors determining the resonance frequency and how much smoothing they cause in the printed parts. Also, some of the shapers like 2HUMP_EI and 3HUMP_EI should usually not be used with shaper_freq = resonance frequency - they are configured from different considerations to reduce several resonances at once.
ta: கிளிப்பர் பல உள்ளீட்டு வடிவங்களை ஆதரிக்கிறார். அதிர்வு அதிர்வெண்ணை நிர்ணயிக்கும் பிழைகள் மற்றும் அச்சிடப்பட்ட பகுதிகளில் அவை எவ்வளவு மென்மையாக்குகின்றன என்பதை அவை உணர்திறன் வேறுபடுகின்றன. மேலும், 2hump_ei மற்றும் 3hump_ei போன்ற சில சேப்பர்கள் வழக்கமாக சேப்பர்_ஃப்ரெக் = அதிர்வு அதிர்வெண் மூலம் பயன்படுத்தப்படக்கூடாது - அவை ஒரே நேரத்தில் பல அதிர்வுகளை குறைக்க வெவ்வேறு கருத்தாய்வுகளிலிருந்து கட்டமைக்கப்படுகின்றன.
uk: Кліппер підтримує кілька форматорів введення. Вони відрізняються своєю чутливістю до помилок, що визначають резонансну частоту і скільки розгладжування вони викликають у друкованих деталях. Також деякі з форматорів, як 2HUMP_EI і 3HUMP_EI, як правило, не повинні використовуватися з форматором_freq = резонансна частота - вони налаштовані з різних міркування, щоб зменшити кілька резонансів одночасно.

source: For most of the printers, either MZV or EI shapers can be recommended. This section describes a testing process to choose between them, and figure out a few other related parameters.
ta: பெரும்பாலான அச்சுப்பொறிகளுக்கு, MZV அல்லது EI சேப்பர்கள் பரிந்துரைக்கப்படலாம். இந்த பிரிவு அவற்றுக்கிடையே தேர்வு செய்வதற்கான ஒரு சோதனை செயல்முறையை விவரிக்கிறது, மேலும் சில தொடர்புடைய அளவுருக்களைக் கண்டுபிடிக்கவும்.
uk: Для більшості принтерів можна використовувати як MZV або EI. Цей розділ описує процес тестування, щоб вибрати між ними, і дізнатися кілька інших пов'язаних параметрів.

source: If you see no ringing at this point, then MZV shaper can be recommended for use.
ta: இந்த கட்டத்தில் எந்த ஒலிப்பையும் நீங்கள் காணவில்லை என்றால், MZV சேப்பரை பயன்படுத்த பரிந்துரைக்கலாம்.
uk: Якщо ви не бачите кільце в цій точці, то для використання може бути рекомендований формар МЗВ.

source: If you do see some ringing, re-measure the frequencies using steps (8)-(10) described in [Ringing frequency](#ringing-frequency) section. If the frequencies differ significantly from the values you obtained earlier, a more complex input shaper configuration is needed. You can refer to Technical details of [Input shapers](#input-shapers) section. Otherwise, proceed to the next step.
ta: [ரிங்கிங் அதிர்வெண்] (#ரிங்கிங்-அதிர்வெண்) பிரிவில் விவரிக்கப்பட்டுள்ள படிகள் (8)-(10) ஐப் பயன்படுத்தி அதிர்வெண்களை மீண்டும் அளவிடவும். நீங்கள் முன்னர் பெற்ற மதிப்புகளிலிருந்து அதிர்வெண்கள் கணிசமாக வேறுபட்டால், மிகவும் சிக்கலான உள்ளீட்டு சேப்பர் உள்ளமைவு தேவைப்படுகிறது. [உள்ளீட்டு வடிவங்கள்] (#உள்ளீட்டு-வடிவங்கள்) பிரிவின் தொழில்நுட்ப விவரங்களை நீங்கள் குறிப்பிடலாம். இல்லையெனில், அடுத்த கட்டத்திற்குச் செல்லவும்.
uk: Якщо ви бачите деякі кільця, перезабезпечте частоти за допомогою кроків (8)-(10), описаних в розділі [Рінг частота](#ringing-частота). Якщо частоти значно відрізняються від значень, які ви отримали раніше, потрібна більш складна конфігурація вводу. Ви можете звернутися до Технічних реквізитів розділу [Вхідні фігурки](#вхідні пастки). В іншому випадку приступаємо до наступного кроку.

source: Compare two prints with MZV and EI input shaper. If EI shows noticeably better results than MZV, use EI shaper, otherwise prefer MZV. Note that EI shaper will cause more smoothing in printed parts (see the next section for further details). Add `shaper_type: mzv` (or ei) parameter to [input_shaper] section, e.g.:
ta: இரண்டு அச்சிட்டுகளை MZV மற்றும் EI உள்ளீட்டு சேப்பருடன் ஒப்பிடுக. MZV ஐ விட EI குறிப்பிடத்தக்க சிறந்த முடிவுகளைக் காட்டினால், EI சேப்பரைப் பயன்படுத்தவும், இல்லையெனில் MZV ஐ விரும்புங்கள். EI சேப்பர் அச்சிடப்பட்ட பகுதிகளில் அதிக மென்மையாக்கும் என்பதை நினைவில் கொள்க (மேலும் விவரங்களுக்கு அடுத்த பகுதியைப் பார்க்கவும்). [Input_shaper] பிரிவில் `shaper_type: mzv` (அல்லது ei) அளவுருவைச் சேர்க்கவும், எ.கா .:
uk: Порівняйте два друки з MZV і EI вводним форматором. Якщо EI показує помітно кращі результати, ніж MZV, скористайтеся формою EI, інакше віддають перевагу MZV. Зауважте, що EI форматор призведе до більш гладкості у друкованих деталях (див. наступний розділ для подальших деталей). Додати `shaper_type: mzv` (або ei) параметр до розділу [input_shaper], наприклад:

source: A few notes on shaper selection:
ta: சேப்பர் தேர்வு குறித்த சில குறிப்புகள்:
uk: Кілька нот на вибір формера:
