Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: ta, uk

source: Choose the minimum out of the two acceleration values (from ringing and smoothing), and put it as `max_accel` into printer.cfg.
ta: இரண்டு முடுக்கம் மதிப்புகளில் குறைந்தபட்சத்தை (ரிங்கிங் மற்றும் மென்மையாக்கத்திலிருந்து) தேர்வுசெய்து, அதை `max_accel` என்று printurs.cfg இல் வைக்கவும்.
uk: Виберіть мінімум з двох значень прискорення (з кількості та згладжування), і покласти його як `max_accel` в принтер.cfg.

source: Assuming that you have sliced the ringing model with suggested parameters, complete the following steps for each of the axes X and Y:
ta: பரிந்துரைக்கப்பட்ட அளவுருக்கள் மூலம் ரிங்கிங் மாதிரியை நீங்கள் வெட்டினீர்கள் என்று கருதி, ஃச் மற்றும் ஒய் அச்சுகளுக்கும் பின்வரும் படிகளை முடிக்கவும்:
uk: Припустимо, що ви зрізаєте модель кільця з запропонованими параметрами, завершити наступні кроки для кожного з осей X і Y:

source: Make sure Pressure Advance is disabled: `SET_PRESSURE_ADVANCE ADVANCE=0`
ta: அழுத்தம் முன்கூட்டியே முடக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்தவும்: `set_pressure_advance அட்வான்ச் = 0`
uk: Зареєструватися Розширений тиск: `SET_PRESSURE_ADVANCE ADVANCE=0`

source: Execute: `SET_INPUT_SHAPER SHAPER_TYPE=ZV`
ta: செயல்படுத்த: `set_input_shaper shaper_type = zv`
uk: `SET_INPUT_SHAPER SHAPER_TYPE=ZV`

source: From the existing ringing test model with your chosen input shaper select the acceleration that shows ringing sufficiently well, and set it with: `SET_VELOCITY_LIMIT ACCEL=...`
ta: நீங்கள் தேர்ந்தெடுத்த உள்ளீட்டு சேப்பருடன் இருக்கும் ரிங்கிங் சோதனை மாதிரியிலிருந்து, போதுமான அளவு ஒலிப்பதைக் காட்டும் முடுக்கத்தைத் தேர்ந்தெடுத்து, அதை அமைக்கவும்: `set_velocity_limit achen = ...`
uk: З існуючої моделі тестування кільця з вибраним входом виберіть прискорення, що показує кільце досить добре, і встановити його з: `SET_VELOCITY_LIMIT ACCEL=...`

source: Execute the command: `TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=factor BAND=5` using `start` and `factor` values calculated at step (5).
ta: கட்டளையை இயக்கவும்: `ட்யூனிங்_டவர் கட்டளை = set_input_shaper அளவுரு = சேப்பர்_ஃப்ரிக்_எக்ச் ச்டார்ட் = ச்டார்ட் காரணி = 5`` தொடக்க` மற்றும் `காரணி` மதிப்புகள் படி (5) இல் கணக்கிடப்படுகின்றன.
uk: Виконувати команду: `TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=фактор BAND=5` за допомогою `start` і [136X]фактор` значення розраховані на крок (5).

source: If you use Pressure Advance, it may need to be re-tuned. Follow the [instructions](Pressure_Advance.md#tuning-pressure-advance) to find the new value, if it differs from the previous one. Make sure to restart Klipper before tuning Pressure Advance.
ta: நீங்கள் அழுத்தம் முன்கூட்டியே பயன்படுத்தினால், அதை மீண்டும் வடிவமைக்க வேண்டியிருக்கலாம். முந்தைய ஒன்றிலிருந்து வேறுபட்டால், புதிய மதிப்பைக் கண்டறிய [வழிமுறைகள்] (Pression_advance.md#ட்யூனிங்-பிரசர்-அட்வான்ச்) ஐப் பின்பற்றவும். அழுத்தம் முன்கூட்டியே டியூனிங் செய்வதற்கு முன் கிளிப்பரை மறுதொடக்கம் செய்யுங்கள்.
uk: Якщо ви використовуєте просунутий тиск, це може знадобитися повторно. Перейдіть за посиланням [instructions](Pressure_Advance.md#tuning-pressure-advance) для пошуку нового значення, якщо він відрізняється від попереднього. Переконайтеся, що перезавантажити кліппер перед перетягуванням тиску.

source: For tuning, add empty `[input_shaper]` section to your `printer.cfg`. Then, assuming that you have sliced the ringing model with suggested parameters, print the test model 3 times as follows. First time, prior to printing, run
ta: டியூனிங்கிற்கு, உங்கள் `printel.cfg` இல் வெற்று` [input_shaper] `பகுதியைச் சேர்க்கவும். பின்னர், நீங்கள் பரிந்துரைக்கப்பட்ட அளவுருக்கள் மூலம் ரிங்கிங் மாதிரியை வெட்டினீர்கள் என்று கருதி, சோதனை மாதிரியை பின்வருமாறு 3 முறை அச்சிடுங்கள். முதல் முறையாக, அச்சிடுவதற்கு முன், இயக்கவும்
uk: Для налаштування додайте порожні `[input_shaper]` розділ до розділу `printer.cfg`. Потім, припустимо, що ви зрізаєте модель з запропонованими параметрами, роздрукуйте модель тесту 3 рази наступним чином. Перший раз, до друку, бігти

source: Yes. In this case, one should measure the resonances twice for each carriage. For example, if the second (dual) carriage is installed on X axis, it is possible to set different input shapers for X axis for the primary and dual carriages. However, the input shaper for Y axis should be the same for both carriages (as ultimately this axis is driven by one or more stepper motors each commanded to perform exactly the same steps). One possibility to configure the input shaper for such setups is to keep `[input_shaper]` section empty and additionally define a `[delayed_gcode]` section in the `printer.cfg` as follows:
ta: ஆம். இந்த வழக்கில், ஒவ்வொரு வண்டிக்கும் இரண்டு முறை அதிர்வுகளை அளவிட வேண்டும். எடுத்துக்காட்டாக, இரண்டாவது (இரட்டை) வண்டி ஃச் அச்சில் நிறுவப்பட்டிருந்தால், முதன்மை மற்றும் இரட்டை வண்டிகளுக்கு ஃச் அச்சுக்கு வெவ்வேறு உள்ளீட்டு வடிவங்களை அமைக்க முடியும். இருப்பினும், ஒய் அச்சுக்கான உள்ளீட்டு சேப்பர் இரு வண்டிகளுக்கும் ஒரே மாதிரியாக இருக்க வேண்டும் (இறுதியில் இந்த அச்சு ஒன்று அல்லது அதற்கு மேற்பட்ட ச்டெப்பர் மோட்டார்கள் மூலம் இயக்கப்படுகிறது, ஒவ்வொன்றும் ஒரே படிகளைச் செய்ய கட்டளையிடப்படுகிறது). அத்தகைய அமைப்புகளுக்கான உள்ளீட்டு சேப்பரை உள்ளமைக்க ஒரு வாய்ப்பு `[உள்ளீடு_சேப்பர்]` பிரிவு காலியாக வைத்திருப்பது மற்றும் கூடுதலாக `printed_gcode]` பகுதியை `printed.cfg` இல் பின்வருமாறு வரையறுப்பது:
uk: Так. У цьому випадку слід заміряти резонанси двічі на кожне перевезення. Наприклад, якщо на осі X встановлена друга (подвійна) вагонка, можна встановити різні форми введення для осі X для первинних і подвійних вагонів. Тим не менш, вводний формувач для осі Y повинен бути таким же для обох вагонів (як в кінцевому підсумку це вісь приводиться до одного або декількох крокових моторів, які збираються виконувати точно ті ж кроки). У розділі ` натисніть кнопку `[delayed_gcode]`:

source: [input_shaper] # Intentionally empty [delayed_gcode init_shaper] initial_duration: 0.1 gcode: SET_DUAL_CARRIAGE CARRIAGE=1 SET_INPUT_SHAPER SHAPER_TYPE_X=<dual_carriage_shaper> SHAPER_FREQ_X=<dual_carriage_freq> SHAPER_TYPE_Y=<y_shaper> SHAPER_FREQ_Y=<y_freq> SET_DUAL_CARRIAGE CARRIAGE=0 SET_INPUT_SHAPER SHAPER_TYPE_X=<primary_carriage_shaper> SHAPER_FREQ_X=<primary_carriage_freq> SHAPER_TYPE_Y=<y_shaper> SHAPER_FREQ_Y=<y_freq>
ta: [input_shaper] # வேண்டுமென்றே காலியாக உள்ளது [தாமதமான_சிகோட் init_shaper] ஆரம்ப_வாட்டு: 0.1 gcode: Set_dual_carriage வண்டி = 1 Set_input_shaper shaper_type_x = <dual_carriage_shaper> shaper_freq_x = <dual_carriage_freq> shaper_type_y = <y_shaper> shaper_freq_y = <y_freq> Set_dual_carriage வண்டி = 0 Set_input_shaper shaper_type_x = <pilical_carriage_shaper> shaper_freq_x = <primal_carriage_freq> shaper_type_y = <y_shaper> shaper_freq_y = <y_freq>
uk: [input_shaper] Нема Важкий порожній [delayed_gcode init_shaper] початковий_duration: 0 р. гкод: SET_DUAL_CARRIAGE CARRIAGE=1 СЕТ_INPUT_SHAPER SHAPER_TYPE_X=<dual_carriage_shaper> SHAPER_FREQ_X=<dual_carriage_freq> SHAPER_TYPE_Y=<y_shaper> SHAPER_FREQ_Y=<y_freq> SET_DUAL_CARRIAGE CARRIAGE=0 СЕТ_INPUT_SHAPER SHAPER_TYPE_X=<primary_carriage_shaper> SHAPER_FREQ_X=<primary_carriage_freq> SHAPER_TYPE_Y=<y_shaper> SHAPER_FREQ_Y=<y_freq>

source: Note that `SHAPER_TYPE_Y` and `SHAPER_FREQ_Y` should be the same in both commands. It is also possible to put a similar snippet into the start g-code in the slicer, however then the shaper will not be enabled until any print is started.
ta: `Shaper_type_y` மற்றும்` shaper_freq_y` ஆகிய இரு கட்டளைகளிலும் ஒரே மாதிரியாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க. ச்லைசரில் தொடக்க சி-குறியீட்டில் இதேபோன்ற துணுக்கை வைக்கவும் முடியும், இருப்பினும் எந்த அச்சு தொடங்கும் வரை சேப்பர் இயக்கப்படாது.
uk: Зверніть увагу, що `SHAPER_TYPE_Y` і `SHAPER_FREQ_Y` повинні бути такими ж, як команди. Також можна покласти схожу хіппе на старт g-код у скибочках, проте потім формар не буде ввімкнено до початку друку.

source: Note that the input shaper only needs to be configured once. Subsequent changes of the carriages or their modes via `SET_DUAL_CARRIAGE` command will preserve the configured input shaper parameters.
ta: உள்ளீட்டு சேப்பரை ஒரு முறை மட்டுமே கட்டமைக்க வேண்டும் என்பதை நினைவில் கொள்க. `Set_dual_carriage` கட்டளை வழியாக வண்டிகளின் அல்லது அவற்றின் முறைகளின் மாற்றங்கள் கட்டமைக்கப்பட்ட உள்ளீட்டு வடிவ அளவுருக்களைப் பாதுகாக்கும்.
uk: Зауважте, що форма входу потрібно налаштувати один раз. Послідовні зміни вагонів або їх режимів через `SET_DUAL_CARRIAGE` команди зберігати настрочені параметри вводу.

source: Prepare for test: `SET_VELOCITY_LIMIT MINIMUM_CRUISE_RATIO=0`
ta: சோதனைக்குத் தயாராகுங்கள்: `set_velocity_limit minder_cruise_ratio = 0`
uk: Підготовка до тестування: `SET_VELOCITY_LIMIT МІНІМУМ_КРУС_РАТІО=0`

source: `SET_VELOCITY_LIMIT MINIMUM_CRUISE_RATIO=0`
ta: `Set_velocity_limit minter_cruise_ratio = 0`
uk: `SET_VELOCITY_LIMIT МІНІМУМ_КРУС_РАТІО=0`

source: Disable the `minimum_cruise_ratio` feature by issuing the following command: `SET_VELOCITY_LIMIT MINIMUM_CRUISE_RATIO=0`
ta: பின்வரும் கட்டளையை வழங்குவதன் மூலம் `MINUTION_CRUISE_RATIO` அம்சத்தை முடக்கவும்:` set_velocity_limit minder_cruise_ratio = 0`
uk: Увімкніть функцію `minimum_cruise_ratio`, видавши наступну команду: `SET_VELOCITY_LIMIT МІНІМУМ_КРУС_РАТІО=0`

source: ![Test gap](img/smoothing-test.png)
ta: ! [சோதனை இடைவெளி] (IMG/மென்மையான-சோதனை. Png)

source: `RESTART`
ta: `மறுதொடக்கம்`

source: 3HUMP_EI
ta: 3hump_ இல்லை

source: `SET_PRESSURE_ADVANCE ADVANCE=0`
ta: `Set_pressure_advance அட்வான்ச் = 0`

source: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`
ta: `ட்யூனிங்_டவர் கட்டளை = set_velocity_limit அளவுரு = முடி தொடக்க = 1500 step_delta = 500 step_height = 5`
