Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: ta, uk

source: EI shaper may be more suited for bed slinger printers (if the resonance frequency and resulting smoothing allows): as more filament is deposited on the moving bed, the mass of the bed increases and the resonance frequency will decrease. Since EI shaper is more robust to resonance frequency changes, it may work better when printing large parts.
ta: படுக்கை ச்லிங்கர் அச்சுப்பொறிகளுக்கு EI சேப்பர் மிகவும் பொருத்தமானதாக இருக்கலாம் (அதிர்வு அதிர்வெண் மற்றும் விளைவாக மென்மையானது அனுமதித்தால்): நகரும் படுக்கையில் அதிகமான இழை டெபாசிட் செய்யப்படுவதால், படுக்கையின் நிறை அதிகரிக்கிறது மற்றும் அதிர்வு அதிர்வெண் குறையும். EI சேப்பர் அதிர்வு அதிர்வெண் மாற்றங்களுக்கு மிகவும் வலுவானது என்பதால், பெரிய பகுதிகளை அச்சிடும்போது இது சிறப்பாக செயல்படக்கூடும்.
uk: ЕІ-форматор може бути більш придатним для принтерів лежачих (якщо резонансна частота і отримана розгладжування дозволяє): в якості більшої нитки приводиться на рухоме ліжко, маса спального місця збільшується і частота резонансу зменшиться. Оскільки EI-форматор більш надійний для резонансних змін частоти, він може працювати краще при друку великих деталей.

source: Due to the nature of delta kinematics, resonance frequencies can differ a lot in different parts of the build volume. Therefore, EI shaper can be a better fit for delta printers rather than MZV or ZV, and should be considered for the use. If the resonance frequency is sufficiently large (more than 50-60 Hz), then one can even attempt to test 2HUMP_EI shaper (by running the suggested test above with `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`), but check the considerations in the [section below](#selecting-max_accel) before enabling it.
ta: டெல்டா இயக்கவியலின் தன்மை காரணமாக, அதிர்வு அதிர்வெண்கள் உருவாக்க அளவின் வெவ்வேறு பகுதிகளில் நிறைய வேறுபடுகின்றன. எனவே, EI சேப்பர் MZV அல்லது ZV ஐ விட டெல்டா அச்சுப்பொறிகளுக்கு சிறந்த பொருத்தமாக இருக்கும், மேலும் பயன்பாட்டிற்கு கருதப்பட வேண்டும். அதிர்வு அதிர்வெண் போதுமானதாக இருந்தால் (50-60 எர்ட்சுக்கு மேல்), பின்னர் 2Hump_EI சேப்பரை சோதிக்க முயற்சி செய்யலாம் (மேலே பரிந்துரைக்கப்பட்ட சோதனையை `set_input_shaper shaper_type = 2hump_ei` உடன் இயக்குவதன் மூலம்), ஆனால் கீழே உள்ள [கீழே உள்ள பிரிவில் சரிபார்க்கவும் ;
uk: У зв'язку з характером дельти-кінематики, резонансні частоти можуть відрізнятися в різних частинах об'єму будівлі. Таким чином, EI-форматор може бути краще підходить для принтерів дельта, а не MZV або ZV, і слід враховувати для використання. Якщо резонансна частота досить велика (більше 50-60 Гц), то можна навіть намагатися перевірити 2HUMP_EI-форматор (для запуску запропонованого тесту над `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`), але перевірте міркування в [розділ нижче](#selecting-max_accel) перед тим, як це зробити.

source: Selecting max_accel
uk: Вибір макс_accel

source: In order to select a suitable max_accel value, inspect the model for the chosen input shaper. First, take a note at which acceleration ringing is still small - that you are comfortable with it.
ta: பொருத்தமான MAX_ACCEL மதிப்பைத் தேர்ந்தெடுக்க, தேர்ந்தெடுக்கப்பட்ட உள்ளீட்டு சேப்பருக்கான மாதிரியை ஆய்வு செய்யுங்கள். முதலில், முடுக்கம் ரிங்கிங் இன்னும் சிறியதாக இருக்கும் ஒரு குறிப்பை எடுத்துக் கொள்ளுங்கள் - நீங்கள் அதனுடன் வசதியாக இருக்கிறீர்கள்.
uk: Для вибору відповідного значення max_accel, перевірте модель для обраного вхідної форми. По-перше, візьміть замітку, при якому прискорення кільце все ще невелике - що ви комфортно з ним.

source: Next, check the smoothing. To help with that, the test model has a small gap in the wall (0.15 mm):
ta: அடுத்து, மென்மையானதை சரிபார்க்கவும். அதற்கு உதவ, சோதனை மாதிரியில் சுவரில் ஒரு சிறிய இடைவெளி உள்ளது (0.15 மிமீ):
uk: Далі перевірте розгладжування. Щоб допомогти з тим, що модель тесту має невеликий проміжок в стіні (0.15 мм):

source: As the acceleration increases, so does the smoothing, and the actual gap in the print widens:
ta: முடுக்கம் அதிகரிக்கும் போது, மென்மையாக்கும், மற்றும் அச்சில் உண்மையான இடைவெளி விரிவடைகிறது:
uk: Як підвищується прискорення, тому робить розгладжування, а фактичний проміжок у принті ширше:

source: In this picture, the acceleration increases left to right, and the gap starts to grow starting from 3500 mm/sec^2 (5-th band from the left). So the good value for max_accel = 3000 (mm/sec^2) in this case to avoid the excessive smoothing.
ta: இந்த படத்தில், முடுக்கம் இடமிருந்து வலமாக அதிகரிக்கிறது, மேலும் இடைவெளி 3500 மிமீ/நொடி^2 (இடதுபுறத்திலிருந்து 5-வது இசைக்குழு) தொடங்கி வளரத் தொடங்குகிறது. எனவே அதிகப்படியான மென்மையாக்கத்தைத் தவிர்க்க இந்த வழக்கில் Max_accel = 3000 (மிமீ/நொடி^2) க்கான நல்ல மதிப்பு.
uk: У цій картині прискорення посилюється зліва направо, а зазор починає рости від 3500 мм/сек^2 (5-й смуги зліва). Отже, хороше значення для max_accel = 3000 (мм/сек^2) в цьому випадку, щоб уникнути зайвого згладжування.

source: Note the acceleration when the gap is still very small in your test print. If you see bulges, but no gap in the wall at all, even at high accelerations, it may be due to disabled Pressure Advance, especially on Bowden extruders. If that is the case, you may need to repeat the print with the PA enabled. It may also be a result of a miscalibrated (too high) filament flow, so it is a good idea to check that too.
ta: உங்கள் சோதனை அச்சில் இடைவெளி இன்னும் சிறியதாக இருக்கும்போது முடுக்கம் கவனியுங்கள். நீங்கள் வீக்கத்தைக் கண்டால், ஆனால் சுவரில் எந்த இடைவெளியும் இல்லை, அதிக முடுக்கம் கூட, அது ஊனமுற்ற அழுத்தம் முன்கூட்டியே காரணமாக இருக்கலாம், குறிப்பாக போடன் எக்ச்ட்ரூடர்களில். அப்படியானால், நீங்கள் PA இயக்கப்பட்ட PA உடன் அச்சிட வேண்டும். இது தவறாக அளவிடப்பட்ட (மிக உயர்ந்த) இழை ஓட்டத்தின் விளைவாக இருக்கலாம், எனவே அதையும் சரிபார்க்க நல்லது.
uk: Зверніть увагу на прискорення, коли проміжок ще дуже невеликий у своєму тестовому друку. Якщо ви бачите повзунки, але не зазор в стіні взагалі, навіть при високих прискореннях вона може бути пов'язана з відключенням тиску вперед, особливо на екструдерів Bowden. Якщо це випадок, вам може знадобитися повторити друк за допомогою ПА. Це також може бути результатом неправильного (до високого) потоку ниток, тому це гарна ідея для перевірки.

source: As a note, it may happen - especially at low ringing frequencies - that EI shaper will cause too much smoothing even at lower accelerations. In this case, MZV may be a better choice, because it may allow higher acceleration values.
ta: ஒரு குறிப்பாக, அது நிகழலாம் - குறிப்பாக குறைந்த ரிங்கிங் அதிர்வெண்களில் - EI சேப்பர் குறைந்த முடுக்கங்களில் கூட அதிக மென்மையாக்கும். இந்த வழக்கில், MZV ஒரு சிறந்த தேர்வாக இருக்கலாம், ஏனெனில் இது அதிக முடுக்கம் மதிப்புகளை அனுமதிக்கும்.
uk: Як замітка, це може статися - особливо на низьких частотах кільця - що форматор EI викличе занадто багато розгладжування навіть при нижніх прискореннях. У цьому випадку MZV може бути кращим вибором, оскільки це може дозволити більш високі значення прискорення.

source: At very low ringing frequencies (~25 Hz and below) even MZV shaper may create too much smoothing. If that is the case, you can also try to repeat the steps in [Choosing input shaper](#choosing-input-shaper) section with ZV shaper, by using `SET_INPUT_SHAPER SHAPER_TYPE=ZV` command instead. ZV shaper should show even less smoothing than MZV, but is more sensitive to errors in measuring the ringing frequencies.
ta: மிகக் குறைந்த ரிங்கிங் அதிர்வெண்களில் (~ 25 எர்ட்ச் மற்றும் அதற்குக் கீழே) MZV சேப்பர் கூட அதிக மென்மையாக்கக்கூடும். அப்படியானால், அதற்கு பதிலாக `set_input_shaper shaper_type = Zv` கட்டளையைப் பயன்படுத்துவதன் மூலம், ZV சேப்பருடன் [உள்ளீட்டு வடிவத்தைத் தேர்ந்தெடுப்பது] (#உள்ள-உள்ளீட்டு-நிழலைத் தேர்ந்தெடுப்பது) பகுதியை மீண்டும் செய்ய முயற்சி செய்யலாம். ZV சேப்பர் MZV ஐ விட குறைவான மென்மையானதைக் காட்ட வேண்டும், ஆனால் ஒலிக்கும் அதிர்வெண்களை அளவிடுவதில் உள்ள பிழைகளுக்கு அதிக உணர்திறன் கொண்டது.
uk: На дуже низьких частотах дзвінка (~25 Гц і нижче) навіть формувач MZV може створити занадто сильне згладжування. Якщо це так, ви також можете спробувати повторити кроки в розділі [Вибір формувача введення](#choosing-input-shaper) із формувальником ZV, використовуючи натомість команду `SET_INPUT_SHAPER SHAPER_TYPE=ZV`. Формувальник ZV повинен демонструвати навіть менше згладжування, ніж MZV, але більш чутливий до помилок у вимірюванні частот дзвінка.

source: Another consideration is that if a resonance frequency is too low (below 20-25 Hz), it might be a good idea to increase the printer stiffness or reduce the moving mass. Otherwise, acceleration and printing speed may be limited due too much smoothing now instead of ringing.
ta: மற்றொரு கருத்தில் என்னவென்றால், ஒரு அதிர்வு அதிர்வெண் மிகக் குறைவாக இருந்தால் (20-25 எர்ட்சுக்கு கீழே), அச்சுப்பொறி விறைப்பை அதிகரிப்பது அல்லது நகரும் வெகுசனத்தைக் குறைப்பது நல்ல யோசனையாக இருக்கலாம். இல்லையெனில், முடுக்கம் மற்றும் அச்சிடும் விரைவு மட்டுப்படுத்தப்படலாம்.
uk: Ще одна думка полягає в тому, що якщо резонансна частота занадто низька (до 20-25 Гц), вона може бути гарною ідеєю для збільшення жорсткості принтера або зменшення рухомої маси. В іншому випадку швидкість прискорення та друку може бути обмежена через занадто багато розгладжування, а не кільце.

source: Fine-tuning resonance frequencies
ta: நன்றாக-சரிப்படுத்தும் அதிர்வு அதிர்வெண்கள்
uk: Витончений резонансні частоти

source: Note that the precision of the resonance frequencies measurements using the ringing test model is sufficient for most purposes, so further tuning is not advised. If you still want to try to double-check your results (e.g. if you still see some ringing after printing a test model with an input shaper of your choice with the same frequencies as you have measured earlier), you can follow the steps in this section. Note that if you see ringing at different frequencies after enabling [input_shaper], this section will not help with that.
ta: ரிங்கிங் சோதனை மாதிரியைப் பயன்படுத்தி அதிர்வு அதிர்வெண் அளவீடுகளின் துல்லியம் பெரும்பாலான நோக்கங்களுக்காக போதுமானது என்பதை நினைவில் கொள்க, எனவே மேலும் டியூனிங் அறிவுறுத்தப்படவில்லை. உங்கள் முடிவுகளை இருமுறை சரிபார்க்க நீங்கள் இன்னும் முயற்சிக்க விரும்பினால் (எ.கா. நீங்கள் முன்னர் அளவிட்ட அதே அதிர்வெண்களுடன் ஒரு சோதனை மாதிரியை அச்சிட்ட பிறகும் ஒரு சோதனை மாதிரியை அச்சிட்ட பிறகும் நீங்கள் இன்னும் சில மோதிரங்களைக் கண்டால்), இதில் உள்ள படிகளைப் பின்பற்றலாம் பிரிவு. [Input_shaper] ஐ இயக்கிய பின் வெவ்வேறு அதிர்வெண்களில் ஒலிப்பதை நீங்கள் கண்டால், இந்த பிரிவு அதற்கு உதவாது என்பதை நினைவில் கொள்க.
uk: Зауважте, що точність вимірювань резонансних частот за допомогою тест-модель з кільця є достатньою для більшості цілей, тому подальше налаштування не рекомендується. Якщо ви все ще хочете спробувати подвійно перевірити ваші результати (наприклад, якщо ви все ще бачите деякі кільця після друку тестової моделі з входом формаром вашого вибору з однаковими частотами, як ви вимірювали раніше), ви можете дотримуватися кроків в цьому розділі. Зверніть увагу, що якщо ви бачите кільце на різних частотах після включення [input_shaper], цей розділ не допоможе з цим.

source: Calculate the necessary parameters for the `TUNING_TOWER` command to tune `shaper_freq_x` parameter as follows: start = shaper_freq_x * 83 / 132 and factor = shaper_freq_x / 66, where `shaper_freq_x` here is the current value in `printer.cfg`.
ta: `சேப்பர்_ஃபிரெக்_எக்ச்` அளவுருவை பின்வருமாறு டியூன் செய்ய` ட்யூனிங்_டவர்` கட்டளைக்கு தேவையான அளவுருக்களைக் கணக்கிடுங்கள்: தொடக்க = சேப்பர்_ஃப்ரெக்_எக்ச் * 83/132 மற்றும் காரணி = சேப்பர்_ஃப்ரெக்_எக்ச் / 66, அங்கு `சேப்பர்_ஃப்ரெக்_எக்ச்` இங்கே` அச்சுப்பொறியில் தற்போதைய மதிப்பு உள்ளது.
uk: Розрахувати необхідні параметри для параметра `TUNING_TOWER`, щоб налаштувати `shaper_freq_x`: start = shaper_freq_x * 83 / 132 і фактор = формаr_freq_x / 66, де `shaper_freq_x` тут є значення `printer.cfg`.

source: Print the test model.
ta: சோதனை மாதிரியை அச்சிடுக.
uk: Друк тестової моделі.

source: Reset the original frequency value: `SET_INPUT_SHAPER SHAPER_FREQ_X=...`.
ta: அசல் அதிர்வெண் மதிப்பை மீட்டமைக்கவும்: `set_input_shaper shaper_freq_x = ...`.
uk: Заміна початкової частоти: `SET_INPUT_SHAPER SHAPER_FREQ_X=`.

source: Find the band which shows ringing the least and count its number from the bottom starting at 1.
ta: குறைந்தபட்சம் ஒலிப்பதைக் காட்டும் இசைக்குழுவைக் கண்டுபிடித்து, அதன் எண்ணை 1 இல் தொடங்கி அதன் எண்ணை எண்ணுங்கள்.
uk: Знайдіть гурт, який показує кільце принаймні і відрахуйте його кількість знизу від 1.

source: Calculate the new shaper_freq_x value via old shaper_freq_x * (39 + 5 * #band-number) / 66.
ta: பழைய சேப்பர்_ஃப்ரெக்_எக்ச் * (39 + 5 * #இசைக்குழு-எண்) / 66 வழியாக புதிய சேப்பர்_ஃப்ரெக்_எக்ச் மதிப்பைக் கணக்கிடுங்கள்.
uk: Обчислення нової форми_freq_x значення через старий форматор_freq_x * (39 + 5 * #band-number) / 66.

source: Repeat these steps for the Y axis in the same manner, replacing references to X axis with the axis Y (e.g. replace `shaper_freq_x` with `shaper_freq_y` in the formulae and in the `TUNING_TOWER` command).
ta: ஒய் அச்சுக்கு இந்த படிகளை அதே முறையில் மீண்டும் செய்யவும், ஃச் அச்சுக்கு குறிப்புகளை ஒய் ஆகோவுடன் மாற்றவும் (எ.கா. `சேப்பர்_ஃப்ரெக்_எக்ச்` ஐ` சேப்பர்_ஃப்ரெக்_ஒய்` உடன் சூத்திரத்திலும் `ட்யூனிங்_டவர்` கட்டளையிலும் மாற்றவும்).
uk: Повторіть ці кроки для осі Y таким же чином, замінивши посилання на вісь X з віссю Y (наприклад, замініть `shaper_freq_x` з `shaper_freq_y` у формулі і в `TUNING_TOWER`).

source: As an example, let's assume you have had measured the ringing frequency for one of the axis equal to 45 Hz. This gives start = 45 * 83 / 132 = 28.30 and factor = 45 / 66 = 0.6818 values for `TUNING_TOWER` command. Now let's assume that after printing the test model, the fourth band from the bottom gives the least ringing. This gives the updated shaper_freq_? value equal to 45 * (39 + 5 * 4) / 66 ≈ 40.23.
ta: உதாரணமாக, 45 எர்ட்சுக்கு சமமான அச்சில் ரிங்கிங் அதிர்வெண்ணை நீங்கள் அளவிட்டுள்ளீர்கள் என்று வைத்துக் கொள்வோம். இது தொடக்க = 45 * 83/132 = 28.30 மற்றும் காரணி = 45/66 = 0.6818 `ட்யூனிங்_டவர்` கட்டளைக்கு மதிப்புகள். சோதனை மாதிரியை அச்சிட்ட பிறகு, கீழே இருந்து நான்காவது இசைக்குழு குறைந்த அளவைக் கொடுக்கும் என்று வைத்துக் கொள்வோம். இது புதுப்பிக்கப்பட்ட சேப்பர்_ஃப்ரெக்_? மதிப்பு 45 * (39 + 5 * 4) / 66 ≈ 40.23 க்கு சமம்.
uk: Як приклад, припустимо, що у вас була виміряна частота кільця для однієї з осі дорівнює 45 Гц. Це дає початок = 45 * 83 / 132 = 28.30 і фактор = 45 / 66 = 0,6818 значення для команди `TUNING_TOWER`. Тепер припустимо, що після друку тестової моделі четвертий гурт знизу дає найменше кільце. Це дає оновлений форматор_freq_? до 45 * (39 + 5 * 4) / 66 ≈ 40.23.

source: After both new `shaper_freq_x` and `shaper_freq_y` parameters have been calculated, you can update `[input_shaper]` section in `printer.cfg` with the new `shaper_freq_x` and `shaper_freq_y` values.
ta: புதிய `shaper_freq_x` மற்றும்` சேப்பர்_ஃப்ரெக்_ஒய்` அளவுருக்கள் கணக்கிடப்பட்ட பிறகு, புதிய `சேப்பர்_ஃப்ரெக்_எக்ச்` மற்றும்` சேப்பர்_ஃப்ரெக்_ஒய்` மதிப்புகளுடன் `அச்சுப்பொறி.
uk: Після нового `shaper_freq_x` і `shaper_freq_y` параметри можна оновити `[input_shaper]` розділ `printer.cfg` з новим `shaper_freq_x` і `shaper_freq_y` значення.

source: Pressure Advance
ta: அழுத்தம் முன்கூட்டியே
uk: Тиск вперед

source: Unreliable measurements of ringing frequencies
ta: ஒலிக்கும் அதிர்வெண்களின் நம்பமுடியாத அளவீடுகள்
uk: Ненадійні вимірювання частоти кільця

source: If you are unable to measure the ringing frequencies, e.g. if the distance between the oscillations is not stable, you may still be able to take advantage of input shaping techniques, but the results may not be as good as with proper measurements of the frequencies, and will require a bit more tuning and printing the test model. Note that another possibility is to purchase and install an accelerometer and measure the resonances with it (refer to the [docs](Measuring_Resonances.md) describing the required hardware and the setup process) - but this option requires some crimping and soldering.
ta: ஒலிக்கும் அதிர்வெண்களை நீங்கள் அளவிட முடியாவிட்டால், எ.கா. ஊசலாட்டங்களுக்கிடையிலான தூரம் நிலையானதாக இல்லாவிட்டால், உள்ளீட்டு வடிவமைக்கும் நுட்பங்களை நீங்கள் இன்னும் பயன்படுத்திக் கொள்ள முடியும், ஆனால் முடிவுகள் அதிர்வெண்களின் சரியான அளவீடுகளைப் போல நன்றாக இருக்காது, மேலும் சோதனையை இன்னும் கொஞ்சம் சரிப்படுத்தும் மற்றும் அச்சிடுதல் தேவைப்படும் மாதிரி. ஒரு முடுக்கமானியை வாங்குவதும் நிறுவுவதும், அதனுடன் அதிர்வுகளை அளவிடுவதும் மற்றொரு சாத்தியம் என்பதை நினைவில் கொள்க (தேவையான வன்பொருள் மற்றும் அமைவு செயல்முறையை விவரிக்கும் [டாக்ச்] (அளவீட்டு_ரெசோனன்ச்.எம்டி) ஐப் பார்க்கவும்) - ஆனால் இந்த விருப்பத்திற்கு சில கிரிம்பிங் மற்றும் சாலிடரிங் தேவைப்படுகிறது.
uk: Якщо ви не змогли вимірювати частоти кілець, наприклад, якщо відстань між коливаннями не стабільна, ви все ще зможете скористатися методиками вводу, але результати можуть бути як добре, так і при правильній вимірюванні частот, і вимагатиме трохи більше тюнінгу і друку тестової моделі. Зауважте, що ще одна можливість полягає в придбанні та встановленні акселерометра та вимірюванні резонансів з ним (відновлення до [довідок](Measuring_Resonances.md) опису необхідного обладнання та процесу налаштування) - але цей варіант вимагає деякої ламки і паяльниці.

source: and print the model. Then print the model again, but before printing run instead
ta: மற்றும் மாதிரியை அச்சிடுங்கள். பின்னர் மாதிரியை மீண்டும் அச்சிடுக, ஆனால் அதற்கு பதிலாக அச்சிடுவதற்கு முன்
uk: і друкувати модель. Потім друкуйте модель знову, але до друку запустіть замість

source: Then print the model for the 3rd time, but now run
ta: பின்னர் 3 வது முறையாக மாதிரியை அச்சிடவும், ஆனால் இப்போது இயக்கவும்
uk: Потім роздрукуйте модель на 3-й раз, але зараз запустіть

source: Essentially, we are printing the ringing test model with TUNING_TOWER using 2HUMP_EI shaper with shaper_freq = 60 Hz, 50 Hz, and 40 Hz.
ta: அடிப்படையில், ரிங்கிங் டெச்ட் மாதிரியை ட்யூனிங்_டோவருடன் 2hump_ei சேப்பரைப் பயன்படுத்தி சேப்பர்_ஃப்ரெக் = 60 எர்ட்ச், 50 எர்ட்ச் மற்றும் 40 எர்ட்ச் மூலம் அச்சிடுகிறோம்.
uk: По суті, ми друкуємо моделі тестування кільця з TUNING_ TOWER за допомогою 2HUMP_EI формера з форматором_freq = 60 Гц, 50 Гц, 40 Гц.

source: If none of the models demonstrate improvements in ringing, then, unfortunately, it does not look like the input shaping techniques can help with your case.
ta: மாதிரிகள் எதுவும் ரிங்கிங் மேம்பாடுகளை நிரூபிக்கவில்லை என்றால், துரதிர்ச்டவசமாக, உள்ளீட்டு வடிவமைக்கும் நுட்பங்கள் உங்கள் வழக்குக்கு உதவக்கூடும் என்று தெரியவில்லை.
uk: Якщо жодна з моделей не означають поліпшення в кільці, то, на жаль, вона не схожа на способи формування вводу може допомогти вашому випадку.

source: Otherwise, it may be that all models show no ringing, or some show the ringing and some - not so much. Choose the test model with the highest frequency that still shows good improvements in ringing. For example, if 40 Hz and 50 Hz models show almost no ringing, and 60 Hz model already shows some more ringing, stick with 50 Hz.
ta: இல்லையெனில், எல்லா மாடல்களும் மோதிரத்தைக் காட்டவில்லை, அல்லது சிலர் ரிங்கிங் மற்றும் சிலவற்றைக் காட்டுகிறார்கள் - அவ்வளவு இல்லை. ரிங்கிங்கில் நல்ல முன்னேற்றங்களைக் காட்டும் அதிக அதிர்வெண் கொண்ட சோதனை மாதிரியைத் தேர்வுசெய்க. எடுத்துக்காட்டாக, 40 எர்ட்ச் மற்றும் 50 எர்ட்ச் மாதிரிகள் கிட்டத்தட்ட ரிங்கிங் இல்லை என்றால், 60 எர்ட்ச் மாதிரி ஏற்கனவே இன்னும் சில ரிங்கிங் காட்டுகிறது, 50 எர்ட்ச் உடன் ஒட்டிக்கொள்கிறது.
uk: В іншому випадку це може бути те, що всі моделі не відображаються, або деякі показують кільце і деякі - не так багато. Виберіть модель тесту з найвищою частотою, яка все ще показує хороші поліпшення в кільці. Наприклад, якщо моделі 40 Гц і 50 Гц показують майже не кільце, а модель 60 Гц вже показує ще одне кільце, приклеїти 50 Гц.

source: Now check if EI shaper would be good enough in your case. Choose EI shaper frequency based on the frequency of 2HUMP_EI shaper you chose:
ta: இப்போது உங்கள் விசயத்தில் EI சேப்பர் போதுமானதாக இருக்குமா என்று சரிபார்க்கவும். நீங்கள் தேர்ந்தெடுத்த 2hump_ei சேப்பரின் அதிர்வெண்ணின் அடிப்படையில் EI சேப்பர் அதிர்வெண்ணைத் தேர்வுசெய்க:
uk: Тепер перевірте, чи достатньо EI у вашому випадку. Виберіть частоту EI на основі частоти 2HUMP_ Ви вибрали:

source: For 2HUMP_EI 60 Hz shaper, use EI shaper with shaper_freq = 50 Hz.
ta: 2hump_ei 60 எர்ட்ச் சேப்பருக்கு, சேப்பர்_ஃப்ரெக் = 50 எர்ட்ச் உடன் EI சேப்பரைப் பயன்படுத்தவும்.
uk: Для 2HUMP_EI 60 Гц-форматор використовується EI-форматор з форматором_freq = 50 Гц.

source: For 2HUMP_EI 50 Hz shaper, use EI shaper with shaper_freq = 40 Hz.
ta: 2hump_ei 50 எர்ட்ச் சேப்பருக்கு, சேப்பர்_ஃப்ரெக் = 40 எர்ட்ச் உடன் ஈஐ சேப்பரைப் பயன்படுத்தவும்.
uk: Для 2HUMP_EI 50 Hz формар, використання EI формар з форматор_freq = 40 Гц.

source: For 2HUMP_EI 40 Hz shaper, use EI shaper with shaper_freq = 33 Hz.
ta: 2hump_ei 40 எர்ட்ச் சேப்பருக்கு, சேப்பர்_ஃப்ரெக் = 33 எர்ட்ச் உடன் ஈஐ சேப்பரைப் பயன்படுத்தவும்.
uk: Для 2HUMP_EI 40 Гц-форматор використовується EI-форматор з форматором_freq = 33 Гц.

source: Now print the test model one more time, running
ta: இப்போது சோதனை மாதிரியை இன்னும் ஒரு முறை அச்சிட்டு, இயங்கும்
uk: Тепер роздрукуйте тестову модель ще раз, бігаючи

source: providing the shaper_freq_x=... and shaper_freq_y=... as determined previously.
ta: சேப்பர்_ஃப்ரெக்_எக்ச் = ... மற்றும் சேப்பர்_ஃப்ரெக்_ஒய் = ... முன்பு தீர்மானித்தபடி.
uk: надання формувача_freq_x=... і формаr_freq_y=... як визначено раніше.

source: If EI shaper shows very comparable good results as 2HUMP_EI shaper, stick with EI shaper and the frequency determined earlier, otherwise use 2HUMP_EI shaper with the corresponding frequency. Add the results to `printer.cfg` as, e.g.
ta: EI சேப்பர் 2hump_ei சேப்பராக மிகவும் ஒப்பிடக்கூடிய நல்ல முடிவுகளைக் காட்டினால், EI சேப்பர் மற்றும் முன்னர் தீர்மானிக்கப்பட்ட அதிர்வெண்ணுடன் ஒட்டிக்கொள்க, இல்லையெனில் தொடர்புடைய அதிர்வெண்ணுடன் 2Hump_EI சேப்பரைப் பயன்படுத்தவும். முடிவுகளை `prinate.cfg` அச் இல் சேர்க்கவும், எ.கா.
uk: Якщо EI-форматор показує дуже вигідні результати, як 2HUMP_EI-форматор, приклеїти EI-форматором і частотою, визначеною раніше, інакше використовується 2HUMP_EI-форматор з відповідною частотою. Додати результати до `printer.cfg`, як, наприклад.

source: Continue the tuning with [Selecting max_accel](#selecting-max_accel) section.
ta: [MAX_ACCEL ஐத் தேர்ந்தெடுப்பது] (#தேர்ந்தெடு-MAX_ACCEL) பிரிவுடன் டியூனிங்கைத் தொடரவும்.
uk: Продовжити тюнінг з розділом [Виберіть max_accel](#selecting-max_accel).

source: Troubleshooting and FAQ
ta: சரிசெய்தல் மற்றும் கேள்விகள்
uk: Виправлення несправностей та FAQ

source: I cannot get reliable measurements of resonance frequencies
ta: அதிர்வு அதிர்வெண்களின் நம்பகமான அளவீடுகளை என்னால் பெற முடியாது
uk: Я не можу отримати надійні вимірювання резонансних частот
