Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Rotation_Distance.po
Languages: ca, uk

source: rotation_distance = <screw_pitch> * <number_of_separate_threads>
ca: rotation_distance = <pas_de_rosca> * <nombre_de_fils>
uk: rotation_distance = <крок_гвинта> * <кількість_окремих_різьб>

source: Rotation distance
ca: Distància de rotació
uk: Відстань обертання

source: Extrude 50mm of filament with the following command sequence: `G91` followed by `G1 E50 F60`. Note 50mm as `<requested_extrude_distance>`. Wait for the extruder to finish the move (it will take about 50 seconds). It is important to use the slow extrusion rate for this test as a faster rate can cause high pressure in the extruder which will skew the results. (Do not use the "extrude button" on graphical front-ends for this test as they extrude at a fast rate.)
ca: Extrudiu 50 mm de filament amb la següent seqüència d'ordres: "G91" seguit de "G1 E50 F60". Tingueu en compte 50 mm com a "<distància_de_extrusió_sol·licitada>". Espereu que l'extrusora acabi el moviment (trigarà uns 50 segons). És important utilitzar la velocitat d'extrusió lenta per a aquesta prova, ja que una velocitat més ràpida pot provocar una pressió alta a l'extrusora que distorsionarà els resultats. (No utilitzeu el "botó d'extrusió" als front-ends gràfics per a aquesta prova, ja que s'extrueixen a un ritme ràpid.)
uk: `G91` Примітка 50мм як `<requested_extrude_distance>`. Зачекайте екструдера, щоб закінчити рух (це займе близько 50 секунд). Важливо використовувати повільний рівень екструзії для цього тесту, як більш швидка швидкість може викликати високий тиск в екструдері, який буде скручувати результати. (Не використовуйте кнопку «Вихідна кнопка» на графічних фронт-ендах для цього тесту, оскільки вони виводяться за швидкою швидкістю.)

source: Almost all printers should have a whole number for `rotation_distance` on X, Y, and Z type axes. If the above formula results in a rotation_distance that is within .01 of a whole number then round the final value to that whole_number.
ca: Gairebé totes les impressores haurien de tenir un nombre sencer per a 'rotation_distance' als eixos de tipus X, Y i Z. Si la fórmula anterior dóna com a resultat una distància de rotació que es troba a 0,01 d'un nombre sencer, arrodoneix el valor final a aquest nombre_sencer.
uk: Майже всі принтери повинні мати цілий номер для `rotation_distance` на X, Y і Z тип осі. Якщо вищезазначена формула призводить до обертання_захисту, який знаходиться в межах .01 всього числа, а потім закруглити кінцеве значення до цього цілого числа.
