Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Rotation_Distance.po
Languages: ca, uk

source: Stepper motor drivers on Klipper require a `rotation_distance` parameter in each [stepper config section](Config_Reference.md#stepper). The `rotation_distance` is the amount of distance that the axis moves with one full revolution of the stepper motor. This document describes how one can configure this value.
ca: Els controladors de motor pas a pas a Klipper requereixen el paràmetre `rotation_distance` (distància de rotació) a cada [Secció de configuració del motor](Config_Reference.md#stepper). La `rotation_distance` és la quantitat de distància que l'eix es mou amb una revolució completa del motor pas a pas. Aquest document descriu com s'ha de configurar aquest valor.
uk: Драйвери крокової двигуна на Кліппері вимагають параметра `rotation_distance` в кожному [схема налаштування](Config_Reference.md#stepper). `rotation_distance` - це кількість відстані, яка осі рухається з однією повною революцією крокової двигуна. Цей документ описує, як можна налаштувати це значення.

source: Obtaining rotation_distance from steps_per_mm (or step_distance)
ca: Obtenint rotation_distance a partir del passos per mm (o passos per distància)
uk: Обертання обертання_випадок від кроків_per_mm (або step_distance)

source: The designers of your 3d printer originally calculated `steps_per_mm` from a rotation distance. If you know the steps_per_mm then it is possible to use this general formula to obtain that original rotation distance:
ca: Els dissenyadors de la impressora originalment calculen els `passos per mil·límetre` a partir de la distància d'una rotació sencera.Si es coneixen els passos per mm (steps_per_mm) es possible emprar aquesta fórmula general per obtenir la distància de rotació:
uk: Дизайнери вашого 3d принтера спочатку обчислені `steps_per_mm` з відстані обертання. Якщо ви знаєте кроки_per_mm, то можна використовувати цю загальну формулу для отримання цієї початкової відстані обертання:

source: Or, if you have an older Klipper configuration and know the `step_distance` parameter you can use this formula:
ca: D'altre banda, si es disposa d'una configuració antiga de Klipper i es coneix el valor del paràmetre `step_distance`, es pot emprar aquesta fórmula:
uk: Або, якщо у вас є старша конфігурація затискачів і дізнатися параметр `step_distance` ви можете використовувати цю формулу:

source: The `<full_steps_per_rotation>` setting is determined from the type of stepper motor. Most stepper motors are "1.8 degree steppers" and therefore have 200 full steps per rotation (360 divided by 1.8 is 200). Some stepper motors are "0.9 degree steppers" and thus have 400 full steps per rotation. Other stepper motors are rare. If unsure, do not set full_steps_per_rotation in the config file and use 200 in the formula above.
ca: El valor `<full_steps_per_rotation>`(pasos per revolució) es determinat pel tipus de motor pas a pas. La majoria dels motors són del tipus "1.8 graus" i per tant necessiten 200 passos sencers per fer una revolució sencera (360 dividit entre 1.8 són 200 passos). Hi ha motors que son de "0.9 graus" i necessiten 400 passos per revolució. Altres opcions són menys freqüents. Si hi ha dubtes, no emprar cap valor per a full_steps_per_rotation en el fitxer de configuració i emprar 200 en la fómula donada.
uk: `<full_steps_per_rotation>` параметр визначається з типу крокової двигуна. Більшість крокових двигунів є "1.8 степперами" і тому мають 200 повний крок за обертання (360 розділений на 1,8 - 200). Деякі крокові двигуни є "0.9 степпери" і, таким чином, мають 400 повний крок за обертання. Інші крокові двигуни є рідкісними. Якщо ви не впевнені, не встановіть повно_steps_per_rotation в файлі конфігурації і використовуйте 200 у формулі вище.

source: The `<microsteps>` setting is determined by the stepper motor driver. Most drivers use 16 microsteps. If unsure, set `microsteps: 16` in the config and use 16 in the formula above.
ca: La configuració "<microssteps>" la determina el controlador del motor pas a pas. La majoria dels controladors utilitzen 16 micropassos. Si no esteu segur, configureu "microspasos: 16" a la configuració i utilitzeu 16 a la fórmula anterior.
uk: `<microsteps>` параметр визначається драйвером крокової двигуна. Більшість драйверів використовують 16 мікрокропів. Якщо unsure, встановити `microsteps: 16` в конфігурації і використовувати 16 в формулі вище.

source: Calibrating rotation_distance on extruders
ca: Calibrant rotation_distance a les extrusores
uk: Калібруючий поворот_посадка на екструдери

source: On an extruder, the `rotation_distance` is the amount of distance the filament travels for one full rotation of the stepper motor. The best way to get an accurate value for this setting is to use a "measure and trim" procedure.
ca: En una extrusora, la 'rotation_distance' és la distància que recorre el filament durant una rotació completa del motor pas a pas. La millor manera d'obtenir un valor precís per a aquesta configuració és utilitzar un procediment de 'mesura i retalla'.
uk: На екструдери `rotation_distance` - це кількість дистанцій, які подорожують на одне повне обертання крокової двигуна. Найкращий спосіб отримання точного значення для цієї установки полягає у використанні процедури «закриття та обрізка».

source: First start with an initial guess for the rotation distance. This may be obtained from [steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance) or by [inspecting the hardware](#extruder).
ca: Primer comenceu amb una estimació inicial de la distància de rotació. Això es pot obtenir des de [steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance) o [inspeccionant el maquinari](#extruder).
uk: Перший запуск з початковою вгадкою на відстань обертання. Це може бути отримано з [steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance) або за допомогою [інспекції](#extruder).

source: Then use the following procedure to "measure and trim":
ca: A continuació, utilitzeu el procediment d'assaig i error com s'indica:
uk: Потім скористайтеся наступною процедурою «закриття та обрізка»:

source: Make sure the extruder has filament in it, the hotend is heated to an appropriate temperature, and the printer is ready to extrude.
ca: Assegureu-vos que l'extrusora tingui filament, que l'hotend s'escalfi a una temperatura adequada i que la impressora estigui llesta per extruir.
uk: Переконайтеся, що екстер'єр має покриття в ньому, гарячий відігрівається до відповідної температури, і принтер готовий виводити.

source: Use a marker to place a mark on the filament around 70mm from the intake of the extruder body. Then use a digital calipers to measure the actual distance of that mark as precisely as one can. Note this as `<initial_mark_distance>`.
ca: Utilitzeu un marcador per posar una marca al filament a uns 70 mm de l'entrada del cos de l'extrusora. A continuació, utilitzeu un calibrador digital per mesurar la distància real d'aquesta marca amb la màxima precisió possible. Tingueu en compte això com a `<marca_inicial>`.
uk: Використовуйте маркер для розміщення позначки на нитки близько 70 мм від надходження екструдерного тіла. Далі використовують цифрові затискачі, щоб виміряти фактичну відстань цього позначки точно так само, як можна. Примітка: `<initial_mark_distance>`.

source: Use the digital calipers to measure the new distance between the extruder body and the mark on the filament. Note this as `<subsequent_mark_distance>`. Then calculate: `actual_extrude_distance = <initial_mark_distance> - <subsequent_mark_distance>`
ca: Utilitzeu les pinces digitals per mesurar la nova distància entre el cos de l'extrusora i la marca del filament. Tingueu en compte això com a `<marca_final>`. A continuació, calculeu: `actual_extrude_distance = <marca_inicial> - <marca_final>`
uk: Використовуйте цифрові затискачі, щоб виміряти нову відстань між тілом екструдера і позначкою на підкладці. Примітка: `<subsequent_mark_distance>`. `actual_extrude_distance = <initial_mark_distance> - <subsequent_mark_distance>`

source: Calculate rotation_distance as: `rotation_distance = <previous_rotation_distance> * <actual_extrude_distance> / <requested_extrude_distance>` Round the new rotation_distance to three decimal places.
ca: Calculeu rotation_distance com: `rotation_distance = <distancia_rotació_prèvia> * <distancia_actual_extrusio> / <longitut_ordre_extrussió>` Arrodoneix la nova rotation_distance a tres decimals.
uk: Калькулятор обертання_distance як: `rotation_distance = <previous_rotation_distance> * <actual_extrude_distance> / <requested_extrude_distance>` Закруглити нову оберта_distance до трьох десяткових місць.

source: If the actual_extrude_distance differs from requested_extrude_distance by more than about 2mm then it is a good idea to perform the steps above a second time.
ca: Si la longitut_actual_extrusio difereix de la longitut_ordre_extrusió en més d'uns 2 mm, és una bona idea realitzar els passos anteriors una segona vegada.
uk: Якщо фактичний_extrude_distance відрізняється від запитуваного_extrude_distance від більш ніж близько 2 мм, то це гарна ідея для виконання кроків за другий раз.

source: Note: Do *not* use a "measure and trim" type of method to calibrate x, y, or z type axes. The "measure and trim" method is not accurate enough for those axes and will likely lead to a worse configuration. Instead, if needed, those axes can be determined by [measuring the belts, pulleys, and lead screw hardware](#obtaining-rotation_distance-by-inspecting-the-hardware).
ca: Nota: *no* utilitzeu un mètode de tipus 'd'assaig i error' per calibrar eixos de tipus x, y o z. El mètode 'mesura i retalla' no és prou precís per a aquests eixos i probablement conduirà a una configuració pitjor. En canvi, si cal, aquests eixos es poden determinar [mesurant les corretges, les politges i els visos sens fi] (#obtaining-rotation_distance-by-inspecting-the-hardware).
uk: Примітка: Do *not* використовувати тип методу «закриття та обрізка» для калібрування x, y, або z тип осі. Метод «забезпечення і обрізка» не є достатньо точним для тих осей і, ймовірно, призведе до гіршої конфігурації. Замість цього, якщо необхідно, ці осі можна визначити за допомогою [вимірювання ременів, шків і гвинтових апаратів](#obtaining-rotation_distance-by-inspecting-the-hardware).

source: Obtaining rotation_distance by inspecting the hardware
ca: Obtenció de rotation_distance inspeccionant el maquinari
uk: Зберігання обертання_захисту за рахунок перевірки обладнання

source: It's possible to calculate rotation_distance with knowledge of the stepper motors and printer kinematics. This may be useful if the steps_per_mm is not known or if designing a new printer.
ca: És possible calcular rotation_distance amb el coneixement dels motors pas a pas i la cinemàtica de la impressora. Això pot ser útil si no es coneix els passos_per_mm o si es dissenya una impressora nova.
uk: Ви можете розрахувати обертання_випадання з знаннями крокових двигунів і принтерів кінематики. Це може бути корисним, якщо кроки_per_mm не відомі або якщо проектування нового принтера.

source: Belt driven axes
ca: Eixos accionats per corretja
uk: Стрічка керовані соки

source: It is easy to calculate rotation_distance for a linear axis that uses a belt and pulley.
ca: És fàcil calcular rotation_distance per a un eix lineal que utilitza una corretja i una politja.
uk: Легко розрахувати обертання_посадку для лінійної осі, яка використовує пояс і шків.

source: First determine the type of belt. Most printers use a 2mm belt pitch (that is, each tooth on the belt is 2mm apart). Then count the number of teeth on the stepper motor pulley. The rotation_distance is then calculated as:
ca: Primer determineu el tipus de corretja. La majoria de les impressores utilitzen un pas de corretja de 2 mm (és a dir, cada dent de la corretja està separada de 2 mm). A continuació, compta el nombre de dents de la politja del motor pas a pas. Aleshores, la distància de rotació es calcula com:
uk: Спочатку визначають тип ременя. Більшість принтерів використовують 2 мм ремінь (тобто кожен зуб на ремені становить 2 мм окремо). Потім відрахуйте кількість зубів на кроковий моторний шків. Після того, як обертання_випадання обчислюється:

source: For example, if a printer has a 2mm belt and uses a pulley with 20 teeth, then the rotation distance is 40.
ca: Per exemple, si una impressora té una corretja de 2 mm i utilitza una politja amb 20 dents, la distància de rotació és de 40.
uk: Наприклад, якщо принтер має 2 мм ремінь і використовує шків з 20 зубами, то відстань обертання 40.

source: Axes with a lead screw
ca: Eixos amb vis sense fi
uk: Ось з гвинтом свинцю

source: It is easy to calculate the rotation_distance for common lead screws using the following formula:
ca: És fàcil calcular la distància de rotació per als cargols comuns mitjançant la fórmula següent:
uk: Легко розрахувати обертання_захист для загального гвинта свинцю за допомогою наступної формули:

source: For example, the common "T8 leadscrew" has a rotation distance of 8 (it has a pitch of 2mm and has 4 separate threads).
ca: Per exemple, el "cargol T8" comú té una distància de rotació de 8 (té un pas de 2 mm i té 4 fils separats).
uk: Наприклад, загальний "T8 ведеквин" має відстань обертання 8 (він має крок 2мм і має 4 окремих ниток).

source: Older printers with "threaded rods" have only one "thread" on the lead screw and thus the rotation distance is the pitch of the screw. (The screw pitch is the distance between each groove on the screw.) So, for example, an M6 metric rod has a rotation distance of 1 and an M8 rod has a rotation distance of 1.25.
ca: Les impressores més antigues amb "barres roscades" només tenen una "rosca" al cargol i, per tant, la distància de rotació és el pas del cargol. (El pas del cargol és la distància entre cada ranura del cargol.) Així, per exemple, una vareta mètrica M6 té una distància de rotació d'1 i una vareta M8 té una distància de rotació d'1,25.
uk: Старші принтери з «прочитаними штангами» мають лише одну «прочитану» на гвинті свинцю і таким чином відстань обертання є кроком гвинта. (Шнековий крок – відстань між кожним пазом на шнеці.) Так, наприклад, метричний штанг M6 має відстань обертання 1 і штанга M8 має відстань обертання 1.25.

source: Extruder
ca: Extrusor
uk: Екструдер

source: It's possible to obtain an initial rotation distance for extruders by measuring the diameter of the "hobbed bolt" that pushes the filament and using the following formula: `rotation_distance = <diameter> * 3.14`
ca: És possible obtenir una distància de rotació inicial per a les extrusores mesurant el diàmetre de la "secció mecanitzada" que empeny el filament i utilitzant la fórmula següent: `rotation_distance = <diametre> * 3,14`
uk: Це можливо отримати початкову відстань обертання для екструдерів шляхом вимірювання діаметра "оббиваного болта", який штовхає нитки і за допомогою наступної формули: `rotation_distance = <diameter> * 3.14`

source: If the extruder uses gears then it will also be necessary to [determine and set the gear_ratio](#using-a-gear_ratio) for the extruder.
ca: Si l'extrusora utilitza engranatges, també caldrà [determinar i establir la relació_engranatges](#using-a-gear_ratio) per a l'extrusora.
uk: Якщо екстер'єр використовує редуктори, то він також буде необхідно [визначити і встановити редуктор_ratio](#using-a-gear_ratio) для екструдера.

source: The actual rotation distance on an extruder will vary from printer to printer, because the grip of the "hobbed bolt" that engages the filament can vary. It can even vary between filament spools. After obtaining an initial rotation_distance, use the [measure and trim procedure](#calibrating-rotation_distance-on-extruders) to obtain a more accurate setting.
ca: La distància de rotació real d'una extrusora variarà d'una impressora a una altra, ja que l'adherència del "secció mecanitzada" que enganxa el filament pot variar. Fins i tot pot variar entre bobines de filament. Després d'obtenir una distància de rotació inicial, utilitzeu el [procediment d'assaig i error] (#calibrating-rotation_distance-on-extruders) per obtenir una configuració més precisa.
uk: Фактична відстань обертання на екструдері варіюватися від принтера до принтера, тому що затирка "розміщеного болта", яка зачіпає нитки може відрізнятися. Він може навіть варіюватися між піддонами. Після отримання початкового обертання_distance використовуйте процедуру [вимірювання та обрізання](#calibrating-rotation_distance-on-extruders) для отримання більш точного налаштування.

source: Using a gear_ratio
ca: Utilitzant una relació d'engranatges
uk: Використання редуктора_ratio

source: Setting a `gear_ratio` can make it easier to configure the `rotation_distance` on steppers that have a gear box (or similar) attached to it. Most steppers do not have a gear box - if unsure then do not set `gear_ratio` in the config.
ca: Establir una `gear_ratio` pot facilitar la configuració de la `rotation_distance` als passos que tenen una caixa d'engranatges (o similar) connectada. La majoria dels steppers no tenen una caixa d'engranatges; si no esteu segurs, no configureu `gear_ratio` a la configuració.
uk: Налаштування `gear_ratio` може зробити його простіше налаштувати `rotation_distance` на кроках, які мають редуктор (або аналогічний) прикріплений до нього. Більшість кроків не мають коробки передач - якщо не запевнити, то не встановити `gear_ratio` в конфігурації.

source: When `gear_ratio` is set, the `rotation_distance` represents the distance the axis moves with one full rotation of the final gear on the gear box. If, for example, one is using a gearbox with a "5:1" ratio, then one could calculate the rotation_distance with [knowledge of the hardware](#obtaining-rotation_distance-by-inspecting-the-hardware) and then add `gear_ratio: 5:1` to the config.
ca: Quan s'estableix 'gear_ratio', la 'rotation_distance' representa la distància que es mou l'eix amb una rotació completa de l'engranatge final a la caixa d'engranatges. Si, per exemple, s'està utilitzant una caixa d'engranatges amb una relació "5:1", es podria calcular la distància de rotació amb [coneixement del maquinari] (#obtaining-rotation_distance-by-inspecting-the-hardware) i després afegir ` gear_ratio: 5:1` a la configuració.
uk: Коли `gear_ratio` встановлюється, `rotation_distance` являє собою відстань осі рухається з одним повним обертанням кінцевого редуктора на редукторі. Якщо, наприклад, за допомогою редуктора з коефіцієнтом "5:1", то можна розрахувати обертання_distance з [knowledge of the Hardware](#obtaining-rotation_distance-by-inspecting-the-hardware), а потім додати `gear_ratio: 5:1` в налаштування.

source: For gearing implemented with belts and pulleys, it is possible to determine the gear_ratio by counting the teeth on the pulleys. For example, if a stepper with a 16 toothed pulley drives the next pulley with 80 teeth then one would use `gear_ratio: 80:16`. Indeed, one could open a common off the shelf "gear box" and count the teeth in it to confirm its gear ratio.
ca: Per als engranatges implementats amb corretges i politges, és possible determinar la relació d'engranatges comptant les dents de les politges. Per exemple, si un pas a pas amb una politja de 16 dents acciona la següent politja amb 80 dents, s'utilitzaria `gear_ratio: 80:16`. De fet, es podria obrir una "caixa d'engranatges" comuna de la prestatgeria i comptar-hi les dents per confirmar la seva relació d'engranatges.
uk: Для шестерні, втілених стрічками і тягами, можна визначити шестерня_ratio шляхом підрахунку зубів на шківах. Наприклад, якщо степпер з 16 зубчастими шківами приводять наступний шків з 80 зубами, то можна використовувати `gear_ratio: 80:16`. Дійсно, можна відкрити спільну від полиці «гаряча коробка» і підрахувати зуби в ній, щоб підтвердити її співвідношення передач.

source: Note that sometimes a gearbox will have a slightly different gear ratio than what it is advertised as. The common BMG extruder motor gears are an example of this - they are advertised as "3:1" but actually use "50:17" gearing. (Using teeth numbers without a common denominator may improve overall gear wear as the teeth don't always mesh the same way with each revolution.) The common "5.18:1 planetary gearbox", is more accurately configured with `gear_ratio: 57:11`.
ca: Tingueu en compte que de vegades una caixa d'engranatges tindrà una relació de transmissió lleugerament diferent de la que s'anuncia. Els engranatges comuns del motor de l'extrusora BMG són un exemple d'això: s'anuncien com a "3:1", però en realitat utilitzen engranatges "50:17". (L'ús de números de dents sense un denominador comú pot millorar el desgast general de l'engranatge, ja que les dents no sempre engranen de la mateixa manera amb cada revolució.) La "caixa d'engranatges planetaris 5.18:1" comuna es configura amb més precisió amb `gear_ratio: 57:11. `.
uk: Зверніть увагу, що іноді коробка передач має дещо різне співвідношення передач, ніж що вона рекламується. Поширені моторні редуктори BMG є прикладом цього - вони рекламуються як "3:1", але насправді використовують "50:17" шестерні. (Кількість зубів без загального деномінатора може покращити загальний носій зуба, оскільки зуби не завжди сітчасті таким же чином з кожним революцією.) `gear_ratio: 57:11`.

source: If several gears are used on an axis then it is possible to provide a comma separated list to gear_ratio. For example, a "5:1" gear box driving a 16 toothed to 80 toothed pulley could use `gear_ratio: 5:1, 80:16`.
ca: Si s'utilitzen diversos engranatges en un eix, és possible proporcionar una llista separada per comes a gear_ratio. Per exemple, una caixa d'engranatges "5:1" que condueix una politja de 16 dents a 80 dents podria utilitzar `gear_ratio: 5:1, 80:16`.
uk: Якщо кілька передач використовуються на вісь, то можна надати комам відокремлений список до Gear_ratio. Наприклад, коробка передач "5:1" 16 зубчаста до 80 зубчастих шків може використовуватися `gear_ratio: 5:1, 80:16`.

source: In most cases, gear_ratio should be defined with whole numbers as common gears and pulleys have a whole number of teeth on them. However, in cases where a belt drives a pulley using friction instead of teeth, it may make sense to use a floating point number in the gear ratio (eg, `gear_ratio: 107.237:16`).
ca: En la majoria dels casos, gear_ratio s'hauria de definir amb nombres enters, ja que els engranatges i politges comuns tenen un nombre sencer de dents. Tanmateix, en els casos en què una corretja acciona una politja utilitzant fricció en lloc de dents, pot tenir sentit utilitzar un nombre de coma flotant en la relació d'engranatges (p. ex., `gear_ratio: 107.237:16`).
uk: У більшості випадків шестерня_ратіо необхідно визначитися з цілими числами, як загальними шестернями, так і шківами мають цілу кількість зубів на них. Тим не менш, у випадках, коли ремінь приводить шків за допомогою тертя замість зубів, він може мати сенс використовувати плаваючий номер точки в співвідношенні редуктора (наприклад, `gear_ratio: 107.237:16`).

source: rotation_distance = <full_steps_per_rotation> * <microsteps> / <steps_per_mm>
ca: rotation_distance = <passos_complets_per_rotació> * <microspassos> / <passos_per_mm>
uk: rotation_distance = <повні_кроки_на_оберт> * <мікрокроки> / <кроки_на_мм>

source: rotation_distance = <full_steps_per_rotation> * <microsteps> * <step_distance>
ca: rotation_distance =<passos_complets_per_rotació> * <micropassos> * <distància_de_passos>
uk: rotation_distance = <повні_кроки_на_оберт> * <мікрокроки> * <крокова_відстань>

source: rotation_distance = <belt_pitch> * <number_of_teeth_on_pulley>
ca: rotation_distance = <pas_de_corretja> * <nombre_de_dents_a_politja>
uk: відстань_обертання = <крок_ременя> * <кількість_зубів_на_шківі>
