Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/SDCard_Updates.po
Languages: hu, it, ta

source: Many of today's popular controller boards ship with a bootloader capable of updating firmware via SD Card. While this is convenient in many circumstances, these bootloaders typically provide no other way to update firmware. This can be a nuisance if your board is mounted in a location that is difficult to access or if you need to update firmware often. After Klipper has been initially flashed to a controller it is possible to transfer new firmware to the SD Card and initiate the flashing procedure via ssh.
hu: A manapság népszerű vezérlőlapok közül sokan olyan bootloaderrel rendelkeznek, amely képes a firmware SD-kártyán keresztül történő frissítésére. Bár ez sok esetben kényelmes, ezek a bootloaderek általában nem biztosítanak más módot a firmware frissítésére. Ez kellemetlen lehet, ha a kártyaolvasót úgy helyezték, hogy nehéz hozzáférni, főleg ha gyakran kell frissíteni a firmware-t. Miután a Klipper eredetileg egy vezérlőre lett égetve, lehetőség van az új firmware átvitelére az SD-kártyára, és a égetési eljárás elindítására SSH-n keresztül.
it: Molte delle schede controller oggi popolari vengono fornite con un bootloader in grado di aggiornare il firmware tramite scheda SD. Sebbene ciò sia conveniente in molte circostanze, questi bootloader in genere non forniscono altro modo per aggiornare il firmware. Questo può essere un fastidio se la tua scheda è montata in una posizione di difficile accesso o se devi aggiornare spesso il firmware. Dopo che Klipper è stato inizialmente flashato su un controller, è possibile trasferire il nuovo firmware sulla scheda SD e avviare la procedura di flashing tramite ssh.
ta: இன்றைய பிரபலமான கட்டுப்பாட்டு பலகைகள் பல எச்டி அட்டை வழியாக ஃபார்ம்வேரைப் புதுப்பிக்கும் திறன் கொண்ட துவக்க ஏற்றி கொண்டவை. பல சூழ்நிலைகளில் இது வசதியானது என்றாலும், இந்த துவக்க ஏற்றிகள் பொதுவாக ஃபார்ம்வேரைப் புதுப்பிக்க வேறு வழியில்லை. உங்கள் பலகை அணுக கடினமாக இருக்கும் இடத்தில் ஏற்றப்பட்டிருந்தால் அல்லது நீங்கள் அடிக்கடி ஃபார்ம்வேரை புதுப்பிக்க வேண்டுமானால் இது ஒரு தொல்லையாக இருக்கலாம். கிளிப்பர் ஆரம்பத்தில் ஒரு கட்டுப்படுத்திக்கு பறந்த பிறகு, புதிய ஃபார்ம்வேரை எச்டி கார்டுக்கு மாற்றவும், பாஓடு வழியாக ஒளிரும் நடைமுறையைத் தொடங்கவும் முடியும்.

source: Typical Upgrade Procedure
hu: Tipikus frissítési eljárás
it: Procedura di aggiornamento tipica
ta: வழக்கமான மேம்படுத்தல் செயல்முறை

source: The procedure for updating MCU firmware using the SD Card is similar to that of other methods. Instead of using `make flash` it is necessary to run a helper script, `flash-sdcard.sh`. Updating a BigTreeTech SKR 1.3 might look like the following:
hu: Az MCU firmware SD-kártya használatával történő frissítésének menete hasonló a többi módszerhez. A `make flash` használata helyett egy segédszkriptet kell futtatni, `flash-sdcard.sh`. Egy BigTreeTech SKR 1.3 frissítése a következőképpen néz ki:
it: La procedura per aggiornare il firmware dell'MCU utilizzando la scheda SD è simile a quella di altri metodi. Invece di usare `make flash` è necessario eseguire uno script di supporto, `flash-sdcard.sh`. L'aggiornamento di un BigTreeTech SKR 1.3 potrebbe essere simile al seguente:
ta: எச்டி கார்டைப் பயன்படுத்தி எம்.சி.யு ஃபார்ம்வேரைப் புதுப்பிப்பதற்கான செயல்முறை மற்ற முறைகளுக்கு ஒத்ததாகும். `மேக் ஃப்ளாச்` ஐப் பயன்படுத்துவதற்குப் பதிலாக, உதவி ச்கிரிப்டை இயக்குவது அவசியம்,` ஃப்ளாச்-Sdcard.sh`. ஒரு பிக் ட்ரீட்டெக் எச்.கே.ஆர் 1.3 ஐ புதுப்பிப்பது பின்வருவனவற்றைப் போல் இருக்கலாம்:

source: It is up to the user to determine the device location and board name. If a user needs to flash multiple boards, `flash-sdcard.sh` (or `make flash` if appropriate) should be run for each board prior to restarting the Klipper service.
hu: Az eszköz helyének és az alaplap nevének meghatározása a felhasználó feladata. Ha a felhasználónak több alaplapot kell égetnie, akkor a Klipper szolgáltatás újraindítása előtt a `flash-sdcard.sh` (vagy `make flash`, ha szükséges) programot kell futtatni minden egyes alaplaphoz.
it: Spetta all'utente determinare la posizione del dispositivo e il nome della scheda. Se un utente ha bisogno di eseguire il flashing di più schede, `flash-sdcard.sh` (o `make flash` se appropriato) dovrebbe essere eseguito per ciascuna scheda prima di riavviare il servizio Klipper.
ta: சாதன இருப்பிடம் மற்றும் போர்டு பெயரை தீர்மானிக்க வேண்டியது பயனரின் பொறுப்பாகும். ஒரு பயனர் பல பலகைகளை ஒளிரச் செய்ய வேண்டுமானால், கிளிப்பர் சேவையை மறுதொடக்கம் செய்வதற்கு முன்னர் ஒவ்வொரு போர்டுக்கும் `ஃப்ளாச்-Sdcard.sh` (அல்லது` பொருத்தமாக இருந்தால் `ஃப்ளாச் செய்யுங்கள்) இயக்கப்பட வேண்டும்.

source: Supported boards can be listed with the following command:
hu: A támogatott alaplapok a következő paranccsal listázhatók:
it: Le schede supportate possono essere elencate con il seguente comando:
ta: ஆதரிக்கப்பட்ட பலகைகளை பின்வரும் கட்டளையுடன் பட்டியலிடலாம்:

source: If you do not see your board listed it may be necessary to add a new board definition as [described below](#board-definitions).
hu: Ha nem látod az alaplapodat a listában, akkor lehet, hogy új alaplap definíciót kell hozzáadnod a [lentebb leírtak szerint](#board-definitions).
it: Se non vedi la tua scheda elencata, potrebbe essere necessario aggiungere una nuova definizione di scheda come [descritto di seguito](#board-definitions).
ta: உங்கள் வாரியம் பட்டியலிடப்பட்டதை நீங்கள் காணவில்லை என்றால், [கீழே விவரிக்கப்பட்டுள்ள] (#போர்டு-வரையறைகள்) புதிய போர்டு வரையறையைச் சேர்க்க வேண்டியது தேவை.

source: Advanced Usage
hu: Fejlett felhasználás
it: Utilizzo avanzato
ta: மேம்பட்ட பயன்பாடு

source: The above commands assume that your MCU connects at the default baud rate of 250000 and the firmware is located at `~/klipper/out/klipper.bin`. The `flash-sdcard.sh` script provides options for changing these defaults. All options can be viewed by the help screen:
hu: A fenti parancsok feltételezik, hogy az MCU az alapértelmezett 250000-es átviteli sebességgel csatlakozik, és a firmware a `~/klipper/out/klipper.bin` címen található. A `flash-sdcard.sh` szkript lehetőséget biztosít ezen alapértelmezések megváltoztatására. Az összes opciót a súgó képernyőn lehet megtekinteni:
it: I comandi precedenti presuppongono che l'MCU si connetta alla velocità di trasmissione predefinita di 250000 e che il firmware si trovi in `~/klipper/out/klipper.bin`. Lo script `flash-sdcard.sh` fornisce opzioni per modificare queste impostazioni predefinite. Tutte le opzioni possono essere visualizzate dalla schermata della guida:
ta: மேலே உள்ள கட்டளைகள் உங்கள் எம்.சி.யு இயல்புநிலை பாட் விகிதத்தில் 250000 மற்றும் ஃபார்ம்வேர் `~/klipper/out/klipper.bin` இல் அமைந்துள்ளது என்று கருதுகின்றன. `Flash-sdcard.sh` ச்கிரிப்ட் இந்த இயல்புநிலைகளை மாற்றுவதற்கான விருப்பங்களை வழங்குகிறது. அனைத்து விருப்பங்களையும் உதவித் திரை மூலம் பார்க்கலாம்:

source: If your board is flashed with firmware that connects at a custom baud rate it is possible to upgrade by specifying the `-b` option:
hu: Ha az alaplapod olyan firmware-vel égetted, amely egyéni átviteli sebesség mellett csatlakozik, akkor a `-b` opció megadásával frissítheted:
it: Se la tua scheda è stata flashata con un firmware che si connette a un baud rate personalizzato, è possibile eseguire l'aggiornamento specificando l'opzione `-b`:
ta: தனிப்பயன் பாட் விகிதத்தில் இணைக்கும் ஃபார்ம்வேருடன் உங்கள் பலகை ஒளிரும் என்றால், `-B` விருப்பத்தைக் குறிப்பிடுவதன் மூலம் மேம்படுத்த முடியும்:

source: If you wish to flash a build of Klipper located somewhere other than the default location it can be done by specifying the `-f` option:
hu: Ha a Klipper egy, az alapértelmezett helytől eltérő helyen található készletét szeretné égetni, akkor ezt a `-f` opció megadásával teheti meg:
it: Se desideri eseguire il flashing di una build di Klipper situata in un luogo diverso da quello predefinito, puoi farlo specificando l'opzione `-f`:
ta: இயல்புநிலை இருப்பிடத்தைத் தவிர வேறு எங்காவது அமைந்துள்ள கிளிப்பரை உருவாக்க நீங்கள் விரும்பினால், `-f` விருப்பத்தைக் குறிப்பிடுவதன் மூலம் அதைச் செய்யலாம்:

source: Note that when upgrading a MKS Robin E3 it is not necessary to manually run `update_mks_robin.py` and supply the resulting binary to `flash-sdcard.sh`. This procedure is automated during the upload process.
hu: Ne feledje, hogy az MKS Robin E3 frissítésekor nem szükséges manuálisan futtatni a `update_mks_robin.py` fájlt, és az így kapott bináris állományt a `flash-sdcard.sh` fájlba táplálni. Ez az eljárás a feltöltési folyamat során automatikusan megtörténik.
it: Nota che quando si aggiorna un MKS Robin E3 non è necessario eseguire manualmente `update_mks_robin.py` e fornire il binario risultante a `flash-sdcard.sh`. Questa procedura è automatizzata durante il processo di caricamento.
ta: ஒரு எம்.கே.எச் ராபின் இ 3 ஐ மேம்படுத்தும் போது `Update_mks_robin.py` ஐ கைமுறையாக இயக்கவும், இதன் விளைவாக வரும் பைனரி` ஃப்ளாச்-Sdcard.sh` க்கு வழங்கவும் தேவையில்லை என்பதை நினைவில் கொள்க. பதிவேற்றும் செயல்பாட்டின் போது இந்த செயல்முறை தானியங்கி செய்யப்படுகிறது.

source: Caveats
hu: Óvintézkedések
it: Avvertenze
ta: எச்சரிக்கைகள்

source: As mentioned in the introduction, this method only works for upgrading firmware. The initial flashing procedure must be done manually per the instructions that apply to your controller board.
hu: Ahogy a bevezetőben említettük, ez a módszer csak a firmware frissítésére alkalmas. A kezdeti égetési eljárást kézzel kell elvégezni az alaplapra vonatkozó utasítások szerint.
it: Come accennato nell'introduzione, questo metodo funziona solo per l'aggiornamento del firmware. La procedura di flashing iniziale deve essere eseguita manualmente secondo le istruzioni che si applicano alla scheda del controller.
ta: அறிமுகத்தில் குறிப்பிட்டுள்ளபடி, இந்த முறை ஃபார்ம்வேரை மேம்படுத்த மட்டுமே வேலை செய்கிறது. உங்கள் கட்டுப்பாட்டு வாரியத்திற்கு பொருந்தும் வழிமுறைகளுக்குள் ஆரம்ப ஒளிரும் செயல்முறை கைமுறையாக செய்யப்பட வேண்டும்.

source: While it is possible to flash a build that changes the Serial Baud or connection interface (ie: from USB to UART), verification will always fail as the script will be unable to reconnect to the MCU to verify the current version.
hu: Bár lehetséges a soros adatátvitelt vagy a csatlakozási interfészt (pl. USB-ről UART-ra) módosító készlet égetése, az ellenőrzés mindig sikertelen lesz, mivel a szkript nem tud újra csatlakozni az MCU-hoz az aktuális verzió ellenőrzéséhez.
it: Sebbene sia possibile eseguire il flashing di una build che modifica il baud seriale o l'interfaccia di connessione (ad esempio: da USB a UART), la verifica avrà sempre esito negativo poiché lo script non sarà in grado di riconnettersi all'MCU per verificare la versione corrente.
ta: சீரியல் பாட் அல்லது இணைப்பு இடைமுகத்தை (அதாவது: யூ.எச்.பி முதல் யுஆர்டி வரை) மாற்றும் ஒரு கட்டமைப்பை ஒளிரச் செய்ய முடியும் என்றாலும், தற்போதைய பதிப்பை சரிபார்க்க ச்கிரிப்ட் எம்.சி.யுவுடன் மீண்டும் இணைக்க முடியாததால் சரிபார்ப்பு எப்போதும் தோல்வியடையும்.

source: Board Definitions
hu: Alaplap definíciók
it: Definizioni della scheda
ta: போர்டு வரையறைகள்

source: Most common boards should be available, however it is possible to add a new board definition if necessary. Board definitions are located in `~/klipper/scripts/spi_flash/board_defs.py`. The definitions are stored in dictionary, for example:
hu: A legtöbb általános alaplapnak rendelkezésre kell állnia, azonban szükség esetén új alaplap definíciót is hozzáadhat. Az alaplapdefiníciók a `~/klipper/scripts/spi_flash/board_defs.py` állományban találhatók. A definíciókat például lexikonban tároljuk:
it: Dovrebbero essere disponibili le schede più comuni, tuttavia è possibile aggiungere una nuova definizione di scheda, se necessario. Le definizioni delle schede si trovano in `~/klipper/scripts/spi_flash/board_defs.py`. Le definizioni sono memorizzate nel dizionario, ad esempio:
ta: பெரும்பாலான பொதுவான பலகைகள் கிடைக்க வேண்டும், இருப்பினும் தேவைப்பட்டால் புதிய போர்டு வரையறையைச் சேர்க்க முடியும். போர்டு வரையறைகள் `~/klipper/scripts/spi_flash/board_defs.py` இல் அமைந்துள்ளன. வரையறைகள் அகராதியில் சேமிக்கப்படுகின்றன, எடுத்துக்காட்டாக:

source: The following fields may be specified:
hu: A következő mezők adhatók meg:
it: Possono essere specificati i seguenti campi:
ta: பின்வரும் புலங்கள் குறிப்பிடப்படலாம்:

source: `firmware_path`: The path on the SD Card where firmware should be transferred. The default is `firmware.bin`.
hu: `firmware_path`: Az SD-kártyán lévő elérési útvonal, ahová a firmware-t át kell vinni. Az alapértelmezett érték `firmware.bin`.
it: `firmware_path`: il percorso sulla scheda SD in cui trasferire il firmware. L'impostazione predefinita è `firmware.bin`.
ta: `ஃபார்ம்வேர்_பாத்`: ஃபார்ம்வேர் மாற்றப்பட வேண்டிய எச்டி கார்டில் உள்ள பாதை. இயல்புநிலை `firmware.bin`.

source: `spi_pins`: This should be 3 comma separated pins that are connected to the SD Card in the format of `miso,mosi,sclk`.
hu: `spi_pins`: Ennek 3 vesszővel elválasztott tűnek kell lennie, amelyek `miso,mosi,sclk` formátumban csatlakoznak az SD-kártyához.
it: spi_pins`: Dovrebbero essere 3 pin separati da virgola che sono collegati alla scheda SD nel formato `miso,mosi,sclk`.
ta: `SPI_PINS`: இது` மிசோ, மொசி, ச்க்ல்க்` வடிவத்தில் எச்டி கார்டுடன் இணைக்கப்பட்டுள்ள 3 கமாவைப் பிரித்த ஊசிகளாக இருக்க வேண்டும்.

source: Prior to creating a new board definition one should check to see if an existing board definition meets the criteria necessary for the new board. If this is the case, a `BOARD_ALIAS` may be specified. For example, the following alias may be added to specify `my-new-board` as an alias for `generic-lpc1768`:
hu: Egy új alaplap definíció létrehozása előtt ellenőrizni kell, hogy egy meglévő alaplap definíció megfelel-e az új alaplap számára szükséges kritériumoknak. Ha ez a helyzet, akkor egy `BOARD_ALIAS` adható meg. Például a következő álnév adható hozzá `az én-új alaplapom` álneveként a `generic-lpc1768` meghatározásához:
it: Prima di creare una nuova definizione di scheda, è necessario verificare se una definizione di scheda esistente soddisfa i criteri necessari per la nuova scheda. Se questo è il caso, può essere specificato un `BOARD_ALIAS`. Ad esempio, è possibile aggiungere il seguente alias per specificare `my-new-board` come alias per `generic-lpc1768`:
ta: புதிய போர்டு வரையறையை உருவாக்குவதற்கு முன், புதிய வாரியத்திற்குத் தேவையான அளவுகோல்களை ஏற்கனவே உள்ள வாரிய வரையறை நிறைவு செய்கிறதா என்பதை ஒருவர் சரிபார்க்க வேண்டும். இதுபோன்றால், ஒரு `போர்டு_லியாச்` குறிப்பிடப்படலாம். எடுத்துக்காட்டாக, `பொதுவான-எல்.பி.சி 1768` க்கான மாற்றுப்பெயராக` எனது புதிய போர்டு` குறிப்பிட பின்வரும் மாற்றுப்பெயர் சேர்க்கப்படலாம்:

source: If you need a new board definition and you are uncomfortable with the procedure outlined above it is recommended that you request one in the [Klipper Community Discord](Contact.md#discord).
hu: Ha új alaplap definícióra van szükséged, és nem tetszik a fent leírt eljárás, akkor ajánlott, hogy a [Klipper Community Discord](Contact.md#discord) segítségével kérj egyet.
it: Se hai bisogno di una nuova definizione di scheda e ti senti a disagio con la procedura descritta sopra, ti consigliamo di rivolgerti a [Klipper Community Discord](Contact.md#discord).
ta: உங்களுக்கு ஒரு புதிய போர்டு வரையறை தேவைப்பட்டால், மேலே குறிப்பிட்டுள்ள நடைமுறையில் உங்களுக்கு சங்கடமாக இருந்தால், [கிளிப்பர் சமூக டிச்கார்ட்] (தொடர்பு. எம்.டி#முரண்பாடு) இல் ஒன்றை நீங்கள் கோர பரிந்துரைக்கப்படுகிறது.

source: sudo service klipper stop cd ~/klipper git pull make clean make menuconfig make ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-skr-v1.3 sudo service klipper start
ta: சூடோ பணி கிளிப்பர் நிறுத்தம் சிடி ~/கிளிப்பர் அறிவிலி இழுத்தல் சுத்தமாக செய்யுங்கள் மெனுகான்ஃபிக் செய்யுங்கள் உருவாக்கு ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-skr-v1.3 சூடோ பணி கிளிப்பர் தொடக்க

source: ./scripts/flash-sdcard.sh -f ~/downloads/klipper.bin /dev/ttyAMA0 btt-skr-v1.3
ta: ./scripts/flash-sdcard.sh -f ~/downloads/cliffs.bin/dev/ttyama0 BTT-SR-V1.3

source: BOARD_DEFS = { 'generic-lpc1768': { 'mcu': "lpc1768", 'spi_bus': "ssp1", "cs_pin": "P0.6" }, ...<further definitions> }
ta: Board_defs = { 'generic-lpc1768': { 'MCU': "LPC1768", 'SPI_BUS': "SSP1", "CS_PIN": "P0.6" }, ... <மேலும் வரையறைகள்> }

source: BOARD_ALIASES = { ...<previous aliases>, 'my-new-board': BOARD_DEFS['generic-lpc1768'], }
ta: Board_aliases = { ... <முந்தைய மாற்றுப்பெயர்கள்>, 'என்-புதிய-பலகை': போர்டு_டெஃப்ச் ['பொதுவான-எல்பிசி 1768'], }

source: SDCard updates
hu: SD-kártya frissítések
it: Aggiornamenti scheda SD
ta: SDCARD புதுப்பிப்புகள்

source: ./scripts/flash-sdcard.sh -h SD Card upload utility for Klipper usage: flash_sdcard.sh [-h] [-l] [-c] [-b <baud>] [-f <firmware>] <device> <board> positional arguments: <device> device serial port <board> board type optional arguments: -h show this message -l list available boards -c run flash check/verify only (skip upload) -b <baud> serial baud rate (default is 250000) -f <firmware> path to klipper.bin
ta: ./scripts/flash-sdcard.sh -h எச்டி அட்டை கிளிப்பருக்கான பயன்பாடு பதிவேற்றும் பயன்பாடு பயன்பாடு: flash_sdcard.sh [-h] [-l] [-c] [-b <baud>] [-f <firmware>] <device> <board> நிலை வாதங்கள்: <சாதனம்> சாதன சீரியல் துறைமுகம் <board> பலகை வகை விருப்ப வாதங்கள்: -h இந்த செய்தியைக் காட்டுங்கள் -எல் பட்டியல் கிடைக்கும் பலகைகள் -c ரன் ஃப்ளாச் சோதனை/சரிபார்க்கவும் (பதிவேற்றத்தைத் தவிர்க்கவும்) -B <பாட்> சீரியல் பாட் வீதம் (இயல்புநிலை 250000) -f <firmware> klipper.bin க்கு பாதை

source: The `-c` option is used to perform a check or verify-only operation to test if the board is running the specified firmware correctly. This option is primarily intended for cases where a manual power-cycle is necessary to complete the flashing procedure, such as with bootloaders that use SDIO mode instead of SPI to access their SD Cards. (See Caveats below) But, it can also be used anytime to verify if the code flashed into the board matches the version in your build folder on any supported board.
ta: குறிப்பிட்ட ஃபார்ம்வேரை சரியாக இயக்குகிறதா என்பதை சோதிக்க காசோலை அல்லது சரிபார்க்க மட்டுமே செயல்பாட்டுக்கு `-c` விருப்பம் பயன்படுத்தப்படுகிறது. இந்த விருப்பம் முதன்மையாக ஒளிரும் நடைமுறையை முடிக்க ஒரு கையேடு சக்தி-சுழற்சி தேவையான நிகழ்வுகளுக்கு நோக்கமாக உள்ளது, அதாவது தங்கள் எச்டி கார்டுகளை அணுக SPI க்கு பதிலாக SDIO பயன்முறையைப் பயன்படுத்தும் துவக்க ஏற்றிகள் போன்றவை. .

source: Only boards that use SPI for SD Card communication are supported. Boards that use SDIO, such as the Flymaker Flyboard and MKS Robin Nano V1/V2, will not work in SDIO mode. However, it's usually possible to flash such boards using Software SPI mode instead. But if the board's bootloader only uses SDIO mode to access the SD Card, a power-cycle of the board and SD Card will be necessary so that the mode can switch from SPI back to SDIO to complete reflashing. Such boards should be defined with `skip_verify` enabled to skip the verify step immediately after flashing. Then after the manual power-cycle, you can rerun the exact same `./scripts/flash-sdcard.sh` command, but add the `-c` option to complete the check/verify operation. See [Flashing Boards that use SDIO](#flashing-boards-that-use-sdio) for examples.
ta: எச்டி அட்டை தகவல்தொடர்புக்கு SPI ஐப் பயன்படுத்தும் பலகைகள் மட்டுமே ஆதரிக்கப்படுகின்றன. ஃப்ளைமேக்கர் ஃப்ளைபோர்டு மற்றும் எம்.கே.எச் ராபின் நானோ வி 1/வி 2 போன்ற SDIO ஐப் பயன்படுத்தும் பலகைகள் SDIO பயன்முறையில் வேலை செய்யாது. இருப்பினும், அதற்கு பதிலாக மென்பொருள் SPI பயன்முறையைப் பயன்படுத்தி இதுபோன்ற பலகைகளை ஒளிரச் செய்வது சாத்தியமாகும். எச்டி கார்டை அணுக போர்டின் துவக்க ஏற்றி SDIO பயன்முறையை மட்டுமே பயன்படுத்தினால், போர்டு மற்றும் எச்டி கார்டின் ஆற்றல் சுழற்சி அவசியமாக இருக்கும், இதனால் பயன்முறை SDIO க்கு மீண்டும் SDIO க்கு மாற முடியும். இத்தகைய பலகைகள் ஒளிரும் உடனேயே சரிபார்க்கும் படிநிலையைத் தவிர்க்க `Skip_verify` உடன் வரையறுக்கப்பட வேண்டும். கையேடு சக்தி-சுழற்சிக்குப் பிறகு, நீங்கள் அதே `/ச்கிரிப்டுகள்/ஃப்ளாச்-Sdcard.sh` கட்டளையை மீண்டும் இயக்கலாம், ஆனால் காசோலை/சரிபார்க்க செயல்பாட்டை முடிக்க` -c` விருப்பத்தைச் சேர்க்கவும். எடுத்துக்காட்டுகளுக்கு [SDIO ஐப் பயன்படுத்தும் ஒளிரும் பலகைகள்] (#ஒளிரும்-போர்டுகள்-அந்த பயன்பாட்டு-Sdio) ஐப் பார்க்கவும்.

source: `current_firmware_path`: The path on the SD Card where the renamed firmware file is located after a successful flash. The default is `firmware.cur`.
ta: `Current_firmware_path`: வெற்றிகரமான ஃபிளாச் பிறகு மறுபெயரிடப்பட்ட ஃபார்ம்வேர் கோப்பு அமைந்துள்ள எச்டி கார்டில் உள்ள பாதை. இயல்புநிலை `firmware.cur`.

source: `skip_verify`: This defines a boolean value which tells the scripts to skip the firmware verification step during the flashing process. The default is `False`. It can be set to `True` for boards that require a manual power-cycle to complete flashing. To verify the firmware afterward, run the script again with the `-c` option to perform the verification step. [See caveats with SDIO cards](#caveats)
ta: `Skip_verify`: இது ஒரு பூலியன் மதிப்பை வரையறுக்கிறது, இது ஒளிரும் செயல்பாட்டின் போது ஃபார்ம்வேர் சரிபார்ப்பு படியைத் தவிர்க்க ச்கிரிப்ட்களைச் சொல்கிறது. இயல்புநிலை `பொய்`. ஒளிரும் முடிக்க ஒரு கையேடு ஆற்றல் சுழற்சி தேவைப்படும் பலகைகளுக்கு இது `உண்மை` என அமைக்கப்படலாம். பின்னர் ஃபார்ம்வேரை சரிபார்க்க, சரிபார்ப்பு படி செய்ய `-c` விருப்பத்துடன் ச்கிரிப்டை மீண்டும் இயக்கவும். [SDIO அட்டைகளுடன் எச்சரிக்கைகள் காண்க] (#எச்சரிக்கைகள்)

source: If software SPI is required, the `spi_bus` field should be set to `swspi` and the following additional field should be specified:
ta: மென்பொருள் SPI தேவைப்பட்டால், `SPI_BUS` புலம்` SWSPI` ஆக அமைக்கப்பட வேண்டும், மேலும் பின்வரும் கூடுதல் புலம் குறிப்பிடப்பட வேண்டும்:

source: It should be exceedingly rare that Software SPI is necessary, typically only boards with design errors or boards that normally only support SDIO mode for their SD Card will require it. The `btt-skr-pro` board definition provides an example of the former, and the `btt-octopus-f446-v1` board definition provides an example of the latter.
ta: மென்பொருள் SPI தேவை என்பது மிகவும் அரிதாக இருக்க வேண்டும், பொதுவாக வடிவமைப்பு பிழைகள் அல்லது பலகைகள் கொண்ட பலகைகள் மட்டுமே தங்கள் SD கார்டுக்கு SDIO பயன்முறையை மட்டுமே ஆதரிக்கும். `BTT-SKR-PRO` போர்டு வரையறை முந்தையவற்றின் உதாரணத்தை வழங்குகிறது, மேலும்` BTT-OCTOPUS-F446-V1` போர்டு வரையறை பிந்தையவருக்கு ஒரு எடுத்துக்காட்டு வழங்குகிறது.

source: Flashing Boards that use SDIO
ta: SDIO ஐப் பயன்படுத்தும் ஒளிரும் பலகைகள்

source: [As mentioned in the Caveats](#caveats), boards whose bootloader uses SDIO mode to access their SD Card require a power-cycle of the board, and specifically the SD Card itself, in order to switch from the SPI Mode used while writing the file to the SD Card back to SDIO mode for the bootloader to flash it into the board. These board definitions will use the `skip_verify` flag, which tells the flashing tool to stop after writing the firmware to the SD Card so that the board can be manually power-cycled and the verification step deferred until that's complete.
ta: . எச்டி கார்டுக்கான கோப்பு துவக்க ஏற்றி பலகையில் ஒளிரும். இந்த போர்டு வரையறைகள் `SKIP_VERIFY` கொடியைப் பயன்படுத்தும், இது எச்டி கார்டுக்கு ஃபார்ம்வேரை எழுதிய பிறகு நிறுத்தும்படி ஒளிரும் கருவியைக் கூறுகிறது, இதனால் வாரியத்தை கைமுறையாக சக்தி-சைக்கிள் ஓட்டவும், அது முடியும் வரை சரிபார்ப்பு படி ஒத்திவைக்கப்படலாம்.

source: There are two scenarios -- one with the RPi Host running on a separate power supply and the other when the RPi Host is running on the same power supply as the main board being flashed. The difference is whether or not it's necessary to also shutdown the RPi and then `ssh` again after the flashing is complete in order to do the verification step, or if the verification can be done immediately. Here's examples of the two scenarios:
ta: இரண்டு காட்சிகள் உள்ளன - ஒன்று ஆர்.பி.ஐ புரவலன் ஒரு தனி மின்சக்தியில் இயங்குகிறது, மற்றொன்று முதன்மையான வாரியம் ஒளிரும் அதே மின்சார விநியோகத்தில் ஆர்.பி.ஐ புரவலன் இயங்கும்போது. சரிபார்ப்பு படிநிலையைச் செய்வதற்காக ஒளிரும் முடிந்ததும், அல்லது சரிபார்ப்பை உடனடியாக செய்ய முடியுமா என்பதையும் `Ssh` மீண்டும்` Ssh` க்கும் அவசியமா இல்லையா என்பதுதான் வேறுபாடு. இரண்டு காட்சிகளின் எடுத்துக்காட்டுகள் இங்கே:
