Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/SDCard_Updates.po
Languages: hu, it, ta

source: SDIO Programming with RPi on Separate Power Supply
ta: தனி மின்சாரம் குறித்து RPI உடன் SDIO நிரலாக்க

source: A typical session with the RPi on a Separate Power Supply looks like the following. You will, of course, need to use your proper device path and board name:
ta: ஒரு தனி மின்சக்தியில் RPI உடன் ஒரு பொதுவான அமர்வு பின்வருவது போல் தெரிகிறது. நிச்சயமாக, நீங்கள் உங்கள் சரியான சாதன பாதை மற்றும் போர்டு பெயரைப் பயன்படுத்த வேண்டும்:

source: sudo service klipper stop cd ~/klipper git pull make clean make menuconfig make ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-octopus-f446-v1 [[[manually power-cycle the printer board here when instructed]]] ./scripts/flash-sdcard.sh -c /dev/ttyACM0 btt-octopus-f446-v1 sudo service klipper start
ta: சூடோ பணி கிளிப்பர் நிறுத்தம் சிடி ~/கிளிப்பர் அறிவிலி இழுத்தல் சுத்தமாக செய்யுங்கள் மெனுகான்ஃபிக் செய்யுங்கள் உருவாக்கு ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-octopus-f446-v1 [[[அறிவுறுத்தப்பட்டபோது இங்கே அச்சுப்பொறி பலகையை கைமுறையாக பவர்-சுழற்சி]]] ./scripts/flash-sdcard.sh -c /dev/ttyACM0 btt-octopus-f446-v1 சூடோ பணி கிளிப்பர் தொடக்க

source: SDIO Programming with RPi on the Same Power Supply
ta: அதே மின்சாரம் குறித்து RPI உடன் SDIO நிரலாக்க

source: A typical session with the RPi on the Same Power Supply looks like the following. You will, of course, need to use your proper device path and board name:
ta: அதே மின்சார விநியோகத்தில் RPI உடன் ஒரு பொதுவான அமர்வு பின்வருவது போல் தெரிகிறது. நிச்சயமாக, நீங்கள் உங்கள் சரியான சாதன பாதை மற்றும் போர்டு பெயரைப் பயன்படுத்த வேண்டும்:

source: sudo service klipper stop cd ~/klipper git pull make clean make menuconfig make ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-octopus-f446-v1 sudo shutdown -h now [[[wait for the RPi to shutdown, then power-cycle and ssh again to the RPi when it restarts]]] sudo service klipper stop cd ~/klipper ./scripts/flash-sdcard.sh -c /dev/ttyACM0 btt-octopus-f446-v1 sudo service klipper start
ta: சூடோ பணி கிளிப்பர் நிறுத்தம் சிடி ~/கிளிப்பர் அறிவிலி இழுத்தல் சுத்தமாக செய்யுங்கள் மெனுகான்ஃபிக் செய்யுங்கள் உருவாக்கு ./scripts/flash-sdcard.sh /dev/ttyACM0 btt-octopus-f446-v1 sudo shutown -h இப்போது [[ஆர்.பி.ஐ பணிநிறுத்தம் செய்ய காத்திருங்கள், பின்னர் பவர்-சைக்கிள் மற்றும் எச்.எச்.எச் மீண்டும் ஆர்.பி.ஐ மறுதொடக்கம் செய்யும்போது]]]]] சூடோ பணி கிளிப்பர் நிறுத்தம் சிடி ~/கிளிப்பர் ./scripts/flash-sdcard.sh -c /dev/ttyACM0 btt-octopus-f446-v1 சூடோ பணி கிளிப்பர் தொடக்க

source: In this case, since the RPi Host is being restarted, which will restart the `klipper` service, it's necessary to stop `klipper` again before doing the verification step and restart it after verification is complete.
ta: இந்த வழக்கில், RPI புரவலன் மறுதொடக்கம் செய்யப்படுவதால், இது `கிளிப்பர்` சேவையை மறுதொடக்கம் செய்யும் என்பதால், சரிபார்ப்பு படிநிலையைச் செய்வதற்கு முன்` கிளிப்பர்` மீண்டும் நிறுத்த வேண்டியது தேவை, சரிபார்ப்பு முடிந்ததும் அதை மறுதொடக்கம் செய்யுங்கள்.

source: SDIO to SPI Pin Mapping
ta: Sdio பெறுநர் spi முள் மேப்பிங்

source: If your board's schematic uses SDIO for its SD Card, you can map the pins as described in the chart below to determine the compatible Software SPI pins to assign in the `board_defs.py` file:
ta: உங்கள் வாரியத்தின் திட்டம் அதன் எச்டி கார்டுக்கு SDIO ஐப் பயன்படுத்தினால், `board_defs.py` கோப்பில் ஒதுக்க இணக்கமான மென்பொருள் SPI ஊசிகளைத் தீர்மானிக்க கீழேயுள்ள விளக்கப்படத்தில் விவரிக்கப்பட்டுள்ளபடி ஊசிகளை வரைபடமாக்கலாம்:

source: SD Card Pin
ta: எச்டி அட்டை முள்

source: Micro SD Card Pin
ta: மைக்ரோ எச்டி அட்டை முள்

source: SDIO Pin Name
ta: Sdio முள் பெயர்

source: SPI Pin Name
ta: SPI முள் பெயர்

source: DATA2
ta: தரவு

source: None (PU)*
ta: எதுவுமில்லை (பு)*

source: CD/DATA3
ta: குறுவட்டு/தேதி 3

source: CMD
ta: சி.எம்.டி.

source: MOSI
ta: மொசி

source: +3.3V (VDD)
ta: +3.3 வி (வி.டி.டி)

source: GND (VSS)
ta: சி.என்.டி (வி.எச்.எச்)

source: DATA0
ta: தேதி 0

source: MISO
ta: மிசோ

source: DATA1
ta: தரவு 1

source: Card Detect (CD)
ta: அட்டை கண்டறிதல் (குறுவட்டு)

source: \* None (PU) indicates an unused pin with a pull-up resistor
ta: \* எதுவுமில்லை (PU) புல்-அப் மின்தடையுடன் பயன்படுத்தப்படாத முள் குறிக்கிறது

source: `mcu`: The mcu type. This can be retrieved after configuring the build via `make menuconfig` by running `cat .config | grep CONFIG_MCU`. This field is required.
ta: `MCU`: MCU வகை. `பூனை .கான்பிக் | grep config_mcu`. இந்த புலம் தேவை.

source: `spi_bus`: The SPI bus connected to the SD Card. This should be retrieved from the board's schematic. This field is required.
ta: `SPI_BUS`: SD கார்டுடன் இணைக்கப்பட்ட SPI பச். வாரியத்தின் திட்டத்திலிருந்து இதை மீட்டெடுக்க வேண்டும். இந்த புலம் தேவை.

source: `cs_pin`: The Chip Select Pin connected to the SD Card. This should be retrieved from the board schematic. This field is required.
ta: `CS_PIN`: SD கார்டுடன் இணைக்கப்பட்ட CIP ஐத் தேர்ந்தெடுக்கவும். இதை வாரியத் திட்டத்திலிருந்து மீட்டெடுக்க வேண்டும். இந்த புலம் தேவை.

source: Only boards that use SPI for SD Card communication are supported. Boards that use SDIO, such as the Flymaker Flyboard and MKS Robin Nano V1/V2, will not work.
hu: Csak azok a kártyák támogatottak, amelyek SPI-t használnak az SD-kártya kommunikációhoz. Az SDIO-t használó alaplapok, például a Flymaker Flyboard és az MKS Robin Nano V1/V2, nem működnek.
it: Sono supportate solo le schede che utilizzano SPI per la comunicazione con scheda SD. Le schede che utilizzano SDIO, come Flymaker Flyboard e MKS Robin Nano V1/V2, non funzioneranno.

source: `mcu`: The mcu type. This can be retrevied after configuring the build via `make menuconfig` by running `cat .config | grep CONFIG_MCU`. This field is required.
hu: `mcu`: Az mcu típusa. Ezt a készlet `make menuconfig` segítségével történő konfigurálása után a `cat .config | grep CONFIG_MCU` futtatásával lehet visszakeresni. Ez a mező kötelezően kitöltendő.
it: `mcu`: il tipo di mcu. Questo può essere recuperato dopo aver configurato la build tramite `make menuconfig` eseguendo `cat .config | grep CONFIG_MCU`. Questo campo è obbligatorio.

source: `spi_bus`: The SPI bus connected to the SD Card. This should be retreived from the board's schematic. This field is required.
hu: `spi_bus`: Az SD-kártyához csatlakoztatott SPI-busz. Ezt a tábla kapcsolási rajzából kell visszakeresni. Ez a mező kötelező.
it: `spi_bus`: il bus SPI collegato alla scheda SD. Questo dovrebbe essere recuperato dallo schema della scheda. Questo campo è obbligatorio.

source: `cs_pin`: The Chip Select Pin connected to the SD Card. This should be retreived from the board schematic. This field is required.
hu: `cs_pin`: Az SD-kártyához csatlakoztatott chipkiválasztó tű. Ezt a kártya kapcsolási rajzából kell visszakeresni. Ez a mező kötelező.
it: `cs_pin`: il pin di selezione del chip collegato alla scheda SD. Questo dovrebbe essere recuperato dallo schema della scheda. Questo campo è obbligatorio.

source: `current_firmware_path` The path on the SD Card where the renamed firmware file is located after a successful flash. The default is `firmware.cur`.
hu: `current_firmware_path` Az SD-kártyán lévő elérési útvonal, ahol az átnevezett firmware fájl található a sikeres flashelés után. Az alapértelmezett érték `firmware.cur`.
it: `current_firmware_path` Il percorso sulla scheda SD in cui si trova il file del firmware rinominato dopo un flash riuscito. L'impostazione predefinita è "firmware.cur".

source: If software SPI is required the `spi_bus` field should be set to `swspi` and the following additional field should be specified:
hu: Ha szoftveres SPI szükséges, az `spi_bus` mezőt `swspi` értékre kell állítani, és a következő további mezőt kell megadni:
it: Se è richiesto il software SPI, il campo `spi_bus` deve essere impostato su `swspi` e deve essere specificato il seguente campo aggiuntivo:

source: It should be exceedingly rare that Software SPI is necessary, typically only boards with design errors will require it. The `btt-skr-pro` board definition provides an example.
hu: Rendkívül ritkán van szükség a Software SPI-re, jellemzően csak a tervezési hibás lapok igénylik. A `btt-skr-pro` alaplap definíció erre ad példát.
it: Dovrebbe essere estremamente raro che sia necessario Software SPI, in genere solo le schede con errori di progettazione lo richiederanno. La definizione della scheda `btt-skr-pro` fornisce un esempio.
