Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Skew_Correction.po
Languages: ta

source: Skew correction
ta: வளைவு திருத்தம்

source: Software based skew correction can help resolve dimensional inaccuracies resulting from a printer assembly that is not perfectly square. Note that if your printer is significantly skewed it is strongly recommended to first use mechanical means to get your printer as square as possible prior to applying software based correction.
ta: மென்பொருள் அடிப்படையிலான வளைவு திருத்தம் ஒரு அச்சுப்பொறி சட்டசபையின் விளைவாக இருக்கும் பரிமாண தவறுகளைத் தீர்க்க உதவும். உங்கள் அச்சுப்பொறி கணிசமாக வளைந்திருந்தால், மென்பொருள் அடிப்படையிலான திருத்தம் பயன்படுத்துவதற்கு முன்பு உங்கள் அச்சுப்பொறியை முடிந்தவரை சதுரமாகப் பெறுவதற்கு முதலில் மெக்கானிக்கல் வழிகளைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது என்பதை நினைவில் கொள்க.

source: Print a Calibration Object
ta: ஒரு அளவுத்திருத்த பொருளை அச்சிடுங்கள்

source: The first step in correcting skew is to print a [calibration object](https://www.thingiverse.com/thing:2563185/files) along the plane you want to correct. There is also a [calibration object](https://www.thingiverse.com/thing:2972743) that includes all planes in one model. You want the object oriented so that corner A is toward the origin of the plane.
ta: வளைவை சரிசெய்வதற்கான முதல் படி, [அளவுத்திருத்த பொருள்] (https://www.thingiverse.com/thing:2563185/files) நீங்கள் சரிசெய்ய விரும்பும் விமானத்தில் அச்சிடுவது. அனைத்து விமானங்களையும் ஒரு மாதிரியில் உள்ளடக்கிய ஒரு [அளவுத்திருத்த பொருள்] (https://www.thingiverse.com/thing:2972743) உள்ளது. நீங்கள் பொருளை நோக்கியதாக விரும்புகிறீர்கள், அதனால் அந்த மூலையில் A விமானத்தின் தோற்றத்தை நோக்கி இருக்கும்.

source: Make sure that no skew correction is applied during this print. You may do this by either removing the `[skew_correction]` module from printer.cfg or by issuing a `SET_SKEW CLEAR=1` gcode.
ta: இந்த அச்சின் போது வளைவு திருத்தம் எதுவும் பயன்படுத்தப்படவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். `[Skew_correction]` Bunturn.cfg இலிருந்து தொகுதியை அகற்றுவதன் மூலமோ அல்லது `set_skew relal = 1` gcode ஐ வழங்குவதன் மூலமோ இதைச் செய்யலாம்.

source: Take your measurements
ta: உங்கள் அளவீடுகளை எடுத்துக் கொள்ளுங்கள்

source: Configure your skew
ta: உங்கள் வளைவை உள்ளமைக்கவும்

source: Make sure `[skew_correction]` is in printer.cfg. You may now use the `SET_SKEW` gcode to configure skew_correcton. For example, if your measured lengths along XY are as follows:
ta: `[Skew_correction]` printur.cfg இல் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். Skew_correcton ஐ உள்ளமைக்க இப்போது `set_skew` gcode ஐப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, XY உடன் உங்கள் அளவிடப்பட்ட நீளங்கள் பின்வருமாறு இருந்தால்:

source: `SET_SKEW` can be used to configure skew correction for the XY plane.
ta: XY விமானத்திற்கான வளைவு திருத்தத்தை உள்ளமைக்க `set_skew` பயன்படுத்தப்படலாம்.

source: You may also add measurements for XZ and YZ to the gcode:
ta: XZ மற்றும் YZ க்கான அளவீடுகளையும் GCODE இல் சேர்க்கலாம்:

source: The `[skew_correction]` module also supports profile management in a manner similar to `[bed_mesh]`. After setting skew using the `SET_SKEW` gcode, you may use the `SKEW_PROFILE` gcode to save it:
ta: `[Skew_correction]` தொகுதி `[bed_mesh]` போன்ற முறையில் சுயவிவர நிர்வாகத்தையும் ஆதரிக்கிறது. `Set_skew` gcode ஐப் பயன்படுத்தி வளைவு அமைத்த பிறகு, அதைச் சேமிக்க` skew_profile` gcode ஐப் பயன்படுத்தலாம்:

source: After this command you will be prompted to issue a `SAVE_CONFIG` gcode to save the profile to persistent storage. If no profile is named `my_skew_profile` then a new profile will be created. If the named profile exists it will be overwritten.
ta: இந்த கட்டளைக்குப் பிறகு, சுயவிவரத்தை தொடர்ச்சியான சேமிப்பகத்திற்கு சேமிக்க `save_config` gcode ஐ வழங்கும்படி கேட்கப்படுவீர்கள். `My_skew_profile` என்று பெயரிடவில்லை என்றால், புதிய சுயவிவரம் உருவாக்கப்படும். பெயரிடப்பட்ட சுயவிவரம் இருந்தால் அது மேலெழுதப்படும்.

source: Once you have a saved profile, you may load it:
ta: உங்களிடம் சேமிக்கப்பட்ட சுயவிவரம் கிடைத்ததும், அதை ஏற்றலாம்:

source: It is also possible to remove an old or out of date profile:
ta: பழைய அல்லது காலாவதியான சுயவிவரத்தை அகற்றவும் முடியும்:

source: After removing a profile you will be prompted to issue a `SAVE_CONFIG` to make this change persist.
ta: ஒரு சுயவிவரத்தை அகற்றிய பிறகு, இந்த மாற்றத்தை தொடர்ந்து செய்ய `save_config` ஐ வழங்கும்படி கேட்கப்படுவீர்கள்.

source: Verifying your correction
ta: உங்கள் திருத்தத்தை சரிபார்க்கிறது

source: After skew_correction has been configured you may reprint the calibration part with correction enabled. Use the following gcode to check your skew on each plane. The results should be lower than those reported via `GET_CURRENT_SKEW`.
ta: SKEW_CORRECTION கட்டமைக்கப்பட்ட பிறகு, அளவுத்திருத்த பகுதியை திருத்தம் இயக்கப்பட்டதன் மூலம் மறுபதிப்பு செய்யலாம். ஒவ்வொரு விமானத்திலும் உங்கள் வளைவு சரிபார்க்க பின்வரும் GCODE ஐப் பயன்படுத்தவும். `Get_current_skew` வழியாக அறிவிக்கப்பட்டதை விட முடிவுகள் குறைவாக இருக்க வேண்டும்.

source: Due to the nature of skew correction it is recommended to configure skew in your start gcode, after homing and any kind of movement that travels near the edge of the print area such as a purge or nozzle wipe. You may use use the `SET_SKEW` or `SKEW_PROFILE` gcodes to accomplish this. It is also recommended to issue a `SET_SKEW CLEAR=1` in your end gcode.
ta: வளைவு திருத்தத்தின் தன்மை காரணமாக, உங்கள் தொடக்க GCODE இல் வளைவை உள்ளமைக்க பரிந்துரைக்கப்படுகிறது, ஓமிங் மற்றும் எந்தவொரு இயக்கத்திற்கும் பிறகு அச்சுப் பகுதியின் விளிம்பிற்கு அருகில் ஒரு தூய்மை அல்லது முனை துடைக்கப்படுகிறது. இதைச் செய்ய நீங்கள் `set_skew` அல்லது` skew_profile` gcodes ஐப் பயன்படுத்தலாம். உங்கள் இறுதி GCODE இல் `Set_skew relal = 1` ஐ வழங்கவும் பரிந்துரைக்கப்படுகிறது.

source: Keep in mind that it is possible for `[skew_correction]` to generate a correction that moves the tool beyond the printer's boundaries on the X and/or Y axes. It is recommended to arrange parts away from the edges when using `[skew_correction]`.
ta: ஃச் மற்றும்/அல்லது ஒய் அச்சுகளில் அச்சுப்பொறியின் எல்லைகளுக்கு அப்பால் கருவியை நகர்த்தும் ஒரு திருத்தத்தை உருவாக்க `[skew_correction]` என்பதற்கு இது சாத்தியமாகும் என்பதை நினைவில் கொள்ளுங்கள். `[Skew_correction] keen ஐப் பயன்படுத்தும் போது விளிம்புகளிலிருந்து பகுதிகளை ஒழுங்கமைக்க பரிந்துரைக்கப்படுகிறது.

source: The `[skew_correction]` module requires 3 measurements for each plane you want to correct; the length from Corner A to Corner C, the length from Corner B to Corner D, and the length from Corner A to Corner D. When measuring length AD do not include the flats on the corners that some test objects provide.
ta: `[Skew_correction]` தொகுதிக்கு நீங்கள் சரிசெய்ய விரும்பும் ஒவ்வொரு விமானத்திற்கும் 3 அளவீடுகள் தேவை; மூலையில் இருந்து சி முதல் சி வரை நீளம், மூலையில் இருந்து மூலையில் இருந்து டி வரை நீளம், மற்றும் மூலையில் இருந்து மூலையில் இருந்து டி வரை நீளம். நீளத்தை அளவிடும்போது சில சோதனை பொருள்கள் வழங்கும் மூலைகளில் உள்ள குடியிருப்புகள் இல்லை.
