Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Slicers.po
Languages: bg, ta

source: This document provides some tips for configuring a "slicer" application for use with Klipper. Common slicers used with Klipper are Slic3r, Cura, Simplify3D, etc.
bg: Този документ предоставя някои съвети за конфигуриране на приложение "slicer" за използване с Klipper. Често срещани слайсери, използвани с Klipper, са Slic3r, Cura, Simplify3D и др.
ta: இந்த ஆவணம் கிளிப்பருடன் பயன்படுத்த "ச்லைசர்" பயன்பாட்டை உள்ளமைக்க சில உதவிக்குறிப்புகளை வழங்குகிறது. கிளிப்பருடன் பயன்படுத்தப்படும் பொதுவான ச்லைசர்கள் SLIC3R, Cura, Simplify3d போன்றவை.

source: Set the G-Code flavor to Marlin
bg: Задайте вкуса на G-кода на Marlin
ta: சி-கோட் சுவையை மார்லினுக்கு அமைக்கவும்

source: Many slicers have an option to configure the "G-Code flavor". The default is frequently "Marlin" and that works well with Klipper. The "Smoothieware" setting also works well with Klipper.
bg: Много машини за нарязване имат възможност за конфигуриране на "вкуса на G-кода". По подразбиране често се избира "Marlin" и това работи добре с Klipper. Настройката "Smoothieware" също работи добре с Klipper.
ta: "சி-குறியீடு சுவையை" உள்ளமைக்க பல ச்லைசர்களுக்கு ஒரு விருப்பம் உள்ளது. இயல்புநிலை அடிக்கடி "மார்லின்" ஆகும், அது கிளிப்பருடன் நன்றாக வேலை செய்கிறது. "ச்மூத்தேவேர்" அமைப்பும் கிளிப்பருடன் நன்றாக வேலை செய்கிறது.

source: Slicers will often allow one to configure "Start G-Code" and "End G-Code" sequences. It is often convenient to define custom macros in the Klipper config file instead - such as: `[gcode_macro START_PRINT]` and `[gcode_macro END_PRINT]`. Then one can just run START_PRINT and END_PRINT in the slicer's configuration. Defining these actions in the Klipper configuration may make it easier to tweak the printer's start and end steps as changes do not require re-slicing.
bg: Резачките често позволяват конфигуриране на последователности "Начален G-код" и "Краен G-код". Вместо това често е удобно да се дефинират потребителски макроси в конфигурационния файл на Klipper - например: `[gcode_macro START_PRINT]` и `[gcode_macro END_PRINT]`. След това можете просто да стартирате START_PRINT и END_PRINT в конфигурацията на слайзера. Дефинирането на тези действия в конфигурацията на Klipper може да улесни промяната на началните и крайните стъпки на принтера, тъй като промените не изискват повторно нарязване.
ta: ச்லைசர்கள் பெரும்பாலும் "ச்டார்ட் சி-கோட்" மற்றும் "எண்ட் சி-கோட்" காட்சிகளை உள்ளமைக்க ஒன்றை அனுமதிக்கும். அதற்கு பதிலாக கிளிப்பர் கட்டமைப்பு கோப்பில் தனிப்பயன் மேக்ரோக்களை வரையறுப்பது பெரும்பாலும் வசதியானது - போன்றவை: `[gcode_macro start_print]` மற்றும் `[gcode_macro end_print]`. பின்னர் ஒருவர் ச்லைசரின் உள்ளமைவில் Start_print மற்றும் End_print ஐ இயக்க முடியும். கிளிப்பர் உள்ளமைவில் இந்த செயல்களை வரையறுப்பது அச்சுப்பொறியின் தொடக்க மற்றும் இறுதி படிகளை மாற்றியமைப்பதை எளிதாக்குகிறது, ஏனெனில் மாற்றங்களுக்கு மறு-துண்டுகள் தேவையில்லை.

source: See [sample-macros.cfg](../config/sample-macros.cfg) for example START_PRINT and END_PRINT macros.
bg: Вижте [sample-macros.cfg](../config/sample-macros.cfg) за примерни макроси START_PRINT и END_PRINT.
ta: எடுத்துக்காட்டாக Start_print மற்றும் End_print பெரியவைகள் க்கு [salem-macros.cfg] (../ config/salem-macros.cfg) ஐப் பார்க்கவும்.

source: See the [config reference](Config_Reference.md#gcode_macro) for details on defining a gcode_macro.
bg: Вижте [config reference](Config_Reference.md#gcode_macro) за подробности относно дефинирането на gcode_macro.
ta: GCODE_MACRO ஐ வரையறுப்பது குறித்த விவரங்களுக்கு [config refeess] (config_reference.md#gcode_macro) ஐப் பார்க்கவும்.

source: Large retraction settings may require tuning Klipper
bg: Големите настройки на прибиране може да изискват настройка на клипса
ta: பெரிய பின்வாங்கல் அமைப்புகளுக்கு டியூனிங் கிளிப்பர் தேவைப்படலாம்

source: The maximum speed and acceleration of retraction moves are controlled in Klipper by the `max_extrude_only_velocity` and `max_extrude_only_accel` config settings. These settings have a default value that should work well on many printers. However, if one has configured a large retraction in the slicer (eg, 5mm or greater) then one may find they limit the desired speed of retractions.
bg: Максималната скорост и ускорението на движенията за прибиране се контролират в Klipper чрез конфигурационните настройки `max_extrude_only_velocity` и `max_extrude_only_accel`. Тези настройки имат стойност по подразбиране, която би трябвало да работи добре при много принтери. Въпреки това, ако някой е конфигурирал голямо прибиране в слайсера (например 5 мм или повече), може да се окаже, че те ограничават желаната скорост на прибиране.
ta: பின்வாங்கல் நகர்வுகளின் அதிகபட்ச விரைவு மற்றும் முடுக்கம் klipper இல் `max_extrude_only_velocity` மற்றும்` max_extrude_only_accel` கட்டமைப்பு அமைப்புகளால் கட்டுப்படுத்தப்படுகிறது. இந்த அமைப்புகள் இயல்புநிலை மதிப்பைக் கொண்டுள்ளன, அவை பல அச்சுப்பொறிகளில் சிறப்பாக செயல்பட வேண்டும். இருப்பினும், ஒருவர் ச்லைசரில் ஒரு பெரிய பின்வாங்கலை உள்ளமைத்திருந்தால் (எ.கா., 5 மிமீ அல்லது அதற்கு மேற்பட்டது) பின்னர் அவர்கள் விரும்பிய பின்வாங்கல்களின் வேகத்தை மட்டுப்படுத்தலாம்.

source: If using a large retraction, consider tuning Klipper's [pressure advance](Pressure_Advance.md) instead. Otherwise, if one finds the toolhead seems to "pause" during retraction and priming, then consider explicitly defining `max_extrude_only_velocity` and `max_extrude_only_accel` in the Klipper config file.
bg: Ако използвате голямо прибиране, помислете за настройване на [аванс на налягането] на Klipper (Pressure_Advance.md) вместо това. В противен случай, ако установите, че главата на инструмента сякаш "спира" по време на прибиране и грундиране, помислете за изрично дефиниране на `max_extrude_only_velocity` и `max_extrude_only_accel` в конфигурационния файл на Klipper.
ta: ஒரு பெரிய பின்வாங்கலைப் பயன்படுத்தினால், அதற்கு பதிலாக கிளிப்பரின் [பிரசர் அட்வான்ச்] (பிரசர்_ட்வான்ச்.ம்டி) ட்யூனிங் செய்வதைக் கவனியுங்கள். இல்லையெனில், பின்வாங்கல் மற்றும் ஆரம்பத்தின் போது கருவித்தொகை "இடைநிறுத்தப்படுவதாக" தோன்றினால், கிளிப்பர் கட்டமைப்பு கோப்பில் `max_extrude_only_velocity` மற்றும்` max_extrude_only_accel` ஆகியவற்றை வெளிப்படையாக வரையறுப்பதைக் கருத்தில் கொள்ளுங்கள்.

source: Do not enable "coasting"
bg: Не разрешавайте функцията "coasting".
ta: "கடலோரத்தை" இயக்க வேண்டாம்

source: The "coasting" feature is likely to result in poor quality prints with Klipper. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
bg: Възможно е функцията за изчакване да доведе до ниско качество на разпечатките с Klipper. Вместо това помислете за използване на функцията [pressure advance](Pressure_Advance.md) на Klipper.
ta: "கடலோர" நற்பொருத்தம் கிளிப்பருடன் தரமான அச்சிட்டுகளை ஏற்படுத்தக்கூடும். அதற்கு பதிலாக கிளிப்பரின் [பிரசர் அட்வான்ச்] (Pression_advance.md) ஐப் பயன்படுத்துவதைக் கவனியுங்கள்.

source: Specifically, if the slicer dramatically changes the extrusion rate between moves then Klipper will perform deceleration and acceleration between moves. This is likely to make blobbing worse, not better.
bg: По-конкретно, ако слайсерът рязко променя скоростта на екструдиране между ходовете, Klipper ще извършва забавяне и ускоряване между ходовете. Това вероятно ще влоши, а не ще подобри блобинга.
ta: குறிப்பாக, ச்லைசர் நகர்வுகளுக்கு இடையிலான வெளியேற்ற விகிதத்தை வியத்தகு முறையில் மாற்றினால், கிளிப்பர் நகர்வுகளுக்கு இடையில் வீழ்ச்சியையும் முடுக்கத்தையும் செய்யும். இது குமிழியை மோசமாக்கும், சிறந்தது அல்ல.

source: In contrast, it is okay (and often helpful) to use a slicer's "retract" setting, "wipe" setting, and/or "wipe on retract" setting.
bg: За разлика от това е добре (и често е полезно) да използвате настройките "прибиране", "избърсване" и/или "избърсване при прибиране" на резачката.
ta: இதற்கு நேர்மாறாக, ச்லைசர் "பின்வாங்கல்" அமைப்புகள், "கம்பி" அமைப்பு மற்றும்/அல்லது "பின்வாங்கலில் துடைக்க" அமைப்பைப் பயன்படுத்துவது பரவாயில்லை (பெரும்பாலும் உதவியாக இருக்கும்).

source: Do not use "extra restart distance" on Simplify3d
bg: Не използвайте "допълнително разстояние за рестартиране" в Simplify3d
ta: சிம்பிளிஃபை 3 டி இல் "கூடுதல் மறுதொடக்கம் தூரத்தை" பயன்படுத்த வேண்டாம்

source: This setting can cause dramatic changes to extrusion rates which can trigger Klipper's maximum extrusion cross-section check. Consider using Klipper's [pressure advance](Pressure_Advance.md) or the regular Simplify3d retract setting instead.
bg: Тази настройка може да доведе до драстични промени в скоростта на екструдиране, които могат да задействат проверката на Klipper за максимално напречно сечение на екструдиране. Вместо това помислете за използване на [pressure advance] (Pressure_Advance.md) на Klipper или обикновената настройка за прибиране на Simplify3d.
ta: இந்த அமைப்பு எக்ச்ட்ரூசன் விகிதங்களில் வியத்தகு மாற்றங்களை ஏற்படுத்தும், இது கிளிப்பரின் அதிகபட்ச வெளியேற்ற குறுக்கு வெட்டு சோதனையைத் தூண்டும். கிளிப்பரின் [பிரசர் அட்வான்ச்] (Pression_advance.md) அல்லது வழக்கமான சிம்பிளிஃபை 3 டி பின்வாங்கல் அமைப்பைப் பயன்படுத்துவதைக் கவனியுங்கள்.

source: Disable "PreloadVE" on KISSlicer
bg: Деактивиране на "PreloadVE" на KISSlicer
ta: கிச்ச்லிசரில் "ப்ரிபிரோட்வ்" ஐ முடக்கு

source: If using KISSlicer slicing software then set "PreloadVE" to zero. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
bg: Ако използвате софтуера за нарязване KISSlicer, задайте "PreloadVE" на нула. Вместо това помислете за използване на [Pressure advance] (Pressure_Advance.md) на Klipper.
ta: கிச்ச்லிசர் ச்லைசிங் மென்பொருளைப் பயன்படுத்தினால், "முன்னுரிமை" பூச்சியமாக அமைக்கவும். அதற்கு பதிலாக கிளிப்பரின் [பிரசர் அட்வான்ச்] (Pression_advance.md) ஐப் பயன்படுத்துவதைக் கவனியுங்கள்.

source: Disable any "advanced extruder pressure" settings
bg: Деактивирайте всички настройки за "разширено налягане на екструдера".
ta: எந்த "மேம்பட்ட எக்ச்ட்ரூடர் அழுத்தம்" அமைப்புகளையும் முடக்கவும்

source: Some slicers advertise an "advanced extruder pressure" capability. It is recommended to keep these options disabled when using Klipper as they are likely to result in poor quality prints. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
bg: Някои машини за нарязване рекламират възможността за "усъвършенствано налягане на екструдера". Препоръчително е тези опции да бъдат изключени, когато използвате Klipper, тъй като има вероятност да доведат до ниско качество на разпечатките. Вместо това помислете за използване на [pressure advance](Pressure_Advance.md) на Klipper.
ta: சில ச்லைசர்கள் "மேம்பட்ட எக்ச்ட்ரூடர் அழுத்தம்" திறனை விளம்பரப்படுத்துகின்றன. கிளிப்பரைப் பயன்படுத்தும் போது இந்த விருப்பங்களை முடக்க வைக்க பரிந்துரைக்கப்படுகிறது, ஏனெனில் அவை தரமான அச்சிட்டுகளை ஏற்படுத்தக்கூடும். அதற்கு பதிலாக கிளிப்பரின் [பிரசர் அட்வான்ச்] (Pression_advance.md) ஐப் பயன்படுத்துவதைக் கவனியுங்கள்.

source: Specifically, these slicer settings can instruct the firmware to make wild changes to the extrusion rate in the hope that the firmware will approximate those requests and the printer will roughly obtain a desirable extruder pressure. Klipper, however, utilizes precise kinematic calculations and timing. When Klipper is commanded to make significant changes to the extrusion rate it will plan out the corresponding changes to velocity, acceleration, and extruder movement - which is not the slicer's intent. The slicer may even command excessive extrusion rates to the point that it triggers Klipper's maximum extrusion cross-section check.
bg: По-конкретно, тези настройки на слайсерите могат да инструктират фърмуера да прави дивашки промени в скоростта на екструдиране с надеждата, че фърмуерът ще се доближи до тези заявки и принтерът приблизително ще получи желаното налягане на екструдера. Klipper обаче използва прецизни кинематични изчисления и синхронизация. Когато Klipper получи команда да направи значителни промени в скоростта на екструдиране, той ще планира съответните промени в скоростта, ускорението и движението на екструдера - което не е целта на слайсера. Режещата машина може дори да подаде команда за прекомерна скорост на екструдиране до такава степен, че да задейства проверката на Klipper за максимално сечение на екструдиране.
ta: குறிப்பாக, இந்த ச்லைசர் அமைப்புகள் ஃபார்ம்வேரை எக்ச்ட்ரூசன் விகிதத்தில் காட்டு மாற்றங்களைச் செய்ய அறிவுறுத்தலாம், அந்தக் கோரிக்கைகளை ஃபார்ம்வேர் தோராயமாக மதிப்பிடும், மேலும் அச்சுப்பொறி விரும்பத்தக்க எக்ச்ட்ரூடர் அழுத்தத்தைப் பெறும். இருப்பினும், கிளிப்பர் துல்லியமான இயக்கவியல் கணக்கீடுகளையும் நேரத்தையும் பயன்படுத்துகிறது. வெளியேற்ற விகிதத்தில் குறிப்பிடத்தக்க மாற்றங்களைச் செய்ய கிளிப்பர் கட்டளையிடப்படும்போது, அது விரைவு, முடுக்கம் மற்றும் எக்ச்ட்ரூடர் இயக்கம் ஆகியவற்றுடன் தொடர்புடைய மாற்றங்களைத் திட்டமிடும் - இது ச்லைசரின் நோக்கம் அல்ல. ச்லைசர் கிளிப்பரின் அதிகபட்ச வெளியேற்ற குறுக்கு வெட்டு சோதனையைத் தூண்டும் அளவிற்கு அதிகப்படியான வெளியேற்ற விகிதங்களை கட்டளையிடலாம்.

source: Slicers
bg: Слайсери

source: START_PRINT macros
bg: Макроси START_PRINT
ta: Start_print மேக்ரோச்

source: When using a START_PRINT macro or similar, it is useful to sometimes pass through parameters from the slicer variables to the macro.
bg: Когато се използва макрос START_PRINT или друг подобен макрос, понякога е полезно да се предават параметри от променливите на слайсера към макроса.
ta: Start_print மேக்ரோ அல்லது ஒத்ததாகப் பயன்படுத்தும் போது, சில நேரங்களில் ச்லைசர் மாறிகள் முதல் மேக்ரோவுக்கு அளவுருக்கள் வழியாகச் செல்வது பயனுள்ளதாக இருக்கும்.

source: In Cura, to pass through temperatures, the following start gcode would be used:
bg: В Cura за преминаване през температурите ще се използва следният стартов gcode:
ta: குராவில், வெப்பநிலையை கடந்து செல்ல, பின்வரும் தொடக்க GCODE பயன்படுத்தப்படும்:

source: START_PRINT BED_TEMP={material_bed_temperature_layer_0} EXTRUDER_TEMP={material_print_temperature_layer_0}
bg: START_PRINT BED_TEMP={материал_легло_температура_слой_0} EXTRUDER_TEMP={материал_печатане_температура_слой_0}

source: In slic3r derivatives such as PrusaSlicer and SuperSlicer, the following would be used:
bg: В производните на slic3r, като PrusaSlicer и SuperSlicer, се използва следното:
ta: ப்ரூசாச்லிசர் மற்றும் சூப்பர்ச்லிசர் போன்ற SLIC3R வழித்தோன்றல்களில், பின்வருபவை பயன்படுத்தப்படும்:

source: Also note that these slicers will insert their own heating codes when certain conditions are not met. In Cura, the existence of the `{material_bed_temperature_layer_0}` and `{material_print_temperature_layer_0}` variables is enough to mitigate this. In slic3r derivatives, you would use:
bg: Също така имайте предвид, че тези резачки въвеждат свои собствени кодове за нагряване, когато не са изпълнени определени условия. В Cura съществуването на променливите `{материал_легло_температура_слой_0}` и `{материал_печат_температура_слой_0}` е достатъчно, за да се смекчи това. В производните на slic3r ще използвате:
ta: Also குறிப்பு that these slicers will செருகவும் their own heating codes when certain conditions அரே not met. குராவில், `{material_bed_temperature_layer_0}` மற்றும் {material_print_temperature_layer_0} `மாறிகள் இதைத் தணிக்க போதுமானது. In slic3r derivatives, you would use:

source: before the macro call. Also note that SuperSlicer has a "custom gcode only" button option, which achieves the same outcome.
bg: преди извикването на макроса. Също така имайте предвид, че SuperSlicer има опция за бутон "само потребителски gcode", с която се постига същият резултат.
ta: மேக்ரோ அழைப்புக்கு முன். சூப்பர்ச்லீசரில் "தனிப்பயன் GCODE மட்டும்" பொத்தான் விருப்பமும் உள்ளது, இது அதே முடிவை அடைகிறது.

source: An example of a START_PRINT macro using these paramaters can be found in config/sample-macros.cfg
bg: Пример за макрос START_PRINT, използващ тези параметри, можете да намерите в config/sample-macros.cfg
ta: இந்த அளவுருவுகளைப் பயன்படுத்தி ஒரு START_PRINT மேக்ரோவின் எடுத்துக்காட்டு கட்டமைப்பு/மாதிரி-macros.cfg இல் காணலாம்

source: START_PRINT EXTRUDER_TEMP=[first_layer_temperature] BED_TEMP=[first_layer_bed_temperature]
bg: START_PRINT EXTRUDER_TEMP=[температура на първия_слой] BED_TEMP=[температура на първия_слой_легло]

source: Klipper gcode_macro
ta: கிளிப்பர் gcode_macro
