Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: ru, ta, uk

source: This document is a reference of printer status information available in Klipper [macros](Command_Templates.md), [display fields](Config_Reference.md#display), and via the [API Server](API_Server.md).
ru: Этот документ является справочником информации о состоянии принтера, доступной в Klipper [macros](Command_Templates.md), [display fields](Config_Reference.md#display) и через[API Server](API_Server.md).
ta: இந்த ஆவணம் கிளிப்பர் [மேக்ரோக்கள்] (கட்டளை_டெம்ப்ளேட்ச்.எம்டி), [காட்சி புலங்கள்] (config_reference.md#காட்சி), மற்றும் [API சேவையகம்] (API_SERVER.MD) வழியாக கிடைக்கும் அச்சுப்பொறி நிலை தகவல்களின் குறிப்பு ஆகும்.
uk: Цей документ є посиланням на інформацію про статус принтера, доступні в Klipper [macros](Command_Templates.md), [display поля](Config_Reference.md#display), а через [API Server](API_Server.md).

source: The fields in this document are subject to change - if using an attribute be sure to review the [Config Changes document](Config_Changes.md) when upgrading the Klipper software.
ru: Поля в этом документе могут быть изменены - при использовании атрибута обязательно ознакомьтесь с документом [Config Changes document](Config_Changes.md) при обновлении программного обеспечения Klipper.
ta: இந்த ஆவணத்தில் உள்ள புலங்கள் மாற்றத்திற்கு உட்பட்டவை - ஒரு பண்புக்கூறு பயன்படுத்தினால், கிளிப்பர் மென்பொருளை மேம்படுத்தும் போது [கட்டமைப்பு மாற்றங்கள் ஆவணத்தை] (config_changes.md) மதிப்பாய்வு செய்ய வேண்டும்.
uk: Поле в цьому документі підлягають зміні - якщо за допомогою атрибута обов'язково перегляньте документ [Config Changes](Config_Changes.md) при оновленні програмного забезпечення Klipper.

source: bed_mesh
ru: сетка постели (bed_mesh)
uk: постіль

source: The following information is available in the [bed_mesh](Config_Reference.md#bed_mesh) object:
ru: Следующая информация доступна в объекте [bed_mesh](Config_Reference.md#bed_mesh):
ta: பின்வரும் தகவல்கள் [bed_mesh] (config_reference.md#bed_mesh) பொருளில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [bed_mesh](Config_Reference.md#bed_mesh) об'єкт:

source: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Information on the currently active bed_mesh.
ru: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Информация о текущей активной сетке bed_mesh.
ta: `சுயவிவரம்_நாம்`,` mesh_min`, `mesh_max`,` probed_matrix`, `mesh_matrix`: தற்போது செயலில் உள்ள படுக்கை_மெச் பற்றிய செய்தி.
uk: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Інформація про в даний час активне ліжко_меш.

source: configfile
ta: கட்டமைப்பு
uk: налаштування

source: The following information is available in the `configfile` object (this object is always available):
ru: Следующая информация доступна в объекте `configfile` (этот объект всегда доступен):
ta: பின்வரும் தகவல்கள் `கட்டமைப்பு` பொருளில் கிடைக்கின்றன (இந்த பொருள் எப்போதும் கிடைக்கும்):
uk: Наступна інформація доступна в `configfile` об'єкт ( цей об'єкт завжди доступний):

source: `settings.<section>.<option>`: Returns the given config file setting (or default value) during the last software start or restart. (Any settings changed at run-time will not be reflected here.)
ru: `settings.<section>.<option>`: Возвращает заданную настройку файла конфигурации (или значение по умолчанию) во время последнего запуска или перезапуска программы. (Любые настройки, измененные во время выполнения, не будут отражены здесь.)
ta: `அமைப்புகள். <ction>. (ரன் நேரத்தில் மாற்றப்பட்ட எந்த அமைப்புகளும் இங்கே பிரதிபலிக்காது.)
uk: `settings.<section>.<option>`: повертає задану налаштування файлу (або значення за замовчуванням) під час останнього запуску програмного забезпечення або перезавантаження. (Налаштування змінені в режимі run-time не будуть відображені тут.)

source: `config.<section>.<option>`: Returns the given raw config file setting as read by Klipper during the last software start or restart. (Any settings changed at run-time will not be reflected here.) All values are returned as strings.
ru: `config.<section>.<option>`: Возвращает заданные необработанные настройки конфигурационного файла, считанные Klipper во время последнего запуска или перезапуска программы. (Любые настройки, измененные во время выполнения, не будут отражены здесь). Все значения возвращаются в виде строк.
ta: `கட்டமைப்பு. <ction>. (ரன் நேரத்தில் மாற்றப்பட்ட எந்த அமைப்புகளும் இங்கே பிரதிபலிக்காது.) அனைத்து மதிப்புகளும் சரங்களாக திருப்பித் தரப்படுகின்றன.
uk: `config.<section>.<option>`: повертає задану конфігурацію файлу, як читати Klipper під час останнього запуску програмного забезпечення або перезавантаження. (Налаштування змінені в режимі run-time не будуть відображені тут.) Всі значення повертаються як рядки.

source: display_status
uk: огляд

source: The following information is available in the `display_status` object (this object is automatically available if a [display](Config_Reference.md#display) config section is defined):
ru: Следующая информация доступна в объекте `display_status` (этот объект автоматически доступен, если определен раздел конфигурации [display](Config_Reference.md#display)):
ta: பின்வரும் தகவல்கள் `டிச்ப்ளே_ச்டேட்டச்` பொருளில் கிடைக்கின்றன (ஒரு [காட்சி] (config_reference.md#காட்சி) கட்டமைப்பு பிரிவு வரையறுக்கப்பட்டால் இந்த பொருள் தானாகவே கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `display_status` ( цей об'єкт автоматично доступний, якщо параметр [display](Config_Reference.md#display)):

source: `progress`: The progress value of the last `M73` G-Code command (or `virtual_sdcard.progress` if no recent `M73` received).
ru: `progress`: Значение прогресса последней `M73` команды G-Code (или `virtual_sdcard.progress`, если не получена последняя `M73` команда).
ta: `முன்னேற்றம்`: கடைசி` M73` சி-குறியீட்டு கட்டளையின் முன்னேற்ற மதிப்பு (அல்லது `மெய்நிகர்_ச்ட்கார்ட்.பிரெச்` சமீபத்திய` எம் 73` பெறவில்லை என்றால்).
uk: `прогрес`: Вартість прогресу останнього `M73` G-Code команди (або `virtual_sdcard.progress` if no last `M73`.

source: `message`: The message contained in the last `M117` G-Code command.
ru: `сообщение`: Сообщение, содержащееся в последней `M117` команде G-кода.
ta: `செய்தி`: கடைசி` M117` சி-குறியீட்டு கட்டளையில் உள்ள செய்தி.
uk: `message`: Останнє повідомлення `M117` G-Code команди.

source: endstop_phase
uk: endstop_фаза

source: The following information is available in the [endstop_phase](Config_Reference.md#endstop_phase) object:
ru: Следующая информация доступна в объекте [endstop_phase](Config_Reference.md#endstop_phase):
ta: பின்வரும் தகவல்கள் [endstop_phase] (config_reference.md#endstop_phase) பொருளில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [endstop_phase](Config_Reference.md#endstop_phase) об'єкт:

source: `last_home.<stepper name>.phase`: The phase of the stepper motor at the end of the last home attempt.
ru: `last_home.<имя шагового двигателя>.phase`: Фаза шагового двигателя в конце последней попытки возврата домой.
ta: `லாச்ட்_ஓம். <ச்டெப்பர் பெயர்> .பேச்`: கடைசி வீட்டு முயற்சியின் முடிவில் ச்டெப்பர் மோட்டரின் கட்டம்.
uk: `last_home.<stepper name>.фаз`: Фаза крокової двигуна в кінці останньої домашньої спроби.

source: `last_home.<stepper name>.phases`: The total number of phases available on the stepper motor.
ru: `last_home.<имя шагового двигателя>.phases`: Общее количество фаз, доступных на шаговом двигателе.
ta: `லாச்ட்_ஓம். <ச்டெப்பர் பெயர்> .பேச்கள்`: ச்டெப்பர் மோட்டரில் கிடைக்கும் மொத்த கட்டங்களின் எண்ணிக்கை.
uk: `last_home.<stepper name>.фаз`: Загальна кількість фаз, доступних на кроковий двигун.

source: `last_home.<stepper name>.mcu_position`: The position (as tracked by the micro-controller) of the stepper motor at the end of the last home attempt. The position is the total number of steps taken in a forward direction minus the total number of steps taken in the reverse direction since the micro-controller was last restarted.
ru: `last_home.<имя шагового двигателя>.mcu_position`: Положение (отслеживаемое микроконтроллером) шагового двигателя в конце последней попытки возврата домой. Позиция - это общее количество шагов, сделанных в прямом направлении, минус общее количество шагов, сделанных в обратном направлении с момента последнего перезапуска микроконтроллера.
ta: `லாச்ட்_ஓம். <ச்டெப்பர் பெயர்> .mcu_position`: கடைசி வீட்டு முயற்சியின் முடிவில் ச்டெப்பர் மோட்டரின் நிலை (மைக்ரோ-கன்ட்ரோலரால் கண்காணிக்கப்பட்டது). மைக்ரோ-கன்ட்ரோலர் கடைசியாக மறுதொடக்கம் செய்யப்பட்டதிலிருந்து தலைகீழ் திசையில் எடுக்கப்பட்ட மொத்த நடவடிக்கைகளின் எண்ணிக்கையை கழித்தல் முன்னோக்கி திசையில் எடுக்கப்பட்ட மொத்த நடவடிக்கைகளின் எண்ணிக்கை இந்த நிலை.
uk: `last_home.<Прізвище>.mcu_позиція`: Позиція (як відстежується мікроконтролером) крокової двигуна в кінці останньої домашньої спроби. Посада – загальна кількість кроків, які беруться в напрямку вперед, мінус загальна кількість кроків, що беруться в зворотному напрямку, так як мікроконтролер був прослужений.

source: The following information is available in [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) and [controller_fan some_name](Config_Reference.md#controller_fan) objects:
ru: Следующая информация доступна в объектах [вентилятор](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) и [controller_fan some_name](Config_Reference.md#controller_fan):
ta: பின்வரும் தகவல்கள் [fan] (config_reference.md#fan), [heter_fan சில_நேம்] (config_reference.md#heter_fan) மற்றும் [controlter_fan சில_நேம்] (config_reference.md#controlter_fan) பொருள்கள்:
uk: Додаткова інформація доступна в [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) і [controller_fan some_name](Config_Reference.md#controller_fan) об'єкти:

source: `speed`: The fan speed as a float between 0.0 and 1.0.
ru: `Скорость`: Скорость вращения вентилятора в виде плавающей величины между 0,0 и 1,0.
ta: `வேகம்`: சுவைஞர் விரைவு 0.0 முதல் 1.0 வரை மிதவையாக இருக்கும்.
uk: `speed`: Швидкість вентилятора в порівнянні з 0,0 і 1,0.

source: `rpm`: The measured fan speed in rotations per minute if the fan has a tachometer_pin defined.
ru: `rpm`: Измеренная скорость вращения вентилятора в оборотах в минуту, если у вентилятора определен контакт тахометра (tachometer_pin).
ta: `ஆர்.பி.எம்.
uk: `rpm`: Вимірюється швидкість вентилятора в обертах в хвилину, якщо вентилятор має тахометр_pin визначений.

source: filament_switch_sensor
uk: javascript licenses api веб-сайт

source: The following information is available in [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) objects:
ru: Следующая информация доступна в объектах [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor):
ta: பின்வரும் தகவல்கள் [Filament_switch_sensor some_name] (config_reference.md#filemation_switch_sensor) பொருள்கள்:
uk: Наступна інформація доступна в [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) об'єктах:

source: `enabled`: Returns True if the switch sensor is currently enabled.
ru: `включен`: Возвращает истину, если датчик переключателя в данный момент включен.
ta: `இயக்கப்பட்டது`: ச்விட்ச் சென்சார் தற்போது இயக்கப்பட்டிருந்தால் உண்மை.
uk: `enabled`: Повернення Правда, якщо датчик вимкнення в даний час включений.

source: `filament_detected`: Returns True if the sensor is in a triggered state.
ru: `filament_detected`: Возвращает истину, если датчик находится в состоянии срабатывания.
ta: `filemation_detected`: சென்சார் தூண்டப்பட்ட நிலையில் இருந்தால் உண்மை.
uk: `filament_detected`: Повернення Правда, якщо датчик перебуває в запущеному стані.

source: The following information is available in [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) objects:
ru: Следующая информация доступна в объектах [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor):
ta: பின்வரும் தகவல்கள் [Filament_motion_sensor some_name] (config_reference.md#filament_motion_sensor) பொருள்கள்:
uk: Наступна інформація доступна в [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) об'єктах:

source: `enabled`: Returns True if the motion sensor is currently enabled.
ru: `включен`: Возвращает истину, если датчик движения включен.
ta: `இயக்கப்பட்டது`: மோசன் சென்சார் தற்போது இயக்கப்பட்டிருந்தால் உண்மை.
uk: `enabled`: Повернення Правда, якщо датчик руху в даний час включений.

source: firmware_retraction
uk: прошивка_відновлення

source: The following information is available in the [firmware_retraction](Config_Reference.md#firmware_retraction) object:
ru: Следующая информация доступна в объекте [firmware_retraction](Config_Reference.md#firmware_retraction):
ta: பின்வரும் தகவல்கள் [firmware_retraction] (config_reference.md#firmware_retraction) பொருளில் கிடைக்கின்றன:
uk: Додаткова інформація доступна в об'єкті [firmware_retraction](Config_Reference.md#firmware_retraction):

source: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: The current settings for the firmware_retraction module. These settings may differ from the config file if a `SET_RETRACTION` command alters them.
ru: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: Текущие настройки для модуля firmware_retraction. Эти настройки могут отличаться от настроек в файле конфигурации, если команда `SET_RETRACTION` изменит их.
ta: `retact_length`,` retact_speed`, `UnorRectact_extra_length`,` Unertract_speed`: firmware_retraction தொகுதிக்கான தற்போதைய அமைப்புகள். `Set_retraction` கட்டளை அவற்றை மாற்றினால் இந்த அமைப்புகள் கட்டமைப்பு கோப்பிலிருந்து வேறுபடலாம்.
uk: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: Поточні налаштування для модуля прошивки_відновлення. Ці налаштування можуть відрізнятися від файла конфігурації, якщо `SET_RETRACTION` команди змінює їх.

source: The following information is available in [gcode_macro some_name](Config_Reference.md#gcode_macro) objects:
ru: Следующая информация доступна в объектах [gcode_macro some_name](Config_Reference.md#gcode_macro):
ta: பின்வரும் தகவல்கள் [gcode_macro some_name] (config_reference.md#gcode_macro) பொருள்கள்:
uk: У розділі [gcode_macro some_name](Config_Reference.md#gcode_macro) об'єкти:

source: `<variable>`: The current value of a [gcode_macro variable](Command_Templates.md#variables).
ru: `<переменная>`: Текущее значение переменной [gcode_macro](Command_Templates.md#variables).
ta: `<yasion>`: ஒரு [gcode_macro மாறி] இன் தற்போதைய மதிப்பு (Command_templates.md#மாறிகள்).
uk: `<variable>`: Поточне значення [gcode_macro змінного](Command_Templates.md#variables).

source: The following information is available in the `gcode_move` object (this object is always available):
ru: Следующая информация доступна в объекте `gcode_move` (этот объект всегда доступен):
ta: பின்வரும் தகவல்கள் `gcode_move` பொருளில் கிடைக்கின்றன (இந்த பொருள் எப்போதும் கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `gcode_move` ( цей об'єкт завжди доступний):

source: `gcode_position`: The current position of the toolhead relative to the current G-Code origin. That is, positions that one might directly send to a `G1` command. It is possible to access the x, y, z, and e components of this position (eg, `gcode_position.x`).
ru: `gcode_position`: Текущее положение головки инструмента относительно текущего начала G-кода. То есть, позиция, которую можно напрямую передать в команду `G1`. Можно получить доступ к компонентам x, y, z и e этой позиции (например, `gcode_position.x`).
ta: `gcode_position`: தற்போதைய சி-குறியீட்டு தோற்றத்துடன் தொடர்புடைய கருவித்தடத்தின் தற்போதைய நிலை. அதாவது, ஒருவர் `சி 1` கட்டளைக்கு நேரடியாக அனுப்பக்கூடிய நிலைகள். இந்த நிலையின் ஃச், ஒய், சட் மற்றும் இ கூறுகளை அணுக முடியும் (எ.கா., `gcode_position.x`).
uk: `gcode_position`: Поточна позиція керма відносно струму G-Code походження. Це, позиції, які можна безпосередньо надсилати на команду `G1`. Доступ до x, y, z і e компонентів цієї позиції (наприклад, `gcode_position.x`).

source: `position`: The last commanded position of the toolhead using the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
ru: `позиция`: Последнее заданное положение головки инструмента в системе координат, указанной в файле конфигурации. Можно получить доступ к компонентам x, y, z и e этой позиции (например, `position.x`).
ta: `நிலை`: கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்பைப் பயன்படுத்தி கருவியின் கடைசியாக கட்டளையிடப்பட்ட நிலை. இந்த நிலையின் ஃச், ஒய், சட் மற்றும் இ கூறுகளை அணுக முடியும் (எ.கா., `pasition.x`).
uk: `позиція`: Остання командована позиція на панелі інструментів, що використовується в координатному файлі. Можливий доступ до x, y, z, і електронних компонентів цієї позиції (наприклад, `position.x`).

source: `homing_origin`: The origin of the gcode coordinate system (relative to the coordinate system specified in the config file) to use after a `G28` command. The `SET_GCODE_OFFSET` command can alter this position. It is possible to access the x, y, and z components of this position (eg, `homing_origin.x`).
ru: `homing_origin`: Начало системы координат gcode (относительно системы координат, указанной в файле конфигурации), которую следует использовать после команды `G28`. Команда `SET_GCODE_OFFSET` может изменить это положение. Можно получить доступ к компонентам x, y и z этой позиции (например, `homing_origin.x`).
ta: `HOMING_ORIGIN`:` G28` கட்டளைக்குப் பிறகு பயன்படுத்த GCODE ஒருங்கிணைப்பு அமைப்பின் தோற்றம் (கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்புடன் தொடர்புடையது). `Set_gcode_offset` கட்டளை இந்த நிலையை மாற்றும். இந்த நிலையின் ஃச், ஒய் மற்றும் சட் கூறுகளை அணுக முடியும் (எ.கா., `homing_origin.x`).
uk: `homing_origin`: Походження координатної системи gcode (відносно до координатної системи, зазначеної в файлі конфігурацій) для використання після команди `G28`. `SET_GCODE_OFFSET` команда може змінити цю позицію. Доступ до x, y, z компонентів цієї позиції (наприклад, `homing_origin.x`).

source: `speed`: The last speed set in a `G1` command (in mm/s).
ru: `скорость`: Последняя скорость, установленная в команде `G1` (в мм/с).
ta: `வேகம்`: கடைசி வேகம்` ஐயா 1` கட்டளையில் (மிமீ/வி இல்) அமைக்கப்பட்டுள்ளது.
uk: `speed`: Останній набір швидкості в `G1` команди (в мм / с).

source: `speed_factor`: The "speed factor override" as set by an `M220` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested speed.
ru: `speed_factor`: "Переопределение коэффициента скорости", установленное командой `M220`. Это значение с плавающей точкой: 1.0 означает отсутствие переопределения, а, например, 2.0 удваивает запрашиваемую скорость.
ta: `SPEED_FACTOR`:` M220` கட்டளையால் அமைக்கப்பட்டுள்ள "வேக காரணி மேலெழுதல்". இது ஒரு மிதக்கும் புள்ளி மதிப்பாகும், அதாவது 1.0 என்பது மேலெழுதும் இல்லை, எடுத்துக்காட்டாக, 2.0 கோரப்பட்ட வேகத்தை இருமுறை செய்யும்.
uk: `speed_фактор`: "швидкий фактор перенареченості" в комплекті команди `M220`. Це плаваючою точкою значення, таким чином, 1,0 означає, що не перейди і, наприклад, 2.0 буде подвійний запитаний швидкість.

source: `extrude_factor`: The "extrude factor override" as set by an `M221` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested extrusions.
ru: `extrude_factor`: "Переопределение коэффициента выдавливания", задаваемое командой `M221`. Это значение с плавающей точкой: 1.0 означает отсутствие переопределения, а, например, 2.0 удваивает требуемые экструзии.
ta: `எக்ச்ட்ரூட்_ஃபாக்டர்`:` எம் 221` கட்டளையால் அமைக்கப்பட்டுள்ளபடி "எக்ச்ட்ரூட் காரணி மேலெழுதல்". இது ஒரு மிதக்கும் புள்ளி மதிப்பாகும், அதாவது 1.0 என்பது மேலெழுதும் இல்லை, எடுத்துக்காட்டாக, 2.0 கோரப்பட்ட வெளியேற்றங்களை இருமுறை செய்யும்.
uk: `extrude_фактор`: "надійний фактор перенареченого" як набір `M221` команди. Це плаваючою точкою значення, наприклад, 1,0 означає, що не перенаречена і, наприклад, 2.0 буде подвійний запитаний екструзії.

source: `absolute_coordinates`: This returns True if in `G90` absolute coordinate mode or False if in `G91` relative mode.
ru: `абсолютные_координаты`: Возвращает True, если в режиме абсолютных координат `G90`, или False, если в режиме относительных координат `G91`.
ta: `முழுமையான_கோர்டேட்ச்`:` G90` முழுமையான ஒருங்கிணைப்பு பயன்முறையில் இருந்தால் அல்லது `G91` உறவினர் பயன்முறையில் இருந்தால் இது உண்மையாக இருந்தால் இது உண்மை.
uk: `absolute_координати`: Це повертає Правда, якщо в `G90` абсолютний координатний режим або False, якщо в `G91` відносний режим.

source: `absolute_extrude`: This returns True if in `M82` absolute extrude mode or False if in `M83` relative mode.
ru: `absolute_extrude`: Возвращает True, если используется режим абсолютного выдавливания `M82`, или False, если используется режим относительного выдавливания `M83`.
ta: `முழுமையான எக்ச்ட்ரூட்`:` M82` முழுமையான எக்ச்ட்ரூட் பயன்முறையில் இருந்தால் அல்லது `M83` உறவினர் பயன்முறையில் இருந்தால் இது உண்மையாக இருந்தால் இது உண்மை.
uk: `absolute_extrude`: Це повертає Правда, якщо в `M82` абсолютний вихідний режим або False, якщо в `M83` відносний режим.

source: hall_filament_width_sensor
ta: ஆல்_பிலமென்ட்_விட்_சென்சர்
uk: href="http://realtor.if.ua/" title="агентство нерухомості ріелтор"

source: The following information is available in the [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) object:
ru: Следующая информация доступна в объекте [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor):
ta: பின்வரும் தகவல்கள் [hall_filament_width_sensor] (config_reference.md#hall_filament_width_sensor) பொருள்:
uk: Наступна інформація доступна в об'єкті [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor):

source: `is_active`: Returns True if the sensor is currently active.
ru: `is_active`: Возвращает True, если датчик в данный момент активен.
ta: `is_active`: சென்சார் தற்போது செயலில் இருந்தால் உண்மை.
uk: `is_active`: Повернення Правда, якщо датчик в даний час активний.

source: heater
ru: нагреватель
ta: ஈட்டர்
uk: нагрівач

source: The following information is available for heater objects such as [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed), and [heater_generic](Config_Reference.md#heater_generic):
ru: Следующая информация доступна для таких объектов нагревателей, как [ экструдер](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed) и [heater_generic](Config_Reference.md#heater_generic):
ta: [எக்ச்ட்ரூடர்] (config_reference.md#எக்ச்ட்ரூடர்), [ஈட்டர்_பெட்] (config_reference.md#heter_bed), மற்றும் [heter_generic] (config_reference.md#heter_generic) போன்ற ஈட்டர் பொருள்களுக்கு பின்வரும் தகவல்கள் கிடைக்கின்றன:
uk: Додаткова інформація доступна для теплових об'єктів, таких як [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed), а [heater_generic](Config_Reference.md#heater_generic):

source: `temperature`: The last reported temperature (in Celsius as a float) for the given heater.
ru: `температура`: Последнее сообщение о температуре (в градусах Цельсия в виде float) для данного нагревателя.
ta: `வெப்பநிலை`: கொடுக்கப்பட்ட ஈட்டருக்கு கடைசியாக அறிவிக்கப்பட்ட வெப்பநிலை (செல்சியசில் ஒரு மிதவை).
uk: `температура`: Останнє повідомлення про температуру (в Келсіус як плавлення) для даної нагрівачі.

source: `target`: The current target temperature (in Celsius as a float) for the given heater.
ru: `цель`: Текущая целевая температура (в градусах Цельсия в виде плавающей величины) для данного нагревателя.
ta: `இலக்கு`: கொடுக்கப்பட்ட ஈட்டருக்கான தற்போதைய இலக்கு வெப்பநிலை (செல்சியசில் ஒரு மிதவை).
uk: `target`: Поточна цільова температура (в Келсіу як плавача) для даної опалювальної машини.
