Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: ru, ta, uk

source: `homed_axes`: The current cartesian axes considered to be in a "homed" state. This is a string containing one or more of "x", "y", "z".
ru: `homed_axes`: Текущие декартовы оси, которые считаются находящимися в состоянии ""дома"". Это строка, содержащая одно или несколько значений "x", "y", "z".
ta: `ஓமட்_அக்ச்`: தற்போதைய கார்ட்டீசியன் அச்சுகள்" வீட்டு "நிலையில் இருப்பதாகக் கருதப்படுகின்றன. இது ஒன்று அல்லது அதற்கு மேற்பட்ட "எக்ச்", "ஒய்", "சட்" கொண்ட ஒரு சரம்.
uk: `homed_axes`: Поточні кошики Це рядок, що містить один або більше "x", "y", "z".

source: `axis_minimum`, `axis_maximum`: The axis travel limits (mm) after homing. It is possible to access the x, y, z components of this limit value (eg, `axis_minimum.x`, `axis_maximum.z`).
ru: `axis_minimum`, `axis_maximum`: Предельные значения перемещения оси (мм) после наведения. Можно получить доступ к компонентам x, y, z этого предельного значения (например, `axis_minimum.x`, `axis_maximum.z`).
ta: `AXIS_MINIMUM`,` AXIS_MAXIMUM`: ஓமிங் செய்த பிறகு அச்சு பயண வரம்புகள் (மிமீ). இந்த வரம்பு மதிப்பின் ஃச், ஒய், சட் கூறுகளை அணுக முடியும் (எ.கா.
uk: ` вісь_minimum`, ` вісь_maximum`: Вісь обмеження (мм) після гоління. Доступ до x, y, z компонентів цього граничного значення (наприклад, `axis_minimum.x`, `axis_maximum.z`).

source: `stalls`: The total number of times (since the last restart) that the printer had to be paused because the toolhead moved faster than moves could be read from the G-Code input.
ru: `stalls`: Общее количество раз (с момента последнего перезапуска), когда принтер был приостановлен из-за того, что головка инструмента двигалась быстрее, чем можно было считать перемещения из G-кода.
ta: `ச்டால்கள்`: அச்சுப்பொறியை இடைநிறுத்த வேண்டிய மொத்த நேரங்கள் (கடைசி மறுதொடக்கம் முதல்), ஏனெனில் சி-கோட் உள்ளீட்டிலிருந்து நகர்வுகளை விட வேகமாக நகர்ந்த கருவிஎட்டு நகர்ந்தது.
uk: `stalls`: Загальна кількість разів (з останнього перезаряджання), що принтер повинен бути виловлений, тому що накладний інструмент переміщається швидше, ніж переміщення можна читати з входу G-Code.

source: The following information is available in the [virtual_sdcard](Config_Reference.md#virtual_sdcard) object:
ru: Следующая информация доступна в объекте [virtual_sdcard](Config_Reference.md#virtual_sdcard):
ta: பின்வரும் தகவல்கள் [மெய்நிகர்_ச்ட்கார்டு] (config_reference.md#virtual_sdcard) பொருளில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [virtual_sdcard](Config_Reference.md#virtual_sdcard) об'єкт:

source: `is_active`: Returns True if a print from file is currently active.
ru: `is_active`: Возвращает True, если печать из файла активна в данный момент.
ta: `is_active`: கோப்பிலிருந்து ஒரு அச்சு தற்போது செயலில் இருந்தால் உண்மை.
uk: `is_active`: Повернення Правда, якщо друк з файлу в даний час активний.

source: `progress`: An estimate of the current print progress (based of file size and file position).
ru: `progress`: Оценка текущего прогресса печати (на основе размера и позиции файла).
ta: `முன்னேற்றம்`: தற்போதைய அச்சு முன்னேற்றத்தின் மதிப்பீடு (கோப்பு அளவு மற்றும் கோப்பு நிலையின் அடிப்படையில்).
uk: `прогрес`: Оцінка поточного прогресу друку (на основі розміру файлу та позиції файлів).

source: `file_position`: The current position (in bytes) of an active print.
ru: `file_position`: Текущая позиция (в байтах) активного отпечатка.
ta: `file_position`: செயலில் உள்ள அச்சின் தற்போதைய நிலை (பைட்டுகளில்).
uk: `file_position`: Поточна позиція (в байтах) активного друку.

source: webhooks
ru: вебхуки
ta: வெப்ஊக்ச்
uk: вебхуки

source: The following information is available in the `webhooks` object (this object is always available):
ru: Следующая информация доступна в объекте `webhooks` (этот объект всегда доступен):
ta: பின்வரும் தகவல்கள் `வெப்ஊக்ச்` பொருளில் கிடைக்கின்றன (இந்த பொருள் எப்போதும் கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `webhooks` ( цей об'єкт завжди доступний):

source: `state`: Returns a string indicating the current Klipper state. Possible values are: "ready", "startup", "shutdown", "error".
ru: `state`: Возвращает строку, указывающую на текущее состояние клиппера. Возможные значения: "готов", "запуск", "выключение", "ошибка".
ta: `மாநிலம்`: தற்போதைய கிளிப்பர் நிலையைக் குறிக்கும் ஒரு சரத்தை வழங்குகிறது. சாத்தியமான மதிப்புகள்: "தயாராக", "தொடக்க", "பணிநிறுத்தம்", "பிழை".
uk: `state`: Повертає рядок, що вказує на поточний стан затискачів. Можливі значення: "живо", "startup", "shutdown", "error".

source: `state_message`: A human readable string giving additional context on the current Klipper state.
ru: `state_message`: Человекочитаемая строка, дающая дополнительный контекст о текущем состоянии Klipper.
ta: `state_message`: தற்போதைய கிளிப்பர் நிலையில் கூடுதல் சூழலைக் கொடுக்கும் மனித படிக்கக்கூடிய சரம்.
uk: `state_message`: Людина, що читається, дає додатковий контекст на поточний стан Кліппера.

source: The following information is available in the `z_tilt` object (this object is available if z_tilt is defined):
ru: Следующая информация доступна в объекте `z_tilt` (этот объект доступен, если определено z_tilt):
ta: பின்வரும் தகவல்கள் `z_tilt` பொருளில் கிடைக்கின்றன (z_tilt வரையறுக்கப்பட்டால் இந்த பொருள் கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `z_tilt` ( цей об'єкт доступний, якщо z_tilt визначено):

source: `applied`: True if the z-tilt leveling process has been run and completed successfully.
ru: `applied`: True, если процесс выравнивания наклона был запущен и успешно завершен.
ta: `பயன்பாடு`: Z-tilt சமநிலை செயல்முறை இயக்கப்பட்டு வெற்றிகரமாக முடிக்கப்பட்டிருந்தால் உண்மை.
uk: `applied`: Правда, якщо процес вирівнювання захвату успішно завершено.

source: dual_carriage
uk: подвійний_кар'єр

source: `file_path`: A full path to the file of currently loaded file.
ru: `file_path`: Полный путь к файлу текущего загруженного файла.
ta: `file_path`: தற்போது ஏற்றப்பட்ட கோப்பின் கோப்புக்கு முழு பாதை.
uk: `file_path`: Повний шлях до файлу в даний час завантажений файл.

source: `file_size`: The file size (in bytes) of currently loaded file.
ru: `file_size`: Размер файла (в байтах) текущего загруженного файла.
ta: `file_size`: தற்போது ஏற்றப்பட்ட கோப்பின் கோப்பு அளவு (பைட்டுகளில்).
uk: `file_size`: Розмір файлу (в байтах) в даний час завантажений файл.

source: Status reference
ru: Ссылка на статус
ta: நிலை குறிப்பு
uk: Статус на сервери

source: motion_report
ta: இயக்கம்_ அறிக்கை
uk: транспорт

source: The following information is available in the `motion_report` object (this object is automatically available if any stepper config section is defined):
ru: Следующая информация доступна в объекте `motion_report` (этот объект автоматически доступен, если определена любая секция конфигурации степпера):
ta: பின்வரும் தகவல்கள் `Mation_Report` பொருளில் கிடைக்கின்றன (ஏதேனும் ச்டெப்பர் கட்டமைப்பு பிரிவு வரையறுக்கப்பட்டால் இந்த பொருள் தானாகவே கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `motion_report` (цей об'єкт автоматично доступний, якщо визначено розділ налаштування кроку):

source: `live_position`: The requested toolhead position interpolated to the current time.
ru: `live_position`: Запрашиваемая позиция головки инструмента, интерполированная к текущему времени.
ta: `லைவ்_போசிசன்`: கோரப்பட்ட கருவி நிலை நிலை தற்போதைய நேரத்திற்கு இடைக்கணித்தது.
uk: `live_position`: Запропонована посада інструменту, що переноситься на поточний час.

source: `live_velocity`: The requested toolhead velocity (in mm/s) at the current time.
ru: `live_velocity`: Запрашиваемая скорость головки инструмента (в мм/с) в текущий момент времени.
ta: `லைவ்_வெலோசிட்டி`: தற்போதைய நேரத்தில் கோரப்பட்ட கருவி தலை விரைவு (மிமீ/வி இல்).
uk: `live_velocity`: Вимагажена швидкість інструменту (в мм/с) в поточний час.

source: `live_extruder_velocity`: The requested extruder velocity (in mm/s) at the current time.
ru: `live_extruder_velocity`: Запрашиваемая скорость экструдера (в мм/с) в текущий момент времени.
ta: `லைவ்_எக்ச்ட்ரூடர்_வெலோசிட்டி`: தற்போதைய நேரத்தில் கோரப்பட்ட எக்ச்ட்ரூடர் விரைவு (மிமீ/வி இல்).
uk: `live_extruder_velocity`: Випробувано швидкість екструдера (в мм/с) в поточний час.

source: `save_config_pending`: Returns true if there are updates that a `SAVE_CONFIG` command may persist to disk.
ru: `save_config_pending`: Возвращает true, если есть обновления, которые команда `SAVE_CONFIG` может сохранить на диске.
ta: `save_config_pending`:` save_config` கட்டளை வட்டுக்கு தொடரும் புதுப்பிப்புகள் இருந்தால் உண்மை என்பதைத் தருகிறது.
uk: `save_config_pending`: Повертає true, якщо є оновлення, що `SAVE_CONFIG` команда може зберігатися на диску.

source: `warnings`: A list of warnings about config options. Each entry in the list will be a dictionary containing a `type` and `message` field (both strings). Additional fields may be available depending on the type of warning.
ru: `предупреждения`: Список предупреждений о параметрах конфигурации. Каждая запись в списке будет представлять собой словарь, содержащий поле `type` и `message` (оба - строки). В зависимости от типа предупреждения могут быть доступны дополнительные поля.
ta: `எச்சரிக்கைகள்`: கட்டமைப்பு விருப்பங்களைப் பற்றிய எச்சரிக்கைகளின் பட்டியல். பட்டியலில் உள்ள ஒவ்வொரு நுழைவும் `வகை` மற்றும்` செய்தி` புலம் (இரண்டு சரங்களும்) கொண்ட அகராதியாக இருக்கும். எச்சரிக்கை வகையைப் பொறுத்து கூடுதல் புலங்கள் கிடைக்கக்கூடும்.
uk: `warnings`: Перелік попереджень про параметри налаштування. Кожен запис у списку буде словником, що містить `тип` та `message` поле (однорядні рядки). Додаткові поля можуть бути доступні в залежності від типу попередження.

source: tmc drivers
ru: драйверы tmc
ta: டி.எம்.சி இயக்கிகள்
uk: драйвери tmc

source: The following information is available in [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) objects (eg, `[tmc2208 stepper_x]`):
ru: Следующая информация доступна в объектах [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) (например, `[tmc2208 stepper_x]`):
ta: பின்வரும் தகவல்கள் [TMC ச்டெப்பர் டிரைவர்] (config_reference.md#tmc- ச்டெப்பர்-டிரைவர்-உள்ளமைவு) பொருள்கள் (எ.கா.
uk: Наступна інформація доступна в [TMC stepper драйвер](Config_Reference.md#tmc-stepper-driver-configuration) об'єкта (наприклад, `[tmc2208 stepper_x]`):

source: `mcu_phase_offset`: The micro-controller stepper position corresponding with the driver's "zero" phase. This field may be null if the phase offset is not known.
ru: `mcu_phase_offset`: Позиция шага микроконтроллера, соответствующая "нулевой" фазе драйвера. Это поле может быть нулевым, если смещение фазы неизвестно.
ta: `MCU_PHASE_OFFSET`: டிரைவரின்" சுழிய "கட்டத்துடன் தொடர்புடைய மைக்ரோ-கன்ட்ரோலர் ச்டெப்பர் நிலை. கட்ட ஆஃப்செட் தெரியாவிட்டால் இந்த புலம் பூச்யமாக இருக்கலாம்.
uk: `mcu_phase_offset`: положення мікроконтролера, що відповідає фазі драйвера. Це поле може бути null, якщо фаза не відома.

source: `phase_offset_position`: The "commanded position" corresponding to the driver's "zero" phase. This field may be null if the phase offset is not known.
ru: `phase_offset_position`: "Заданное положение", соответствующее "нулевой" фазе водителя. Это поле может быть нулевым, если смещение фазы неизвестно.
ta: `fack_offset_position`: ஓட்டுநரின்" பூச்சியம் "கட்டத்துடன் தொடர்புடைய" கட்டளையிடப்பட்ட நிலை ". கட்ட ஆஃப்செட் தெரியாவிட்டால் இந்த புலம் பூச்யமாக இருக்கலாம்.
uk: `фаза_поставка`: "командована позиція" відповідає фазі водія "зеро". Це поле може бути null, якщо фаза не відома.

source: `drv_status`: The results of the last driver status query. (Only non-zero fields are reported.) This field will be null if the driver is not enabled (and thus is not periodically queried).
ru: `drv_status`: Результаты последнего запроса состояния драйвера. (Сообщаются только ненулевые поля.) Это поле будет равно нулю, если драйвер не включен (и, следовательно, периодически не запрашивается).
ta: `drv_status`: கடைசி இயக்கி நிலை வினவலின் முடிவுகள். .
uk: `drv_status`: Результати запиту останнього стану водія. (Повідомо про ненульські поля.) Якщо водій не ввімкнено (і таким чином не періодично передається).

source: `run_current`: The currently set run current.
ru: `run_current`: Текущее значение тока выполнения.
ta: `ரன்_கரண்ட்`: தற்போது அமைக்கப்பட்ட ரன் மின்னோட்டம்.
uk: `run_current`: В даний час встановлюється струм.

source: `hold_current`: The currently set hold current.
ru: `hold_current`: Установленный в данный момент ток удержания.
ta: `Hold_Current`: தற்போது அமைக்கப்பட்ட ஓல்ட் மின்னோட்டம்.
uk: `hold_current`: В даний час встановлюється струм утримання.

source: `Diameter`: The last reading from the sensor in mm.
ru: `Диаметр`: Последнее показание датчика в мм.
ta: `விட்டம்`: மிமீ சென்சாரிலிருந்து கடைசி வாசிப்பு.
uk: `Diameter`: Останнє читання від датчика в мм.

source: `Raw`: The last raw ADC reading from the sensor.
ru: `Сырой`: Последнее необработанное показание АЦП с датчика.
ta: `ரா`: சென்சாரிலிருந்து கடைசி மூல ஏடிசி வாசிப்பு.
uk: `Raw`: Остання сира ADC читання від датчика.

source: `profiles`: The set of currently defined profiles as setup using BED_MESH_PROFILE.
ru: `профайлы`: Набор определенных в данный момент профилей, установленных с помощью BED_MESH_PROFILE.
ta: `சுயவிவரங்கள்`: BED_MESH_PROFILE ஐப் பயன்படுத்தி தற்போது வரையறுக்கப்பட்ட சுயவிவரங்களின் தொகுப்பு.
uk: `profiles`: Набір в даний час визначених профілів як налаштування за допомогою BED_ MESH_PROFILE.

source: angle
ru: угол
ta: கோணம்
uk: кут

source: The following information is available in [angle some_name](Config_Reference.md#angle) objects:
ru: Следующая информация доступна в объектах [angle some_name](Config_Reference.md#angle):
ta: பின்வரும் தகவல்கள் [goll some_name] (config_reference.md#கோணம்) பொருள்களில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [angle some_name](Config_Reference.md#angle) об'єкти:

source: `temperature`: The last temperature reading (in Celsius) from a tle5012b magnetic hall sensor. This value is only available if the angle sensor is a tle5012b chip and if measurements are in progress (otherwise it reports `None`).
ru: `температура`: Последнее показание температуры (в градусах Цельсия) с магнитного датчика Холла tle5012b. Это значение доступно только в том случае, если датчик угла является микросхемой tle5012b и если ведутся измерения (в противном случае он сообщает `Нет`).
ta: `வெப்பநிலை`: TLE5012B காந்த மண்டப சென்சாரிலிருந்து கடைசி வெப்பநிலை வாசிப்பு (செல்சியசில்). கோண சென்சார் ஒரு TLE5012B சிப்பாக இருந்தால் மட்டுமே இந்த மதிப்பு கிடைக்கும் மற்றும் அளவீடுகள் செயலில் இருந்தால் (இல்லையெனில் அது `எதுவுமில்லை 'என்று புகாரளிக்கிறது).
uk: `температура`: Останнє читання температури (в Кельсі) від датчика магнітного залу tle5012b. Ця величина доступна тільки в тому випадку, якщо датчик кута є чіпом tle5012b і якщо вимірювання знаходяться в прогресі (інші звіти `None`).

source: led
ru: светодиод
ta: எல்.ஈ.டி
uk: під керівництвом

source: The following information is available for each `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]`, and `[pca9632 led_name]` config section defined in printer.cfg:
ru: Следующая информация доступна для каждого раздела конфигурации `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]` и `[pca9632 led_name]`, определенного в файле printer.cfg:
ta: ஒவ்வொரு `[எல்.ஈ.டி எல்.ஈ.டி_நேம்]`, `[நியோபிக்சல் லெட்_நேம்]`, `[டாட்ச்டார் லெட்_நேம்]`, `[பி.சி.ஏ 9533 லெட்_நேம்]`, மற்றும் `[பி.சி.ஏ 9632 லெட்_நேம்]` அச்சுப்பொறி.
uk: Наступна інформація доступна для кожного `[led led_name]`, `[neoпіксель Led_name]`, `[dotstar led_name]`, `[pca9533 led_name]`, і `[pca9632 led_name]` config розділ, визначений у принтері.cfg:

source: `color_data`: A list of color lists containing the RGBW values for a led in the chain. Each value is represented as a float from 0.0 to 1.0. Each color list contains 4 items (red, green, blue, white) even if the underyling LED supports fewer color channels. For example, the blue value (3rd item in color list) of the second neopixel in a chain could be accessed at `printer["neopixel <config_name>"].color_data[1][2]`.
ru: `color_data`: Список списков цветов, содержащих значения RGBW для светодиода в цепочке. Каждое значение представлено в виде float от 0.0 до 1.0. Каждый список цветов содержит 4 элемента (красный, зеленый, синий, белый), даже если подстроечный светодиод поддерживает меньшее количество цветовых каналов. Например, значение синего цвета (3-й элемент в списке цветов) второго неопикселя в цепочке может быть доступно по адресу `printer["neopixel <config_name>"].color_data[1][2]`.
ta: `color_data`: சங்கிலியில் ஒரு எல்.ஈ.டி க்கான RGBW மதிப்புகளைக் கொண்ட வண்ண பட்டியல்களின் பட்டியல். ஒவ்வொரு மதிப்பும் 0.0 முதல் 1.0 வரை மிதவை என குறிப்பிடப்படுகிறது. ஒவ்வொரு வண்ண பட்டியலிலும் 4 உருப்படிகள் (சிவப்பு, பச்சை, நீலம், வெள்ளை) உள்ளன, அவை அண்டரிலிங் எல்.ஈ.டி குறைவான வண்ண சேனல்களை ஆதரித்தாலும். எடுத்துக்காட்டாக, ஒரு சங்கிலியில் இரண்டாவது நியோபிக்சலின் நீல மதிப்பு (வண்ண பட்டியலில் 3 வது உருப்படி) `அச்சுப்பொறி [" நியோபிக்சல் <config_name> "] இல் அணுகப்படலாம். Color_data [1] [2]`.
uk: `color_data`: список списків кольорів, що містять значення RGBW для світлодіода в ланцюжку. Кожне значення представлено у вигляді числа з плаваючою точкою від 0,0 до 1,0. Кожен список кольорів містить 4 елементи (червоний, зелений, синій, білий), навіть якщо базовий світлодіод підтримує менше кольорових каналів. Наприклад, синє значення (3-й елемент у списку кольорів) другого неопікселя в ланцюжку можна отримати за адресою `printer["neopixel <config_name>"].color_data[1][2]`.

source: `save_config_pending_items`: Contains the sections and options that were changed and would be persisted by a `SAVE_CONFIG`.
ru: `save_config_pending_items`: Содержит секции и опции, которые были изменены и будут сохранены при `SAVE_CONFIG`.
ta: `save_config_pending_items`: மாற்றப்பட்ட பிரிவுகள் மற்றும் விருப்பங்கள் உள்ளன, மேலும் அவை` save_config` ஆல் தொடரப்படும்.
uk: `save_config_pending_items`: Містить розділи та параметри, які були змінені і будуть перенасичені `SAVE_CONFIG`.

source: exclude_object
ta: விலக்கு_ஆப்செக்ட்
uk: без категорії

source: The following information is available in the [exclude_object](Exclude_Object.md) object:
ru: Следующая информация доступна в объекте [exclude_object](Exclude_Object.md):
ta: பின்வரும் தகவல்கள் [excalude_object] (excolude_object.md) பொருளில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [exclude_object](Exclude_Object.md) об'єкт:

source: `objects`: An array of the known objects as provided by the `EXCLUDE_OBJECT_DEFINE` command. This is the same information provided by the `EXCLUDE_OBJECT VERBOSE=1` command. The `center` and `polygon` fields will only be present if provided in the original `EXCLUDE_OBJECT_DEFINE`
ru: `объекты`: Массив известных объектов, предоставленных командой `EXCLUDE_OBJECT_DEFINE`. Это та же информация, которую предоставляет команда `EXCLUDE_OBJECT VERBOSE=1`. Поля `центр` и `полигон` будут присутствовать только в том случае, если они были указаны в исходной команде `EXCLUDE_OBJECT_DEFINE`
ta: `பொருள்கள்`:` விலக்கு_ஆப்செக்ட்_ டெஃபைன்` கட்டளையால் வழங்கப்பட்ட அறியப்பட்ட பொருள்களின் வரிசை. `விலக்கு_ஆப்செக்ட் VERBOSE = 1` கட்டளை வழங்கிய அதே செய்தி இது. அசல் `விலக்கு_ஆப்செக்ட்_ டிஃபைன்` இல் வழங்கப்பட்டால் மட்டுமே` மையம்` மற்றும் `பலகோணம்` புலங்கள் இருக்கும்
uk: `objects`: масив відомих об'єктів, що надаються `EXCLUDE_OBJECT_DEFINE` команди. Ця ж інформація, надана командою `EXCLUDE_OBJECT VERBOSE=1`. `center` і `polygon` поля будуть присутні тільки при наявності в оригінальному `EXCLUDE_OBJECT_DEFINE`

source: Here is a JSON sample:
ru: Вот пример JSON:
ta: இங்கே ஒரு சாதொபொகு மாதிரி:
uk: Ось зразок JSON:

source: `excluded_objects`: An array of strings listing the names of excluded objects.
ru: `excluded_objects`: Массив строк, в которых перечислены имена исключенных объектов.
ta: `விலக்கப்பட்ட_ஆப்செக்ட்ச்`: விலக்கப்பட்ட பொருட்களின் பெயர்களை பட்டியலிடும் சரங்களின் வரிசை.
uk: `excluded_objects`: Список імен виключених об'єктів масиву рядків.

source: `current_object`: The name of the object currently being printed.
ru: `current_object`: Имя объекта, который печатается в данный момент.
ta: `நடப்பு_ஆப்செக்ட்`: தற்போது அச்சிடப்பட்ட பொருளின் பெயர்.
uk: `current_object`: Ім'я об'єкта в даний час друкується.

source: The following information is available in the `manual_probe` object:
ru: В объекте `manual_probe` доступна следующая информация:
ta: பின்வரும் தகவல்கள் `கையேடு_ப்ரோப்` பொருளில் கிடைக்கின்றன:
uk: В об’єкті `manual_probe` доступна така інформація:

source: `is_active`: Returns True if a manual probing helper script is currently active.
ru: `is_active`: Возвращает True, если в данный момент активен вспомогательный скрипт ручного зондирования.
ta: `is_active`: ஒரு கையேடு ஆய்வு உதவி ச்கிரிப்ட் தற்போது செயலில் இருந்தால் உண்மையை அளிக்கிறது.
uk: `is_active`: Повернення Правда, якщо в даний час працює ручний скрипт пробування.

source: `z_position`: The current height of the nozzle (as the printer currently understands it).
ru: `z_position`: Текущая высота сопла (как ее понимает принтер).
ta: `z_position`: முனை தற்போதைய உயரம் (அச்சுப்பொறி தற்போது அதைப் புரிந்துகொள்வது போல).
uk: `z_position`: Поточна висота сопла (як принтер в даний час розуміє його).

source: `z_position_lower`: Last probe attempt just lower than the current height.
ru: `z_position_lower`: Последняя попытка зондирования ниже текущей высоты.
ta: `z_position_lower`: கடைசி ஆய்வு முயற்சி தற்போதைய உயரத்தை விடக் குறைவாக உள்ளது.
uk: `z_position_lower`: Остання спроба зонду трохи нижче поточного висоти.

source: `z_position_upper`: Last probe attempt just greater than the current height.
ru: `z_position_upper`: Последняя попытка зондирования, превышающая текущую высоту.
ta: `z_position_upper`: தற்போதைய உயரத்தை விட கடைசி ஆய்வு முயற்சி.
uk: `z_position_upper`: Остання спроба проби тільки більше, ніж поточна висота.

source: The following information is available in the `Config_Reference.md#bed_screws` object:
ru: Следующая информация доступна в объекте `Config_Reference.md#bed_screws`:
ta: பின்வரும் தகவல்கள் `config_reference.md#bed_screws` பொருளில் கிடைக்கின்றன:
uk: Наступна інформація доступна в `Config_Reference.md#bed_screws` об'єкт:

source: `is_active`: Returns True if the bed screws adjustment tool is currently active.
ru: `is_active`: Возвращает True, если инструмент регулировки винтов станины активен в данный момент.
ta: `is_active`: படுக்கை திருகுகள் சரிசெய்தல் கருவி தற்போது செயலில் இருந்தால் உண்மை.
uk: `is_active`: Повернення Правда, якщо в даний час працює інструмент регулювання саморізів.

source: `state`: The bed screws adjustment tool state. It is one of the following strings: "adjust", "fine".
ru: `Состояние`: Состояние инструмента для регулировки винтов кровати. Это одна из следующих строк: " регулировать", "тонкий".
ta: `மாநிலம்`: படுக்கை திருகுகள் சரிசெய்தல் கருவி நிலை. இது பின்வரும் சரங்களில் ஒன்றாகும்: "சரிசெய்யவும்", "நன்றாக".
uk: `state`: Регулювання шурупами стан інструменту. Він є одним з наступних рядків: "регулюйте", "fine".

source: `current_screw`: The index for the current screw being adjusted.
ru: `current_screw`: Индекс для текущего винта, который регулируется.
ta: `Current_screw`: தற்போதைய திருகு சரிசெய்யப்படும் குறியீடு.
uk: `current_screw`: Індекс для поточного гвинта регулюється.

source: `accepted_screws`: The number of accepted screws.
ru: `accepted_screws`: Количество принимаемых винтов.
ta: `ஏற்றுக்கொள்ளப்பட்ட_சக்கிகள்`: ஏற்றுக்கொள்ளப்பட்ட திருகுகளின் எண்ணிக்கை.
uk: `accepted_screws`: Кількість прийнятих шурупів.

source: extruder_stepper
ta: எக்ச்ட்ரூடர் ச்டெப்பர்
uk: extruder_starper
