Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: ru, ta, uk

source: `power`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the heater.
ru: `power`: Последняя настройка PWM-штырька (значение между 0.0 и 1.0), связанного с нагревателем.
ta: `பவர்`: ஈட்டருடன் தொடர்புடைய PWM முள் (0.0 மற்றும் 1.0 க்கு இடையிலான மதிப்பு) கடைசி அமைப்பு.
uk: `power`: Останнє налаштування штифта PWM (ціна між 0,0 і 1,0) пов'язана з нагрівачем.

source: `can_extrude`: If extruder can extrude (defined by `min_extrude_temp`), available only for [extruder](Config_Reference.md#extruder)
ru: `can_extrude`: Если экструдер может выдавливать (определяется `min_extrude_temp`), доступно только для [extruder](Config_Reference.md#extruder)
ta: `can_extrude`: எக்ச்ட்ரூடர் எக்ச்ட்ரூட் செய்ய முடிந்தால் (` min_extrude_temp` ஆல் வரையறுக்கப்படுகிறது), [எக்ச்ட்ரூடர்] க்கு மட்டுமே கிடைக்கும் (config_reference.md#extruder)
uk: `can_extrude`: Якщо extruder може extrude (визначений `min_extrude_temp`), доступний тільки для [extruder](Config_Reference.md#extruder)

source: heaters
ru: обогреватели
ta: ஈட்டர்கள்
uk: нагрівачі

source: The following information is available in the `heaters` object (this object is available if any heater is defined):
ru: Следующая информация доступна в объекте `нагреватели` (этот объект доступен, если определен любой нагреватель):
ta: பின்வரும் தகவல்கள் `ஈட்டர்கள்` பொருளில் கிடைக்கின்றன (ஏதேனும் ஈட்டர் வரையறுக்கப்பட்டால் இந்த பொருள் கிடைக்கும்):
uk: В об’єкті `heaters` доступна така інформація (цей об’єкт доступний, якщо визначено будь-який нагрівач):

source: `available_heaters`: Returns a list of all currently available heaters by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
ru: `available_heaters`: Возвращает список всех доступных на данный момент нагревателей по их полным именам секций конфигурации, например, `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
ta: `கிடைக்கும்_ஈட்டர்ச்`: தற்போது கிடைக்கக்கூடிய அனைத்து ஈட்டர்களின் பட்டியலையும் அவற்றின் முழு கட்டமைப்பு பிரிவு பெயர்களால் வழங்குகிறது, எ.கா. `[" எக்ச்ட்ரூடர் "," ஈட்டர்_பெட் "," ஈட்டர்_செனெரிக் மை_கச்டம்_ஈட்டர் "]`.
uk: `0_heaters`: Повертає список всіх наявних на даний момент опалювальних пристроїв за іменами повного налаштування, наприклад, `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.

source: `available_sensors`: Returns a list of all currently available temperature sensors by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
ru: `available_sensors`: Возвращает список всех доступных на данный момент датчиков температуры по их полным именам разделов конфигурации, например, `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
ta: `கிடைக்கக்கூடிய_சென்சர்கள்`: தற்போது கிடைக்கக்கூடிய அனைத்து வெப்பநிலை சென்சார்களின் பட்டியலை அவற்றின் முழு கட்டமைப்பு பிரிவு பெயர்களால் வழங்குகிறது, எ.கா. `[" எக்ச்ட்ரூடர் "," ஈட்டர்_பெட் "," ஈட்டர்_செனெரிக் மை_கச்டம்_ஈட்டர் "," வெப்பநிலை_சென்சர் எலெக்ட்ரானிக்ச்_டெம்ப் "]`.
uk: `0_sensors`: Повертає список всіх наявних датчиків температури за їхніми іменами повного налаштування, наприклад, `["extruder", "heater_bed", "heater_generic my_custom_heater", "температурна електроніка_temp"]`.

source: The following information is available in the [idle_timeout](Config_Reference.md#idle_timeout) object (this object is always available):
ru: Следующая информация доступна в объекте [idle_timeout](Config_Reference.md#idle_timeout) (этот объект всегда доступен):
ta: பின்வரும் தகவல்கள் [idle_timeout] (config_reference.md#idle_timeout) பொருளில் கிடைக்கின்றன (இந்த பொருள் எப்போதும் கிடைக்கும்):
uk: Наступна інформація доступна в [idle_timeout](Config_Reference.md#idle_timeout) об'єкт (це об'єкт завжди доступний):

source: `state`: The current state of the printer as tracked by the idle_timeout module. It is one of the following strings: "Idle", "Printing", "Ready".
ru: `состояние`: Текущее состояние принтера, отслеживаемое модулем idle_timeout. Это одна из следующих строк: " простаивает", "печатает", "готов".
ta: `மாநிலம்`: idle_timeout தொகுதி மூலம் கண்காணிக்கப்பட்ட அச்சுப்பொறியின் தற்போதைய நிலை. இது பின்வரும் சரங்களில் ஒன்றாகும்: "செயலற்ற", "அச்சிடுதல்", "தயாராக".
uk: `state`: Поточний стан принтера як відстежується модулем idle_timeout. Він є одним з наступних рядків: "Попередження", "Читання".

source: `printing_time`: The amount of time (in seconds) the printer has been in the "Printing" state (as tracked by the idle_timeout module).
ru: `printing_time`: Количество времени (в секундах), в течение которого принтер находился в состоянии "Печать" (отслеживается модулем idle_timeout).
ta: `printing_time`: அச்சுப்பொறி" அச்சிடுதல் "நிலையில் உள்ளது (செயலற்ற_TIMEOUT தொகுதி மூலம் கண்காணிக்கப்பட்டபடி) அச்சுப்பொறி.
uk: `printing_time`: Сума часу (в секундах) принтера була в стані "припинення" (як відстежити модуль idle_timeout).

source: mcu
uk: мапи

source: The following information is available in [mcu](Config_Reference.md#mcu) and [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) objects:
ru: Следующая информация доступна в объектах [mcu](Config_Reference.md#mcu) и [mcu some_name](Config_Reference.md#mcu-my_extra_mcu):
ta: பின்வரும் தகவல்கள் [MCU] (config_reference.md#mcu) மற்றும் [MCU some_name] (config_reference.md#mcu-my_extra_mcu) பொருள்களில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [mcu](Config_Reference.md#mcu) і [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) об'єкти:

source: `mcu_version`: The Klipper code version reported by the micro-controller.
ru: `mcu_version`: Версия кода Klipper, сообщенная микроконтроллером.
ta: `MCU_VERSION`: மைக்ரோ-கன்ட்ரோலரால் அறிவிக்கப்பட்ட கிளிப்பர் குறியீடு பதிப்பு.
uk: `mcu_version`: Версія коду Klipper, що повідомляється мікроконтролером.

source: `mcu_build_versions`: Information on the build tools used to generate the micro-controller code (as reported by the micro-controller).
ru: `mcu_build_versions`: Информация о средствах сборки, использованных для генерации кода микроконтроллера (по данным микроконтроллера).
ta: `mcu_build_versions`: மைக்ரோ-கன்ட்ரோலர் குறியீட்டை உருவாக்க பயன்படுத்தப்படும் உருவாக்க கருவிகள் பற்றிய தகவல்கள் (மைக்ரோ-கன்ட்ரோலரால் அறிவிக்கப்பட்டபடி).
uk: `mcu_build_versions`: Відомості про інструменти побудови, які використовуються для створення мікроконтролерного коду (як повідомляється мікроконтролером).

source: `mcu_constants.<constant_name>`: Compile time constants reported by the micro-controller. The available constants may differ between micro-controller architectures and with each code revision.
ru: `mcu_constants.<constant_name>`: Константы времени компиляции, сообщаемые микроконтроллером. Доступные константы могут отличаться в разных архитектурах микроконтроллеров и в каждой ревизии кода.
ta: `MCU_Constants. <nountth_name>`: மைக்ரோ-கன்ட்ரோலரால் அறிவிக்கப்பட்ட நேர மாறிலிகளை தொகுக்கவும். கிடைக்கக்கூடிய மாறிலிகள் மைக்ரோ-கட்டுப்பாட்டு கட்டமைப்புகளுக்கும் ஒவ்வொரு குறியீடு திருத்தத்திற்கும் இடையில் வேறுபடலாம்.
uk: `mcu_constants.<constant_name>`: Спірні часові константи, що повідомляються мікроконтролером. Доступні константи можуть відрізнятися між архітектурами мікроконтролерів і з кожним кодом.

source: `last_stats.<statistics_name>`: Statistics information on the micro-controller connection.
ru: `last_stats.<statistics_name>`: Статистическая информация о подключении микроконтроллера.
ta: `கடைசி புள்ளிவிவரங்கள். <புள்ளிவிவர பெயர்>`: மைக்ரோகண்ட்ரோலர் இணைப்பு குறித்த புள்ளிவிவர செய்தி.
uk: `last_stats.<statistics_name>`: Статистика інформації про підключення мікроконтролера.

source: The following information is available in [output_pin some_name](Config_Reference.md#output_pin) objects:
ru: Следующая информация доступна в объектах [output_pin some_name](Config_Reference.md#output_pin):
ta: பின்வரும் தகவல்கள் [output_pin some_name] (config_reference.md#output_pin) பொருள்களில் கிடைக்கின்றன:
uk: Наступна інформація доступна в об’єктах [output_pin some_name](Config_Reference.md#output_pin):

source: `value`: The "value" of the pin, as set by a `SET_PIN` command.
ru: `value`: "Значение" пина, заданное командой `SET_PIN`.
ta: `மதிப்பு`: முள்" மதிப்பு ",` set_pin` கட்டளையால் அமைக்கப்பட்டுள்ளது.
uk: `value`: "значення" шпильки, як встановити `SET_PIN` команди.

source: palette2
ta: தட்டு 2
uk: палітра2

source: The following information is available in the [palette2](Config_Reference.md#palette2) object:
ru: Следующая информация доступна в объекте [palette2](Config_Reference.md#palette2):
ta: பின்வரும் தகவல்கள் [தட்டு 2] (config_reference.md#தட்டு 2) பொருளில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [palette2](Config_Reference.md#palette2) об'єкт:

source: `ping`: Amount of the last reported Palette 2 ping in percent.
ru: `ping`: Величина последнего зарегистрированного пинга Palette 2 в процентах.
ta: `பிங்`: கடைசியாக அறிவிக்கப்பட்ட தட்டு 2 பிங் விழுக்காடு.
uk: `ping`: Сума останнього повідомлення Палетт 2 ping в відсотках.

source: `remaining_load_length`: When starting a Palette 2 print, this will be the amount of filament to load into the extruder.
ru: `remaining_load_length`: При запуске печати Palette 2 это будет количество нити, которое нужно загрузить в экструдер.
ta: `மீதமுள்ள_ லோட்_எங்`: தட்டு 2 அச்சிடும்போது, இது எக்ச்ட்ரூடரில் ஏற்றப்படுவதற்கான இழைகளின் அளவு.
uk: `remaining_load_length`: При відпускі палета 2 друку, це буде кількість ниток для завантаження в екструдер.

source: `is_splicing`: True when the Palette 2 is splicing filament.
ru: `is_splicing`: Истина, если палитра 2 сращивает нити.
ta: `is_splicing`: தட்டு 2 ஃபிலிமென்ட் பிரிக்கும் போது உண்மை.
uk: `is_splicing`: Правда, коли палета 2 є запобіжним поданням.

source: pause_resume
uk: пауза_пошук

source: The following information is available in the [pause_resume](Config_Reference.md#pause_resume) object:
ru: Следующая информация доступна в объекте [pause_resume](Config_Reference.md#pause_resume):
ta: பின்வரும் தகவல்கள் [pause_resume] (config_reference.md#pause_resume) பொருளில் கிடைக்கின்றன:
uk: Наступна інформація доступна в [pause_resume](Config_Reference.md#pause_resume) об'єкт:

source: `is_paused`: Returns true if a PAUSE command has been executed without a corresponding RESUME.
ru: `is_paused`: Возвращает true, если была выполнена команда PAUSE без соответствующего RESUME.
ta: `is_paused`: இடைநிறுத்த கட்டளை அதனுடன் தொடர்புடைய விண்ணப்பம் இல்லாமல் செயல்படுத்தப்பட்டால் உண்மை.
uk: `is_paused`: Повертає true, якщо команда PAUSE була виконана без відповідного RESUME.

source: print_stats
uk: друк_статисти

source: The following information is available in the `print_stats` object (this object is automatically available if a [virtual_sdcard](Config_Reference.md#virtual_sdcard) config section is defined):
ru: Следующая информация доступна в объекте `print_stats` (этот объект автоматически доступен, если определен раздел конфигурации [virtual_sdcard](Config_Reference.md#virtual_sdcard)):
ta: பின்வரும் தகவல்கள் `print_stats` பொருளில் கிடைக்கின்றன (ஒரு [மெய்நிகர்_ச்ட்கார்டு] (config_reference.md#virtual_sdcard) கட்டமைப்பு பிரிவு வரையறுக்கப்பட்டால் இந்த பொருள் தானாகவே கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `print_stats` (цей об'єкт автоматично доступний, якщо [virtual_sdcard](Config_Reference.md#virtual_sdcard)):

source: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Estimated information about the current print when a virtual_sdcard print is active.
ru: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Оценочная информация о текущем отпечатке, если активен отпечаток virtual_sdcard.
ta: `FileName`,` Total_duration`, `print_duration`,` filament_used`, `state`,` செய்தி`: மெய்நிகர்_ச்ட்கார்ட் அச்சு செயலில் இருக்கும்போது தற்போதைய அச்சு பற்றிய மதிப்பிடப்பட்ட தகவல்கள்.
uk: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Оцінена інформація про поточний принт, коли активний віртуальний_sdcard друку.

source: probe
ta: தேட்டி
uk: пробе

source: The following information is available in the [probe](Config_Reference.md#probe) object (this object is also available if a [bltouch](Config_Reference.md#bltouch) config section is defined):
ru: Следующая информация доступна в объекте [probe](Config_Reference.md#probe) (этот объект также доступен, если определен раздел конфигурации [bltouch](Config_Reference.md#bltouch)):
ta: பின்வரும் தகவல்கள் [ஆய்வு] (config_reference.md#ஆய்வு) பொருளில் கிடைக்கின்றன (ஒரு [bltouch] (config_reference.md#bltouch) கட்டமைப்பு பிரிவு வரையறுக்கப்பட்டால் இந்த பொருள் கிடைக்கும்):
uk: Наступна інформація доступна в [probe](Config_Reference.md#probe) об'єкт ( цей об'єкт також доступний, якщо параметр [bltouch](Config_Reference.md#bltouch) config розділу:

source: `last_query`: Returns True if the probe was reported as "triggered" during the last QUERY_PROBE command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_PROBE command must be run prior to the macro containing this reference.
ru: `last_query`: Возвращает True, если во время последней команды QUERY_PROBE зонд был признан "сработавшим". Обратите внимание, если это используется в макросе, то из-за порядка расширения шаблона команда QUERY_PROBE должна быть запущена до макроса, содержащего эту ссылку.
ta: `last_query`: கடைசி வினவல்_ புரோப் கட்டளையின் போது ஆய்வு" தூண்டப்பட்டதாக "அறிவிக்கப்பட்டால் உண்மை. குறிப்பு, இது ஒரு மேக்ரோவில் பயன்படுத்தப்பட்டால், வார்ப்புரு விரிவாக்கத்தின் வரிசை காரணமாக, இந்த குறிப்பைக் கொண்ட மேக்ரோவுக்கு முன் வினவல்_பிரக கட்டளை இயக்கப்பட வேண்டும்.
uk: `last_query`: Повернення Правда, якщо зонд був повідомлений як "підготовлений" під час останнього команди QUERY_PROBE. Примітка, якщо це використовується в макросі, через порядок розширення шаблону, команда QUERY_PROBE повинна працювати до макрос, що містить цю посилання.

source: `last_z_result`: Returns the Z result value of the last PROBE command. Note, if this is used in a macro, due to the order of template expansion, the PROBE (or similar) command must be run prior to the macro containing this reference.
ru: `last_z_result`: Возвращает значение Z-результата последней команды PROBE. Обратите внимание, если это используется в макросе, то из-за порядка расширения шаблона команда PROBE (или аналогичная) должна быть запущена до макроса, содержащего эту ссылку.
ta: `last_z_result`: கடைசி ஆய்வு கட்டளையின் சட் முடிவு மதிப்பை வழங்குகிறது. குறிப்பு, இது ஒரு மேக்ரோவில் பயன்படுத்தப்பட்டால், வார்ப்புரு விரிவாக்கத்தின் வரிசை காரணமாக, இந்த குறிப்பைக் கொண்ட மேக்ரோவுக்கு முன் ஆய்வு (அல்லது ஒத்த) கட்டளை இயக்கப்பட வேண்டும்.
uk: `last_z_result`: повертає значення результату Z останнього команди PROBE. Примітка, якщо це використовується в макросі, через порядок розширення шаблону, Команда PROBE (або аналогічний) повинна працювати до макрос, що містить цей посилання.

source: The following information is available in the `quad_gantry_level` object (this object is available if quad_gantry_level is defined):
ru: Следующая информация доступна в объекте `quad_gantry_level` (этот объект доступен, если определен quad_gantry_level):
ta: பின்வரும் தகவல்கள் `Quat_gantry_level` பொருளில் கிடைக்கின்றன (குவாட்_கான்ட்ரி_லெவல் வரையறுக்கப்பட்டால் இந்த பொருள் கிடைக்கும்):
uk: У розділі `quad_gantry_level` об'єкт (цей об'єкт доступний, якщо визначено квадротип_gantry_level):

source: `applied`: True if the gantry leveling process has been run and completed successfully.
ru: `применено`: True, если процесс выравнивания порталов был запущен и успешно завершен.
ta: `பயன்பாடு`: கேன்ட்ரி லெவலிங் செயல்முறை இயக்கப்பட்டு வெற்றிகரமாக முடிக்கப்பட்டிருந்தால் உண்மை.
uk: `applied`: Правда, якщо процес вирівнювання ганчі успішно завершений.

source: The following information is available in the `query_endstops` object (this object is available if any endstop is defined):
ru: Следующая информация доступна в объекте `query_endstops` (этот объект доступен, если определена какая-либо конечная остановка):
ta: பின்வரும் தகவல்கள் `Query_endstops` பொருளில் கிடைக்கின்றன (ஏதேனும் எண்ட்ச்டாப் வரையறுக்கப்பட்டால் இந்த பொருள் கிடைக்கும்):
uk: Наступна інформація доступна в `query_endstops` об'єкт ( цей об'єкт доступний, якщо будь-який кінцевий стіл визначений):

source: `last_query["<endstop>"]`: Returns True if the given endstop was reported as "triggered" during the last QUERY_ENDSTOP command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_ENDSTOP command must be run prior to the macro containing this reference.
ru: `last_query["<endstop>"]`: Возвращает True, если указанный endstop был зарегистрирован как "сработавший" во время последней команды QUERY_ENDSTOP. Обратите внимание, если это используется в макросе, то из-за порядка расширения шаблона команда QUERY_ENDSTOP должна быть запущена до макроса, содержащего эту ссылку.
ta: `லாச்ட்_க்யூரி [" <endstop> "]`: கடைசி வினவல்_எண்ட்ச்டாப் கட்டளையின் போது கொடுக்கப்பட்ட எண்ட்ச்டாப் "தூண்டப்பட்டதாக" புகாரளிக்கப்பட்டால் உண்மை. குறிப்பு, இது ஒரு மேக்ரோவில் பயன்படுத்தப்பட்டால், வார்ப்புரு விரிவாக்கத்தின் வரிசை காரணமாக, இந்த குறிப்பைக் கொண்ட மேக்ரோவுக்கு முன் வினவல்_எண்ட்ச்டாப் கட்டளை இயக்கப்பட வேண்டும்.
uk: `last_query["<endstop>"]`: Повернення Правда, якщо надана ендстоп була повідомлена як "підготовлений" під час останнього команди QUERY_ENDSTOP. Примітка, якщо це використовується в макросі, через порядок розширення шаблону, команда QUERY_ENDSTOP повинна працювати до макрос, що містить цей посилання.

source: servo
ru: сервопривод
ta: சர்வோ
uk: серво

source: The following information is available in [servo some_name](Config_Reference.md#servo) objects:
ru: Следующая информация доступна в объектах [servo some_name](Config_Reference.md#servo):
ta: பின்வரும் தகவல்கள் [servo some_name] (config_reference.md#servo) பொருள்களில் கிடைக்கின்றன:
uk: Додаткова інформація доступна в [servo some_name](Config_Reference.md#servo) об'єктах:

source: `printer["servo <config_name>"].value`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the servo.
ru: `printer["servo <config_name>"].value`: Последняя настройка вывода ШИМ (значение между 0.0 и 1.0), связанного с сервоприводом.
ta: `அச்சுப்பொறி [" சர்வோ <config_name> "]. மதிப்பு`: சர்வோவுடன் தொடர்புடைய PWM முள் (0.0 மற்றும் 1.0 க்கு இடையிலான மதிப்பு) கடைசி அமைப்பு.
uk: `printer["servo <config_name>"].value`: Останнє налаштування штифта PWM ( значення між 0.0 і 1,0) пов'язане з серво.

source: system_stats
uk: система_статисти

source: The following information is available in the `system_stats` object (this object is always available):
ru: Следующая информация доступна в объекте `system_stats` (этот объект доступен всегда):
ta: பின்வரும் தகவல்கள் `system_stats` பொருளில் கிடைக்கின்றன (இந்த பொருள் எப்போதும் கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `system_stats` ( цей об'єкт завжди доступний):

source: `sysload`, `cputime`, `memavail`: Information on the host operating system and process load.
ru: `sysload`, `cputime`, `memavail`: Информация об операционной системе хоста и загрузке процессов.
ta: `sysload`,` cputime`, `Memavail`: புரவலன் இயக்க முறைமை மற்றும் செயல்முறை சுமை பற்றிய செய்தி.
uk: `sysload`, `cputime`, `memavail`: Відомості про операційну систему та навантаження процесу.

source: temperature sensors
ru: температурные датчики
ta: வெப்பநிலை சென்சார்கள்
uk: датчики температури

source: The following information is available in
ru: Следующая информация доступна в
ta: பின்வரும் தகவல்கள் கிடைக்கின்றன
uk: Інформація доступна в

source: `temperature`: The last read temperature from the sensor.
ru: `температура`: Последнее значение температуры, считанное с датчика.
ta: `வெப்பநிலை`: சென்சாரிலிருந்து கடைசி வாசிப்பு வெப்பநிலை.
uk: `температура`: Остання температура читання від датчика.

source: temperature_fan
ta: வெப்பநிலை_பான்
uk: температура_фан

source: The following information is available in [temperature_fan some_name](Config_Reference.md#temperature_fan) objects:
ru: Следующая информация доступна в объектах [temperature_fan some_name](Config_Reference.md#temperature_fan):
ta: பின்வரும் தகவல்கள் [வெப்பநிலை_பான் சில_பெயர்] (config_reference.md#வெப்பநிலை_பான்) பொருள்களில் கிடைக்கின்றன:
uk: Наступна інформація доступна в об’єктах [temperature_fan some_name](Config_Reference.md#temperature_fan):

source: `target`: The target temperature for the fan.
ru: `Цель`: Целевая температура для вентилятора.
ta: `இலக்கு`: விசிறியின் இலக்கு வெப்பநிலை.
uk: `target`: Цільова температура для вентилятора.

source: temperature_sensor
ta: வெப்பநிலை_சென்சர்
uk: температура_сенсор

source: The following information is available in [temperature_sensor some_name](Config_Reference.md#temperature_sensor) objects:
ru: Следующая информация доступна в объектах [temperature_sensor some_name](Config_Reference.md#temperature_sensor):
ta: பின்வரும் தகவல்கள் [வெப்பநிலை_சென்சர் சில_பெயர்] (config_reference.md#வெப்பநிலை_சென்சர்) பொருள்களில் கிடைக்கின்றன:
uk: Вказана нижче інформація доступна в [температурна_сенсорна частина_ім'я](Config_Reference.md# Infrastructure_sensor) об'єктах:

source: `measured_min_temp`, `measured_max_temp`: The lowest and highest temperature seen by the sensor since the Klipper host software was last restarted.
ru: `measured_min_temp`, `measured_max_temp`: Самая низкая и самая высокая температура, наблюдаемая датчиком с момента последнего перезапуска хост-программы Klipper.
ta: `அளவிடப்பட்ட_மின்_டெம்ப்`,` அளவிடப்பட்ட_மாக்ச்_டெம்ப்`: கிளிப்பர் புரவலன் மென்பொருள் கடைசியாக மறுதொடக்கம் செய்யப்பட்டதிலிருந்து சென்சார் பார்த்த மிகக் குறைந்த மற்றும் மிக உயர்ந்த வெப்பநிலை.
uk: `measured_min_temp`, `measured_max_temp`: Найнижчою і найвищою температурою, що бачив датчиком, оскільки програмне забезпечення для хостів Klipper було оновлено останнім часом.

source: toolhead
ru: головка инструмента
ta: கருவி
uk: головна

source: The following information is available in the `toolhead` object (this object is always available):
ru: Следующая информация доступна в объекте `toolhead` (этот объект всегда доступен):
ta: பின்வரும் தகவல்கள் `கருவிஎட்` பொருளில் கிடைக்கின்றன (இந்த பொருள் எப்போதும் கிடைக்கும்):
uk: Наступна інформація доступна в об'єкті `toolhead` ( цей об'єкт завжди доступний):

source: `position`: The last commanded position of the toolhead relative to the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
ru: `позиция`: Последнее заданное положение головки инструмента относительно системы координат, указанной в файле конфигурации. Можно получить доступ к компонентам x, y, z и e этой позиции (например, `position.x`).
ta: `நிலை`: கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள ஒருங்கிணைப்பு அமைப்புடன் ஒப்பிடும்போது கருவி தலையின் கடைசியாக கட்டளையிடப்பட்ட நிலை. இந்த நிலையின் ஃச், ஒய், சட் மற்றும் இ கூறுகளை அணுக முடியும் (எ.கா., `pasition.x`).
uk: `позиція`: Остання командована позиція інструментального керівника відносно координаційної системи, зазначеної в файлі конфігурації. Можливий доступ до x, y, z, і електронних компонентів цієї позиції (наприклад, `position.x`).

source: `extruder`: The name of the currently active extruder. For example, in a macro one could use `printer[printer.toolhead.extruder].target` to get the target temperature of the current extruder.
ru: `экструдер`: Имя активного в данный момент экструдера. Например, в макросе можно использовать `принтер[printer.toolhead.extruder].target`, чтобы получить целевую температуру текущего экструдера.
ta: `எக்ச்ட்ரூடர்`: தற்போது செயலில் உள்ள எக்ச்ட்ரூடரின் பெயர். எடுத்துக்காட்டாக, ஒரு மேக்ரோவில் `அச்சுப்பொறி [அச்சுப்பொறி.
uk: `extruder`: Назва діючого екструдера. Наприклад, в макросі можна використовувати `принтер[printer.toolhead.extruder].target`, щоб отримати цільову температуру поточного екструдера.
