Repository: KevinOConnor/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: ru, ta, uk

source: If using stealthChop mode then the positional inaccuracy from interpolation is small relative to the positional inaccuracy introduced from stealthChop mode. Therefore tuning interpolation is not considered useful when in stealthChop mode, and one can leave interpolation in its default state.
ru: Если используется режим stealthChop, то неточность позиционирования от интерполяции мала по сравнению с неточностью позиционирования, вносимой режимом stealthChop. Поэтому настройка интерполяции не считается полезной в режиме stealthChop, и можно оставить интерполяцию в состоянии по умолчанию.
ta: ச்டீல்த்சாப் பயன்முறையைப் பயன்படுத்தினால், இடைக்கணிப்பிலிருந்து நிலை தவறான தன்மை ச்டெல்த்சாப் பயன்முறையிலிருந்து அறிமுகப்படுத்தப்பட்ட நிலை தவறாத தன்மையுடன் ஒப்பிடும்போது சிறியது. ஆகவே, ச்டெல்த்சாப் பயன்முறையில் இருக்கும்போது ட்யூனிங் இடைக்கணிப்பு பயனுள்ளதாக கருதப்படுவதில்லை, மேலும் ஒருவர் அதன் இயல்புநிலை நிலையில் இடைக்கணிப்பை விட்டுவிடலாம்.
uk: При використанні стелс Хоп-режим, після чого послідовна неточність від інтерполяції невелика порівняно з позиційною неточністю, введеною з режиму крадіжкиЧоп. Таким чином, перевтілення інтерполяції не вважається корисною, коли в прихованому режимі, і можна залишити інтерполяції в його стандартному стані.

source: It can also be useful to have that macro set the driver current before homing and set a new current after the carriage has moved away.
ru: Также может быть полезно, чтобы этот макрос устанавливал ток драйвера перед наведением и устанавливал новый ток после того, как каретка отойдет.
ta: அந்த மேக்ரோ டிரைவர் மின்னோட்டத்தை ஓமிங் செய்வதற்கு முன்பு அமைத்து, வண்டி நகர்ந்த பிறகு ஒரு புதிய மின்னோட்டத்தை அமைக்கவும் பயனுள்ளதாக இருக்கும்.
uk: Також можна скористатися тим, що макроси встановлюють струм драйвера перед замішуванням і встановлюють новий струм після переїзду.

source: [gcode_macro SENSORLESS_HOME_X] gcode: {% set HOME_CUR = 0.700 %} {% set driver_config = printer.configfile.settings['tmc2209 stepper_x'] %} {% set RUN_CUR = driver_config.run_current %} # Set current for sensorless homing SET_TMC_CURRENT STEPPER=stepper_x CURRENT={HOME_CUR} # Pause to ensure driver stall flag is clear G4 P2000 # Home G28 X0 # Move away G90 G1 X5 F1200 # Set current during print SET_TMC_CURRENT STEPPER=stepper_x CURRENT={RUN_CUR}
ru: [gcode_macro SENSORLESS_HOME_X] gcode: {% set HOME_CUR = 0.700 %} {% set driver_config = printer.configfile.settings['tmc2209 stepper_x'] %} {% set RUN_CUR = driver_config.run_current %} # Установка тока для бессенсорного самонаведения SET_TMC_CURRENT STEPPER=stepper_x CURRENT={HOME_CUR} # Пауза, чтобы убедиться, что флаг остановки драйвера сброшен G4 P2000 # Дом G28 X0 # Отъезд G90 G1 X5 F1200 # Установите ток во время печати SET_TMC_CURRENT STEPPER=stepper_x CURRENT={RUN_CUR}
ta: [gcode_macro sensorless_home_x] gcode: { % home_cur = 0.700 %} { % கணம் traver_config = printur.configfile.settings ['TMC2209 STEPPER_X'] %} { % கணம் run_cur = trair_config.run_current %} # சென்சார்லெச் ஓமிங்கிற்கான மின்னோட்டத்தை அமைக்கவும் Set_tmc_current stepper = stepper_x மின்னோட்ட்ம், ஓட்டம் = {HOME_CUR} # டிரைவர் ச்டால் கொடி தெளிவாக இருப்பதை உறுதிப்படுத்த இடைநிறுத்தம் ஐயா 4 பி 2000 # வீடு G28 x0 # விலகிச் செல்லுங்கள் ஐயா 90 G1 X5 F1200 # அச்சின் போது மின்னோட்டத்தை அமைக்கவும் Set_tmc_current stepper = stepper_x மின்னோட்ட்ம், ஓட்டம் = {RUN_CUR}

source: When using sensorless homing on CoreXY, make sure there is no `hold_current` configured for either stepper.
ru: При использовании бессенсорного самонаведения на CoreXY убедитесь, что для обоих шаговиков не настроен `hold_current`.
ta: கோர்எக்சியில் சென்சார்லெச் ஓமிங்கைப் பயன்படுத்தும் போது, எந்தவொரு ச்டெப்பருக்கும் கட்டமைக்கப்படாத `ஓல்ட்_கரண்ட்` இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: При використанні безсенсорного гоління на CoreXY, переконайтеся, що немає `hold_current` налаштовано для будь-якого кроку.

source: If one wishes to reduce current to motors during print start routines, then consider issuing [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) commands in a [START_PRINT macro](Slicers.md#klipper-gcode_macro) to adjust the current before and after normal printing moves.
ru: Если вы хотите уменьшить ток, подаваемый на двигатели во время запуска печати, подумайте о том, чтобы подать команду [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) в макросе [START_PRINT](Slicers.md#klipper-gcode_macro) для регулировки тока до и после обычных движений печати.
ta: அச்சு தொடக்க நடைமுறைகளின் போது மோட்டார்கள் மின்னோட்டத்தைக் குறைக்க ஒருவர் விரும்பினால், [Set_TMC_CURRENT] (g-codes.md#set_tmc_current) கட்டளைகளை [start_print மேக்ரோ] (slicers.md#klipper-gcode_macro) இல் வழங்குவதற்கு முன், தற்போதையதை சரிசெய்யவும் சாதாரண அச்சிடும் நகர்வுகளுக்குப் பிறகு.
uk: Якщо один хоче зменшити струм до моторів під час початку друку, то розглянути емітацію [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) команди в [START_PRINT макро](Slicers.md#klipper-gcode_macro) для регулювання струму до і після нормального переміщення друку.

source: The `[DUMP_TMC command](G-Codes.md#dump_tmc) is a useful tool when configuring and diagnosing the drivers. It will report all fields configured by Klipper as well as all fields that can be queried from the driver.
ru: Команда `[DUMP_TMC](G-Codes.md#dump_tmc) является полезным инструментом при настройке и диагностике драйверов. Она сообщает обо всех полях, сконфигурированных Klipper, а также обо всех полях, которые могут быть запрошены из драйвера.
ta: இயக்கிகளை உள்ளமைத்து கண்டறியும் போது `[dif_tmc கட்டளை] (g-codes.md#diff_tmc) ஒரு பயனுள்ள கருவியாகும். இது கிளிப்பர் கட்டமைக்கப்பட்ட அனைத்து புலங்களையும், ஓட்டுநரிடமிருந்து வினவக்கூடிய அனைத்து புலங்களையும் தெரிவிக்கும்.
uk: `[DUMP_TMC команди](G-Codes.md#dump_tmc) є корисним інструментом при налаштуванні та діагностуванні драйверів. Повідомляти всі поля, налаштовані Klipper, а також всі поля, які можуть бути перевірені з водія.

source: In addition, almost all fields can be modified at run-time using the [SET_TMC_FIELD command](G-Codes.md#set_tmc_field).
ru: Кроме того, почти все поля могут быть изменены во время выполнения программы с помощью команды [SET_TMC_FIELD](G-Codes.md#set_tmc_field).
ta: கூடுதலாக, [SET_TMC_FIELD கட்டளை] (G-Codes.MD#SET_TMC_FIELD) ஐப் பயன்படுத்தி கிட்டத்தட்ட எல்லா புலங்களையும் ரன்-நேரத்தில் மாற்றலாம்.
uk: Крім того, майже всі поля можуть бути змінені в режимі run-time за допомогою команди [SET_TMC_FIELD](G-Codes.md#set_tmc_field).

source: Then issue a `G28 X0` command and verify the axis does not move at all or quickly stops moving. If the axis does not stop, then issue an `M112` to halt the printer - something is not correct with the diag/sg_tst pin wiring or configuration and it must be corrected before continuing.
ru: Затем подайте команду `G28 X0` и убедитесь, что ось не двигается вообще или быстро останавливается. Если ось не останавливается, подайте команду `M112` для остановки принтера - что-то не так с подключением или конфигурацией контактов diag/sg_tst, и это необходимо исправить, прежде чем продолжать.
ta: பின்னர் `G28 X0` கட்டளையை வெளியிட்டு, அச்சு நகர்த்தாது அல்லது விரைவாக நகர்வதை நிறுத்தாது என்பதை சரிபார்க்கவும். அச்சு நிறுத்தப்படாவிட்டால், அச்சுப்பொறியைத் தடுக்க `M112` ஐ வழங்கவும் - DIAG/SG_TST முள் வயரிங் அல்லது உள்ளமைவுடன் ஏதாவது சரியாக இல்லை, தொடர்வதற்கு முன் அது சரிசெய்யப்பட வேண்டும்.
uk: Потім випишіть команду `G28 X0` і перевірте віссю не рухається на всіх або швидко зупиняється переміщення. Якщо вісь не зупиняється, то виписайте `M112`, щоб захопити принтер - щось не вірно з діаг / сg_tst шпилькою або конфігурацією, і її необхідно виправити до продовження.

source: An example CoreXY homing macro might look like:
ru: Пример макроса самонаведения CoreXY может выглядеть следующим образом:
ta: ஒரு எடுத்துக்காட்டு கோர்சி ஓமிங் மேக்ரோ போல் இருக்கலாம்:
uk: Наприклад, CoreXY кодування макро може виглядати:

source: [gcode_macro HOME] gcode: G90 # Home Z G28 Z0 G1 Z10 F1200 # Home Y G28 Y0 G1 Y5 F1200 # Home X G4 P2000 G28 X0 G1 X5 F1200
ru: [gcode_macro HOME] gcode: G90 # Дом Z G28 Z0 G1 Z10 F1200 # Дом Y G28 Y0 G1 Y5 F1200 # Дом X G4 P2000 G28 X0 G1 X5 F1200
ta: [gcode_macro home] gcode: ஐயா 90 # முகப்பு சட் G28 Z0 G1 Z10 F1200 # முகப்பு ஒய் G28 Y0 G1 Y5 F1200 # முகப்பு ஃச் ஐயா 4 பி 2000 G28 x0 G1 X5 F1200

source: TMC reports error: `... ShortToGND` OR `ShortToSupply`
ru: TMC сообщает об ошибке: `... ShortToGND` ИЛИ `ShortToSupply`
ta: டி.எம்.சி புகாரளிக்கிறது பிழை: `... சார்ட் டோக்ன்ட்` அல்லது` சார்ட் டோசப்லி`
uk: TMC повідомляє про помилку: `... ShortToGND` АБО `ShortToSupply`

source: Tuning
ru: Тюнинг
uk: Тюнінг
